{"url":"https://u.today/press-releases/crypto-pioneer-netki-powers-seamless-kyc-and-compliance-solutions-across-the-sui","web_url":"https://u.today/","type":"article","description":"Crypto Pioneer Netki Powers Seamless KYC and Compliance Solutions Across the Sui Ecosystem","title":"Crypto Pioneer Netki Powers Seamless KYC and Compliance Solutions Across the Sui Ecosystem","content":["Grand Cayman, Cayman Islands, May 16th, 2024, Chainwire","Today, Netki, a digital identity verification leader, announced the launch of their pioneering compliance oracle – DeFi Sentinel – on Sui, the Layer 1 blockchain and smart contract platform. The integration introduces an essential tool for developers that automates compliance within their protocols, allowing them to focus on shipping high-impact projects instead of spending time developing tools to meet complex, ever-changing regulations that often differ across jurisdictions.","Institutions are eager to engage with DeFi protocols and technology but need to ensure that all of their trades, and trading partners, meet their compliance standards. Until now, these institutional players have been forced to either trade in manually managed pools with limited liquidity and trading volume, or to avoid DeFi altogether. With DeFi Sentinel on Sui, developers can meet institutional as well as regulator requirements via a one-time integration.","DeFi Sentinel leverages Netki\u0027s advanced technology to provide real-time KYC/AML, wallet screening, financial transaction monitoring, securities compliance, and tax compliance, all now integrated directly within the DeFi protocols on Sui that choose to implement the tool. The solution combines on-chain and off-chain data to ensure each transaction adheres to institutional risk, as well as regulatory standards.","Sui will also integrate Netki\u0027s OnboardID, which, for protocols that enable it, enhances user onboarding and identity verification processes, reducing costs and simplifying compliance around the onramping process for Sui developers’ applications. Netki’s integration represents a significant advancement in making decentralized financial systems safer and more accessible globally.","\"DeFi protocols are poised to transform financial services by enhancing accessibility and transparency, but many of the best ideas fail to get off the ground due to compliance concerns,\" said Evan Cheng, CEO of Mysten Labs, the original contributor to Sui. \"Netki’s integration not only fortifies the security and compliance of transactions on Sui but also assures institutional and individual participants of their adherence to evolving regulatory requirements, and most importantly, gives developers the peace of mind to build with confidence.\"","Netki’s DeFi compliance oracle is unique in the industry, enabling transaction-by-transaction compliance, which is crucial for institutional adoption of DeFi tools. With features like real-time name and wallet screening, the solution ensures that compliance and risk management are seamlessly integrated into the transaction flow without compromising the user experience or developer agility.","“By integrating DeFi Sentinel with Sui\u0027s robust and scalable blockchain infrastructure, we are setting a new standard for safety and compliance in the DeFi space,” said Justin Newton, CEO of Netki. “We aim to enable the safe and widespread adoption of DeFi technologies, ensuring that developers can focus on innovation while evolving and expanding compliance requirements are effortlessly met.”"],"create_date":"","tag":"","author":""}
{"url":"https://u.today/another-big-bitcoin-etf-holder-just-rolled-in","web_url":"https://u.today/","type":"article","description":"The list of major Bitcoin ETF holders keeps getting longer","title":"Another Big Bitcoin ETF Holder Just Rolled In","content":["According to Eric Balchunas, Bloomberg\u0027s senior ETF manager, investment advisory firm Pine Ridge Advisers has emerged as yet another major holder of Bitcoin ETFs.","The firm has snapped up an impressive $205 million worth of shares of Bitcoin ETFs from such issuers as BlackRock\u0027s IBIT, Fidelity\u0027s IBIT, and Bitwise\u0027s BITB. Notably, the sum accounts for 23% of the total assets under management.","The ARK 21Shares Bitcoin ETF, which is known as ARKB, managed to record $133.1 million worth of inflows on Tuesday.","Fidelity\u0027s FBTC and the Invesco Galaxy Bitcoin ETF (BTCO) recorded relatively modest inflows ($8.1 and $5.5, respectively) Meanwhile, BlackRock\u0027s IBIT and Bitwise\u0027s BITB saw zero inflows yesterday.","","","However, after a brief period of inflows, Grayscale\u0027s GBTC once again recorded substantial outflows on Tuesday, losing more than $50 million.","The largest cryptocurrency is currently seeing signs of growing mainstream adoption. On Tuesday, the State of Wisconsin Investment Board (SWIB) revealed that it had bought almost $100 million worth of shares of BlackRock\u0027s IBIT. Such major banks as Edmond de Rothschild (Suisse) and Wells Fargo have also jumped on the Bitcoin bandwagon.","","","Earlier today, the Bitcoin price managed to top the $65,000 level after the most recent US CPI report that turned out to be in line with analysts\u0027 expectations.","The institutional adoption narrative and the expectations of multiple rate cuts are expected to be the main bullish catalysts this year."],"create_date":"2024-05-15T17:19:36+0000","tag":"Bitcoin News","author":""}
{"url":"https://u.today/press-releases/one-trading-extends-the-reach-of-its-institutional-trading-services-in-europe","web_url":"https://u.today/","type":"article","description":"One Trading Extends the Reach of its Institutional Trading Services in Europe Through Integration with Talos","title":"One Trading Extends the Reach of its Institutional Trading Services in Europe Through Integration with Talos","content":["London, United Kingdom, May 16th, 2024, Chainwire","Talos, the premier provider of digital asset trading technology for institutions, and One Trading, a crypto trading venue headquartered and regulated in the European Union, announced an integration designed to expand liquidity access for institutions. As part of the collaboration, One Trading joins the Talos network of liquidity providers, expanding the possible destinations for their shared clients looking to achieve best execution. Talos users will now be able to access One Trading’s high-speed trading platform, with a matching engine time of just 1 microsecond.","In addition to expanding its potential reach to Talos’s institutional clients, One Trading also adopts the Talos trading platform as a sell-side client to support its OTC trading desk. The award-winning Talos trading platform will help One Trading efficiently source liquidity to better serve its clients’ needs. The multi-faceted relationship between the two firms highlights the different ways that the Talos network and platform can enhance a partner’s business.","Commenting on the integration, Joshua Barraclough, CEO of One Trading said, “Talos shares our goal of bridging the gap between traditional and crypto asset trading. That’s why we’re excited to integrate with Talos as a liquidity provider as well as a sell-side trading client. They provide us with the same institutional grade of technology that we seek to provide to our own clients.”","One Trading is an EU-based trading venue built by a highly experienced ex-TradFi team. One Trading provides an institutional-grade digital asset exchange for both retail customers and institutional clients, with a focus on achieving market-leading execution speed, deep order books, and low fees. The exchange provides zero fees for both maker and taker transactions. One Trading operates a regulated spot trading venue and an OTC business with plans to roll out a MiFID II regulated derivatives business in the near future. As the Markets in Crypto Assets (MiCA) European regulation elevates the importance of best execution, Talos’s integration with One Trading will empower shared clients with an additional option for sourcing the best available liquidity.","About Talos","Talos provides institutional-grade technology that supports the full digital asset trading lifecycle, including liquidity sourcing, price discovery, trading, settlement, lending, borrowing and portfolio management. Engineered by a team with unmatched experience building institutional trading systems, the Talos platform connects institutions to key participants in today’s digital asset ecosystem – exchanges, OTC desks, prime brokers, lenders, custodians and more – through a single point of entry. By streamlining the entire trading process, Talos helps mitigate intermediary risk and facilitate best execution. For additional information, visit www.talos.com.","Talos Disclaimer: Talos offers software-as-a-service products that provide connectivity tools for institutional clients. Talos does not provide clients with any pre-negotiated arrangements with liquidity providers or other parties. Clients are required to independently negotiate arrangements with liquidity providers and other parties bilaterally. Talos is not party to any of these arrangements. Services and venues may not be available in all jurisdictions.","About One Trading","One Trading is a leading European digital asset trading platform with a VASP registration in Italy with Organismo Agenti e Mediatori (OAM). The One Trading platform has various offerings: Exchange, Instant Trade, and an OTC desk. The Exchange is where registered customers can access the fastest trading venue in the world with zero fees — also boasting a transparent order book with deep liquidity, and charting tools for technical analysis. The team behind One Trading has strong ex-TradFi expertise and is focused on providing an unparalleled product experience.","Instant Trade offers a simplified UI for trading a wide range of fiat, stablecoin, and altcoin pairs at 0% additional commission. One Trading retrieves the best prices for customers by plugging into a number of major liquidity providers with access to deep liquidity. These relationships have been established through the over-the-counter (OTC) offering, and are typically only reserved for HNWs or institutional customers. Through Instant Trade, all trader types can access this unique trading mechanism through a simple UI.","The OTC desk offers a high-touch trading team to work with clients, typically institutional partners to facilitate trades in any size and digital asset, with access to deep pools of liquidity, rapid settlement, and large asset coverage.","One Trading Disclaimer: This material is for informational purposes only, and is not intended to provide legal, tax, financial, or investment advice. Past performance is not necessarily indicative of the future nor a reliable indicator of the likely performance of any investment. Recipients should consult their own advisors before making these types of decisions. One Trading has no responsibility or liability for any decision made or any other acts or omissions in connection with Recipient’s use of this material."],"create_date":"","tag":"","author":""}
{"url":"https://u.today/press-releases/lbanks-mothers-day-initiative-supporting-christ-foundation-orphanage-home-and-widows#","web_url":"https://u.today/","type":"article","description":"LBank\u0027s Mother\u0027s Day Initiative: Supporting Christ Foundation Orphanage Home and Widows Outreach Center in Nigeria","title":"LBank\u0027s Mother\u0027s Day Initiative: Supporting Christ Foundation Orphanage Home and Widows Outreach Center in Nigeria","content":["Singapore- May 14, 2024 -In a heartfelt demonstration of compassion and solidarity, LBank, a leading cryptocurrency exchange platform, has embarked on a charitable endeavor to support the Christ Foundation Orphanage Home and Widows Outreach Center in Nigeria on the occasion of Mother\u0027s Day.","As the world celebrated motherhood and maternal love, LBank recognized the importance of extending care and assistance to those who may be less fortunate. In partnership with the Christ Foundation Orphanage Home and Widows Outreach Center, LBank organized a donation drive aimed at providing essential life necessities to the residents of the center.","\"Mother\u0027s Day serves as a poignant reminder of the love and sacrifice that mothers selflessly give to their families and communities,\" stated Kaia Wang, Global CMO at LBank. \"In line with our commitment to corporate social responsibility, LBank is proud to stand in solidarity with the Christ Foundation Orphanage Home and Widows Outreach Center and contribute toward improving the lives of women and children in need.","","","The charitable initiative underscores LBank\u0027s ethos of giving back to society and making a positive impact on communities. By extending support to the Christ Foundation Orphanage Home and Widows Outreach Center, LBank aims to provide tangible assistance to individuals and families facing adversity, particularly in challenging times.","LBank remains committed to fostering social responsibility and community development through its philanthropic endeavors. By leveraging its resources and platform, LBank endeavors to create positive change and empower marginalized communities across the globe.","About LBank","Established in 2015, LBank is a premier global cryptocurrency trading platform, serving millions of users globally. Committed to security, innovation, and user satisfaction, LBank offers a seamless trading experience with a wide array of digital asset services. With a robust selection of cryptocurrencies and advanced trading features, LBank Exchange redefines digital asset trading, empowering users to navigate the dynamic crypto market confidently."],"create_date":"","tag":"","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide#h636","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide#","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
{"url":"https://u.today/bitcoin-btc-critic-nassim-taleb-teases-his-new-book","web_url":"https://u.today/","type":"article","description":"Nassim Nicholas Taleb has revealed what his new book will be about","title":"Bitcoin (BTC) Critic Nassim Taleb Teases His New Book","content":["Renowned scholar, former option trader and risk analyst Nassim Nicholas Taleb is known to a wide audience thanks to his popular books “Black Swan”, “Antifragile”, “Skin in The Game”, etc.","Less than an hour ago, Taleb revealed the title of his next book and what it will be about in a post published on the X social media platform. Taleb is also a major Bitcoin critic who came to it all the way from adoring BTC.","","","Taleb shared that his next book will be called The Lydian Stone (also known as the “touchstone”) that is a flint stone that was used by ancient peoples to verify the quality of silver and gold. As for the subject of this new book, the scholar wrote that it will be “partly on how humans get confused by sequences.” “It also maps to the arrow of time and Entropy.”","Three years ago, Taleb made a loud reverse from Bitcoin, turning into a BTC critic. He tweeted that he had begun selling his BTC. One of the reasons for that was its high volatility and he stated that a currency cannot be more volatile than things you buy with it. He also stated that Bitcoin for him had failed to work as a store of value. Since then, he has been constantly criticizing BTC on his X account and once even referred to it as a tumor.","Considering the large amount of critiques he has poured on Bitcoin, the odds are that Taleb could mention Bitcoin in his new book."],"create_date":"2024-05-16T14:43:00+0000","tag":"Nassim Nicholas Taleb","author":""}
{"url":"https://u.today/solana-sol-price-surges-12-as-major-metrics-go-bullish","web_url":"https://u.today/","type":"article","description":"Solana\u0027s key metrics are signaling strong momentum and potential for further gains","title":"Solana (SOL) Price Surges 12% as Major Metrics Go Bullish","content":["Solana (SOL) has taken a significant leap forward in its market trajectory, with its price surging by 12.78% in the last 24 hours. This substantial surge has propelled SOL to a trading value of $162.35 at the time of reporting, marking a notable uptick in investor interest and market activity.","One of the most striking aspects of this surge is the remarkable increase in Solana\u0027s trading volume, which has surged by an impressive 82.78%, reaching a substantial $4.38 billion. This surge in trading volume underscores a surge in investor confidence and interest in SOL, indicating strong market momentum.","Moreover, the market capitalization of SOL has experienced a significant upswing, rising by 13.64% to reach $73.15 billion. This surge in market capitalization further solidifies SOL\u0027s position as a leading player on the cryptocurrency market, garnering attention from investors and traders alike.","In addition to the notable price surge and increased trading volume, several key technical indicators are flashing bullish signals for Solana. The Relative Strength Index (RSI), a widely followed momentum oscillator, currently stands at 59.30, indicating bullish sentiment for SOL.","Furthermore, Solana\u0027s price is trading above both its 200-day Exponential Moving Average (EMA) and 200-day Simple Moving Average (SMA). This technical outlook reinforces the bullish sentiment for the cryptocurrency in the long term.","The Moving Average Convergence Divergence (MACD) for SOL is also noteworthy, currently at 0.68 and gaining momentum in the bullish zone. This further bolsters the positive sentiment surrounding Solana\u0027s price movement and suggests potential further upside in the near term.","Looking ahead, analysts are eyeing the next resistance level for Solana at $165. If SOL manages to clear this hurdle, it could pave the way for continued upward momentum in its price trajectory. With bullish technical indicators and growing market interest, Solana appears poised for further gains in the foreseeable future."],"create_date":"2024-05-16T13:08:00+0000","tag":"Solana News","author":""}
{"url":"https://u.today/xrp-skyrockets-23-in-volume-amid-mysterious-100-million-xrp-transfer","web_url":"https://u.today/","type":"article","description":"XRP\u0027s dramatic 23% surge in trading volume coincides with mysterious 100 million XRP transfer from major Japanese exchange","title":"XRP Skyrockets 23% in Volume Amid Mysterious 100 Million XRP Transfer","content":["The trading volume of the popular cryptocurrency XRP has surged by an impressive 23% over the last 24 hours, reaching a staggering $1.27 billion, as reported by CoinMarketCap. This surge in trading activity coincides with a noteworthy uptick in XRP\u0027s price, which experienced a notable 3.7% increase yesterday, peaking at $0.5196.","However, today, the price is undergoing a minor correction of 0.6%. These fluctuations in price come amid a broader surge in volatility across the cryptocurrency market.","","","Of particular interest is the revelation that 100 million XRP tokens were withdrawn from the Coincheck exchange today, amounting to approximately $51.6 million. The withdrawal was directed to an address identified as \"r99Q,\" which has been active since February, with an initial transfer from the same exchange.","Analysis of the address\u0027s transaction history reveals a consistent pattern of receiving XRP transfers from Coincheck, strongly indicating that the address is affiliated with the exchange itself.","🚨 🚨 🚨 100,000,000 #XRP (51,892,868 USD) transferred from #Coincheck to unknown wallethttps://t.co/wUtyvbs8YO","Coincheck is a prominent cryptocurrency exchange known for its strong presence in Japan. It is regulated by the country\u0027s Financial Services Agency (FSA) and audited by the Japan Blockchain Association. It boasts substantial liquidity, $100 million trading volume and traffic, positioning it as a key player in the Asian region.","","","The mysterious transfer of 100 million XRP from Coincheck raises intriguing questions about the exchange\u0027s internal operations and its potential implications for market dynamics. While the exact motive behind the transfer remains undisclosed, it has undoubtedly contributed to the surge in XRP trading volume observed in the past 24 hours."],"create_date":"2024-05-16T13:37:00+0000","tag":"XRP","author":""}
{"url":"https://u.today/hedge-fund-ginat-millenium-emerges-as-king-of-bitcoin-etf-holders","web_url":"https://u.today/","type":"article","description":"There is already a diverse list of Bitcoin ETF holders","title":"Hedge Fund Ginat Millenium Emerges as King of Bitcoin ETF Holders","content":["Millennium Management, one of the top hedge funds, now has more than $2 billion worth of Bitcoin ETFs, according to Eric Balchunas, Bloomberg\u0027s chief ETF analyst.","It has acquired shares from BlackRock\u0027s IBIT, Fidelity\u0027s FBTC, Grayscale\u0027s GBTC, and other products.","The hedge fund, which was founded by American billionaire Israel Englander, is now at the top of the list of ETF holders.","Firms were supposed to submit 13F forms ahead of the May 15 deadline. These forms allowed industry observers to see the current rate of Bitcoin ETF adoption.","","","According to Balchunas, it is \"impressive\" that many different institution types are represented among the initial batch of ETF holders.","As reported by U.Today, the State of Wisconsin Investment Board (SWIB), which manages state pensions, recently revealed that it had scooped up nearly $100 million worth of Bitcoin.","Pine Ridge Advisers, Edmond de Rothschild (Suisse), JPMorgan, Well Fargo, and Susquehanna International Group are also among Bitcoin ETF holders.","Overall, the list of advisors consists mainly of hedge funds, but there are also some hedge funds. However, there are no university endowments yet, according to Balchunas.","While Bitcoin ETFs are enjoying surging popularity, Vanguard will seemingly remain on the sidelines. the","Meanwhile, incoming Vanguard CEO Salim Ramji has already rejected the possibility of launching an ETF.","However, it is now clear whether Vanguard will allow Bitcoin ETFs to appear on its brokerage platform.","It is worth noting that Ramji is a former BlackRock exec who took part in the rollout of the asset manager\u0027s hit Bitcoin ETF."],"create_date":"2024-05-16T07:49:36+0000","tag":"Bitcoin News","author":""}
{"url":"https://u.today/dogecoin-doge-creator-breaks-silence-on-ethereum-etf","web_url":"https://u.today/","type":"article","description":"Dogecoin\u0027s Billy Markus slams SEC ahead of Ethereum ETF verdict","title":"Dogecoin (DOGE) Creator Breaks Silence on Ethereum ETF","content":["In a recent social media discussion, Dogecoin co-author Billy Markus gave his opinion on the upcoming SEC decision regarding Ethereum-based exchange-traded funds. Responding to a skeptical post about the fate of ETH ETFs, Markus expressed an equally pessimistic stance, implying that the current \"compromised\" state of the regulator holds little good for potential approval.","","","i don’t think it’s that important personally the SEC is compromised anyway, nothing good will come out of it until the house is cleaned","This statement from Markus comes amid heightened expectations surrounding Ethereum\u0027s legal position as part of the SEC\u0027s ETF discussions. Financial lawyer Scott Johnsson recently opined that Ethereum\u0027s legal classification will figure prominently in the upcoming ETF decisions. He noted the regulator\u0027s reluctance to approve commodity trust shares for Ethereum, citing concerns about its securities-like nature, something Bitcoin ETFs have not faced.","The imminent decision dates for VanEck and ARK Invest\u0027s applications for Ethereum ETFs, set for May 23 and May 24, respectively, which is already a week away, has intensified speculation in the crypto industry. Despite expectations of a rejection due to Ethereum\u0027s alleged regulatory failure, the exact basis for the SEC\u0027s potential rejection remains unclear.","Markus\u0027s remarks add to the skepticism surrounding the prospects of Ethereum ETFs, reflecting the broader sentiment in the cryptocurrency community regarding regulatory obstacles.","","","There are still unanswered questions about the extent to which regulatory barriers will prevent the mass adoption of Ethereum and altcoins, and whether there will be alternative investment opportunities.","There are also ongoing debates about the effectiveness and fairness of the regulatory framework, with supporters arguing for clearer guidelines and opponents criticizing excessive regulatory overreach."],"create_date":"2024-05-16T09:58:00+0000","tag":"Ethereum","author":""}
{"url":"https://u.today/bonk-bonk-skyrockets-36-in-volume-amid-major-exchange-listing","web_url":"https://u.today/","type":"article","description":"Bonk (BONK) surges 36% in trading volume as Bithumb announces its listing","title":"Bonk (BONK) Skyrockets 36% in Volume Amid Major Exchange Listing","content":["In a significant boost for Bonk (BONK), Bithumb, South Korea\u0027s second-largest crypto exchange, has announced its listing on the Korean won market. Trading for BONK, the first dog-themed cryptocurrency on the Solana network, will commence at 5:00 p.m. on May 16, sparking a bullish trend in the coin’s price and volume.","The listing on Bithumb is a pivotal moment for BONK, providing it with exposure to one of the largest cryptocurrency markets in Asia. This development is likely to enhance liquidity and trading activity, attracting more investors and potentially driving further price increases.","Following the announcement, BONK’s market performance has shown a remarkable uptrend. As of now, BONK is trading at $0.00002611, marking a 9.57% increase in the last 24 hours. This surge underscores the market’s positive reaction to the listing news. Over the past 30 days, BONK’s price has soared by 78.5%, maintaining strong bullish momentum.","Trading volume has also seen a significant uptick, increasing by 36.53% to reach $498.6 million. This spike in volume reflects heightened investor interest and activity surrounding BONK. Concurrently, the market capitalization of BONK has risen by 9.37%, now standing at $1.66 billion, further highlighting the coin’s growing market presence.","Additionally, data from CoinGlass indicates a substantial increase in Open Interest for BONK, which has surged by 13.24% to $280.82 million. Open Interest is a key metric that represents the total number of outstanding derivative contracts, such as futures and options, and its rise is often seen as a bullish indicator. It suggests that more traders are entering the market and taking positions in BONK.","The meme coin’s robust performance and the increased market activity point to a positive outlook, as it continues to gain traction and recognition within the crypto community. Overall, BONK’s recent listing on Bithumb has catalyzed a significant increase in its trading volume and price. With the bullish indicators showing strong momentum, BONK is poised for further growth and stability on the cryptocurrency market."],"create_date":"2024-05-16T10:32:00+0000","tag":"BONK News","author":""}
{"url":"https://u.today/3-trillion-shib-mysteriously-sent-to-robinhood-amid-122-price-surge","web_url":"https://u.today/","type":"article","description":"Trillions of Shiba Inu meme coins have been transferred to major trading app from enigmatic wallet following 200 billion SHIB transfer to Coinbase and OKX","title":"3 Trillion SHIB Mysteriously Sent to Robinhood Amid 12.2% Price Surge","content":["A recent tweet from popular blockchain sleuth Whale Alert shows that approximately six hours ago, an anonymous wallet owner shoveled a whopping $75 million worth of Shiba Inu meme coins to popular investment app Robinhood.","This transaction took place as the second most popular meme cryptocurrency, SHIB, demonstrated a 10% price increase in the past 24 hours.","According to the above-mentioned data source, a mysterious whale shoveled 3,000,000,000,000 Shiba Inu to Robinhood. This chunk of meme coins was valued at approximately $74,788,500 at the time of the transaction.","🚨 🚨 🚨 3,000,000,000,000 #SHIB (74,788,500 USD) transferred from unknown wallet to #Robinhoodhttps://t.co/YPK3w7Mceb","This week, SHIB whales have seen a major activity increase. On May 15, large cryptocurrency trading firm Cumberland transferred 144 billion SHIB meme coins to the biggest U.S.-based crypto exchange, Coinbase. This transaction was worth approximately $3.3 million in fiat.","Prior to that, 50.36 billion Shiba Inu were deposited to OKX.","Overall, this week, before the aforementioned three trillion SHIB got going, more than 1.5 trillion Shiba Inu were transacted within 24 hours by awakened meme coin whales. They mostly carried between 42.6 billion and 397 billion SHIB to leading cryptocurrency trading platforms Binance, Coinbase, Gate.io and others.","Along with the three trillion SHIB mentioned above, another anonymous wallet decided to deposit several hundred billion of another popular meme coin to the same platform; 200,000,000 DOGE were deposited to Robinhood.","","","Over the period of the last 24 hours, the second biggest meme coin by market capitalization value, Shiba Inu, started seeing a bullish breakout. Overnight, SHIB managed to surge by 12.26%. A total of 3.5% of this surge took place over the past two hours.","At the time of this writing, SHIB is changing hands at $0.00002574.","Shibburn meme coin explorer has shared data positive for the SHIB army. Within the last 24 hours, the community of this popular meme coin has managed to dispose of almost 10 million SHIB. That propelled the growth of the SHIB burn metric by 306.7% into the green zone.","That achievement took more than 20 transactions to unspendable blockchain wallets. The three largest burn transfers carried 1,447,938; 1,359,610 and 1,000,000 SHIB."],"create_date":"2024-05-16T08:04:00+0000","tag":"Shiba Inu (SHIB) News","author":""}
{"url":"https://u.today/scam-alert-this-whale-lost-1155-btc-heres-how-to-avoid-it","web_url":"https://u.today/","type":"article","description":"One of biggest heists in 2024: What should have been done","title":"Scam Alert: This Whale Lost 1,155 BTC, Here\u0027s How to Avoid It","content":["The best way to avoid losing 1,155 BTC is obviously not having it in the first place. But if you are the lucky owner of a large chunk of crypto, safety should be your main priority. This whale, unfortunately, was not as cautious as they should have been.","On the evening of May 3, Beijing time, a whale mistakenly transferred 1,155 BTC to a phishing wallet address, worth about $71 million at the time. This significant loss serves as a stark reminder of the importance of security in the crypto world.","","","The hacker monitored the whale\u0027s blockchain activity and saw the whale create a new address. The hacker then generated a similar address to the one the whale created and conducted a small transaction to include this phishing address in the transaction history. When the whale saw the phishing address in their transfer history, they mistakenly copied it, thinking it was their own address. The hacker monitored the phishing address and, upon receiving 1,155 BTC, quickly transferred the funds to a new address.","This incident shows that the hacker was well prepared and used significant computational power, likely indicating an organized effort rather than an individual. The speed and precision of the attack suggest automated scripts were used, and the hacker had access to considerable resources.","","","To protect your digital assets, create private keys and mnemonic phrases offline and store them securely offline. Use hardware wallets for additional security, but ensure you back up your private keys.","If you suspect your private key or mnemonic phrase is compromised, replace them immediately and transfer your assets. Store transfer addresses in an address book with notes and avoid copying addresses temporarily. Always perform small test transfers and confirm success with the recipient before large transactions.","For large transfers, consider splitting them into multiple smaller transactions. Avoid clicking on transfer links or online transactions sent by others, and always verify links and addresses independently. For larger fund management, consider using multi-signature methods to add an extra layer of security."],"create_date":"2024-05-16T14:20:00+0000","tag":"Bitcoin","author":""}
{"url":"https://u.today/billionaire-mike-novogratz-predicts-major-shift-ahead-for-crypto","web_url":"https://u.today/","type":"article","description":"Novogratz hints that next few months might be critical to watch for crypto","title":"Billionaire Mike Novogratz Predicts Major Shift Ahead for Crypto","content":["As the cryptocurrency market matures, its narratives and odds constantly evolve. Mike Novogratz, Galaxy Digital founder and a pivotal figure in the crypto industry, mentioned this in a recent tweet.","According to Novogratz, the coming months are poised to be particularly intriguing as these narratives take shape and the odds shift, signaling potential pivotal changes for the crypto world.","It’s been a fascinating week in crypto. Narratives are forming and odds are shifting. It’ll be interesting to watch the next few months play out, and even more interesting to watch the jump shift that’ll occur as soon as there’s regulatory clarity around crypto in the U.S.… pic.twitter.com/t0g5rTIKjP","Novogratz points out that the crypto market is currently at a juncture where new narratives are forming. He further added that the odds are shifting, possibly hinting at a more favorable climate for crypto assets shortly. According to him, it will be interesting to see how the next few months unfold and the sudden shift that will occur once there is finally regulatory certainty around cryptocurrency in the United States.","\"It’s been a fascinating week in crypto. Narratives are forming and odds are shifting. It’ll be interesting to watch the next few months play out, and even more interesting to watch the jump shift that’ll occur as soon as there’s regulatory clarity around crypto in the U.S,\" Novogratz wrote in a tweet while sharing a clip of his interview at the \"business untitled\" podcast.","","","In his recent outlook on the crypto market, Novogratz predicted that Bitcoin was likely to remain stuck in a relatively narrow trading range for at least the current quarter as cryptocurrencies enter a consolidation phase.","Galaxy\u0027s earnings soared significantly during the rapid rally in digital assets earlier this year, with first-quarter net income more than tripling to $421.7 million. According to Novogratz, the adoption of cryptocurrency in traditional finance is in full swing, and there is renewed interest in the industry, as seen by a rise in lending activity.","","","As narratives form and odds shift, the cryptocurrency market is entering a phase that promises to be full of developments. The anticipation of what is to come is palpable, and the market could be on the cusp of what could be a transformative period."],"create_date":"2024-05-16T15:28:00+0000","tag":"Mike Novogratz","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide#h424","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
{"url":"https://u.today/everything-you-need-to-know-about-sam-altmans-worldcoin","web_url":"https://u.today/","type":"article","description":"As AI tokens regain momentum, Worldcoin promises truly massive use case for crypto in global economy","title":"Everything You Need to Know About Sam Altman\u0027s Worldcoin","content":["Recently, Worldcoin (WLD), the cryptocurrency associated with Sam Altman\u0027s digital identification venture, has experienced a remarkable surge of over 42% in 24 hours, reaching $7.46. This surge is part of a broader upward trend, with the token\u0027s value nearly tripling within a week.","This surge coincides with OpenAI\u0027s announcement of the text-to-video AI model Sora, known as the \"Hollywood Killer\" for its lifelike 60-second videos. Additionally, Worldcoin\u0027s announcement of its World App crypto wallet passing 1 million daily users contributed to the surge.","The Sora effect was also seen in the broader segment of AI crypto. The total market capitalization of AI cryptocurrencies surged by 8% within 24 hours, reaching $15.8 billion.","","","The token\u0027s market capitalization is now approaching $1 billion, marking a 41% increase. Analyst Ali Martinez predicts a rise to $15 or even $26, representing a gain of up to 250%.","#Worldcoin appears to have broken out of an ascending parallel channel on its daily chart, setting the stage for potential upward movement. If this breakout holds, $WLD could rise to $15 and possibly even extend to $26. If you’re planning to join me in this trade, go to… pic.twitter.com/laKqk4ig5Z","Co-founded by the CEO of OpenAI via Tools for Humanity, Worldcoin, an open-source protocol, aims to democratize global economic access by decentralizing decision-making to its user community. It offers digital identity verification through iris scanning, rewarding users with WLD tokens and aspiring to establish a global universal basic income (UBI) system.","","","One of the venture\u0027s most ambitious applications is in creating systems for fair distribution of limited resources. With World ID, double claiming of resources like bonuses or rewards is prevented, laying the groundwork for universal basic income (UBI) proposals.","Worldcoin launched its token in July 2023, witnessing a 40% surge in 24 hours. With over 2 million users signing up for a World ID, Worldcoin incentivizes users to create digital credentials through iris scanning.","more than 2 million people signed up during the beta. hopeful for that number to get to 2 billion now!","Worldcoin uses iris scans for identity verification, similar to CLEAR or Apple\u0027s Face ID, and also operates as a cryptocurrency. Iris scans generate digital World IDs using zero-knowledge proofs cryptography. An orb device scans irises to create World IDs, offering secure identity verification online without revealing personal data.","These IDs could serve as logins for websites, enhancing privacy by unlinking from personal information. The decentralized protocol will utilize zero-knowledge proofs (ZKPs) to allow users to prove their humanity without revealing sensitive details about their true identity.","Key components:","In January 2024, the Office of the Privacy Commissioner for Personal Data (PCPD) in Hong Kong launched an investigation into Worldcoin\u0027s operations due to concerns over personal data privacy. Executing warrants, the PCPD entered six premises linked to Worldcoin across Hong Kong, citing serious risks to personal data privacy.","","","The project has faced regulatory scrutiny in various jurisdictions, leading to the suspension of its services in Kenya and a pause in iris scans in India. French, U.K. and German data protection authorities have also initiated investigations into its data practices.","According to Altman, Worldcoin will not offer tokens in the U.S. and other countries with unclear crypto regulations. This reflects a trend of crypto projects avoiding the U.S. amid regulatory ambiguity.","There\u0027s growing demand for World ID, which helps differentiate between humans and AI-driven software. Worldcoin aims to bridge the gap between AI and crypto, promising a truly massive use case for crypto in the global economy.","","","In an interview to Financial Times, Altman acknowledged the skepticism surrounding eye-scanning technology, admitting its \"clear ick factor.\" However, he challenges critics by questioning why governments have not taken the initiative in such endeavors.","Worldcoin recently secured $115 million in funding, with a valuation reaching $3 billion in the previous year. It originally intended to issue a total of 10 billion tokens, allocating 80% to users, 10% to the company\u0027s investors and the remaining 10% to a foundation. The token has a total supply of 143 million, with 43 million distributed to Worldcoin app users through an airdrop."],"create_date":"2024-02-25T09:00:00+0000","tag":"Worldcoin","author":""}
{"url":"https://u.today/binance-coin-bnb-price-prediction-for-may-15","web_url":"https://u.today/","type":"article","description":"Has price of Binance Coin (BNB) accumulated enough energy to bounce back?","title":"Binance Coin (BNB) Price Prediction for May 15","content":["The cryptocurrency market is bouncing back, according to CoinStats.","The price of Binance Coin (BNB) has fallen by 0.38% over the past day.","On the hourly chart, the rate of SOL has broken the local resistance level of $571.1. If the daily bar closes above it, the growth may continue to the $590-$600 zone soon.","On the bigger time frame, the price has made a false breakout of yesterday\u0027s low. However, the rate of SOL does not have enough strength for a continued bull run.","","","In this case, sideways trading in the range of $570-$590 is the more likely scenario.","From the midterm point of view, the situation is quite similar. As none of the sides has seized the initiative yet, traders may expect ongoing consolidation in the zone of $550-$600 by the end of the month.","BNB is trading at $580 at press time."],"create_date":"2024-05-15T15:17:00+0000","tag":"Binance coin price prediction","author":""}
{"url":"https://u.today/strong-xrp-support-will-it-hold-solana-sol-interesting-pattern-at-144-whats-next-ethereum-eth-in","web_url":"https://u.today/","type":"article","description":"Unfortunately, market could not get enough momentum","title":"Strong XRP Support: Will It Hold? Solana (SOL) Interesting Pattern at $144, What\u0027s Next? Ethereum (ETH) In Problematic State","content":["XRP sits at a pivotal support level around $0.50. Recently, the cryptocurrency experienced a breakdown from a symmetrical triangle pattern, a bearish signal that typically indicates a continuation of the downward trend. However, this has not translated into a significant drop yet, thanks to the strong support at $0.50.","XRP had a surge in volume during the breakdown, showing bulls\u0027 conviction. The 50-day moving average and the 200-day moving average are converging above the current price.","The RSI is hovering around 40, suggesting that XRP is not yet oversold, which means there might still be some room for further downward movement before a potential rebound. However, the resilience at the $0.50 level could also imply a consolidation phase before any significant move.","The key takeaway is the importance of the $0.50 support level. If this level holds, we might see a consolidation phase with potential for a reversal, especially if volume continues to remain high, indicating sustained interest. On the flip side, a break below this support could lead to further declines, potentially testing lower support levels around $0.45.","Solana is currently displaying a problematic price pattern on its daily chart. The cryptocurrency is trading within a descending price channel. This pattern often indicates a period of consolidation before a potential breakout, which could lead to increased volatility and significant price movement.","SOL has been fluctuating within this descending channel, bounded by two parallel trendlines. The lower trendline acts as support, while the upper trendline serves as resistance. The price is currently testing the upper boundary of the channel, around $146.63, suggesting a possible breakout.","","","The volume has been relatively stable, with occasional spikes that highlight periods of heightened trading activity. These volume surges often precede major price movements, indicating that traders are closely watching SOL for any signs of a breakout.","The 50-day moving average is currently above the price, providing additional resistance, while the 200-day moving average is well below the current price, indicating long-term bullish sentiment. The RSI is hovering around 48, suggesting that SOL is in a neutral zone and not yet overbought or oversold.","A breakout above the descending channel could signal the end of the consolidation phase and potentially lead to a surge in volatility. This breakout is what many traders are eagerly anticipating, as it could mark the beginning of a new upward trend for Solana. On the other hand, if the price fails to break through the resistance and continues to trade within the channel, we might see further consolidation before any significant move.","Ethereum is struggling below the crucial $3,000 level. This breach is worrisome because it suggests bearish momentum. Right now, ETH is trying to hold support above $2,800, trading around $2,895.","ETH has settled below $3,000, indicating a potential problem for its price stability. If the price dips further, it could aim for the 200-day EMA, which is around $2,779. This moving average often acts as a reversal point, so it is a critical level to watch.","","","Moving averages and volumes currently show the possibility of aggravation, as the price of Ethereum has not really been showing any signs of an upcoming price surge. Unfortunately, buyers are not providing the support needed for ETH to break through and gain more strength to enter a bull run.","Volume profiles are relatively neutral, and the most recent surge of it isn ot really a sign of anything. The market in general had an inflow of funds, and Ethereum\u0027s volume movement is only part of it."],"create_date":"2024-05-16T00:30:00+0000","tag":"Ethereum","author":""}
{"url":"https://u.today/shiba-inu-shib-soars-8-as-shibarium-welcomes-shibaswap","web_url":"https://u.today/","type":"article","description":"Shiba Inu on rampage as ShibaSwap now hosted on Shibarium","title":"Shiba Inu (SHIB) Soars 8% as Shibarium Welcomes ShibaSwap","content":["Shiba Inu (SHIB) is on a rampage today as the token has soared by more than 8%, joining the broader market momentum. Beyond the general market sentiment, the Shiba Inu revival is powered by the hype surrounding Shibarium, its layer-2 scaling solution.","The Shiba Inu project announced on Wednesday that the much-awaited ShibaSwap decentralized exchange made its way to Shibarium. ShibaSwap is the pioneering DEX associated with the Shiba Inu ecosystem. It was hosted on Ethereum when it launched in 2021.","","","The debut on Shibarium highlighted an important transition for the SHIB ecosystem. With ShibaSwap hosted on Shibarium, project innovators on the L2 now have a ready marketplace to host their projects. This might encourage an influx of developers into the ecosystem, which already boasts of a vibrant community.","ShibaSwap and its thriving marketplace might also boost the total transaction count on Shibarium. The daily transaction count on the L2 platform has flattened out since at least April 20. With more swaps on Shibarium, this metric can revive and possibly contribute to the growth in the total number of SHIB tokens sent to burn addresses.","The Shiba Inu price revival also stems from the realization of the impact of the DEX as concerns staking on Shibarium. This can largely help control the circulating supply of SHIB and, hence, price valuation over time.","The current price trend pegs the price of Shiba Inu at $0.00002549, beating the $0.000023 point that has formed a crucial barrier for over a month. With the token breaching this resistance point, it might further stretch to reclaim the $0.00003 mark.","","","While the token has a confluence of fundamentals to support this ambitious surge, the launch of ShibaSwap on Shibarium can change its future outlook remarkably."],"create_date":"2024-05-16T09:45:00+0000","tag":"Shiba Inu","author":""}
{"url":"https://u.today/doge-community-hotly-anticipates-payments-launch-on-x","web_url":"https://u.today/","type":"article","description":"Dogecoin army excited at prospects of X Payments leaving banks in dust","title":"DOGE Community Hotly Anticipates Payments Launch on X","content":["An insider from the X and Dogecoin teams known on the X platform (formerly famous as Twitter) as “DogeDesigner” (@cb_doge) has published a tweet about the much-anticipated launch of “X Payments” and the effect it may have on the payments industry, and conventional banks in particular.","This message triggered an enthusiastic reaction from the Dogecoin community since they expect DOGE to be adopted as one of payment options on this popular platform.","The tweet went on, saying that X Payments will surpass and leave banks behind in the same way as another of Elon Musk\u0027s companies – Tesla – has left behind legacy auto and had a massive impact on it.","\"𝕏 Payments\" will do to Banks, what \"Tesla\" did to legacy auto. pic.twitter.com/wTOHZlw5aU","While the X Corporation continues to secure licenses for payment processing in new U.S. states, the payment service on X is expected to launch by the end of this year. Still, it remains unclear whether the technical entrepreneur will indeed implement cryptocurrencies, or solely DOGE, on X.","Prior to purchasing the platform for $44 billion in October 2022, Musk stated many times that integrating Dogecoin payments on Twitter would be a good idea. By that time, BTC and ETH tipping had already been enabled by Jack Dorsey (the CEO back then) and Musk tried to persuade the public that DOGE is much better suited for payments than Bitcoin.","","","Several times last year, Elon Musk made it “clear,” and then “super clear,” that neither X nor any of his other companies intend to release a native cryptocurrency. Perhaps this was announced out of fear of having to deal with the SEC regulator. Musk has already had to clash with it in court and won a case about \"taking Tesla private at 420.\"","However, the Securities and Exchange Commission has labeled only Bitcoin a commodity, and over the past few years, it has been pestering crypto companies and exchanges, claiming that they trade altcoins, which are nothing but unregistered securities. Ripple Labs has been fighting in court against the SEC’s charges since December 2020 about whether XRP is an unregistered security or not.","In July last year, Judge Analisa Torres rules that XRP sales on the secondary markets do not qualify as security sales."],"create_date":"2024-05-16T13:19:00+0000","tag":"Dogecoin","author":""}
{"url":"https://u.today/press-releases/cosmos-hub-approves-1-million-grant-to-dora-factory-for-quadratic-funding-initiative","web_url":"https://u.today/","type":"article","description":"Cosmos Hub Approves $1 Million Grant to Dora Factory for Quadratic Funding Initiative","title":"Cosmos Hub Approves $1 Million Grant to Dora Factory for Quadratic Funding Initiative","content":["Singapore, Singapore, May 15th, 2024, Chainwire","A major event in Cosmos is the recent passing of Governance Proposal No.917: a request by Dora Factory and DoraHacks for a $1 million grant from the Cosmos Hub community treasury. This grant will support ten rounds of Quadratic Funding within the Cosmos Hub ecosystem over the next two years.","","As one of the largest treasury funding applications, this proposal sparked extensive discussions within the Cosmos community and received overwhelming support. Over $1 billion worth of ATOM, including major validators and core Cosmos contributors, voted in favor. The approval rate reached 91.9%, making Gov Proposal 917 the motion with the highest approval rating in the Cosmos Hub\u0027s history.","Following the approval of this proposal, Dora Factory, in collaboration with DoraHacks, has officially announced the second AEZ (ATOM Economic Zone) quadratic funding program, marking the launch of the first long-term funding initiative. This quadratic funding program will span two years, starting May 15, 2024, and ending May 2026.","The passing of Gov Proposal 917 brings native Quadratic Funding to the Cosmos Hub for the first time.","What is Public Goods Funding?","Public goods funding is a frequently discussed concept within the Web3 industry. Generally, public goods refer to goods or services that are available for everyone to use.","In crypto, public goods can include blockchain infrastructure, storage, developer tools, software middleware, and user-facing applications such as block explorers, data dashboards, and wallets.","Due to its inherent transparency and verifiability, crypto and blockchain are ideal tools for funding public goods.","However, web3 public goods funding also faces numerous challenges.","Enter Dora Factory, which strives to build infrastructure that enables large-scale adoption of public goods funding.","Dora Factory: Infrastructure Born for Public Goods","Dora Factory is a leading decentralised governance infrastructure and multi-chain public goods funding protocol stack, incubated and supported by DoraHacks, the industry\u0027s developer and public goods funding platform. Its products include Public Good Staking infrastructure and Dora Vota, an appchain for voting and governance designed to empower the global Hacker Movement, open-source communities, and DAOs.","Multi-Chain Quadratic Funding: Aligning Communities and Ecosystem Builders","What is Quadratic Funding? Through native-token donations, token-holder communities can support high-quality early-stage projects and public goods within various ecosystems, fostering better collaboration among foundations, communities, and developers.","As the first and only team in the industry to develop and advocate for this approach, Dora Factory is a true leader in multi-chain quadratic funding. It has successfully deployed native quadratic funding in numerous mainstream crypto ecosystems, including BNB Chain, Solana, Polygon, Aptos, Cosmos Hub, Injective, and Avalanche.","Public Good Staking: Providing Sustainable Funding for Public Goods","In late 2022, Dora Factory introduced the concept of Public Good Staking. By operating underlying infrastructure such as validators, they earn native block rewards that are continuously used to fund multi-chain developers and public goods ecosystems.","Dora Factory has promoted public good staking in over 30 ecosystems\u0027 mainnets and testnets, achieving a TVL (Total Value Locked) of over $400 million, providing up to $10 million in sustainable annual funding.","In the future, Dora Factory will explore ways to use cryptocurrency to fund cutting-edge technology fields like space technology, quantum computing, artificial intelligence, and biomedical research.","Community Incentive Fund: Making Public Goods Funding More Fun","Dora Factory launched the Community Incentive Fund to make the public goods funding process more engaging and fun. Top meme and NFT projects like Celestia’s Celestine Sloth Collection, Injective Ninja, Aptos Gui Inu, and Aptos Monkeys have become partners of the Community Incentive Fund. Through retroactive airdrops and gamified donations, these projects have brought more fun to public goods funding, receiving contributions and donations from nearly 100,000 unique addresses across different communities.","Anonymous Minimum Anti-Collusion Infrastructure (aMACI): Bringing Privacy Technology to On-Chain Public Goods Governance","MACI is a cryptographic technology designed to maximize the detection and elimination of collusion in voting. In 2022 and 2023, the Dora Factory team collaborated with ETHDenver, 0x, and OpenSea to introduce privacy voting to crypto hackathons. MACI has significantly improved privacy and reduced collusion in on-chain governance and voting.","In 2024, Dora Factory launched aMACI, adding voter anonymity to eliminate collusion between the vote initiator and the operator. This further enhances privacy and lowers the usage threshold of MACI voting. This is a significant step towards future large-scale decentralized voting systems.","Dora Vota: Open Infrastructure for Public Goods Funding","Dora Vota is a multi-chain governance and voting infrastructure. Vota and interoperability protocols like IBC will provide modular voting and governance infrastructure, such as plug-and-play quadratic funding modules and grant distribution mechanisms. As the first permissionless appchain focused on scaling on-chain voting, Dora Vota will offer developers a valuable playground, unlocking more possibilities for public goods funding and decentralized community governance.","Recently, Dora Factory secured strategic financing from dao5, Whampoa Digital, and angel investors like EigenLayer co-founder Calvin Liu. This is the first strategic round of a new funding series since Dora Factory’s $17.5M raise in 2021.","As Dora’s Public Good Staking grows and Vota’s ecosystem matures, the team believes Dora Factory will continue exploring new solutions to traditional funding inefficiencies, accelerating the maturity of governance and public goods funding in the multi-chain ecosystem."],"create_date":"","tag":"","author":""}
{"url":"https://u.today/billionaire-friedland-slams-bitcoins-energy-use","web_url":"https://u.today/","type":"article","description":"American-Canadian billionaire Robert Friedland has criticized Bitcoin\u0027s wastefulness","title":"Billionaire Friedland Slams Bitcoin\u0027s Energy Use","content":["During his appearance at the Qatar Economic Forum, American-Canadian financier Robert Friedland slammed Bitcoin mining as an \"energy obscenity.\"","\"Huge amounts of energy being sort of used up for nothing,\" Friedland said.","According to the most recent data, Bitcoin consumes more energy than the entire state of Utah (or roughly 2% of U.S. electricity consumption).","\"A lot of people get the idea that the internet is green. There is nothing whatsoever green about the internet,\" he said.","\"When you do a Google search…you are using a quantum of electrical energy about the same as running a 100-watt light bulb for 10 seconds. When you do an AI search, you are using up to 30, 35 times more energy or enough to run that lightbulb for two or three or four or five or ten minutes.\"","The billionaire has predicted that energy demand will go \"to infinity\" due to the growing popularity of artificial intelligence.","He believes that AI will have to compete with cryptocurrency mining for power. This is the sentiment shared by some industry leaders, including Marathon Digital CEO Fred Thiel. Some miners have even pivoted to AI in order to diversify their business models.","Friedland also took a shot at the gold mining industry for wasting too much electricity. \"I think most of the world\u0027s gold mines could close today and humanity wouldn\u0027t be materially worse off,\" he said."],"create_date":"2024-05-16T15:32:00+0000","tag":"Bitcoin News","author":""}
{"url":"https://u.today/5-key-reasons-why-bitcoin-btc-may-hit-all-time-high-soon","web_url":"https://u.today/","type":"article","description":"Bitcoin\u0027s imminent surge toward all-time high may be supported by these five compelling factors, as highlighted by QCP Capital analysts","title":"5 Key Reasons Why Bitcoin (BTC) May Hit All-Time High Soon","content":["QCP Capital, a notable Singapore-based crypto trading firm, has identified pivotal indicators, suggesting a forthcoming surge in the Bitcoin (BTC) price, potentially surpassing the previous peak of $74,000. Here are five key drivers underpinning this optimistic outlook.","","","First, the recent release of CPI data has sparked a broad breakout across risk assets. Bitcoin swiftly rebounded above the $66,000 threshold, signaling renewed investor confidence and a shift toward risk-on sentiment.","Second, QCP Capital\u0027s analysts project a continuation of this upward trajectory, foreseeing a potential return to the $74,000 highs. This projection is supported by notable market activity, including substantial purchases of $100,000-$120,000 per BTC call options for December 2024.","Third, institutional interest in Bitcoin remains robust, with major asset managers like Millennium Management and Schonfeld allocating significant portions of their assets under management to spot Bitcoin ETFs. Recent filings underscore this trend, revealing Millennium Management\u0027s $2 billion exposition through such solutions.","Moreover, a convergence of factors, including widespread sovereign and institutional adoption, diminishing inflation concerns and the anticipation surrounding upcoming U.S. presidential elections, further bolsters the case for bullish momentum.","","","As market observers speculate on the future of this breakout, there is growing anticipation regarding the potential resumption of the bull market for Bitcoin.","Should this trend persist, it could pave the way for BTC to eclipse its previous all-time high at $74,000, presenting enticing prospects for investors seeking to capitalize on the potential upward trajectory."],"create_date":"2024-05-16T15:14:00+0000","tag":"Bitcoin","author":""}
{"url":"https://u.today/legendary-trader-peter-brandt-expects-bitcoin-price-pump","web_url":"https://u.today/","type":"article","description":"Legendary trader Peter Brandt\u0027s latest prediction on Bitcoin\u0027s price trajectory triggers all-time high speculation","title":"Legendary Trader Peter Brandt Expects Bitcoin Price Pump","content":["Legendary trader Peter Brandt has reaffirmed his optimistic outlook on Bitcoin (BTC), a move that has garnered significant attention in the financial world. Taking to social media, Brandt shared a Bitcoin price chart that outlines his projection for the cryptocurrency\u0027s future trajectory. His analysis suggests that Bitcoin is poised for a significant surge, potentially reaching its previous all-time high of $74,000.","","","Brandt, known for his seasoned expertise in financial markets, has consistently advocated for Bitcoin\u0027s bullish potential. He emphasized the reliability of his analysis, noting that it aligns with his previous interpretations of market trends. The chart presented by Brandt illustrates a pattern of accumulation followed by a minor downturn, culminating in an expected upward trend for Bitcoin\u0027s price.","I have shown this chart many times in the past in slightly different iterations and it remains my preferred interpretation $BTC pic.twitter.com/dr47wYBsw3","The veteran trader\u0027s bullish sentiment comes on the heels of Bitcoin\u0027s recent price surge, with the cryptocurrency climbing over 7.5% in the past 24 hours to surpass the $66,000 mark per BTC. This upward momentum coincided with favorable inflation data and record highs in major stock market indices, signaling a shift in market sentiment from bearish to bullish.","","","While Brandt\u0027s track record of accurately predicting market movements lends credibility to his analysis, some remain cautious, citing the infamous volatility of cryptocurrencies and the unpredictability of market dynamics.","Questions linger about the sustainability of Bitcoin\u0027s upward momentum and the potential impact of external factors such as monetary policy developments and risks of recession."],"create_date":"2024-05-16T08:28:00+0000","tag":"Bitcoin","author":""}
{"url":"https://u.today/futures-exchange-giant-cme-plans-to-kick-off-bitcoin-trading","web_url":"https://u.today/","type":"article","description":"CME is set to make a foray into Bitcoin spot trading","title":"Futures Exchange Giant CME Plans To Kick Off Bitcoin Trading","content":["According to a Thursday report by the Financial Times, Chicago-based futures exchange CME Group is on track to launch Bitcoin spot trading due to growing demand.","It is unclear when spot Bitcoin trading will become available on the exchange since the plan is yet to be finalized.","It is worth noting that CME Group has long been a major player in the crypto market. It initially launched Bitcoin futures in December 2017, a move that coincided with the peak of the bull run.","In May 2021, it also launched micro Bitcoin futures, responding to demand for futures contracts of smaller size.","","","According to data provided by CoinGlass, CME is currently in the lead when it comes to Bitcoin futures open interest with $9 billion. It is ahead of such major crypto native players as Binance, OKX, and BitMEX.","In early 2020, CME also launched Bitcoin options on its futures contracts. CME comes in second place in terms of options value, significantly lagging behind Deribit.","The growing demand for spot trading comes after the launch of several spot ETFs earlier this year.","According to the most recent data, spot Bitcoin ETFs managed to attract $303 million worth of inflows on Wednesday."],"create_date":"2024-05-16T05:46:53+0000","tag":"Bitcoin News","author":""}
{"url":"https://u.today/giga-shiba-inu-shib-whales-wake-up-with-35-trillion-transfer","web_url":"https://u.today/","type":"article","description":"Massive Shiba Inu whales start moving","title":"Giga Shiba Inu (SHIB) Whales Wake up With 3.5 Trillion Transfer","content":["Shiba Inu whales are slowly waking up after the asset exits the state of anemia and shows some kind of a bullish price performance in the last few days. Luckily, those large transfers are not tied to any kind of selling operations and are most likely part of fund redistribution operations. Additionally, we will take a look at the most recent and relevant on-chain data.","In the last 24 hours, Shiba Inu has seen two massive transfers, totaling approximately 3.5 trillion SHIB. The first transfer involved three trillion SHIB, valued at around $74.79 million, moved from one Robinhood wallet to another. The second transfer moved 495.646 billion SHIB, valued at about $12.65 million, between two unknown wallets. These significant movements indicate internal reshuffling rather than sell-offs, which is a positive sign for the market.","The number of large transactions has spiked, with 281 transactions recorded in the last 24 hours, hitting a seven-day high. This suggests increased activity among major holders, which can sometimes precede significant price movements. However, these transactions have not led to a notable price drop, reinforcing the idea that they are internal redistributions rather than sell-offs.","","","The volume of large transactions has also seen a surge. In the last 24 hours, the total volume of large transactions reached 5.41 trillion SHIB, compared to the seven-day low of 415.2 billion SHIB. With the surge in volume, we may conclude that whale activity is a major part of it.","Despite this increased activity, some metrics highlight potential weaknesses. For instance, the overall number of transactions on the Shiba Inu network has been relatively stable but not particularly high, indicating that while whale activity is up, retail participation may not be as high."],"create_date":"2024-05-16T13:59:00+0000","tag":"Shiba Inu","author":""}
{"url":"https://u.today/charles-hoskinson-spotlights-important-cardano-update-details","web_url":"https://u.today/","type":"article","description":"Cardano expecting huge upgrade, as teased by founder Charles Hoskinson","title":"Charles Hoskinson Spotlights Important Cardano Update: Details","content":["Charles Hoskinson, founder of the blockchain platform Cardano, has focused the community’s attention on an important update: the Ouroboros Genesis design. Hoskinson created excitement about the update with an interesting Gif that seems to portray users’ impatience to welcome Genesis.","Ouroboros Genesis builds upon the foundation laid by previous iterations of the Ouroboros protocol. It introduces enhancements aimed at protecting network nodes, particularly those that are new or returning after an absence. The goal is to strengthen Cardano\u0027s resilience and scalability.","","","All blockchains have a consensus protocol, which ensures the consistency and immutability of the distributed ledger across network nodes. Ouroboros Classic served as the initial proof-of-stake protocol, followed by Ouroboros BFT, then Ouroboros Praos.","Now, Ouroboros Genesis represents the next phase in this evolution, addressing key challenges faced by network nodes, particularly during the initial synchronization process or after prolonged periods of absence.","The Ouroboros Genesis update introduces several new concepts and mechanisms to enhance the security and reliability of the Cardano blockchain. Some of these include Ledger Peers, Lightweight Checkpointing, Limit on Eagerness (LoE), Genesis Density Disconnection (GDD), Limit on Patience (LoP) and Genesis State Machine.","The Ledger Peers are crucial in preventing eclipses, a potential threat to syncing nodes. The function is to reduce the probability of selecting malicious nodes, thereby enhancing network security. Lightweight Checkpointing activates when there is a severe network outage.","","","Limit on Eagerness ensures that nodes only select blocks that all ledger peers agree on. This prevents syncing nodes from committing to malicious blocks. A Genesis node employs GDD to disconnect from peers serving alternative chains to maintain network integrity and prevent nodes from committing to adversarial chains.","Cardano is long known as a major development hub. The Ouroboros update is one of the many recent attempts the protocol is exploring to outrank Ethereum and other competing blockchains."],"create_date":"2024-05-16T15:41:00+0000","tag":"Cardano","author":""}
{"url":"https://u.today/xrp-whales-surge-into-bullish-outlook-as-market-confidence-skyrockets","web_url":"https://u.today/","type":"article","description":"This aggressive accumulation is typically positive sign","title":"XRP Whales Surge into Bullish Outlook as Market Confidence Skyrockets","content":["Crypto analyst Ali has spotted an interesting trend among XRP whales. According to Ali, XRP whales have purchased approximately 110 million XRP tokens in the last two weeks, totaling $55 million in value.","The term \"whales\" often refers to entities or persons who own a large amount of a certain cryptocurrency. This aggressive accumulation is typically a positive sign since it may indicate more buying pressure from market players.","#Ripple whales have bought over 110 million $XRP in the past two weeks, totaling around $55 million! pic.twitter.com/yeguiYitcT","Ali referenced Santiment data to show that XRP whales with 1 million to 10 million coins had been aggressively accumulating the digital currency, with noteworthy transactions occurring in the last two weeks.","These large-scale purchases have resulted in a net rise in whales\u0027 XRP holdings, signaling confidence and bullish sentiment toward the cryptocurrency.","This has piqued the interest of the crypto community, prompting speculation regarding the reasons behind such a large accumulation and its potential implications for XRP\u0027s price trajectory.","XRP price has largely consolidated in a range since mid-April. Bulls\u0027 attempts to push XRP price beyond the $0.57 level was rebuffed by bears on two occasions. This suggests a near-term resistance around this region, which needs to be breached for the XRP price to advance.","After hitting a low of $0.4841 on May 13, the XRP price began to recover. Although slight selling has hampered its rebound, XRP reached intraday highs of $0.523 during today\u0027s trading session.","","","At the time of writing, XRP had risen 1.69% in the last 24 hours to $0.514. If XRP\u0027s price can maintain its present levels, it may rally to the overhead resistance of $0.57. This level may prove to be a difficult obstacle to overcome. If this is surpassed, XRP might rise as high as $0.64 or perhaps $0.74 on a breach of its daily moving averages.","Alternatively, if the price falls from its current level, bears may attempt to strengthen their position by bringing the price to the important support of $0.46. Buyers are anticipated to defend this level vigorously. A robust rebound from $0.46 might indicate that the range-bound activity may continue for some time."],"create_date":"2024-05-16T14:47:00+0000","tag":"XRP News","author":""}
{"url":"https://u.today/ripple-cto-congratulates-elon-musk-on-beating-sec-by-taking-xrp-private-at-420","web_url":"https://u.today/","type":"article","description":"David Schwartz says hello to Elon Musk using his famous \"420 Tesla\" tweet after billionaire wins against the SEC","title":"Ripple CTO \"Congratulates\" Elon Musk on Beating SEC by \"Taking XRP Private at $420\"","content":["Chief technology officer of Ripple Labs giant, who has been quite active on Twitter not only on crypto topics recently, has posted a tweet in which he seems to be congratulating Elon Musk.","The tech mogul has been found not guilty by the jury in the case set by the SEC against Musk in 2018 after his \"420\" Tesla tweet.","But instead of Tesla, Ripple CTO\u0027s tweet is focused on XRP. This tweet is a joke, Schwartz warns just in case.","As reported by WSJ, the jury found tech magnate Elon Musk not guilty in charges of violating the federal law on securities. The SEC pressed those against the billionaire in 2018 after he posted a tweet saying that he was taking Tesla private at $420 and funding was secured.","Musk took to his recently purchased Twitter to thank the jury that defended him, saying \"thank goodness, the wisdom of the people has prevailed!\"","Thank goodness, the wisdom of the people has prevailed! I am deeply appreciative of the jury\u0027s unanimous finding of innocence in the Tesla 420 take-private case.","Many who follow the Tesla boss on Twitter sent their congratulations in the comments to the aforementioned tweet.","David Schwartz from Ripple congratulated Musk in his own ironic manner, tweeting \"I\u0027m taking XRP private at $420. Funding secured.\"","I\u0027m taking XRP private at $420. Funding secured. ᵀʰⁱˢ ⁱˢ ᵃ ʲᵒᵏᵉ","","","It is worth noting that both Ripple and Elon Musk have become targets of the U.S. securities regulator.","The agency initiated a lawsuit against the San Francisco-based fintech firm in December 2020, accusing it, as well as its co-founder and CEO, of making billions of USD on selling XRP as an unregistered security to institutional investors.","Now, Elon Musk has been found not guilty in the SEC case and the crypto community looks forward to Ripple beating the securities regulator in court this year too."],"create_date":"2023-02-04T10:54:00+0000","tag":"Elon Musk","author":""}
{"url":"https://u.today/michael-saylor-delivers-surprising-meme-bitcoin-btc-statement","web_url":"https://u.today/","type":"article","description":"Michael Saylor delivers surprising Bitcoin declaration amid meme coin mania","title":"Michael Saylor Delivers Surprising Meme Bitcoin (BTC) Statement","content":["Michael Saylor, the CEO of MicroStrategy and a prominent advocate for Bitcoin, has once again attracted attention with a recent statement regarding the cryptocurrency. Saylor\u0027s succinct declaration characterizes Bitcoin (BTC) as the embodiment of a cultural phenomenon, referring to it as the \"Meme-ing of Life.\"","","","This unexpected analogy comes amid a growing trend of meme-inspired cryptocurrencies gaining traction on the market. It is interesting that Saylor pointed out precisely the memeing connotation when real meme mania is unfolding on the crypto market. While all sorts of dog- and cat-inspired tokens are soaring parabolas on their price charts, Saylor emphasizes Bitcoin\u0027s central role in this cultural narrative.","#Bitcoin is the Meme-ing of Life.","Defined as ideas or behaviors spread virally within a culture, memes carry symbolic significance, often representing specific themes or phenomena. Saylor\u0027s comparison positions Bitcoin as not only a digital currency but also a symbolic representation of broader societal shifts in finance and technology.","As Saylor continues to provide insights into Bitcoin\u0027s significance, the cryptocurrency itself experiences a positive trajectory. Currently trading at $66,000 following a notable 7.5% increase, BTC remains near its recent highs, with a slight dip of around 12%.","","","Several analysts, including renowned trader Peter Brandt, are anticipating further upward momentum in the price of Bitcoin. With projections pointing toward a potential retest of the $74,000 mark, which stands as the current all-time high, optimism prevails within the crypto community. However, as with any market prediction, only time will reveal the accuracy of these forecasts."],"create_date":"2024-05-16T12:26:00+0000","tag":"Bitcoin","author":""}
{"url":"https://u.today/10-things-you-need-to-know-about-crypto-scams-in-2024","web_url":"https://u.today/","type":"article","description":"Crypto scammers continue to thrive through 2024, and their threat should not be overlooked","title":"10 Things You Need to Know About Crypto Scams in 2024","content":["Last year, almost $2 billion was lost in crypto. The very decentralized nature and irreversible transactions of cryptocurrencies expose the landscape to significant vulnerabilities. Retrieving funds post-crypto scam becomes an insurmountable challenge, necessitating vigilance, early detection and cautious engagement as paramount defenses. Here are the top 10 things you need to know about crypto scams in 2024.","Crypto scams correlate with market trends. In bullish markets, unqualified traders rush in, while scams generate less revenue during declines. Overall, crypto scamming and hacking revenue have been steadily declining since 2021, but scammers get more inventive.","Market sentiment drives pump-and-dump scams. Scammers inflate a new crypto\u0027s price through hype, enticing investors to later sell and profit. In 2022, 24% of new tokens were pump-and-dump schemes, illustrating their prevalence.","AI advances equip scammers with deceptive tools, such as AI-powered chatbots. Recently, the CFTC warned of scams using AI promises, exploiting its growing use for false claims. Several fraud schemes were identified, including one causing a loss of 30,000 Bitcoins ($1.7 billion).","Last year saw a growing number of deepfake video ads, and the trend continues into 2024. Fraudsters often exploit high-profile figures\u0027 images and AI-generated videos to endorse fraudulent crypto projects utilizing deepfake technology.","The infamous SEC’s official account is merely one, although memorable, event in the series of recent X hacks. Apparently, the crypto community should beware of social networks\u0027 vulnerability to hacks and market manipulation.","","","Pig butchering, or romance scams, is gaining more attention as a primary threat. This type of scam uses emotional manipulation on social media or dating apps. Scammers create a fake identity, engaging victims before discussing investments. Victims often hesitate to report, contributing to underreporting.","Crypto investment scams persist, with a 23% increase reported in 2023. Scammers promise high returns and quick profits, but investment scams lack transparency about fund use and underlying mechanisms. Legitimate projects offer detailed information about goals, technology and the team.","Phishing scams target crypto users through deceitful emails and links, draining $300 million in 2023. These attacks have been reported quite frequently: MetaMask, Blockstream and Trezor wallets recently faced new and dangerous phishing attacks.","With more investment scams ending up in court convictions, other fraudsters lean into the victims’ search for recovery. The rise of \"double scams\" adds complexity to crypto fraud. Victims face a second wave from firms posing as recovery agents, promising to reclaim lost funds for fees.","For more information, check our ultimate guide How To Avoid Crypto Scams in 2024."],"create_date":"2024-02-11T00:00:00+0000","tag":"Cryptocurrency Scam","author":""}
{"url":"https://u.today/parity-wallet-hacker-moves-9-million-in-ethereum-leaving-246-million-in-limbo","web_url":"https://u.today/","type":"article","description":"Parity hacker moves $9 million in Ethereum, sparking renewed discussions of crypto security","title":"Parity Wallet Hacker Moves $9 Million in Ethereum, Leaving $246 Million in Limbo","content":["In a development echoing one of the largest crypto heists in history, Cyvers Alerts has reported that a hacker, who exploited a vulnerability in Parity\u0027s multi-signature wallet in 2017, has now moved a substantial sum of Ethereum (ETH). The hacker, responsible for the theft of 150,000 ETH, valued at $30 million at the time, has initiated the laundering of a portion of their loot, transferring 3,050 ETH, equivalent to $9 million, through the eXch platform.","This marks a significant chapter in the saga, underscoring the enduring impact of cyber breaches in the digital asset realm. Cyvers Alerts took to X to highlight the unfolding events, reminding followers of the 2017 incident that shook the crypto community. The vulnerability in Parity\u0027s Multisig Wallet version 1.5+ had allowed the perpetrator to abscond with a staggering amount of Ethereum, causing substantial financial losses.","🚨ALERT🚨 In 2017, a vulnerability in Parity Multisig Wallet version 1.5+ led to the theft of over 150K ETH, valued at approximately $30M USD at the time. The hacker behind this theft has demonstrated remarkable patience, marking a significant chapter in crypto history. Today,… pic.twitter.com/JPD5nJcmrJ","The latest maneuver by the hacker underscores a strategic and patient approach to their illicit activities. By utilizing eXch and consolidating multiple addresses under \"0x5167052b,\" they have successfully laundered a portion of the stolen funds. However, what\u0027s more concerning is the sizable sum still under their control. With 83,017 ETH, valued at a staggering $246.6 million, remaining untouched at the primary address \"0xb3764761,\" the hacker retains significant leverage within the cryptocurrency ecosystem.","This recent activity reignites discussions surrounding security measures within the crypto space and the persistent threat posed by vulnerabilities in blockchain platforms. Despite efforts to enhance security protocols and mitigate risks, incidents like the Parity Wallet breach are stark reminders of the ever-present danger of cyber attacks.","As stakeholders assess the implications of this latest development, attention turns to broader implications for investor confidence and regulatory oversight within the crypto market. The ability of hackers to exploit weaknesses in infrastructure and maneuver substantial sums of digital assets shows the need for continued vigilance and collaboration within the industry to safeguard against such threats."],"create_date":"2024-05-13T12:00:00+0000","tag":"","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
{"url":"https://u.today/press-releases/multipool-announces-lbp-after-raising-650k-in-vc-round-led-by-nxgen","web_url":"https://u.today/","type":"article","description":"Multipool Announces LBP After Raising $650k in VC Round Led By NxGen","title":"Multipool Announces LBP After Raising $650k in VC Round Led By NxGen","content":["Majuro, Marshall Islands, May 15th, 2024, Chainwire","Multipool, a leading innovator in the blockchain and cryptocurrency industry, announces the close of its $650k VC investment round led by NxGen, and the announcement of its Fjord Foundry LBP on May 21st-23rd. In the past month, Multipool has brought together the best of the crypto investment scene and connected them with the next big thing, receiving an overwhelmingly positive response from the community.","Partnered with Professionals","The Multipool LBP launches with industry professionals including NxGen, a group of private investors and advisers. These stakeholders provide Multipool with all the skillsets and regulatory support needed to reshape the industry offering compliance, flawless technological development and widespread awareness.","The Big Launch","With the close of the VC round, Multipool will launch their LBP on Fjord Foundry May 21st - 23rd, where crypto enthusiasts from all around the world can participate, joining a community of vibrant experts on the cutting edge of crypto tech.","To learn more about Multipool and the upcoming LBP, users can visit:","Website - www.multipool.finance","Telegram - t.me/multipoolfi","X - https://twitter.com/multipoolfi","About Multipool","Multipool is a cutting-edge decentralized exchange (DEX) transforming the trading landscape for real-world assets (RWAs) and cryptocurrencies. Multipool is designed for fairness and equality, featuring a fully decentralized on-chain order book, deep liquidity through dynamic bracket pools, and seamless trading of RWAs and cryptocurrencies. Utilizing world-class innovations including industry-first FIX APIs, low latency networks, zero price impact auctions, trustless RFQs, peer-to-peer repo lending, and MEV bot protection, Multipool sets a new standard in DeFi trading. Experience unparalleled efficiency and security in your trading journey with Multipool – The DEX with CEX appeal.","https://www.multipool.finance/"],"create_date":"","tag":"","author":""}
{"url":"https://u.today/cardano-skyrockets-500-million-in-market-cap-as-ada-price-shines-green","web_url":"https://u.today/","type":"article","description":"Cardano\u0027s market cap surges half a billion dollars as ADA price goes green on CPI data release","title":"Cardano Skyrockets $500 Million in Market Cap as ADA Price Shines Green","content":["Cardano (ADA), a prominent player on the cryptocurrency market, witnessed a significant resurgence today, boosting its market capitalization by over half a billion dollars. This surge comes on the heels of a positive response from financial markets, particularly within the crypto sphere, to the latest Consumer Price Index (CPI) data release.","According to data from CoinMarketCap, Cardano\u0027s market capitalization surged from $15.4 billion to $15.91 billion during the current trading session, solidifying its position as the 10th largest cryptocurrency by market capitalization. This surge places Cardano ahead of Shiba Inu (SHIB) but behind Dogecoin (DOGE), which presently holds 9th place with a market capitalization of $22.12 billion.","","","The primary catalyst behind this surge is the remarkable uptick in the price of ADA, Cardano\u0027s native token, triggered by the CPI report. Following a notable downturn over the past five days, ADA\u0027s price experienced a rapid ascent, climbing by 4.2% within a single trading session to reach $0.448.","The CPI report, indicating a slightly lower-than-expected inflation rate, led traders to bolster their predictions of interest rate cuts by the Federal Reserve in the coming months. This sentiment further fueled the bullish trend in Cardano\u0027s market performance.","","","The resurgence of ADA reflects the resilience and promise of this popular cryptocurrency amid market uncertainty. As Cardano enthusiasts closely monitor its trajectory, the notable increase in market capitalization signals renewed confidence in ADA\u0027s investment potential."],"create_date":"2024-05-15T15:48:00+0000","tag":"Cardano News","author":""}
{"url":"https://u.today/23-billion-xrp-in-24-hours-what-just-happened","web_url":"https://u.today/","type":"article","description":"XRP volume hits major milestone in 24 hours, price reacts","title":"2.3 Billion XRP in 24 Hours, What Just Happened?","content":["XRP has joined the general market rebound trend as its price moved from a 24-hour low of $0.4993 to a high of $0.5213. At the time of writing, XRP has maintained 3.56% in the trailing 24-hour period, and its price is pegged at $0.5180.","One intriguing trend in the XRP trading ecosystem is the massive trading volume. This interest indicator has jumped by over 20% overnight and is pegged at $1,231,202,840. In the volume-to-price count, it implies that a total of 2,376,839,459 XRP has been traded thus far, per data from CoinMarketCap.","","","This massive XRP shuffled on exchanges does not also account for Over-The-Counter (OTC) trades that also account for a sizable chunk. With interest in the retail market rebooted, it sets the stage for XRP to chart a new bullish trend overall.","XRP has generally maintained the $0.52 level as formidable support it has failed to successfully breach since at least May 10. With the 2.3 billion booms in volume, the narrative might change in the short- to midterm.","XRP is one of the most troubled altcoins in the top 10 lists. Unlike Bitcoin (BTC) and Ethereum (ETH), with 9.91% and 38.58% from their all-time highs (ATHs) of $73,750.07 and $4,891.70 respectively, XRP is still down from its highest level by 86.51%.","Many XRP proponents believe this undervaluation of the coin may soon change should the lawsuit between Ripple Labs and the U.S. Securities and Exchange Commission (SEC) reach a favorable end. While the timeline remains unknown, the community is keeping tabs on important dates for key events.","","","The growth of the XRP Ledger (XRPL) ecosystem is also another major catalyst that the coin’s proponents believe will boost the price in the long term."],"create_date":"2024-05-16T13:28:00+0000","tag":"XRP","author":""}
{"url":"https://u.today/cardano-ada-makes-surprising-reversal-after-death-cross-formation","web_url":"https://u.today/","type":"article","description":"ADA recovered from low of $0.426 on May 15","title":"Cardano (ADA) Makes Surprising Reversal After Death Cross Formation","content":["After a concerning five-day streak of declines, which coincided with the formation of a technical pattern known as the \"death cross,\" Cardano\u0027s ADA has made a noteworthy rebound.","ADA recovered from a low of $0.426 on May 15; the gains continued until press time, with ADA rising 5.38% in the last 24 hours to $0.455.","This upward movement comes as a welcome relief for ADA holders, who have been patiently waiting for signs of a bullish reversal. Over the past weekend, Cardano\u0027s ADA\u0027s 50-day and 200-day simple moving averages (SMAs) crossed bearishly, resulting in a death cross formation.","","","Given the bearish outlook suggested by the death cross, ADA\u0027s recent rebound is noteworthy. Several factors may have contributed to Cardano\u0027s positive price performance post-death cross.","One significant aspect is the overall market recovery, where a slight improvement in the broader economic outlook has led to increased investor confidence across various asset classes, including cryptocurrencies.","Also, the anticipation of upcoming protocol upgrades likely played a role in bolstering investor sentiment.","","","However, it remains yet to be seen if ADA\u0027s current rebound is a dead cat bounce or something that might metamorphose into a sustained rally for the cryptocurrency. In this regard, a break above the daily moving averages may be the first indication of strength.","Ouroboros is the consensus protocol that powers the Cardano blockchain. Given Cardano\u0027s ongoing development and increasing use, Ouroboros has moved forward with its planned upgrade path.","Ouroboros\u0027s evolution will continue with Ouroboros Genesis, which is scheduled for release in the third quarter of 2024. Ouroboros Genesis is a set of improvements to the already robust Ouroboros protocol that include countermeasures to safeguard network nodes when they are new or return after an absence.","The first Genesis-capable implementation is expected for deployment in Q3, 2024. At this point, the most significant unknown is the level of optimization required to compensate for the increased peer count required to prevent eclipses."],"create_date":"2024-05-16T12:55:00+0000","tag":"Cardano News","author":""}
{"url":"https://u.today/fantom-ftm-skyrockets-30-in-24-hours-whats-driving-surge","web_url":"https://u.today/","type":"article","description":"Fantom\u0027s (FTM) leap was not in isolation","title":"Fantom (FTM) Skyrockets 30% in 24 Hours — What\u0027s Driving Surge?","content":["Fantom (FTM) a layer-1 protocol focused on fast and cost-efficient transaction execution, recently experienced a remarkable 30% increase in its token value within a single day.","Fantom saw a sharp rebound from lows of $0.637 on May 15, as the crypto markets rallied on softer-than-expected U.S. inflation data. The surge sustained until press time, with Fantom reaching intraday highs of $0.834.","At the time of writing, FTM was up 26.21% in the last 24 hours to $0.828. Its 24 hour trading volume has also risen 315% to come in at $497 million.","This surge is not just a random spike but the result of specific developments within the Fantom ecosystem and the broader crypto market.","","","Fantom\u0027s surge might be rooted in tangible improvements to its network infrastructure. The platform has been diligently working on upgrades that would enhance the scalability of the network.","On May 14, Fantom Introduced the Opera Upgrade Dashboard, as validators on Opera upgrade their nodes to be powered by Sonic tech.","One of Fantom\u0027s key projects for 2024 is to upgrade the Opera chain with the newest Sonic technology.","This upgrade aims to improve the scalability of the network through two new implementations: Fantom Virtual Machine (FVM) and a new storage system for Fantom’s Opera chain. Ultimately, this upgrade aims to make Fantom one of the highest-performing monolithic blockchains.","As previously stated, Fantom\u0027s leap was not in isolation. The broader momentum on the crypto markets, particularly the upswing in Bitcoin\u0027s value, has had an impact on a variety of cryptocurrencies, including FTM.","Bitcoin rose alongside the markets on Wednesday as the April consumer price index indicated that inflation fell from the previous month. The cryptocurrency\u0027s price has risen by 6% to $66,243, according to CoinMarketCap - its biggest day of gains since March 25."],"create_date":"2024-05-16T10:46:00+0000","tag":"Fantom","author":""}
{"url":"https://u.today/blackrock-bitcoin-etf-surpasses-rivals-as-this-crucial-metric-hits-new-record","web_url":"https://u.today/","type":"article","description":"Amazing new data about the largest spot Bitcoin exchange-traded fund revealed by Bloomerg analyst","title":"BlackRock Bitcoin ETF Surpasses Rivals as This Crucial Metric Hits New Record","content":["Senior ETF analyst for Bloomberg Eric Balchunas has spread the word about the largest spot Bitcoin ETF – BlackRock’s IBIT – surpassing its rival ETFs not only by the amount of Bitcoin held but also by another important metric. This one has skyrocketed, according to a recent tweet published by Balchunas.","The analyst’s post reveals that a surprising 414 reported holders in the fund\u0027s first 13F season have been reported. This is a “mind boggling” figure for this metric, the analyst admitted, adding that it “blows away [the] record.”","","","Balchunas then clarified that even if a newly born ETF gets 20 holders, that is already a big deal very rare.","The analyst provided an infographic to show how far behind some of the other largest spot Bitcoin ETFs stand behind BlackRock. Bitwise’s BITB boasts around 100 reported holders, Fidelity’s FBTC has slightly under 250 and Ark Invest has less than 100.","$IBIT ended up with 414 reported holders in its first 13F season, which is mind boggling, blows away record. Even having 20 holders as a newborn is bfd, highly rare. Here\u0027s a look at how the btc ETFs compare to other ETFs launched in Jan (aka the Class of 2024) in this metric. pic.twitter.com/ngicEdbaTq","In the meantime, BlackRock’s ETF keeps seeing zero inflows for the third consecutive day. The other nine spot ETFs have seen positive inflows over the past three days, scooping up $303 million worth of Bitcoin on May 15, according to data shared by the @spotonchain analytics account.","🚨 $BTC #ETF Net Inflow May 15, 2024: +$303M! • The net inflow has been positive for 3 trading days. • 9 out of the 10 US Bitcoin ETFs, including #Grayscale, experienced single-day inflows. • The #BlackRock BTC ETF continues to have zero flow for the third day in a row.… pic.twitter.com/7yKB85CEcM"],"create_date":"2024-05-16T14:12:00+0000","tag":"Spot Bitcoin ETF","author":""}
{"url":"https://u.today/litecoin-price-predictions-and-ltc-forecasts","web_url":"https://u.today/","type":"article","description":"Read the accurate and complete Analytics of Litecoin market status, which will help you navigate its movement relative to other cryptocurrencies.","title":"Litecoin Price Prediction","content":[],"create_date":"","tag":"","author":""}
{"url":"https://u.today/press-releases/lbanks-mothers-day-initiative-supporting-christ-foundation-orphanage-home-and-widows","web_url":"https://u.today/","type":"article","description":"LBank\u0027s Mother\u0027s Day Initiative: Supporting Christ Foundation Orphanage Home and Widows Outreach Center in Nigeria","title":"LBank\u0027s Mother\u0027s Day Initiative: Supporting Christ Foundation Orphanage Home and Widows Outreach Center in Nigeria","content":["Singapore- May 14, 2024 -In a heartfelt demonstration of compassion and solidarity, LBank, a leading cryptocurrency exchange platform, has embarked on a charitable endeavor to support the Christ Foundation Orphanage Home and Widows Outreach Center in Nigeria on the occasion of Mother\u0027s Day.","As the world celebrated motherhood and maternal love, LBank recognized the importance of extending care and assistance to those who may be less fortunate. In partnership with the Christ Foundation Orphanage Home and Widows Outreach Center, LBank organized a donation drive aimed at providing essential life necessities to the residents of the center.","\"Mother\u0027s Day serves as a poignant reminder of the love and sacrifice that mothers selflessly give to their families and communities,\" stated Kaia Wang, Global CMO at LBank. \"In line with our commitment to corporate social responsibility, LBank is proud to stand in solidarity with the Christ Foundation Orphanage Home and Widows Outreach Center and contribute toward improving the lives of women and children in need.","","","The charitable initiative underscores LBank\u0027s ethos of giving back to society and making a positive impact on communities. By extending support to the Christ Foundation Orphanage Home and Widows Outreach Center, LBank aims to provide tangible assistance to individuals and families facing adversity, particularly in challenging times.","LBank remains committed to fostering social responsibility and community development through its philanthropic endeavors. By leveraging its resources and platform, LBank endeavors to create positive change and empower marginalized communities across the globe.","About LBank","Established in 2015, LBank is a premier global cryptocurrency trading platform, serving millions of users globally. Committed to security, innovation, and user satisfaction, LBank offers a seamless trading experience with a wide array of digital asset services. With a robust selection of cryptocurrencies and advanced trading features, LBank Exchange redefines digital asset trading, empowering users to navigate the dynamic crypto market confidently."],"create_date":"","tag":"","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide#h527","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
{"url":"https://u.today/binance-issues-key-announcement-for-bnb-beacon-chain-users","web_url":"https://u.today/","type":"article","description":"Binance has issued key announcement that might concern BNB Beacon Chain users","title":"Binance Issues Key Announcement for BNB Beacon Chain Users","content":["In a significant development, Binance has issued a key announcement that might concern BNB Beacon Chain (BEP2) users. As indicated by the project team in January 2024, BNB Beacon Chain (BEP2) will be phased out in June 2024. The sunset plan is not an abrupt discontinuation but a carefully orchestrated transition process.","In this regard, Binance has announced it will start migrating assets from BNB Beacon Chain (BNB) to BNB Smart Chain (BSC), taking effect from today May 15. The migration will continue over the next few weeks, with completion aimed at June 2024.","Starting today, #Binance will start migrating assets from BNB Beacon Chain (BNB) to BNB Smart Chain (BSC). The migration will continue over the next few weeks, with completion aimed at June 2024. More details here ⤵️https://t.co/o6SwsO4j6d","As the BNB Chain team will be completing the sunset of BNB Beacon Chain (BEP2) by June 2024, Binance says it will stop processing deposit requests for all BEP2 tokens, excluding BEP2 Binance-pegged tokens (B-tokens) on May 15, 2024, at 12:00 a.m. (UTC).","As a result, users are strongly encouraged to deposit BEP2 B-tokens into their Binance accounts before the BEP2 network sunset is complete in June 2024. B-tokens credited to Binance accounts can then be withdrawn via its native network or other networks supported by Binance.","","","Ahead of the sunset completion in June, efforts are being made to bind all BEP2 and BEP8 assets to BNB Smart Chain (BSC), allowing users to conduct cross-chain withdrawals of their assets.","According to an earlier announcement, the binding and asset migration process will become unavailable once the BEP2 network sunset is complete in June 2024.","Users who hold BEP2 tokens that are not bound to the BEP20 network may be unable to recover their BEP2 assets and might sustain losses if this is not done before the sunset deadline.","A pivotal step in June will be the release of a CLI (Command Line Interface) token migration application. This tool is intended to assist users in retrieving funds that are still on the Beacon Chain, signaling a key milestone in the roadmap."],"create_date":"2024-05-15T15:37:00+0000","tag":"","author":""}
{"url":"https://u.today/press-releases/crypto-pioneer-netki-powers-seamless-kyc-and-compliance-solutions-across-the-sui#","web_url":"https://u.today/","type":"article","description":"Crypto Pioneer Netki Powers Seamless KYC and Compliance Solutions Across the Sui Ecosystem","title":"Crypto Pioneer Netki Powers Seamless KYC and Compliance Solutions Across the Sui Ecosystem","content":["Grand Cayman, Cayman Islands, May 16th, 2024, Chainwire","Today, Netki, a digital identity verification leader, announced the launch of their pioneering compliance oracle – DeFi Sentinel – on Sui, the Layer 1 blockchain and smart contract platform. The integration introduces an essential tool for developers that automates compliance within their protocols, allowing them to focus on shipping high-impact projects instead of spending time developing tools to meet complex, ever-changing regulations that often differ across jurisdictions.","Institutions are eager to engage with DeFi protocols and technology but need to ensure that all of their trades, and trading partners, meet their compliance standards. Until now, these institutional players have been forced to either trade in manually managed pools with limited liquidity and trading volume, or to avoid DeFi altogether. With DeFi Sentinel on Sui, developers can meet institutional as well as regulator requirements via a one-time integration.","DeFi Sentinel leverages Netki\u0027s advanced technology to provide real-time KYC/AML, wallet screening, financial transaction monitoring, securities compliance, and tax compliance, all now integrated directly within the DeFi protocols on Sui that choose to implement the tool. The solution combines on-chain and off-chain data to ensure each transaction adheres to institutional risk, as well as regulatory standards.","Sui will also integrate Netki\u0027s OnboardID, which, for protocols that enable it, enhances user onboarding and identity verification processes, reducing costs and simplifying compliance around the onramping process for Sui developers’ applications. Netki’s integration represents a significant advancement in making decentralized financial systems safer and more accessible globally.","\"DeFi protocols are poised to transform financial services by enhancing accessibility and transparency, but many of the best ideas fail to get off the ground due to compliance concerns,\" said Evan Cheng, CEO of Mysten Labs, the original contributor to Sui. \"Netki’s integration not only fortifies the security and compliance of transactions on Sui but also assures institutional and individual participants of their adherence to evolving regulatory requirements, and most importantly, gives developers the peace of mind to build with confidence.\"","Netki’s DeFi compliance oracle is unique in the industry, enabling transaction-by-transaction compliance, which is crucial for institutional adoption of DeFi tools. With features like real-time name and wallet screening, the solution ensures that compliance and risk management are seamlessly integrated into the transaction flow without compromising the user experience or developer agility.","“By integrating DeFi Sentinel with Sui\u0027s robust and scalable blockchain infrastructure, we are setting a new standard for safety and compliance in the DeFi space,” said Justin Newton, CEO of Netki. “We aim to enable the safe and widespread adoption of DeFi technologies, ensuring that developers can focus on innovation while evolving and expanding compliance requirements are effortlessly met.”"],"create_date":"","tag":"","author":""}
{"url":"https://u.today/binance-coin-bnb-price-prediction-for-may-15#","web_url":"https://u.today/","type":"article","description":"Has price of Binance Coin (BNB) accumulated enough energy to bounce back?","title":"Binance Coin (BNB) Price Prediction for May 15","content":["The cryptocurrency market is bouncing back, according to CoinStats.","The price of Binance Coin (BNB) has fallen by 0.38% over the past day.","On the hourly chart, the rate of SOL has broken the local resistance level of $571.1. If the daily bar closes above it, the growth may continue to the $590-$600 zone soon.","On the bigger time frame, the price has made a false breakout of yesterday\u0027s low. However, the rate of SOL does not have enough strength for a continued bull run.","","","In this case, sideways trading in the range of $570-$590 is the more likely scenario.","From the midterm point of view, the situation is quite similar. As none of the sides has seized the initiative yet, traders may expect ongoing consolidation in the zone of $550-$600 by the end of the month.","BNB is trading at $580 at press time."],"create_date":"2024-05-15T15:17:00+0000","tag":"Binance coin price prediction","author":""}
{"url":"https://u.today//worldcoin-wld-reaches-new-important-milestones-report","web_url":"https://u.today/","type":"article","description":"Worldcoin expands its tech to Singapore, while it reaches several big milestones important for further expansion, including Minecraft partnership","title":"Worldcoin (WLD) Reaches New Important Milestones: Report","content":["Chinese crypto journalist Colin Wu has taken to the Twitter/X social media platform to share the news about Worldcoin (WLD) launched by the founder and chief executive of OpenAI, Sam Altman, earlier this year.","He spread the word about the important milestones reached by Worldcoin recently and a major update the company made about World ID verification.","According to a blog post published by Worldcoin, the World ID verification now has a new location where it can be carried out using Worldcoin’s hardware gadget Orb – tech hub Singapore. Still, at the same time, Worldcoin has eliminated such an opportunity for India, France and Brazil, depriving customers from these countries of a chance to conduct this verification.","Worldcoin said that World ID verification can now be carried out in Singapore through its hardware device Orb. It recently announced that it will no longer provide its Orb verification service in India, Brazil and France. Additionally, the World ID-compatible wallet World App…","The important milestone mentioned above is the fact that the World App wallet compatible with World ID has reached a peak of more than five million downloads as it now boasts nearly 2 million monthly active users.","","","According to a recent report, Mojang, the company that created the mega popular computer game Minecraft, has begun collaborating with Microsoft and Worldcoin, getting these tech giants’ help in improving the digital security of its game using blockchain.","World ID has now been integrated into the game, thus ensuring a unique way to for a secure digital verification of players. World ID is a system of digital identity created by Worldcoin and it is meant to turn online gaming into a safer process than it is now. It will help players to securely verify their identities while playing. This means that they will no longer have to use regular credentials and a password for logging into the game but will utilize World ID instead.","The impact is expected to be much wider than just Minecraft, the integration of World ID is expected to make the whole space of online gaming secure what with multiple hacks, cyber threats happening these days. World ID is supposed to keep users’ digital identities safe and authenticated, while playing.","Every World ID can be applied only to one player, thus eliminating the issue of managing several accounts and protecting him/her from being impersonated. Besides, World ID will prevent game cheating imposed by some players."],"create_date":"2023-12-27T15:18:00+0000","tag":"Worldcoin","author":""}
{"url":"https://u.today/press-releases/rocktree-capital-unveils-cyberpunk-crypto-future-in-new-website","web_url":"https://u.today/","type":"article","description":"RockTree Capital Unveils Cyberpunk Crypto Future In New Website","title":"RockTree Capital Unveils Cyberpunk Crypto Future In New Website","content":["Beijing, China – May 16, 2024","RockTree Capital, a leading crypto-native fund and merchant bank headquartered in Beijing, announces the launch of its immersive website, showcasing a futuristic film-noir concept: the Cyberpunk Crypto City. The website’s cutting-edge interactive cityscape represents RockTree\u0027s vision where Web3 has become pervasive, fusing technology, finance, and culture. The site, set in the future near the 11th halving of bitcoin, builds on the ideas of the cypherpunk movement, through advocating for the widespread use of decentralization and privacy-enhancing technologies as a route to self sovereignty and freedom for human beings everywhere.","As an early-stage investor and bespoke accelerator in Asia for its portfolio companies, RockTree Capital has been instrumental in geometrically accelerating its investee projects’ go-to-market cycle. Through its ultra-localized strategies and grassroots community building initiatives, RockTree has empowered emerging founders and projects to thrive in both East and West markets. Leveraging deep regional relationships with leading crypto institutions, capital collaborators, and Web3 partners, RockTree invests in and accelerates the trajectory of projects from Infrastructure, DeFi, Cross-chain, and the Bitcoin Ecosystem.","Founded by visionary investor Omer Ozden and headquartered in Beijing, China, RockTree Capital operates at the nexus of the East & West with a crypto native team that bridges the human, cultural, capital and media gap across these markets. RockTree embodies a truly grassroots approach that unites Eastern and Western crypto markets and benefits its portfolio investments, which include amongst others; dYdX, The Graph, Chainlink, Fantom, Pocket, Maple, Covalent, Axelar, Eclipse, and BEVM.","\"RockTree focuses on the human aspects of Web3. In addition to unifying the collaboration of top people in Eastern and Western crypto markets, our core strength is identifying the human hallmarks of success for Founders and Team,\" says Omer Ozden, Founder and Chairman of RockTree Capital. \"We utilize advanced behavioral neuroscience methods to determine Founders’ emotional intelligence, execution capabilities and integrity. We prioritize not only technological innovation, but also the individuals behind that innovation, their psychology and levels of consciousness. And we invite those projects into our trusted international ecosystem and methodology, so they can scale rapidly in foreign markets, instead of trying to figure it out organically through trial and error,\" said Ozden.","The Cyberpunk Crypto City website represents RockTree\u0027s forward-looking vision decades in the future, where Web3 technology and digital assets penetrate all peoples’ daily lives, and decentralized finance becomes a pervasive consumer product, like soft drinks or chewing gum, allowing true democratization of finance. Visitors to the Cyberpunk Crypto City website will immerse themselves in a retro film-noir homage, with captivating visuals of a cybernetic metropolis of replicants, that is bilingual in English and Chinese, and powered by blockchain technology.","Experience the future of finance at RockTree Capital\u0027s Cyberpunk Crypto City and join us in shaping the next chapter of Web3 innovation.","For media inquiries, please contact:","Alisa Loi","lisa@rocktreecapital.com","RockTree Capital is an early stage crypto-native fund and merchant bank based in Beijing, China. Our portfolio companies experience geometric scale in Asian markets through the RockTree Acceleration Program by combining our ultra-localized go-to-market strategies and grassroots long-term community building. RockTree invests into top-tier crypto projects and helps build Decacorns in the areas of Infrastructure, DeFi, Cross-chain and Bitcoin Ecosystem","www.rocktreecapital.com","https://twitter.com/RockTreeCapital"],"create_date":"","tag":"","author":""}
{"url":"https://u.today/press-releases/one-trading-extends-the-reach-of-its-institutional-trading-services-in-europe#","web_url":"https://u.today/","type":"article","description":"One Trading Extends the Reach of its Institutional Trading Services in Europe Through Integration with Talos","title":"One Trading Extends the Reach of its Institutional Trading Services in Europe Through Integration with Talos","content":["London, United Kingdom, May 16th, 2024, Chainwire","Talos, the premier provider of digital asset trading technology for institutions, and One Trading, a crypto trading venue headquartered and regulated in the European Union, announced an integration designed to expand liquidity access for institutions. As part of the collaboration, One Trading joins the Talos network of liquidity providers, expanding the possible destinations for their shared clients looking to achieve best execution. Talos users will now be able to access One Trading’s high-speed trading platform, with a matching engine time of just 1 microsecond.","In addition to expanding its potential reach to Talos’s institutional clients, One Trading also adopts the Talos trading platform as a sell-side client to support its OTC trading desk. The award-winning Talos trading platform will help One Trading efficiently source liquidity to better serve its clients’ needs. The multi-faceted relationship between the two firms highlights the different ways that the Talos network and platform can enhance a partner’s business.","Commenting on the integration, Joshua Barraclough, CEO of One Trading said, “Talos shares our goal of bridging the gap between traditional and crypto asset trading. That’s why we’re excited to integrate with Talos as a liquidity provider as well as a sell-side trading client. They provide us with the same institutional grade of technology that we seek to provide to our own clients.”","One Trading is an EU-based trading venue built by a highly experienced ex-TradFi team. One Trading provides an institutional-grade digital asset exchange for both retail customers and institutional clients, with a focus on achieving market-leading execution speed, deep order books, and low fees. The exchange provides zero fees for both maker and taker transactions. One Trading operates a regulated spot trading venue and an OTC business with plans to roll out a MiFID II regulated derivatives business in the near future. As the Markets in Crypto Assets (MiCA) European regulation elevates the importance of best execution, Talos’s integration with One Trading will empower shared clients with an additional option for sourcing the best available liquidity.","About Talos","Talos provides institutional-grade technology that supports the full digital asset trading lifecycle, including liquidity sourcing, price discovery, trading, settlement, lending, borrowing and portfolio management. Engineered by a team with unmatched experience building institutional trading systems, the Talos platform connects institutions to key participants in today’s digital asset ecosystem – exchanges, OTC desks, prime brokers, lenders, custodians and more – through a single point of entry. By streamlining the entire trading process, Talos helps mitigate intermediary risk and facilitate best execution. For additional information, visit www.talos.com.","Talos Disclaimer: Talos offers software-as-a-service products that provide connectivity tools for institutional clients. Talos does not provide clients with any pre-negotiated arrangements with liquidity providers or other parties. Clients are required to independently negotiate arrangements with liquidity providers and other parties bilaterally. Talos is not party to any of these arrangements. Services and venues may not be available in all jurisdictions.","About One Trading","One Trading is a leading European digital asset trading platform with a VASP registration in Italy with Organismo Agenti e Mediatori (OAM). The One Trading platform has various offerings: Exchange, Instant Trade, and an OTC desk. The Exchange is where registered customers can access the fastest trading venue in the world with zero fees — also boasting a transparent order book with deep liquidity, and charting tools for technical analysis. The team behind One Trading has strong ex-TradFi expertise and is focused on providing an unparalleled product experience.","Instant Trade offers a simplified UI for trading a wide range of fiat, stablecoin, and altcoin pairs at 0% additional commission. One Trading retrieves the best prices for customers by plugging into a number of major liquidity providers with access to deep liquidity. These relationships have been established through the over-the-counter (OTC) offering, and are typically only reserved for HNWs or institutional customers. Through Instant Trade, all trader types can access this unique trading mechanism through a simple UI.","The OTC desk offers a high-touch trading team to work with clients, typically institutional partners to facilitate trades in any size and digital asset, with access to deep pools of liquidity, rapid settlement, and large asset coverage.","One Trading Disclaimer: This material is for informational purposes only, and is not intended to provide legal, tax, financial, or investment advice. Past performance is not necessarily indicative of the future nor a reliable indicator of the likely performance of any investment. Recipients should consult their own advisors before making these types of decisions. One Trading has no responsibility or liability for any decision made or any other acts or omissions in connection with Recipient’s use of this material."],"create_date":"","tag":"","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide#h283","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
{"url":"https://u.today/dogecoin-doge-skyrockets-71-in-volume-whats-happening","web_url":"https://u.today/","type":"article","description":"Dogecoin (DOGE) surprises community with astonishing 71% surge in trading volume","title":"Dogecoin (DOGE) Skyrockets 71% in Volume - What\u0027s Happening?","content":["In a startling turn of events, Dogecoin (DOGE), the cryptocurrency initially created as a joke, has witnessed an astounding surge in trading volume, leaving both investors and analysts scratching their heads. According to data from CoinGlass, the trading volume of Dogecoin has soared by a staggering 71.04% within the last 24 hours, reaching an eye-popping $2.06 billion.","This surge in trading activity comes against a backdrop of uncertainty and volatility within the cryptocurrency market as a whole. Dogecoin, known for its whimsical Shiba Inu mascot and playful origins, has defied expectations once again by capturing the attention of traders and enthusiasts alike.","Despite its origins as a meme-inspired digital currency, DOGE has steadily gained traction over the years, propelled by an enthusiastic community and high-profile endorsements from figures like Elon Musk and Mark Cuban. However, the magnitude of this recent surge in trading volume has left many observers astonished.","As of the latest data, the current price of Dogecoin stands at $0.1471, marking a modest increase of 3.21% during the same 24-hour period. This rise in price, coupled with the surge in trading volume, suggests renewed interest and activity surrounding the cryptocurrency.","Furthermore, Open Interest in Dogecoin has also experienced a notable uptick, climbing by 6.83% to reach $774.73 million. Open Interest refers to the total number of outstanding derivative contracts, providing insights into market sentiment and potential future price movements.","The sudden spike in trading volume and Open Interest raises questions about the underlying factors driving this surge. While cryptocurrencies are known for their volatility, the extent of Dogecoin\u0027s movement has caught many off guard. However, this recent surge could be attributed to the renewed interest from retail investors.","Despite its unconventional origins and often unpredictable price movements, Dogecoin continues to command attention within the community. Whether this surge signifies a temporary anomaly or the beginning of a sustained rally remains to be seen, but one thing is certain: DOGE continues to defy expectations."],"create_date":"2024-05-13T15:02:00+0000","tag":"Dogecoin News","author":""}
{"url":"https://u.today/guides/xuirin-introduces-defi-card-for-web3-adoption-by-businesses-guide#h362","web_url":"https://u.today/","type":"article","description":"Here’s how Xuirin project introduces card solution for DeFi built on top of eponymous token XUIRIN","title":"Xuirin Introduces DeFi Card for Web3 Adoption by Businesses: Guide","content":["The newly-launched protocol Xuirin is going to advance plastic bank card usage in DeFi. With its cards, customers can enjoy spicy rewards, cashbacks, and pay with crypto in a secure, confidential and low-cost manner.","Launched in Q1, 2024, the Xuirin project exploded in the cryptocurrency market with its DeFi cards offering.","In general, Xuirin represents a new-gen attempt to solve issues with credit card usage in DeFi and introduce a sphere of cryptocurrencies to newcomers.","In the segment of cryptocurrencies, credit cards have been used frequently since the mid-2010s. Typically, these cards can be topped up with cryptocurrency: Bitcoin (BTC), U.S. Dollar Tether (USDT) or major altcoins with the largest liquidity. Once funded with crypto, this card works not unlike regular ones issued by classic banks on top of Visa and Mastercard payments processors.","In general, crypto cards are developed and promoted by large centralized exchanges: Binance, Coinbase, Bybit have their own card programs. The usage of crypto cards might be restricted in some jurisdictions with no clear legal framework for issuance and usage of Web3 products.","The adoption of credit cards associated with cryptocurrency payment operators is catalyzed by the flexibility, resource-efficiency and profitability of these solutions for the end customers.","As such, more and more cryptocurrency users are considering trying DeFi cards for personal and business needs.","The novel crypto debit card project Xuirin employs all the latest developments in DeFi to offer the most convenient and resource-efficient card for daily usage in personal and commercial use cases.","Introduced by a team of cryptocurrency developers and entrepreneurs in 2024, Xuirin is an ecosystem of crypto debit cards. As per statements of its representatives shared on the official Xuirin website, the ecosystem includes DeFi debit cards themselves, intelligent crypto payment gateways, an AI-powered peer-to-peer (P2P) lending module and a multi-chain, non-custodial, highly secure decentralized cryptocurrency wallet.","Despite being in very early phases of development, the project has already scored a third-party security audit with SolidProof, a reputable cybersec team in crypto and blockchain.","The project’s economics are underpinned by the native eponymous token XUIRIN, which is issued on top of Ethereum (ETH) as an ERC-20 asset. Right now, the token is available in a discount sale phase for $0.03 in equivalent.","In order to address the most dangerous challenges in the segment of DeFi credit cards, Xuirin offers a number of exclusive features to various groups of its customers. Thanks to its tech design and rich stack of integrations, the card is suitable for all types of transactions, be it online shopping or dining out.","Due to a balanced transactions scheme, which is 100% regulatory compliant in various regions and territories, Xuirin cards can be seamlessly usable both locally and internationally. Xuirin cards guarantee quick and safe payment processes; their owners can withdraw cash in ATMs in various regions.","The Xuirin team highlights that security and anonymity of transactions with funds are guaranteed by Xuirin\u0027s non-custodial DeFi wallet associated with its cards.","Last but not least, new and existing customers of Xuirin cards are able to enjoy complimentary access to airport lounges around the world.","To make the experience with cryptocurrency debit cards resource-efficient for various groups of customers, its team introduced three tiers of DeFi cards associated with various cashback rates on transactional volume.","Xuirin’s offering\u0027s tiered structure — with Silver, Gold and Diamond cards — enhances each transaction with escalating cashback rewards. Silver tier users enjoy 2.5% cashback, Gold members receive 4%, and Diamond cardholders are at the forefront with generous 8% cashback.","While a Silver card can be opened for free, a Gold card is available for $50 and a Diamond card can be obtained for a one-time $90 payment.","In late Q1, 2024, the team of Xuirin is running the inaugural phase of the XUIRIN token sale for cryptocurrency enthusiasts. Everyone can purchase XUIRIN with their on-chain wallet seamlessly via the project’s website main page.","XUIRIN is minted on the Ethereum (ETH) blockchain as an ERC-20 token; its supply is capped at 1,000,000,000 XUIRIN. The team designed a balanced tokenomical structure to protect the asset from inflation and fuel catalysts for its demand.","Category","Allocation, million XUIRIN amount","Marketing","40","Liquidity and listing reserves","120","Partner and advisor compensation","30","Ecosystem development","210","Presale allocation","450","Market making, KOL incentives","50","Team rewards","50","Cashback reserves","50","Right now, the token is available with a discount at $0.03 only. Users can purchase it for either Ether (ETH) or U.S. Dollar Tether (USDT) via Xuirin’s official website.","All purchasers of the Xuirin token with $100+ deposits can take part in the global $500,000 giveaway initiative. A lucrative 5% referral bonus can be claimed by successful owners of affiliate links.","Xuirin is a one-stop platform for DeFi credit cards targeting B2B and B2C usage. Customers can top up these cards with cryptocurrency and use them like regular bank cards.","The project is running a public presale of its token XUIRIN on the Ethereum (ETH) blockchain, a massive giveaway and affiliate program for early supporters."],"create_date":"2024-03-29T16:06:00+0000","tag":"Xuirin","author":""}
