{"url":"https://crypto.news/coinbase-recovers-services-following-two-hour-system-wide-outage/","web_url":"https://crypto.news/","type":"article","description":"Cryptocurrency exchange Coinbase said in an X post it has restored some of its services following an outage that disrupted trading on its website and mobile app","title":"Coinbase recovers services following two-hour system wide outage","content":["Cryptocurrency exchange Coinbase said in an X post it has restored some of its services following an outage that disrupted trading on its website and mobile app.","In an X post on May 14, the US-based crypto exchange Coinbase said it recovered “some services,” noting though that customers “may still be encountering connectivity problems.” The exchange’s update comes two hours after Coinbase initially reported a “system wide outage” and reassured customers of an active investigation into the matter.","We\u0027re seeing some services recover. We know customers may still be encountering connectivity problems and we appreciate your patience while we work to correct this. We\u0027re still monitoring this closely. https://t.co/AAzEMPaJGL","Coinbase allegedly first encountered the problem on May 13 at around 21:19 PDT. In a notification message on its status page, the exchange said some users “may experience failures when sending funds,” without elaborating on the matter.","At the time of writing, Coinbase’s status page reads “This incident has been resolved,” although it’s unclear what was the reason for the two-hour “wide outage.” Centralized crypto exchanges usually go down due to a spike of volatility in the market or high blockchain network traffic.","As Bloomberg notes, Coinbase had previously encountered technical difficulties in March, resulting in some users’ accounts displaying a zero balance. This incident coincided with a Bitcoin rally to record levels shortly afterward, the report reads.","The recent incident, however, appears to be related to a technical issue on the exchange’s back-end side as Bitcoin (BTC) and Ethereum (ETH) show barely any movements over the past 24 hours with +0.31% and -0.44% change respectively, according to CoinGecko."],"create_date":"2024-05-14T08:04:58+00:00","tag":"Coinbase","author":"Denis Omelchenko"}
{"url":"https://crypto.news/op_cats-bip-420-proposes-to-revive-bitcoin-covenants/","web_url":"https://crypto.news/","type":"article","description":"OP_CAT recently unveiled its BIP-420 proposal amid the ongoing discourse surrounding covenants within the Bitcoin community.","title":"OP_CAT\u0027s BIP-420 proposes to revive Bitcoin covenants","content":["OP_CAT recently unveiled its BIP-420 proposal amid the ongoing discourse surrounding covenants within the Bitcoin community.","According to Udi Wertheimer on X, an advocate for OP_CAT, the proposal aims to enable covenants on Bitcoin, opening avenues for smart contracts, secure bridges, on-chain trading, zk proof verification, and more. However, it’s worth noting that the proposal hasn’t yet gained official status as a Bitcoin Improvement Proposal (BIP).","Covenants on Bitcoin (BTC), in essence, are sophisticated scripting features dictating specific conditions on how bitcoins can be spent in future transactions.","Covenants have the potential for various use cases, from creating secure vaults that facilitate reversible transactions to enabling automated recurring payments, time-locked transfers for inheritance purposes, and even complex financial instruments like escrows and bonds.","Originally, OP_CAT was part of Bitcoin’s early opcodes but was disabled by Satoshi Nakamoto in 2010 due to concerns about potential vulnerabilities. An opcode, a command within the Bitcoin scripting language, is crucial in executing operations within Bitcoin scripts.","The proposal, spearheaded by Ethan Heilman and Armin Sabouri, proposes reintroducing OP_CAT through a backward-compatible soft fork, specifically by redefining the opcode OP_SUCCESS126, which aims to mitigate confusion by retaining the original opcode value.","The proponents argue that reintroducing OP_CAT would enhance Bitcoin’s capabilities, simplify decentralized protocols, support advanced multi-sig setups, and expand Bitcoin’s scripting power and flexibility.","However, realizing an OP_CAT soft fork hinges on technical feasibility, security considerations, and achieving consensus within the community.","Besides OP_CAT, several other covenant proposals are under consideration within the Bitcoin ecosystem, each with its unique approach and potential trade-offs. These include Check Template Verify (CTV), OP_CHECKSIGFROMSTACK (CSFS), and LNHANCE, each offering different functionalities and levels of formalization in their proposals."],"create_date":"2024-04-23T17:14:09+00:00","tag":"Bitcoin","author":"Bralon Hill"}
{"url":"https://crypto.news/ethereum-l2-eclipse-sees-change-in-leadership-following-ceos-sexual-misconduct-claims/","web_url":"https://crypto.news/","type":"article","description":"Ethereum layer-2 project Eclipse is seeing a change in leadership after its former CEO faced allegations of sexual misconduct","title":"Ethereum L2 Eclipse sees change in leadership following CEO’s sexual misconduct claims","content":["Ethereum layer-2 project Eclipse is seeing a change in leadership after its former CEO faced allegations of sexual misconduct.","Neel Somani, the project’s founder and now former CEO, has stepped down from his role. Per a May 16 announcement from Eclipse Labs, Somani will be succeeded by Vijay Chetty, “efficitive immediately.”","Eclipse’s announcement doesn’t mention the reason behind Somani’s departure.","Chetty, currently leading Eclipse, has been the project’s growth officer until now. His past experiences include leadership roles at dYdX Trading, Ripple Labs, and Uniswap Labs. He has also worked with investment manager BlackRock.","Meanwhile, Somani has continued to deny all of the claims. On May 9, he announced that he was “temporarily reducing” his “public face” following the allegations made against him.","He asserted that he has not “sexually assaulted or harassed” anyone.","On the same day, Eclipse announced that it takes the allegations against Somani “seriously” and “believes in the importance of truth.”","The former faced immediate backlash from the cryptocurrency community, with some suggesting that the fact that he was stepping down proved that he was guilty.","Some of Eclipse’s backers and investors have also expressed their discontent on the matter. Dragonfly Capital managing partner Haseeb Qureshi revealed that his VC firm passed on an opportunity to invest in Ecliplse while conducting some background checks on the firm.","Reportedly, Dragonfly was made aware of Somani’s history of sexual harassment claims.","“If we heard this doing only minimal diligence, there’s no way the actual investors didn’t also hear the same,” Qureshi wrote in an X post.","Meanwhile, Hack VC, an investor in Eclipse, posted on X that it was “deeply troubled” about the allegations made against the former Eclipse founder. The firm revealed that it urged Somani to resign and was happy with Somani’s decision.","“To be perfectly clear: the alleged behavior in question is unacceptable, full stop.” the firm wrote."],"create_date":"2024-05-16T10:04:39+00:00","tag":"#Metoo","author":"Rony Roy"}
{"url":"https://crypto.news/paul-oleary-on-how-polygons-zkevm-will-enhance-ethereum-scalability/","web_url":"https://crypto.news/","type":"article","description":"Speaking to crypto.news, Paul O’Leary, CTO of Polygon Labs, discussed how Polygon’s zkEVM technology aims to enhance Ethereum’s scalability by reducing transaction costs and increasing throughput","title":"Paul O’Leary on how Polygon’s zkEVM will enhance Ethereum scalability","content":["Speaking to crypto.news, Paul O’Leary, CTO of Polygon Labs, discussed how Polygon’s zkEVM technology aims to enhance Ethereum’s scalability by reducing transaction costs and increasing throughput.","Polygon’s zkEVM technology is set to significantly enhance Ethereum’s scalability by reducing transaction costs and increasing throughput. Launched as an open-source mainnet beta in March 2023, Polygon’s zkEVM batches transactions off-chain and posts cryptographic proofs to the Ethereum mainnet, alleviating network congestion and reducing costs.","The recent transition to Stage 2 of the Mainnet Beta in January 2024 emphasizes responsible dApp growth and on-chain activity. The Elderberry upgrade, which has been live since March 14, 2024, includes optimizations that reduce network errors and improve overall performance.","Paul O’Leary, CTO of Polygon Labs, shared his insights on ongoing enhancements to zkEVM’s network client architecture.","“The team is currently working on upgrading the zkEVM’s network client architecture. Next up will be an implementation of the Erigon client for CDK chains. This will work to improve network performance and stability and be easier to maintain. We expect it to be live in the coming months.”","Efforts are underway to reduce proving times without compromising security or efficiency. O’Leary mentioned, “We do have something in the works on this, but we aren’t releasing a timeframe on it yet.”","Integration with other scaling solutions, including sharding, is planned for Polygon. O’Leary noted that as a “full-featured rollup,” zkEVM will adapt to Ethereum’s new features like sharding, ensuring continuous evolution and enhanced scalability.","Further efforts to make zkEVM more accessible include simplifying the technology for developers. O’Leary emphasized that with zkEVM, Solidity developers can deploy their Ethereum dApps “without having to get a degree in cryptography,” making it easier to expand the zkEVM ecosystem by reducing complexity and lowering entry barriers for new developers.","Balancing zkEVM’s scalability with blockchain’s decentralization ethos is another key focus.","O’Leary explained that “Ethereum at the settlement layer provides a base of true decentralization. That’s the beauty of zkEVM; it solves blockchain’s scalability challenge while remaining fully compatible with decentralization.”","Looking ahead, O’Leary envisions significant advancements for zkEVM over the next five years, particularly as Ethereum introduces sharding and other scaling technologies. He also anticipates a notable slump in fees.","“It won’t be long before fees become so trivial that the amount users do pay will be negligible — or they’ll no longer need to pay anything at all,” he concluded.","The synergy of these developments and robust community collaboration places zkEVMs at the forefront of cultivating a scalable, secure, and decentralized Ethereum ecosystem."],"create_date":"2024-05-16T11:56:14+00:00","tag":"Cryptocurrency","author":"Rony Roy"}
{"url":"https://crypto.news/btce-founder-pleads-guilty-laundering-stolen-bitcoin/","web_url":"https://crypto.news/","type":"article","description":"Alexander Vinnik, co-founder of the now-defunct crypto exchange BTC-e, admitted to conspiring to launder money, marking a significant development in a long-standing legal saga.","title":"BTC-e founder pleads guilty to laundering stolen Bitcoin","content":["Alexander Vinnik, co-founder of the now-defunct crypto exchange BTC-e, admitted to conspiring to launder money, marking a significant development in a long-standing legal saga.","Vinnik’s guilty plea comes in the wake of a broader investigation that unearthed extensive illegal activities on the exchange from 2011 to 2017.","BTC-e Operator Pleads Guilty to Money Laundering Conspiracy Exchange Moved Over $9B Worth of Transactions; Defendant Caused Criminal Losses in Excess of $100M 🔗: https://t.co/yMrJMgn9qC pic.twitter.com/nRyad1AH7D","In a May 3 press release, the U.S. Department of Justice (DoJ) revealed that at the time Vinnik was at the helm of BTC-e, the exchange processed no less than $9 billion in transactions and amassed a global user base exceeding one million, with many of them located in the U.S.","According to the DoJ, BTC-e served as a conduit for laundering funds acquired from a variety of criminal activities.","Moreover, the DoJ’s investigation revealed that BTC-e operated without having compliance measures such as registration with the Financial Crimes Enforcement Network (FinCEN) in place.","Furthermore, the exchange did not put its customers through anti-money laundering (AML) or know-your-customer (KYC) protocols in the period it operated.","Additionally, investigators found Vinnik to have established numerous shell companies and financial accounts worldwide, facilitating the illicit transfer of funds through BTC-e, resulting in criminal losses totaling at least $121 million.","The case gained traction following a 2017 report by WizSecurity, which revealed BTC-e’s involvement in the Mt. Gox hack.","The report detailed how hackers, in collaboration with BTC-e and Vinnik, laundered stolen Bitcoins through the exchange, implicating Vinnik in the illicit activity.","In February, the DoJ indicted Belarusian Aliaksandr Klimenka as the main defendant in the BTC-e case, alongside Vinnik.","Klimenka faces charges of conspiracy to launder money and running an unlicensed financial services business, with an estimated $4 billion in laundered funds.","At the time of Klimenka’s indictment, the DoJ stated that BTC-e servers in the U.S. were crucial tools for criminal operations, purportedly supported by Klimenka and his company Soft-FX.","Following BTC-e’s closure by American law enforcement in 2017, Vinnik was arrested near Thessaloniki, Greece. After extradition to the U.S. in 2022, the Russian-born crypto entrepreneur faced accusations of money laundering and other offenses.","Despite attempts to revive and rebrand BTC-e as WEX, the venture eventually shuttered, leaving many users unable to withdraw funds.","In 2023, Alexey Bilyuchenko, a Vinnik associate and the former technology administrator of BTC-e, was fined and sentenced to three years and six months in prison for misappropriating the exchange’s funds."],"create_date":"2024-05-04T15:44:00+00:00","tag":"Alexander Vinnik","author":"Julius Mutunkei"}
{"url":"https://crypto.news/senators-probe-fincen-crypto-mixer-lawsuits/","web_url":"https://crypto.news/","type":"article","description":"A bi-partisan duo wrote a letter to the Department of Justice, challenging FinCEN’s “unprecedented interpretation” of rules used to sue crypto mixers.","title":"Bipartisan Senators probe FinCEN crypto mixer lawsuits","content":["A pair of Senators wrote a letter to the Department of Justice, challenging FinCEN’s “unprecedented interpretation” of rules used to sue crypto mixers.","Senators Cynthia Lummis (R-Wyo.) and Ron Wyden (D-Ore.) petitioned U.S. Attorney General Merrick Garland and the Department of Justice (DOJ) regarding an ongoing crackdown on crypto mixers allegedly operating as illegal money transmitters.","Sen. Wyden stressed that holding non-custodial crypto asset software developers liable for supposed criminal activity raised may violate the First Amendment and upset years of lawful precedent.","The issue stems from the Financial Crimes Enforcement Network (FinCEN) view that any crypto mixers or services allowing asset transactions satisfy the requirement of a money transmitter and would thus be subject to registration with authorities.","President Biden\u0027s DOJ steamrolling the longstanding interpretation of FinCEN is legally wrong and threatens to criminalize Bitcoin software development in America. @RonWyden and I have sent a bipartisan letter to DOJ urging it to drop this interpretation immediately. ⬇️ pic.twitter.com/iazbBhMcOv","Both Senators argued that FinCEN’s latest view, as confirmed in a filing last month, directly contradicted this law’s actual meaning. According to a bipartisan letter dated May 9 and disclosed on May 13, a service must exercise control of the assets to qualify as a money transmitter under this provision.","“Wallet software is no more to blame for illicit finance than a highway is responsible for a bank robber’s getaway car.”","Senators Lummis and Wyden have questioned the DOJ’s methods through FinCEN following cases against crypto mixers like Samourai Wallet and Tornado Cash. Five founders credited with developing the platforms have either been arrested or await a verdict in their respective court cases.","Industry proponents insist that builders should not be held responsible for the criminal use of their software, noting that blaming an individual for writing lines of code could stunt innovation and technological advancement.","Some on-chain participants also opined that users have been left out to dry due to a lack of clear digital assets policies in the United States. Several bills in Congress seek to address these concerns but experts are doubtful that concrete legislation will be decided during an election year."],"create_date":"2024-05-13T20:31:34+00:00","tag":"Crypto Mixer","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/bitcoins-blitz-above-66k-bolsters-altcoin-gains/","web_url":"https://crypto.news/","type":"article","description":"Bitcoin recorded one of its best trading days in nearly two months, galvanizing market sentiment and capital deployments.","title":"Bitcoin’s blitz above $66k bolsters altcoin gains ","content":["Bitcoin recorded one of its best trading days in nearly two months, galvanizing market sentiment and capital deployments.","According to CoinMarketCap, six cryptocurrencies posted double-digit price gains as Bitcoin (BTC) zoomed past $66,000 in the last 24 hours and grew over 6% on May 15.","At press time, data showed that Fantom (FTM), Sei (SEI), Immutable (IMX), Core (CORE), THORChain (RUNE), and Sui (SUI) each boasted increases of more than 10% in token price.","Following Bitcoin’s break above current levels, QCP Capital highlighted signals that may indicate bullish momentum for risk assets and the cryptocurrency market.","The company cited encouraging economic data from the U.S. Federal Reserve, which suggests that the Fed has succeeded in containing inflation concerns. After the news, QCP Capital noted sizable buys for $100,000 to $120,000 call options scheduled to expire in December.","Additionally, multiple state-backed and private institutions have disclosed holdings in spot Bitcoin ETFs. This development could catalyze crypto market movements, as the BTC supply has been halved since last month.","“Institutional demand for the BTC continues to grow with large asset managers Millennium and Schonfeld investing approximately 3% and 2% of their AUM into the BTC spot ETF,” QCP Capital researchers wrote via Telegram."],"create_date":"2024-05-16T14:58:50+00:00","tag":"Bitcoin","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/cme-reportedly-in-talks-with-traders-to-open-bitcoin-trading/","web_url":"https://crypto.news/","type":"article","description":"The Chicago Mercantile Exchange is said to be weighing in on launching Bitcoin trades on its platform to capitalize on surging demand","title":"CME reportedly in talks with traders to open Bitcoin trading","content":["The Chicago Mercantile Exchange is said to be weighing in on launching Bitcoin trades on its platform to capitalize on surging demand.","CME Group, the world’s largest futures exchange, appears to be considering launching Bitcoin trading services, as interest for digital assets on Wall Street keeps growing, the Financial Times has learned, citing people familiar with the matter.","The Chicago-based exchange has reportedly been in discussions with traders interested in trading the largest cryptocurrency by market value, although the plan is yet to be finalized. As of press time, CME made no public statements on the matter.","The talks come after the U.S. Securities and Exchange Commission (SEC) gave the green light to list spot Bitcoin exchange-traded funds (ETFs) on CME, alongside its existing crypto futures products. And while the first influx of capital into spot Bitcoin ETFs from institutional investors like Wisconsin’s Investment Board and BNY Mellon was a notable one, the latter sentiment on the market seems to have cooled off, leaving many ETF issuers with nearly no inflows.","If CME proceeds with its spot trading business, it will operate through the EBS currency trading venue in Switzerland, the people say, referring to the region’s robust regulations governing the trading and storage of crypto.","The U.S. Securities and Exchange Commission (SEC) approved multiple spot Bitcoin ETFs in early 2024 for listing on all registered national exchanges in the U.S., including the Nasdaq, NYSE, and CBOE, following a decade-long hunt for these products.","And while the SEC approved several spot Bitcoin ETFs, the watchdog has shown reluctance to swiftly approve options for spot Bitcoin ETFs, raising concerns on whether options on spot crypto ETFs should be subject to the same regulations as stocks."],"create_date":"2024-05-16T10:02:13+00:00","tag":"Bitcoin","author":"Denis Omelchenko"}
{"url":"https://crypto.news/memecoin-frenzy-in-numbers-the-phenomena-of-2024-pre-halving-bull-run-opinion/","web_url":"https://crypto.news/","type":"article","description":"In the current market phase, meme tokens drive up the value of L1 chain coins such as Ethereum and Solana and reshape the web3 wallet leaderboard.","title":"Memecoin frenzy in numbers: the phenomena of 2024 pre-halving bull run | Opinion","content":["Disclosure: The views and opinions expressed here belong solely to the author and do not represent the views and opinions of crypto.news’ editorial.","For the second time in the crypto market history, memecoins spearhead the new bull run while demonstrating unprecedented growth. Some slam meme tokens for having “zero value” and being harmful to the industry, but others praise them for engaging communities and attracting new users to crypto. Meanwhile, the latest memecoin boom has sparked a surge in transaction volume in web3 wallets, defining new leaders in the crypto storage landscape.","Regardless of what anyone thinks about the value of memecoins, their influence on the crypto market right now is hard to overstate.","The soar of meme tokens marks the emerging bull run. By the end of March 2024, the capitalization of top meme coins reached $80 billion, which is close to the all-time highs seen during the previous rally in 2021. At the time of writing, the total value has corrected to nearly $55 billion.","The top memecoins by market cap are Dogecoin and Shiba Inu, well-known from previous alt seasons, but new leaders have also popped up. Among them are BONK, “The Dog Coin of the People,” and Book of Meme (BOME)—a Solana-based token that skyrocketed 457 times since its listing on Binance on March 16, only to plummet by 50% later.","Another leader in the race is Dogwifhat (WIF), also based on Solana. As the token has gained 22X since January, its supporters managed to raise 690,000 USDC to showcase the project’s mascot at Sphere in Las Vegas.","Analysts note how “weird” the current rally is compared to previous market cycles. Zach Rynes, the community liaison at Chainlink, points out that the market skipped several stages—liquidity shifted from Bitcoin directly into memecoins, bypassing several intermediate steps such as Ethereum and other high-cap coins.","The market capitalization of memecoins has already approached its all-time high level of 2021. But this time, this is perhaps only the beginning of the rally—the Bitcoin halving hasn’t even happened yet, while market peaks typically occur within one year after the event.","We are now witnessing a sharp increase in the crypto wallets’ transaction volume, which can be at least partially attributed to the memecoin frenzy. Among the top five web3 wallets, one saw growth of 18% in weekly active users, while two others experienced an increase of almost 50%.","What stands out is the transaction count: the weekly figures in two wallets have surpassed those of MetaMask, one of the most widely used web3 wallets that gained recognition in previous market cycles. Leading the list is Bitget Wallet—a solution by a crypto exchange Bitget that acquired the BitKeep wallet last year and has been developing it under its own brand since then. The wallet recently listed trading pairs with BOME and BONK, which could have contributed to the surge in transaction volume.","Another chart clarifies how the web3 landscape has changed in recent months and weeks: the percentage of transactions processed by MetaMask dropped from 100% to nearly 19%, giving way to new players.","Market experts have directly opposite opinions on memecoins. Among those articulating a popular point of view is Franklin Templeton, an American trillion-dollar asset management firm. The company notes that meme coins have appealed to many traders due to low fees and the potential for quick profits. Experts warn that tokens originating from internet memes “have no inherent value or utility.” “Meme coins harm the crypto industry,” adds Ki Joung Ju, the founder and CEO of the blockchain analytics firm CryptoQuant. He continues:","“It’s frustrating to see billion-dollar-cap meme coins overshadow hardworking teams building legit products to advance this industry. Easy money can’t drive industry-wide progress.”","However, many market participants argue for the opposite. It’s crucial to think twice before labeling memecoins as “stupid and valueless” since they can benefit blockchain ecosystems by attracting new users and developers, says crypto entrepreneur Arthur Hayes.","Memecoins will remain a vital part of the crypto industry and potentially evolve into a new asset class, believes Maartje Bus, VP of research at Messari. They “inadvertently” introduce newcomers to web3 basics, including decentralized exchanges and crypto wallets, and bring people together in the blockchain space.","Like many crypto phenomena, memecoins have the potential to evolve and become more than just a tool for short-term gain. Vitalik Buterin suggests that meme tokens can contribute positively to society, serving as tools for funding public projects.","Whatever memecoins may become in the future, they are transforming the market right now. In the current market phase, meme tokens drive up the value of L1 chain coins such as Ethereum and Solana and reshape the web3 wallet leaderboard. The upcoming rally will show further changes that meme coins will bring to the crypto market.","Mary Pedler is a seasoned communication expert and founder of INPUT Communications Agency, with over seven years of experience in GR and PR. Her expertise has significantly contributed to the success of over 50 tech projects, enhancing their organic media presence and aiding in raising over $500 million. Mary’s proficiency in global media relations, tailored communication strategies, and deep understanding of web3, blockchain, and the MENA market positions her as a leader in her field. Mary is a regular speaker and moderator at industry events, and her agency in Dubai specializes in creating effective communication strategies for tech projects worldwide."],"create_date":"2024-04-27T10:15:00+00:00","tag":"Dogecoin","author":"Guest Post"}
{"url":"https://crypto.news/how-inflation-interest-rates-and-the-stock-market-affect-bitcoins-price/","web_url":"https://crypto.news/","type":"article","description":"Read on how macroeconomic and global events Bitcoin\u0027s price","title":"How inflation, interest rates and the stock market affect Bitcoin\u0027s price","content":["While there are crypto-specific factors that can boost Bitcoin, there’s no denying that prices are often influenced by macroeconomic and global events.","Sometimes, Bitcoin’s price can suddenly leap or plunge without warning.","And in many cases, this is because of macroeconomic and global events outside of BTC’s control — rather than sentiment directly related to the cryptocurrency itself.","Here, we’ll explore the data and developments that can have an outsized influence on the digital asset’s performance.","After the cost of living in the U.S., U.K., and beyond surged to 40-year highs, inflation has become a closely watched barometer of health in major economies.","The likes of the Federal Reserve and the Bank of England have a long-established target of 2% for the Consumer Price Index, but this went out the window after the coronavirus pandemic.","American CPI spiked to a jaw-dropping 9.1% in June 2022 — and over in Britain, double-digit highs of 11.1% were recorded in October of that year. Central bankers in both nations have admitted inflation has proven sticky, and difficult to bring back under control.","Bitcoiners often like to refer to dollar and pound inflation as an invisible thief because of how it erodes spending power — and point to the fact that BTC has a fixed supply of 21 million coins.","For that reason, you may think that worse-than-expected CPI readings would serve as good news for Bitcoin’s price, and increase demand for this digital asset.","But a lot of the time, the opposite has proven to be true.","A classic example of this came in May 2024, when CPI reached at 3.4% — less than what analysts had been expecting.","In the four hours after the data was released, Bitcoin surged from $62,650 to $65,000, a considerable uptick of 3.8%. Wall Street also ascended to record highs.","And that brings us neatly on to the reason for this little rally.","When Bitcoin launched in January 2009 — a cryptocurrency that was designed as a protest to how the 2007/08 global financial crisis was handled — the Fed’s interest rate stood at 0.25%, lows that hadn’t been seen at any point in the previous 40 years.","They stayed there for about six years, before beginning to climb slightly as confidence in the bounceback from the recession grew. Then the coronavirus pandemic happened, and they were slashed to 0.25% once again.","Critics say this ushered in an era of free money — not least because it lowered the cost of borrowing. Consumers were incentivized to spend, especially considering the returns in savings accounts would have been tepid to say the least. But as inflation grew red hot with alarming speed, central banks needed to slam on the brakes and hike interest rates quickly to their current level of 5.5%, a high not seen since 2001.","Unfortunately, bumper interest rates tend to be bad news for Bitcoin. That’s because appetite dwindles for riskier assets, as investors can get pretty healthy returns on their cash by parking it in savings accounts or bonds.","For months and months now, there has been a growing expectation that the Fed will finally move to cut interest rates — and analysts believe this could be a catalyst for Bitcoin. Back in March 2024, a note by Deutsche Bank strategists said:","“More investors will likely seek out higher-yielding alternative assets as Treasury returns decline. This flow of capital into nontraditional investment classes like cryptocurrencies could further support an ongoing rally in digital currency prices.”","At times, there has been a close correlation between Bitcoin and flagship indices such as the S\u0026P 500 or the tech-heavy Nasdaq 100.","And you could argue that this will move even closer now exchange-traded funds based on BTC’s spot price are in operation on U.S. markets — allowing institutional investors to gain exposure to the flagship cryptocurrency’s price fluctuations without owning it directly.","When it comes to the global events that can influence Bitcoin’s value, unrest in the Middle East has proven to have a dramatic effect on BTC several times in recent months.","One such decline was seen in the middle of April, when it was announced that Iran had launched a drone and missile attack against Israel. Bitcoin plunged from $70,000 to $62,000 in a matter of hours as the market digested the news, but rather quickly rebounded.","There was another drop a few days later when Israel retaliated, amid fears that existing conflict in the region could widen.","While there are specific factors that can boost Bitcoin — including excitement around halvings, news of nation-state adoption or accelerating beyond psychologically significant price points — there’s no denying that BTC’s fortunes can also hinge upon the dollar-based economy it was designed to offer an alternative to."],"create_date":"2024-05-16T09:13:34+00:00","tag":"Bitcoin","author":"Connor Sephton"}
{"url":"https://crypto.news/as-bitcoin-rebounds-to-66k-short-term-holders-sell-at-basically-zero-profit/","web_url":"https://crypto.news/","type":"article","description":"While large investors appear to demonstrate their interest in Bitcoin, the growth has yet to accelerate in order to make the rally sustainable, analysts at CryptoQuant say","title":"As Bitcoin rebounds to $66k, short-term holders sell at \u0027basically zero profit\u0027","content":["While large investors appear to demonstrate their interest in Bitcoin, the growth has yet to accelerate in order to make the rally sustainable, analysts at CryptoQuant say.","The price of Bitcoin managed to recover to the $66,000 mark late Wednesday following the news of lower-than-expected inflation in the U.S., resulting in minimal or no profit for short-term holders who are selling.","In a recent research report, blockchain analytics firm CryptoQuant said short-term Bitcoin holders are selling “at basically zero profit,” adding though that the growth “has yet to accelerate in order to make the rally sustainable.”","“[…] traders are now experiencing unrealized losses on their positions, a situation that in the past has coincided with a local bottom in prices.”","CryptoQuant","Additionally, the report notes that the balance of Bitcoin at over-the-counter desks has stabilized since late April, suggesting a decrease in the supply of Bitcoin entering the market through these channels. However, analysts caution that despite this stabilization, stablecoin liquidity growth, which is often associated with sustainable price rallies, is “still slowing down” from a market liquidity perspective.","The analysts also pointed out that Bitcoin’s price remains relatively undervalued from a miner profitability standpoint.","“Bitcoin miners are currently extremely underpaid and their profitability has fallen to the lowest since March 2020, a few days after the COVID market crash.”","CryptoQuant","Meanwhile, analysts at blockchain firm Kaiko suggest that Bitcoin’s recent halving might soon force miners to sell their crypto holdings should the prices fail to recover fast. This is because the daily average network fees, which spiked after the halving, are now decreasing. Initially, these fees gave miners some relief, Kaiko says, noting they’re falling again as the initial excitement about the Runes protocol has “cooled off.”"],"create_date":"2024-05-16T08:24:28+00:00","tag":"Bitcoin","author":"Denis Omelchenko"}
{"url":"https://crypto.news/a-rewarding-ecosystem-enables-monetizing-passion-in-web3-opinion/","web_url":"https://crypto.news/","type":"article","description":"A balanced reward system will need to be transparent, as well as think beyond token utility to consider the quality of engagement value.","title":"A rewarding ecosystem enables monetizing passion in web3  | Opinion","content":["Disclosure: The views and opinions expressed here belong solely to the author and do not represent the views and opinions of crypto.news’ editorial.","We are nearly halfway through what’s being called a problematic year for Big Tech. Threats of TikTok bans, headlines reporting Facebook data breaches (again), news of Big Tech platforms colluding to trade and sell user’s data to one another (again)… the list goes on. However, the latest earnings report from the most prominent tech platforms suggests the opposite.","Fueled by the rise of user engagement and brand adverts, Big Tech’s top five have posted profits upwards of $100 billion. Unfortunately for the creators using these platforms, less than 0.5% are estimated to be earning decent revenue for their contributions and regular engagement, earning less than $10 million collectively. Compare this figure to the hundreds of billions that Big Tech is racking in, and we see how broken the current creator monetization system is.","However, there is hope.","The creator economy is projected to double in size over the next four years—even outperforming the surging global growth rate of gaming. There is a bright future for creators, no doubt, but there remains an issue of imbalanced revenue distribution within the Big Tech/Content Creator ecosystem. The current landscape reflects an oft-witnessed real-world scenario of the top 1% profiting from the activity and input of the rest of the 99%.","Outside of the top-tier full-time influencers, the vast majority of creators are often relegated to the bottom of the pyramid. This is something that needs correction, considering the intense amount of effort creators put in daily, with each post and engagement contributing to the collective social economy. From ideating fresh content to staying up late decoding user analytics, adapting to ever-changing algorithms, and finding social validation, being a creator is no cakewalk. In addition to this, there is the uncertainty of your account getting shadowbanned or losing all your IP for violating hidden or obscured policies, and it’s clear that being a creator is not the glamorous and easy ride that it sometimes appears to be.","The concept of building loyal communities to fund your creativity is not a new concept. It existed in Shakespearean times, and it exists today; in the form of crowdfunding campaigns and community-based platforms. So what can web3 offer anew?","While much has been written about the hegemony of social media platforms, the truth remains that tech is highly cost-intensive, especially when dealing with UGC and multimedia, which involves numerous moving parts. Companies need to hedge against a multitude of risks, which includes investing continually in varying aspects of cybersecurity, regulatory compliance, R\u0026D, product development, and, of course, the astronomical costs of cloud storage. Not to mention the need to hire world-class talent to deploy scalable systems and processes. Social media giants may thus have their reasons for parting with a smaller share of earnings, but that doesn’t mean creators have to lose out on potential earnings.","If revenue distribution is the key to increased user participation, then decentralization holds a strong value proposition. We are already seeing creators pivot from the uncertainty of brand partnerships to focus their time and energy on building their own communities, which respect and pay for the novelty of creativity and personal connection.","That’s truly where web3 SocialFi systems are making a difference. The idea of enabling ownership through token-gated access and then tying this token’s intrinsic value to a creator’s digital equity makes for a thoughtful and lucrative ecosystem. An ecosystem where every interaction builds upon the creator-user synergy and rewards each person, adding value to the digital ecosystem.","SocialFi platforms are pioneering the fundamental shift from Big Tech’s dominance to a more creator-owned model, leading the way in regards to the democratization of monetizing digital content. Their tokens offer a sort of social currency and have been met with mixed success overall, but the initial excitement witnessed in onboarding new users shows the vast untapped potential.","With Bitcoin (BTC) and other cryptocurrencies gaining mainstream attention globally, one cannot ignore the significant number of web3-focused creators that have cropped up in the last few months. Still, web3 is a foreign concept to most, even to digital natives.","Thankfully, digital creators are exerting their influence across platforms such as X, Telegram, and even Instagram and YouTube to educate and grow their brand value while spreading the word about the benefits of web3 and cryptocurrency.","While revenue-generating opportunities have emerged on these platforms, the prospect of decentralized projects with innovative web3-focused communities and tokenized ecosystems is an exciting proposition for all creators.","Many users today want to be more than just passive participants in one-sided engagement. They want to connect with creators and be rewarded in the process. This is where tokenized platforms add massive value. By enabling a model of engagement and monetization where loyal communities can be built, SocialFi platforms provide a wide range of token utilities that benefit both fans and creators. This 2-way engagement that tokenization facilitates allows creators to provide an experience and value system that results in users feeling acknowledged and thus involved in a creator’s growth and success.","A major challenge of building such a democratized earning system is keeping all parties incentivized. A balanced reward system will need to be transparent, as well as think beyond token utility to consider the quality of engagement value. To be sustainable and have longevity in the industry, platforms will need to set proper frameworks that keep the creator’s priorities at heart without devaluing user engagement and, of course, keeping engagements human and bot-free. Another critical requisite is the need to constantly upgrade features and build in-platform tools that advance the web3 aspect of a SocialFi platform.","Ultimately, it is the management and vision of the founding team, along with meticulously developed tokenomics that will allow this sector to thrive. There have been many cases in recent years of seemingly promising SocialFi platforms losing favor due to poorly designed tokenomics, unviable airdrops, and subsequent sell-offs. Despite these token-specific setbacks, the immense interest among early users reflects an appetite for such creator-focused platforms where both sides of the user spectrum benefit.","In the web3 era, social earnings will mean different things to different users. How incentivized every digital user feels, especially creators and their followers, will make or break platforms developing in this new era of social engagement—a much-needed one built on the promise of monetizing your passion for greater financial independence.","Dave Catudal is an international tech and wellness entrepreneur and co-founder of Lyvely, a super media SocialFi platform rewarding creators and users through in-platform exchange traded $LVLY tokens."],"create_date":"2024-05-12T14:36:00+00:00","tag":"content creators","author":"Guest Post"}
{"url":"https://crypto.news/drift-foundation-introduces-token-airdrop/","web_url":"https://crypto.news/","type":"article","description":"Solana-based decentralized exchange, the Drift Foundation, announced the release of its new DRIFT token and the start of airdrop claims.","title":"Drift Foundation introduces DRIFT token with bonus airdrop","content":["Solana-based decentralized exchange, the Drift Foundation, announced the release of its new DRIFT token and the start of airdrop claims.","According to the foundation, the airdrop includes 120 million tokens, constituting 12% of the total 1 billion DRIFT supply. The allocation includes an additional 2% bonus of 20 million tokens, surpassing the quantity initially planned for last month’s airdrop.","Cindy Leow, co-founder of Drift, explained that the bonus is designed to deter early selling and prevent network congestion.","“Historically, airdrop claims have caused network congestion, resulting in a suboptimal user experience as tens of thousands of users and bots rush to claim their airdrop,” Leow said.","The co-founder emphasized that the bonus mechanism enhances user experience and rewards loyal supporters.","The airdrop includes two components: an initial allocation available immediately at launch and a bonus that unlocks over six hours.","“By waiting the full six hours, users can double the number of tokens they receive,” Leow noted.","If users claim the initial allocation immediately, they forfeit the potential bonus.","The DRIFT airdrop claim is now live! Claim your DRIFT here: https://t.co/nVYP4cr3Rz More information below (🧵) pic.twitter.com/hnfaBOpzaz","The 2% bonus was funded from the token supply designated for ecosystem rewards, ensuring that other allocations remain unaffected. Following the launch, major crypto exchanges, including Coinbase and Bybit, have indicated plans to list DRIFT. While the initial trading price and the fully diluted valuation of DRIFT remain uncertain, these listings are anticipated soon.","According to DefiLlama data, Drift has facilitated a cumulative trading volume of over $1.13 billion and currently has a total value locked of over $338 million.","Drift’s token, DRIFT, has already gone live with trading starting at $0.10 before spiking up to $0.84, and currently trades at $0.31 as of 11:44 EDT with a $37.5 million market cap, according to CoinMarketCap."],"create_date":"2024-05-16T16:51:00+00:00","tag":"Airdrop","author":"Bralon Hill"}
{"url":"https://crypto.news/runes-is-making-bitcoin-fun-and-accessible-again-opinion/","web_url":"https://crypto.news/","type":"article","description":"Bitcoin\u0027s vast potential has been dormant until now, but with Runes, BTC is ready to realize all these possibilities.","title":"Runes is making Bitcoin fun and accessible again | Opinion","content":["Disclosure: The views and opinions expressed here belong solely to the author and do not represent the views and opinions of crypto.news’ editorial.","Bitcoin is no longer boring or out of the reach of retail; it’s fun and exciting and ready to kickstart a new era of innovation. For years, Bitcoin has been regarded as a store of value—a means to preserve capital. This meant using the Bitcoin blockchain to buy BTC and then moving it to cold storage, forgetting all about the world’s largest network.","As a result, while Ethereum, Solana, and other blockchains have been bustling with activity, raking in billions of dollars in fees, the Bitcoin blockchain has remained relatively dormant, with little fun, activity, fees, or innovation—save for its rising prices. And as a trillion-dollar asset class, most retail can’t even think of getting into BTC.","But now the tide is changing, and for the first time, Bitcoin is ready to experience all that and more. This will not only attract more people, encourage adoption, and encourage innovation but also help the Bitcoin blockchain find a solution to the issue of its network security.","This new era of change is being ushered in by Runes, which helped Bitcoin miners rake in a record $107 million in revenue in a single day. This helped alleviate the concerns around halving’s impact on miner revenue and Bitcoin’s ‘long-term security budget.’","Even the legacy institutions are noticing this surge of activity on Bitcoin, with Bernstein analysts stating:","“Bitcoin is experiencing a ‘Defi summer’ like a moment that Ethereum did back in 2020, where multiple decentralized apps and tokens were launched on the Ethereum blockchain, leading to splurge of liquidity and transaction fees.”","Bernstein is not the only one either; Franklin Templeton has also noted a “renaissance in activity” on Bitcoin.","Launched alongside Bitcoin halving this past month, there has been a lot of excitement surrounding Runes. This is pretty evident in the Bitcoin average transaction fee, which has been flatlining but revived with the launch of the Runes protocol. At the beginning of this month, the fees were around $5, but surged past $128 for the first time ever on April 20, according to YCharts. With that, total transaction fees hit a record high of $80 million.","The protocol itself has already seen 1.9 million in transactions and generated 1,366 BTC in fees, as per the data provided by Dune Analytics. Data by NFT Pulse meanwhile reveals Bitcoin to be the top chain in terms of trading revenue.","It all started with Ordinals, which allows users to embed data into the Bitcoin blockchain. Ordinals have been a gigantic success, with over 66 million Ordinal inscriptions created since 2022, generating over 6,777 BTC (worth $450.8 mln) in fees, according to Dune Analytics.","Of course, things can always be better, and so came Runes, also created by Ordinals developer Casey Rodarmor. What Runes does is make use of Bitcoin’s Unspent Transaction Outputs (UTX) and store data in the transactions’s OP_RETURN field. In contrast, the current Bitcoin token standard BRC-20s is less efficient and can clog up the network.","This means Rune maintains all the data on-chain while being cheaper and more network-efficient than previous standards. This way, Runes can offer a more secure platform to launch fungible token projects such as meme coins and make transactions.","Already, retail is having fun with Bitcoin, with hundreds of tokens launched in less than a week. Also, the Runes ecosystem has grown to include DEXs, NFT marketplaces, launchpads, exchanges, lending protocols, explorers, analytics, and Rune-focused projects. Even centralized exchanges like OKX and Gate.io have jumped in, listing some of these newly minted runes. This goes on to show just how, over time, it will lead to a vast and vibrant ecosystem surrounding Bitcoin.","All of this is while the whole experience of creating and speculating on NFTs and meme coins on Bitcoin isn’t even seamless yet. As the tech and user experience gets better and people realize the true potential of Runes, this growth will only accelerate even further.","So, this is just the beginning, which means the project may see a drop in price, activity, and fees in the short term. As we can already see, the fee is back at $32. However, in the long term, once the hype cools down, it will drive a real frenzy of ingenuity, integrations, and utility. Soon, Runes will be a billion-dollar ecosystem, leading to new blockchain capabilities and renewed excitement.","All this enthusiasm, accessibility, and technological superiority will see Rune changing the landscape of Bitcoin. It does need more legitimate gamefi, defi, and overall infrastructure in place. The top 10 Runes by Market Cap are memes and we will see this change over the next few months.","Top 10 Runes by Market Cap 1. DOG•GO•TO•THE•MOON: $371.4M +5.3% 2. RSIC•GENESIS•RUNE: $260.6M +0.7% 3. DECENTRALIZED: $66.7M -0.9% 4. SATOSHI•NAKAMOTO: $45.7M +9.6% 5. Z•Z•Z•Z•Z•FEHU•Z•Z•Z•Z•Z: $31.9M +37.9% 6. LOBO•THE•WOLF•PUP: $27.6M +34.3% 7.…","Overall, Bitcoin’s vast potential has been dormant until now, but with Runes, BTC is ready to realize all these possibilities. The base layer has already spent the last decade establishing itself as a secure and robust blockchain. Now, retail will get to access Bitcoin again and experience its enormous value, which will take it to new heights.","z3th is the founder and CEO of Ordz Games, a blockchain-based gaming platform that develops on-chain games powered by Bitcoin, GameFi, and DePIN. Ordz Games launched the world’s first web3 gaming device, the BitBoy, which allows users to interact with the Bitcoin blockchain and earn Bitcoin rewards. z3th has been in the crypto space since 2017 and is a serial entrepreneur with over a decade of experience."],"create_date":"2024-05-12T12:30:49+00:00","tag":"Adoption","author":"Guest Post"}
{"url":"https://crypto.news/certik-damage-from-hacks-scams-reaches-lowest-level-since-2021/","web_url":"https://crypto.news/","type":"article","description":"In April 2024, damage from cybersecurity incidents such as exploits and scams amounted to $25.7 million.","title":"CertiK: Damage from hacks, scams reaches lowest level since 2021","content":["In April 2024, damage from cybersecurity incidents such as exploits and scams amounted to $25.7 million.","CertiK experts say the current figure is the lowest seen since 2021. Losses due to cybersecurity exploits decreased by 141% since March.","Most losses are due to hacks, with $21 million being compromised in defi attacks. The leader in this category is the attack on the FixedFloat project, which was hacked again earlier this month. The team stated that the same attackers who compromised the project in February 2024 are behind it.","Exit scams were the second most costly exploit, with a total amount lost equaling $4.3 million. Instant loans, the third most costly incident in this category, saw $129,000 compromised.","The experts noted that crypto casino ZKasino was not included in the report as the rug pull was unconfirmed. At the time of writing, it is estimated that $32 million has been lost in the suspected scam. The ZKasino team allegedly collected 10,515 ETH as part of the ZKAS token presale. On April 20, funds were transferred to another address, the withdrawal was blocked, and the Telegram group was closed.","According to DefiLlama data, as of April 1, total losses from cryptocurrency hacks exceeded $7.7 billion, despite a 23% decline in incidents in the first quarter of 2024 compared to last year.","Data shows that defi protocols have suffered the most losses since 2016, with hackers stealing $5.8 billion from defi over seven years."],"create_date":"2024-04-30T13:58:56+00:00","tag":"Certik","author":"Anna Kharton"}
{"url":"https://crypto.news/creating-killer-whales-and-bringing-web3-to-masses-a-conversation-with-hello-labs-ceo-sander-gortjes/","web_url":"https://crypto.news/","type":"article","description":"Produced by Hello Labs and boasting a roster of leaders and influencers from the crypto industry, the web3 series showcases crypto and NFT entrepreneurs and the stories behind their concepts.","title":"Creating Killer Whales and bringing web3 to masses: a conversation with Hello Labs CEO Sander Görtjes","content":["The article has been updated for clarity Feb. 12, 11:54 am (UTC).","You’ve likely heard about the business reality television show called Shark Tank, where aspiring entrepreneurs and founders from around the globe pitch their ideas to investors in the hopes of securing funding.","It features names like Mark Cuban and Kevin O’Leary and has disbursed millions in deals over 15 seasons. Crypto just got its version of Shark Tank, sort of.","Enter Killer Whales. Produced by Hello Labs and boasting a roster of leaders and influencers from the crypto industry, the web3 series showcases crypto and NFT entrepreneurs and the stories behind their concepts.","Hello Labs focuses on building intellectual properties (IPs) with the hope of demystifying web3 and exposing crypto to the masses. The firm’s native token HELLO runs atop the Ethereum and BNB Chain networks.","Sander Görtjes, Hello Labs CEO, told crypto.news about how the web3 startup founded by Paul Caslin, a Grammy-nominated MTV VMA’s creative director, started with a self-funded blockchain game called Doge Dash back in 2021.","The company also launched its HELLO token, which gives holders an in-game currency and utility with Hello Labs NFTs. Also, the token would eventually become a key part of the Hello TV streaming platform.","As crypto garnered mainstream adoption and attention, narratives formed around protocols promising to onboard the next hundreds of millions of users. But a question remained: who is actually going to build the entertainment IP to bring these people in?","Cushioned by individual backgrounds in television production, music awards, marketing, software, and business development, to name a few, Hello Labs set out to simplify crypto and web3 using entertainment.","Naga Avan-Nomayo: How did the idea of Killer Whales come to light?","Sander Görtjes: We said, let’s go back to the basics, and let’s build a television show that highlights the best projects in the space, projects that are actually building, that can pitch their idea in front of a group of KOLs, and get opinionated feedback so they get a sink or swim. That was the general idea.","NAN: Was there more to it than just the entertainment? Or perhaps there was a problem that Killer Whales was trying to solve?","SG: The Killer Whales give an honest opinion, but we eliminate the entire aspect of investing. The show is a real-life entertainment show with founders from across the globe showing their technology, ideas, and traction to the whales. Because Killer Whales focuses on founders and their stories, we quickly decided no investments were needed. We’re trying to solve that first contact point for projects with a new base of users for web3 technology. It’s about the unbiased stories of founders that you and I would have loved to hear when we first started in web3.","Season one of Killer Whales has five episodes, and each episode revolves around a specific web3 sector, from real-world utility to NFTs.","NAN: Killer Whales features an impressive roster of judges from the crypto ecosystem and the world of digital finance. How were these personalities picked?","SG: What we were looking for were whales and well-informed people who have been in the web3 industry for a while, who understand what type of projects are around, and who have an opinion. They are not shy to voice and explain why they give that feedback. So we went out searching for KOLs that had either a big following, a VC background, a technology background, or an exchange background. We carefully selected who we thought would have a profound impact on the show because of their entertainment value, expertise, and credibility.","NAN: What was production like working with this pool of personalities as judges?","SG: All the whales on the show have their own businesses, they’re extremely busy, they have strong personalities, they are experienced, and they know what they want. But what I definitely have to say is that these people are all super-professionals. Everybody understood [that] ‘we’re doing this to make the space bigger, it’s good for our brands, and it’s good for the space.’ Having come from a high-performance marketing and TV background, I was confident that they would execute flawlessly, and they did.","This week, on the series premiere of Killer Whales, crypto entrepreneurs from Singapore, the United States, and Spain, aiming to revolutionize the real estate, banking, and event industries, face off against the Killer Whale judges@MarioNawfal @AltcoinDailyio @Scaramucci… pic.twitter.com/4EJ5F9n5Ij","Görtjes also mentioned that there were 12-hour recording sessions on some days, with panelists sometimes working in the back of a studio van, taking calls, and working together on the process.","A focal point in developing Killer Whales initially began with building a business model capable of generating revenue through sponsorships and distribution income, partially from pre-sales tied to the Hello TV platform, the CEO added.","NAN: How long did this production take? What was the cost of it, and where did the funding for this project come from?","SG: I think that the beginning to the end was about two years. Partnerships started around March 2022, with production in June 2023, and the launch is now, February 2024. We started with onboarding Altcoin Daily as a producer of the show then CoinMarketCap as a co-producer and data partner and Hacken as a security partner. Eventually, we made deals with half a dozen crypto entities.","NAN: Was there a process for deciding which projects made it to Killer Whales and which did not?","SG: We work with several partners together in the space, they’re either an official partner or a search partner to Killer Whales and Hello Labs. They are allowed to inform us about projects they’ve found or know that would fit the show. For instance, projects that want to come onto the show need to have a valid legal opinion, have a thorough business setup, founders need to be doxxed, need to pass criminal and legal background checks, need to have some funding and a working product.","All that needs to be in place, and then it goes through a selection committee that consists of Hacken, CoinMarketCap, the production companies, all our story producers, Hello Labs, and then legal as well. We have a say, but we do not have veto control over who gets in. And there’s no scripting or deep preparation for the founders. We do help them with their pitch and how to behave in front of a camera. What’s cool is that the founders get into the studio and see the whales for the first time.","NAN: What can projects that feature on Killer Whales expect after the show in terms of support and, perhaps, investment?","SG: Hello Labs itself will not make any direct capital investments into these projects, but partners and associated brands may decide to interact with founders they consider interesting after the show, just as any other organization could. We have plans for a weekly X Spaces that features Killer Whales projects, but we see the show itself as the biggest way to raise awareness for the solutions being built in web3.","NAN: Killer Whales is the inaugural show by Hello Labs. What should we expect next, and when?","SG: We started as a gaming project. Now, we’re very much focused on television and creating these bigger IPs. But in the future, we would definitely revisit the gaming aspect of the company. We also look at Killer Whales as something that can go on for 10, 15, or 20 seasons.","Just as a comparison, Shark Tank is in its 15th season, and the format hasn’t really changed a lot. So we view Killer Whales as a multi-season IP and a flagship product that, hopefully, web3 natives can point to when they want others to get a feel of what the space is about. It’s a little bit faster, more modern. It’s about technology and the folks behind it.","Hello Labs doesn’t have any investors so we have complete creative freedom to develop new initiatives in the future and play with ideas.","NAN: Will the show stream on non-blockchain platforms after debuting on Hello TV?","SG: This is a show made for the masses, and we’re targeting some mainstream platforms, but I can’t comment on the streamers just yet. It’s a well-kept secret to be announced by Hello Labs in the coming weeks.","NAN: Will production on Hello TV remain an exclusive right of Hello Labs, or is there a plan to open the platform up to user-generated content?","SG: For now, there are no announcements on whether the platform will incorporate user-generated content.","NAN: Can HELLO token holders expect any additional utility like staking or perhaps voting on what shows appear on Hello TV?","SG: We have several initiatives in development that further increase the utility of the HELLO token, as we always have. We have a tradition of building utility and surprising our community with it, as we believe in the mantra underpromise, overdeliver.","NAN: Who would Hello Labs consider as its competitor on and off-chain?","SG: Hello Labs is sort of a multi-legged IP beast with activity in several categories. Looking from the viewpoint of game IPs, TV show IPs, and brand IPs, a comparison may be drawn with Disney. If streaming technology and content production were the focus, maybe you could compare us to web2 studios.","But I think what makes us unique is that we built the narrative of web3, and we are able to position that in the web2 space. So I would say we’re a little bit in between. And we like to think that we’re trying to set a standard for the entertainment category in web3. But it’s up to the people to define what that is and where we’re at.","NAN: Would Hello Labs consider a cross-over between Shark Tank and Killer Whales?","SG: Mark Cuban and Kevin O’Leary coming out to Killer Whales — that would be the dream. I think the biggest thing that we can do as Killer Whales is set that standard for what the web3 space feels like. This is the Shark Tank of web3, and I’m pretty sure that mainstream celebrities will have a look at this and want to be a part of it. But let’s see, it’s a dream, right?"],"create_date":"2024-02-08T14:40:06+00:00","tag":"entertainement","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/from-hollywood-to-hodl-how-celebrity-adoption-is-spurring-the-growth-of-memecoins/","web_url":"https://crypto.news/","type":"article","description":"Celebrity endorsements by Paris Hilton, Floyd Mayweather, Jamie Foxx, Cameron and Tyler Winklevoss show that such endorsements can fuel memecoin adoption as well","title":"From Hollywood to HODL: how celebrity adoption is spurring the growth of memecoins","content":["Celebrities are helping to shape the popularity and perception of cryptocurrency assets.","Notable personalities such as Paris Hilton, Floyd Mayweather, Jamie Foxx, and Cameron and Tyler Winklevoss have endorsed and invested in various cryptocurrencies — particularly meme coins.","Paris Hilton, an American media personality, socialite, businesswoman, model, singer, actress, and DJ, picked interest in crypto in 2016, with investments in Bitcoin and Ethereum.","Over time, her interest expanded to blockchain technology, non-fungible tokens (NFTs), and the metaverse, establishing her as a significant influencer in the NFT realm. Through active promotion and creation of NFT collections, Hilton has solidified her presence in the burgeoning NFT market.","Floyd Mayweather Jr., a retired professional boxer from the U.S. who is widely regarded as one of the greatest boxers of all time, showcased his interest in cryptocurrencies through social media endorsements of blockchain projects like Stox and Hubii Network. His Instagram posts supporting initial coin offerings (ICOs) underscore his engagement with digital assets, amplifying visibility and adoption among his followers.","Jamie Foxx, an American actor, singer, comedian, and producer, joined the cryptocurrency wave by endorsing Cobinhood’s token sale, demonstrating his support for innovative crypto ventures. The actor’s public backing of Robin Hood’s zero-fee trading platform added momentum to the project, showcasing his interest in emerging crypto technologies.","In June 2021, Kim Kardashian, known for her roles as an American media personality, socialite, model, and actress, utilized her Instagram platform to invite her 328 million followers to consider investing in EthereumMax.","In her Instagram story, she explicitly stated, “This is not financial advice,” while sharing insights from her friends regarding the Ethereum Max token. Additionally, she included the hashtag “ad” among others to ensure transparency regarding the nature of her endorsement.","However, Kim Kardashian faced penalties from the SEC for promoting EthereumMax without proper disclosure, leading to a settlement where she agreed to pay $1.26 million.","The SEC charged Kardashian with unlawfully touting the crypto asset security offered by EthereumMax on her Instagram stories without revealing that she was paid $250,000 for the promotion. This lack of disclosure violated federal securities laws, prompting the SEC to take action against her.","The settlement required Kardashian to pay $260,000 in disgorgement, reflecting the amount she received for promoting the token, along with a $1 million penalty. Additionally, Kardashian agreed not to promote any crypto asset securities for three years and to cooperate with the ongoing investigation.","The case highlighted the importance of transparency in influencer marketing, emphasizing that investors have the right to know if endorsements are unbiased. Kardashian’s settlement with the SEC allowed her to resolve the matter and move forward while avoiding a more extensive legal process.","A recent statement by Tesla CEO Elon Musk hinted at the possibility of using Dogecoin (DOGE) for Tesla payments in the future. Notably, iconic rapper Snoop Dogg has also voiced his support for Dogecoin, leveraging his influence in music and pop culture to further promote the digital currency.","The recent surge in Dogecoin was ignited by remarks made by Elon Musk on March 15. The Tesla CEO was touring the Berlin gigafactory, which had recently reopened following an arson attack. During a Q\u0026A session, an audience member inquired about the possibility of purchasing a Tesla with Dogecoin.","Musk responded, “At some point I think we should enable that,” eliciting cheers from the crowd. He further reiterated the catchphrase “Dogecoin to the moon,” further fueling enthusiasm among attendees.","Elon Musk’s impact on Dogecoin has been a turbulent journey, characterized by his remarks and actions that have profoundly affected the cryptocurrency’s value and popularity. Musk’s association with Dogecoin, ranging from dubbing himself the “Dogefather” to proposing its potential use for Tesla payments, has ignited both enthusiasm and controversy within the crypto community.","Musk’s tweets and comments have served as significant drivers behind the fluctuations in Dogecoin’s price.","On Jan. 14, 2022, Tesla commenced accepting Dogecoin exclusively for its merchandise, specifying that transactions made with other digital assets would not be eligible for returns.","His endorsement of Dogecoin as his preferred cryptocurrency and his playful interactions with the coin have generated widespread attention. However, Musk’s influence has also faced scrutiny, with allegations of market manipulation and insider trading emerging in response to some of his social media posts.","The market’s responsiveness to Musk’s actions was evident when Dogecoin’s price surged by 30% following his change of Twitter profile picture to the Shiba Inu dog emblem of Dogecoin. This immediate reaction highlights the profound impact of Musk’s engagement with the cryptocurrency market.","Another notable individual, who has piqued interest in the memecoin, is Snoop Dogg.","His interest in crypto assets was evident when he shared a meme featuring a Shiba Inu, the iconic dog breed linked with Dogecoin. His remarks, coupled with similar posts from Elon Musk and Gene Simmons, contributed to the increasing buzz surrounding Dogecoin.","Snoop Dogg has also demonstrated his support for Dogecoin in a music video where references to Dogecoin and the Shiba Inu were prominently featured. This strengthened Snoop Dogg’s association with the cryptocurrency and increased its cultural significance.","Snoop Dogg’s endorsement of Dogecoin not only brought visibility to the digital asset but also highlighted the intersection of celebrity influence and cryptocurrency. By using his platform and wide audience reach, Snoop Dogg helped shape the narrative around Dogecoin, making it more accessible and appealing to a broader audience.","The only real successful coins on $SOL are meme coins 😂"],"create_date":"2024-04-01T10:02:04+00:00","tag":"Bitcoin","author":"Ogwu Osaemezu Emmanuel"}
{"url":"https://crypto.news/sichuan-police-uncover-underground-finance-scheme-involving-2b-in-usdt/","web_url":"https://crypto.news/","type":"article","description":"Chinese police in Sichuan reportedly intensified crackdowns on underground banking networks, with a particular focus on USDT transactions totaling billions of U.S. dollars","title":"Sichuan police uncover underground finance scheme involving $2b in USDT","content":["Chinese police in Sichuan reportedly intensified crackdowns on underground banking networks, with a particular focus on USDT transactions totaling billions of U.S. dollars.","Chinese police in the Sichuan province reportedly uncovered a wide-scale underground banking scheme, with operations reportedly involving the use of Tether‘s USDT stablecoin. According to local reports, the crackdown targeted suspects allegedly evading national foreign exchange supervision and facilitating illicit foreign exchange transactions involving nearly $2 billion worth of USDT.","The suspects purportedly utilized the stablecoin as a means to circumvent national foreign exchange regulations and provide illicit foreign exchange settlement channels, the report says. Authorities are said to have shut down two underground banking hubs located in the Chinese provinces of Fujian and Hunan. The case reportedly spread across 26 provinces in China, with over 190 suspects arrested nationwide by the police.","Although Sichuan previously played a significant role in the crypto industry due to its cheap hydropower-generated electricity, attracting Bitcoin miners seeking low-cost energy for their operations, the landscape changed quickly following Beijing’s blanket ban on all crypto mining operations and transactions in the country.","In late 2023, the Supreme People’s Procuratorate (SPP) and the State Administration of Foreign Exchange (SAFE) underscored criminal cases involving stablecoins, highlighting that digital currencies backed by fiat currencies had become a popular intermediary for yuan trading with other currencies in cases involving illegal foreign exchange."],"create_date":"2024-05-15T07:33:41+00:00","tag":"China","author":"Denis Omelchenko"}
{"url":"https://crypto.news/mark-cuban-sec-biden-re-election-chances-trump-crypto/","web_url":"https://crypto.news/","type":"article","description":"Mark Cuban: If the 2024 U.S. presidential election goes to twice-impeached, quadruple-indicted former President Trump, the SEC could bear the blame.","title":"Mark Cuban: SEC could tank Biden\u0027s re-election chances","content":["Billionaire Mark Cuban is concerned about President Joe Biden’s chances of re-election and blaming the U.S. Securities and Exchange Commission (SEC).","In a May 10 post on X, Cuban — a minority stakeholder of the Dallas Mavericks — criticized SEC chair Gary Gensler’s regulatory approach toward the crypto industry.","And if the 2024 U.S. presidential election goes to former, and twice-impeached President Donald Trump, the SEC could bear the blame, he says.","“If [Biden] loses, there is a good change you will be able to thank Gary Gensler,” Cuban says. See below.","If @joebiden loses, there is a good chance you will be able to thank @GaryGensler and the @NewYork_SEC Crypto is a mainstay with younger and independent voters. Gensler HAS NOT PROTECTED A SINGLE INVESTOR AGAINST FRAUD All he has done is make it nearly impossible for… https://t.co/uBKupxLhS9","“All [Gensler] has done is make it nearly impossible for legitimate crypto companies to operate, killing who knows how many businesses and ruining who knows how many entrepreneurs,” the “Shark Tank” host said. “This is also a warning to Congress.”","On Election Day, Nov. 5, a total of 468 seats in the U.S. Congress (33 in the Senate and all 435 House seats) are in play.","“Crypto voters will be heard this election,” Cuban continued. “You could solve this problem for Biden by passing legislation that defines registration that is specific to the crypto industry just as other industries have registration that is defined for them.”","Biden hasn’t ignored the cryptocurrency sector.","On March 9, 2022, his administration touted the “first whole-of-government approach to addressing the risks and harnessing the potential benefits of digital assets and their underlying technology.”","The Biden administration has identified several priorities as part of an executive order, including consumer and investor protection; countering illicit finance; and responsible innovation.","But according to Cuban, the SEC’s role has been harmful thus far, particularly as digital assets are popular among younger voters.","He emphasized the significance of the crypto industry in this demographic and criticized Gensler for failing to protect investors from fraudulent activities. Instead, he claimed that Gensler’s crackdown had harmed legitimate crypto businesses, leading to their closure.","Under Gensler’s leadership, the SEC has filed lawsuits against several crypto companies for alleged fraud and unregistered securities sales.","The regulator is currently engaged in legal battles with major players in the crypto industry, including Ripple, Coinbase, Huobi, and Binance.","Cuban warned Congress of the importance of addressing the concerns of crypto voters in the upcoming election. He also proposed potential solutions to regulatory challenges, suggesting tailored legislation for the crypto sector or assigning all crypto regulation to the CFTC for their expertise in the field.","Meanwhile, Trump — who currently faces criminal charges in New York for falsifying business records — is embracing cryptocurrency.","Just three years ago, Trump said Bitcoin “seems like a scam.”","Now, the quadruple-indicted GOP candidate is reaching out to donors with cryptocurrency. See below.","BREAKING: DONALD TRUMP ASKED “CAN WE DONATE USING CRYPTO?” “IF YOU CANT, I’LL MAKE SURE YOU CAN” pic.twitter.com/Nm2YjqxwSI","At a March 8 gathering with members of the crypto community at Mar-a-Lago, Trump urged them to support him, citing the Biden administration’s tough stance on crypto regulation.","Observers note that Trump reversed his stance on crypto once he was saddled with millions of dollars in legal fees and fines from ongoing legal trouble. He has also resorted to hawking sneakers, cologne and his own Bible to raise cash.","Trump’s crypto portfolio reportedly consists of Ethereum, MAGA tokens and other meme coins, obtained through NFTs that feature his face in photoshopped costumes.","While some Democrats are uneasy about Trump’s overture to the crypto industry, the party remains divided on how to approach the sector.","Gensler, appointed by Biden, has taken a tough stance on enforcing securities laws against crypto firms. The White House itself has threatened to veto legislation aimed at undoing SEC guidelines for the crypto industry."],"create_date":"2024-05-11T15:44:11+00:00","tag":"Donald Trump","author":"Julius Mutunkei"}
{"url":"https://crypto.news/coinbase-slapped-class-action-lawsuit-san-francisco/","web_url":"https://crypto.news/","type":"article","description":"Coinbase, the cryptocurrency exchange, along with its CEO, Brian Armstrong, is facing a new class-action lawsuit.","title":"Coinbase slapped with class-action lawsuit in San Francisco","content":["Cryptocurrency exchange Coinbase, and CEO Brian Armstrong, face a new class-action lawsuit.","A group of plaintiffs from California and Florida filed a lawsuit in the U.S. District Court for the Northern District of California, San Francisco Division.","The plaintiffs — Gerardo Aceves, Thomas Fan, Edwin Martinez, Tiffany Smoot, Edouard Cordi, and Brett Maggard — allege that Coinbase’s sales of digital assets have knowingly violated state securities laws since the company’s inception.","The lawsuit claims that several tokens sold on Coinbase, such as Solana (SOL), Polygon (MATIC), Near Protocol (NEAR), Decentraland (MANA), Algorand (ALGO), Uniswap (UNI), Tezos (XTZ), and Stellar Lumens (XLM), should be classified as securities.","According to the plaintiffs, Coinbase has admitted to being a “Securities Broker” in its user agreement, suggesting that the digital asset sales on the platform may qualify as investment contracts or other forms of securities.","The lawsuit also contends that Coinbase’s Prime brokerage functions as a securities broker.","The plaintiffs are seeking full rescission of these sales, statutory damages under state laws, and injunctive relief, with the matter proceeding to a jury trial. This lawsuit bears similarities to another class-action suit alleging consumer harm from Coinbase’s sale of securities.","Coinbase, however, has pushed back, arguing that secondary sales of crypto assets do not meet the criteria for securities transactions and questioning the applicability of securities regulations in this context.","This case is separate from Coinbase’s ongoing legal battle with the U.S. Securities and Exchange Commission (SEC), which also examines whether the tokens sold on Coinbase should be treated as securities. Recently, Coinbase filed an interlocutory appeal in response to a judge’s ruling allowing the SEC’s case to proceed.","Crypto.news reached out to Coinbase for comment but has not heard back.","In a separate development, pro-crypto lawyer John Deaton has stepped in to support Coinbase in its legal battle with the SEC by filing an amicus brief.","Deaton, known for his crypto advocacy and campaign against Massachusetts Senator Elizabeth Warren, is said to be providing his services pro bono.","His involvement coincides with Coinbase’s pushback against the SEC’s allegations and its efforts to gain clarity on regulatory matters, illustrating the ongoing tensions between cryptocurrency companies and financial regulators.","In June 2023, the SEC filed a lawsuit against Coinbase, accusing the cryptocurrency exchange of operating as an unregistered national securities exchange and broker.","The SEC claims that Coinbase traded at least 13 crypto assets that should have been registered as securities, including tokens like Solana, Cardano, and Polygon.","Separately, hundreds of Coinbase customers have sued the company over its handling of the GYEN stablecoin, which they argue was far from stable.","This lawsuit alleges that Coinbase promoted and traded the GYEN token despite being aware of its high volatility, leading to significant losses for investors.","Coinbase’s crypto staking program has also come under regulatory scrutiny. The SEC alleges that the program operates as an unregistered investment contract and security. Several U.S. states have joined the SEC’s case, accusing Coinbase of violating securities laws in connection with its staking rewards program.","Coinbase has pushed back against the regulatory crackdown. Armstrong has expressed pride in representing the crypto industry in court and has called for clearer regulations.","However, legal experts caution that the SEC’s actions could limit options for U.S. investors and increase fees as platforms turn to less-regulated markets.","These lawsuits reflect the ongoing tensions between cryptocurrency companies and financial regulators over how to classify and oversee digital assets. As the SEC intensifies its crypto enforcement, further legal battles are likely for Coinbase and other major players in the industry."],"create_date":"2024-05-05T16:18:57+00:00","tag":"Coinbase","author":"Ogwu Osaemezu Emmanuel"}
{"url":"https://crypto.news/french-senate-advances-legislation-allowing-social-media-influencers-to-advertise-cryptocurrency/","web_url":"https://crypto.news/","type":"article","description":"French Senate\u0027s Economic Affairs Committee has approved an amendment allowing registered cryptocurrency firms to hire social media influencers for advertising","title":"French senate advances legislation allowing social media influencers to advertise cryptocurrency","content":["The Committee on Economic Affairs in the French Senate has approved an amendment to pending legislation that will permit registered cryptocurrency companies to enlist social media influencers for promotional and advertising purposes.","The new wording would enable France’s Financial Markets Authority (AMF) to authorize companies to employ influencers for their products.","In March 2023, 102 victims filed a lawsuit against a pair of French social media influencers for intentionally causing them to lose money through crypto trading.","The proposal was then put forward in France’s Senate Committee on Economic Affairs. France’s National Assembly’s Economics Committee later voted in favor of a law that bans social media influencers from touting risky financial services, including cryptocurrencies..","In France, all cryptocurrency companies must register with the Financial Markets Authority (AMF), the primary regulatory body for financial markets.","However, despite this requirement, none of these companies have yet secured the necessary licensing to engage social media influencers for advertising and promotional purposes.","The proposed amendment, which has been approved by the Committee and will be deliberated in the Senate plenary next week, seeks to permit cryptocurrency firms to use social media influencers when advertising.","The approval of the proposed legislation by the French Senate’s Committee on Economic Affairs would allow registered cryptocurrency companies to employ influencers, provided they meet certain standards and are approved by the AMF. This new law will enable cryptocurrency firms to take advantage of the growing influencer marketing trend and capitalize on its potential for increased visibility and engagement.","However, it’s worth noting that with this new development comes the responsibility of these cryptocurrency companies to ensure that any promotional material shared through influencers is done in a manner that is fair, clear, and not misleading to consumers. The AMF will also monitor the activity of these companies and influencers to ensure compliance with these regulations.","In contrast to their counterparts in the National Assembly of Paris, senators favor implementing less stringent measures regarding cryptocurrency advertising by social media influencers.","The National Assembly passed a motion in March 2023 effectively banning such promotions."],"create_date":"2023-05-03T21:12:30+00:00","tag":"advertising","author":"Sarah Jansen"}
{"url":"https://crypto.news/blockchain-sleuth-uncovers-identity-of-prismafis-hacker-who-stole-11m/","web_url":"https://crypto.news/","type":"article","description":"Crypto detective ZachXBT has identified the alleged PrismaFi hacker, exposing their involvement in the $11.1 million theft and subsequent demands.","title":"Blockchain sleuth uncovers identity of PrismaFi\u0027s hacker, who stole $11m","content":["Crypto detective ZachXBT has identified the alleged PrismaFi hacker, exposing their involvement in the $11.1 million theft and subsequent demands.","Blockchain sleuth ZachXBT uncovered an alleged attacker behind the PrismaFi hack, which left the protocol without $11.1 million worth of crypto. In a series of X posts, ZachXBT revealed that the exploiter, known as 0x77 (or Trung) might be linked to multiple other exploits.","1/ An investigation into the alleged $11.1M @PrismaFi exploiter 0x77 (Trung) and the multiple other exploits they are connected to. pic.twitter.com/QU1Oy7Txbb","The Prisma team detected a series of transactions on the MigrateTroveZap contract earlier in March, which eventually resulted in a loss of 3,257 ETH (equivalent to $11.1 million at the time). Initially, the attacker communicated with the Prisma deployer, claiming the attack was just a whitehat initiative. However, all the funds were later deposited to Tornado Cash, a sanctioned crypto mixer.","The exploiter proceeded to make audacious demands, including a $3.8 million (34%) whitehat bounty, significantly higher than the industry standard of 10%, ZachXBT noted, adding that the demand was “essentially extorting the team as the treasury does not have sufficient assets to reimburse users.”","3/ At first the attacker communicated with the Prisma deployer the attack was whitehat. Later that day all of the funds were deposited to Tornado Cash contradicting that statement. The exploiter began making outrageous demands and asked for a $3.8M (34%) whitehat bounty This… pic.twitter.com/vFdJCJM5mz","Further investigation revealed that the exploiter’s address received funds via FixedFloat and was subsequently located on Arbitrum, a layer-2 solution on Ethereum. By analyzing timing, ZachXBT found that the exploiter’s address was connected to withdrawals on TRON, including those from the Bybit crypto exchange.","The investigation also uncovered connections to previous exploits, such as the Arcade_xyz exploit from March 2023 and the Pine Protocol exploit from February this year. The exploiter, using the alias 0x77 on Telegram, remained active, with ties to the deployer of @modulusprotocol, further solidifying the link between each incident.","The investigator also disclosed conducting an analysis of the exploiter’s personal information, gathering phone numbers and emails, which suggested a proficient technical background. Currently, all gathered personal data has been forwarded to the Prisma team, who are pursuing legal action against the hacker in Vietnam and Australia, ZachXBT added."],"create_date":"2024-04-17T08:39:53+00:00","tag":"Bybit","author":"Denis Omelchenko"}
{"url":"https://crypto.news/canadian-regulator-fines-binance-4-4m-for-money-laundering-violations/","web_url":"https://crypto.news/","type":"article","description":"FINTRAC has imposed a substantial fine on cryptocurrency exchange Binance for allegedly violating anti-money laundering regulations.","title":"Canadian regulator fines Binance $4.4m for money laundering violations","content":["FINTRAC has imposed a substantial fine on cryptocurrency exchange Binance for allegedly violating anti-money laundering regulations.","In a release issued today, the Financial Transactions and Reports Analysis Centre of Canada (FINTRAC) outlined two primary violations: failure to register as a foreign money services business and neglect to report significant transactions in virtual currency.","Specifically, FINTRAC claims that Binance did not declare transactions exceeding $10,000 on 5,902 separate occasions between June 2021 and July 2023.","“Binance is determined to be a foreign money services business. Binance Holdings Limited was imposed an administrative monetary penalty of $6,002,000 on May 7, 2024, for committing 2 violations,” the regulator stated.","The penalty, $4.4 million, or 6 million CAD, stems from compliance checks conducted in 2023.","FINTRAC is Canada’s financial intelligence unit, preventing money laundering and other financial crimes. Using blockchain analytics, it identified Binance’s oversight of failing to report virtual currency transactions as crucial for transparency in the financial system.","The development follows similar regulatory scrutiny Binance faced in the United States. In November 2023, the U.S. Department of Justice reached a plea deal with the exchange, involving a $4 billion settlement for alleged money laundering and sanctions violations.","Part of the agreement required Binance founder and then-CEO Changpeng Zhao to step down and pay a $50 million fine. Zhao subsequently received a four-month prison sentence after pleading guilty to violating anti-money laundering regulations."],"create_date":"2024-05-09T17:21:32+00:00","tag":"Binance","author":"Bralon Hill"}
{"url":"https://crypto.news/code-is-not-a-crime-and-alexey-pertsev-should-be-free-opinion/","web_url":"https://crypto.news/","type":"article","description":"Instead of scapegoating developers like Perstev and Swartz, we as a community should focus on addressing the root causes of criminal activity and promoting responsible use of technology.","title":"Code is not a crime, and Alexey Pertsev should be free | Opinion","content":["Disclosure: The views and opinions expressed here belong solely to the author and do not represent the views and opinions of crypto.news’ editorial.","The recent sentencing of Tornado Cash developer Alexey Pertsev to 64 months in prison by a Dutch court sends a chilling message to the tech community: code itself is being criminalized. This verdict not only unjustly punishes a developer for creating software but also sets a dangerous precedent that undermines innovation and stifles technological progress.","Pertsev’s conviction for money laundering, based on his creation of Tornado Cash, is deeply troubling. Tornado Cash, a privacy-focused decentralized application, does not inherently facilitate criminal activity. Like any tool, it can be misused, but holding its creator accountable for how others use it sets a concerning precedent.","In March, during Pertsev’s two-day trial, the 30-year-old Russian citizen justified his involvement with the crypto mixer by stating that its technology, particularly smart contracts, prevented him from identifying users who utilized its services to anonymize transactions. The prosecution argued this piece of code laundered billions for North Korea linked Lazarus group by facilitating the transfer of stolen funds across multiple wallets, thereby obfuscating their origins.","Pertsev argued in court that this aspect was not within his control, suggesting that penalizing him for Tornado’s clientele would be both a misinterpretation of the technology and an injustice. It would be like if Linux developers were arrested on account of open-source computers found to power Iran’s nuclear program. “I never had the desire to help or tolerate criminals in any way, I have a different mindset,” Pertsev told the court. “I hope you understand that.”","Pertsev’s case echoes previous and more pernicious instances where code has been unfairly targeted and its creators persecuted. One notable example is the case of Aaron Swartz, the brilliant programmer and an activist who tragically took his own life in 2013 after facing aggressive prosecution in the United States for his involvement in scraping and sharing academic articles online for free. The Computer Fraud and Abuse Act (CFAA), the law under which Swartz was charged, was used to penetrate the very soul of the internet: the free flow of information.","Likewise, in the ever-evolving landscape of digital finance, Perstev’s sentencing sends a chilling signal that the brave new world of online finance is far from free. Pablito, head of security research at Blockfence, said on X that the ruling was a “sad day for privacy, crypto and open-source,” adding that “the war is not over. Privacy is a human right.” I agree.","Sad day for privacy, crypto and open-source. Tornado Cash developer Alexey Pertsev has been found guilty of money laundering and sentenced to more than 5 years in prison. The war is not over. Privacy is a human right. ⚔️🪖 pic.twitter.com/yAp5TDjp3K","Indeed, with the upcoming trial of Pertsev’s co-developer, Roman Storm, in the US, slated for September, this tension, with allegations of money laundering and sanctions violations hanging over him, looms large.","Beneath all of this lies a deeper, more insidious struggle: the battle for control over the very soul of the internet. Will it succumb to the stronghold of traditional banking regulations, or will it carve out its own path, free from the shackles of surveillance capitalism?","It’s also important to note that this struggle is far from over. The founders of innovative privacy-centric platforms like Samourai Wallet and Wasabi Wallet also faced recent arrests and shutdowns, while coins offering privacy features find themselves delisted en masse. It’s a systematic dismantling of privacy tools under the guise of regulation. But as these pillars of privacy crumble, should advocates be worried? The answer is a resounding yes. For in this struggle lies not just the fate of digital finance, but the very essence of personal freedom and privacy in the digital age.","As John Perry Barlow, the veritable OG of the free and open internet, once said:","“Governments of the Industrial World, you weary giants of flesh and steel, I come from Cyberspace, the new home of Mind. On behalf of the future, I ask you of the past to leave us alone. You are not welcome among us. You have no sovereignty where we gather.”"],"create_date":"2024-05-15T06:18:37+00:00","tag":"Alexey Pertsev","author":"Dorian Batycka"}
{"url":"https://crypto.news/all-spot-bitcoin-etfs-see-inflows-analyst-doubts-dynamics-will-repeat/","web_url":"https://crypto.news/","type":"article","description":"All 11 spot Bitcoin ETFs saw inflows for the first time since the launch in January.","title":"All spot Bitcoin ETFs see inflows, analyst doubts dynamics will repeat","content":["All 11 spot Bitcoin ETFs saw inflows for the first time since the launch in January.","According to Bloomberg analyst Eric Balchunas, such dynamics were recorded on May 3. However, he expressed doubts that such dynamics would ever happen again.","First time ever 1D flows all green, no red for the Bitcoin Bunch. Not going to spike the football like some did during the outflow period but will point out that over 95% of the ETF investors HOLD-ed during what was a pretty nasty and persistent downturn. Will same happen next… pic.twitter.com/3l3uwwmqGy","Balchunas emphasized that despite the previously recorded outflow of capital from spot Bitcoin ETFs and Bitcoin’s (BTC) fall below $60,000, more than 95% of investors maintained capital in the funds and did not sell.","“Will the same happen next time? Who knows, but track record says it will be a pretty high % again.”","The expert is confident that the spot ETF market will record both capital inflows and outflows over time. Ultimately, funds will have two characteristics: net growth and relatively strong hands.","On May 3, Grayscale Investments’ spot Bitcoin ETF recorded net inflows for the first time since its launch in January 2024.","Since entering the market, BlackRock’s fund has received more than $15 billion in net inflows, which brought its assets under management (AUM) to $16.93 billion.","On May 3, the capital inflows into spot Bitcoin ETFs increased to $378.2 million. On May 1, a record $563.7 million was withdrawn from cryptocurrency ETFs."],"create_date":"2024-05-06T17:42:17+00:00","tag":"Bitcoin","author":"Anna Kharton"}
{"url":"https://crypto.news/blackrock-bitcoin-etf-attracts-no-inflows-for-4th-consecutive-day/","web_url":"https://crypto.news/","type":"article","description":"Following last week’s digital asset investment product sentiment, spot Bitcoin ETFs saw capital exits on April 29. ","title":"BlackRock Bitcoin ETF attracts no inflows for 4th consecutive day","content":["Following last week’s digital asset investment product sentiment, spot Bitcoin ETFs again saw capital exits on April 29.","According to SoSoValue, 11 U.S. spot Bitcoin (BTC) ETFs recorded $51.53 million in cumulative single-day outflows.","Grayscale’s GBTC fund was upstaged by another player in a rare occurrence. While GBTC noted $24.66 million in exits, investors withdrew $31.34 million from ARK 21Shares’ BTC ETF. Fidelity’s spot Bitcoin ETF also saw outflows of $6.85 million.","Meanwhile, five issuers, including BlackRock’s IBIT fund, did not attract inflows. BlackRock has leapfrogged Grayscale as the new spot BTC ETF market leader and commands only $2 billion less than GBTC despite debuting over 10 years after the incumbent.","The latest trading data marked a four-day streak of no inflows for BlackRock’s fund. This came after 71 days of daily inflows, which propelled IBIT above competing funds. Furthermore, ETF expert Eric Balchunas noted that the trend was not unusual on Wall Street.","Totally normal, for example 78% of all ETFs saw $0 inflow yest. Extreme eg: $EEM has reported $0 inflows for like 150 days in a row while trading $80b worth of shares. Just means naturals balanced out or inflows and outflows were equal","Per CoinMarketCap, Bitcoin traded under $61,000 at press time and had declined over 12% in the past month due to a market correction leading up to the halving.","The broader cryptocurrency market has correlated with BTC price action, and altcoin valuations have stalled, with the total crypto market cap plunging below $2.3 trillion.","Sideways crypto movement is not new following a halving, but speculations about the market’s status abound. Speaking with crypto.news, Storm Labs CEO Sunil Srivatsa said the bull run is on.","“General consensus is that we’ve entered another bull market, and seasoned investors know to expect healthy corrections. There is still plenty to look forward to with anticipated rate cuts in the near term and the inevitable approval of an ETH ETF after.”"],"create_date":"2024-04-30T14:13:16+00:00","tag":"Bitcoin ETF","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/what-is-zero-knowledge-proof-how-it-works/","web_url":"https://crypto.news/","type":"article","description":"Your data is valuable – protect it with zero knowledge proof. But first, what is zero knowledge proof, and why should you care?","title":"What is zero-knowledge proof? A complete guide","content":["What is zero knowledge proof, and how does it ensure privacy online? Learn what it is and why it’s important.","Imagine you hold a secret, and someone wants to verify that you know it, but you don’t want to reveal what the secret actually is. How is that possible? Enter zero-knowledge proofs (ZKP), a cryptographic concept that allows exactly that.","Zero-knowledge proofs, despite their complex-sounding name, offer a simple yet powerful idea: proving knowledge of something without disclosing the specifics.","Introduced in the 1980s, zero-knowledge proofs have since become a cornerstone of modern cryptography, offering a path to secure and private digital interactions in an increasingly data-centric world.","Let’s understand what is zero-knowledge proof, explore how they function, and the diverse fields where they find application.","ZKPs are a cryptographic method that enables one party, known as the prover, to demonstrate to another party, the verifier, that they possess specific knowledge without actually revealing that knowledge.","In simpler terms, ZKPs allow for the verification of information without disclosing its actual content. One of the most famous analogies illustrating zero-knowledge proofs is the “Ali Baba cave” scenario:","Imagine a situation where a prover, let’s call her Peggy, wants to prove to a verifier, Victor, that she knows the secret passphrase to enter a cave, without actually revealing the passphrase itself.","Peggy takes Victor to the cave entrance, enters, and then exits through a different route. She then challenges Victor to determine the original entrance she used.","If Victor can find the original entrance, Peggy will reveal the passphrase. However, if Victor cannot find the original entrance, Peggy successfully proves her knowledge of the passphrase without disclosing it.","In this analogy, the cave represents the secret knowledge (the passphrase), and Peggy’s ability to enter and exit the cave demonstrates her knowledge of the passphrase.","Importantly, Victor gains no knowledge of the passphrase itself because he cannot see which entrance Peggy used to exit the cave.","This example reflects how zero-knowledge proofs allow one party to prove knowledge of a secret without revealing the secret itself.","ZKPs have broad applications in areas such as authentication, privacy-preserving protocols, and blockchain technology.","Zero-knowledge proof is achieved through a complex series of interactions. At the core of ZKPs are mathematical algorithms and protocols that enable this interaction.","One common type of ZKP is the interactive protocol, where the prover and verifier engage in a series of steps to establish the validity of the statement.","These steps are designed in such a way that the verifier can be convinced of the prover’s knowledge without the prover needing to reveal any specific information.","For example, consider a scenario where Donald wants to prove to Joe that he knows a secret number.","This is achieved through a series of cryptographic calculations and exchanges that allow Joe to verify the correctness of Donald’s claim without learning anything about the secret number itself.","ZKPs have wide-ranging applications. In addition to authentication and privacy-preserving protocols, ZKPs are also used in blockchain technology.","For instance, in a blockchain network, ZKPs can be used to prove the validity of transactions without revealing any sensitive information, such as the sender’s address or the amount transacted.","Zero-knowledge proofs (ZKPs) come in several types, each serving specific purposes and offering unique advantages.","The two major types include interactive and non-interactive ZKPs, and a few more, each with its own characteristics and applications.","Zero-knowledge proofs have a wide range of applications across various industries and technologies, thanks to their ability to enhance privacy, security, and efficiency in digital interactions.","Zero-knowledge proofs (ZKPs) offer several advantages.","ZKPs also come with certain challenges that need to be addressed for widespread adoption:","As of today, zero-knowledge proofs have emerged as a crucial technology for enhancing privacy and scalability in various digital applications.","Recently launched ZK-powered blockchains like Polygon zkEVM, zkSync Era, and StarkNet show great promise. Their potential applications and impact are just beginning to be explored.","It will be fascinating to see how these technologies evolve and what new possibilities they unlock in the coming years."],"create_date":"2024-05-16T15:12:53+00:00","tag":"zero knowledge","author":"Ankish Jain"}
{"url":"https://crypto.news/tens-of-billions-in-stablecoin-transactions-inorganic-visa-says/","web_url":"https://crypto.news/","type":"article","description":"International payment giant Visa has unveiled a new study challenging the assumption that stablecoin turnover is approaching levels seen in traditional payment networks","title":"Tens of billions in stablecoin transactions \u0027inorganic,\u0027 Visa says","content":["International payment giant Visa has unveiled a new study challenging the assumption that stablecoin turnover is approaching levels seen in traditional payment networks.","Visa, a global payment network, has raised concerns about the reliability of stablecoin transactions, opposing the common belief that they are becoming as popular as traditional money networks.","Cuy Sheffield, Visa’s head of crypto, suggested in a recent X thread that a significant portion of stablecoin transactions across many blockchain networks are influenced by “a lot of noise,” mainly due to automated bot activities.","3/ We found there can be a lot of noise in stablecoin data given that they can be used across a range of use cases with transactions that can be initiated manually by an end user or programmatically through bots.","Visa’s methodology of differentiating between stablecoin transactions relies on two metrics. Firstly, it focuses only on the largest stablecoin amount transferred within a single transaction, excluding smaller transactions resulting from complex smart contract interactions.","Secondly, it employs an “inorganic user filter,” targeting transactions initiated by accounts engaging in fewer than 1,000 stablecoin transactions and $10 million in transfer volume.","“This removes various bot activity as well as automatic transactions from large entities like centralized exchanges.”","Visa","In a commentary to Bloomberg, Pranav Sood, executive general manager for EMEA at payments platform Airwallex, noted that data says that stablecoins “are still in a very nascent moment in their evolution as a payment instrument,” adding that in the short-term and the mid-term, the market should focus on “making sure that existing rails work much better.”","However, not everyone in the cryptocurrency market agrees with Visa’s findings, questioning their methodology. Nick van Eck, co-founder of Agora, a startup specializing in stablecoins, said in a statement to DL News that the data “makes no sense because then it would factor in trading firms, which are entirely legitimate businesses using these products.”"],"create_date":"2024-05-06T07:45:21+00:00","tag":"Blockchain","author":"Denis Omelchenko"}
{"url":"https://crypto.news/cryptos-future-hinges-on-solving-the-privacy-transparency-conundrum-opinion/","web_url":"https://crypto.news/","type":"article","description":"Advancements in privacy-oriented blockchain protocols and applications highlight the ingenuity and evolution of blockchain, but the focus should be on web3.","title":"Crypto’s future hinges on solving the privacy-transparency conundrum | Opinion","content":["Disclosure: The views and opinions expressed here belong solely to the author and do not represent the views and opinions of crypto.news’ editorial.","Identity theft and the exposure of private user data were and still are serious problems plaguing web2. The impact of privacy infringements in the cyber realm is nothing new. Still, it consistently leaves the vast majority of internet users vulnerable, causing real economic and reputation damage to individuals and organizations.","In web3, there is a misguided belief that privacy threats aren’t as dangerous as those in web2—or that they barely exist altogether. While centralized Big Tech companies use closed protocols that collect user data to profit off their advertising value, web3’s decentralized nature feels less precarious.","This is because anonymity is a central tenet of blockchain technology, providing users with a pseudonym via an identifiable public key alongside a private key, enabling network access.","Yes, blockchain and decentralized technologies introduce novel approaches to identity management and data protection, such as cryptographic techniques, but it’s far from a complete privacy guarantee. Suppose a user’s blockchain pseudonym can be connected to their real-life identity, which can happen via several channels, including networking protocols and IP analyses. In that case, the user can be completely de-anonymized.","And thanks to blockchain’s signature transparency, a user’s entire transactional history is publicly visible, which would likely lead to substantial privacy concerns. An individual whose private key gets compromised and has their identity exposed could face a wide range of personal threats, such as extortion at the hands of cybercriminals.","As traditional and decentralized finance grow closer, the need to balance privacy and transparency will become more apparent. Fortunately, as the web3 industry underwent a much-needed cleanse in the wake of the crypto winter, progress was also made in this area.","Decentralized identity solutions have emerged as a reliable arsenal, empowering web3 users to safeguard their private data by allowing them to manage their identity information directly. With decentralized identity, users can employ selective disclosure mechanisms to share only specific elements of their personal data, such as transaction history, thus reducing the damage if a privacy breach occurs.","For example, the Galactica Network recently launched a layer-1 protocol powered by zero-knowledge KYC and impressive whitelisting primitives that help form a compliant, privacy-preserving sovereign identity while fostering a more robust defi space.","Likewise, ChainGPT recently debuted a web3 security extension called CryptoGuard, which safeguards against private key compromises and prevents unauthorized access to transaction history, among other features.","Furthermore, the Data Ownership Protocol, or DOP, was formed to curb public blockchain over-transparency by empowering users to control their on-chain data. The Ethereum-based protocol leverages zero-knowledge cryptography while operating within existing and future regulatory frameworks and leveraging advanced technologies such as zk-SNARKs and the Elliptic Curve Digital Signature Algorithm (ECDSA). Recently, DOP raised $162 million in a token sale in April 2024, making it the 9th largest ever at the time. Alongside a strong community of 2.7 million users, DOP’s climb shows a clear indication that Web3 users are yearning for a way to balance transparency and privacy.","Advancements in privacy-oriented blockchain protocols and applications highlight the ingenuity and evolution of blockchain, but more progress can still be made to address challenges surrounding web3 privacy. Web3’s future largely depends on effectively reconciling the contradictive nature of privacy and transparency. Walking this fine line while also anticipating privacy-related regulatory issues is a prerequisite for mainstream adoption."],"create_date":"2024-05-11T10:15:00+00:00","tag":"Decentralized Identity","author":"Ariel Shapira"}
{"url":"https://crypto.news/visa-vs-stablecoins-are-they-really-competing/","web_url":"https://crypto.news/","type":"article","description":"Does Visa\u0027s new report truly reflect stablecoin adoption, or do they overlook legitimate uses of them?","title":"Visa vs. stablecoins: are they really competing?","content":["Is Visa’s report on stablecoins an objective analysis, and who is behind the majority of transactions if not real users?","Stablecoins, crypto’s promise for stability and utility, are facing a stark challenge: their actual use. A recent study by Visa and Allium Labs has unveiled that over 90% of stablecoin transactions aren’t from genuine users.","According to Cuy Sheffield, Head of Crypto at Visa, the total transactions involving stablecoins as of April 24 in the last 30 days amounted to a monumental $2.65 trillion.","However, only a fraction—$265 billion—were identified as originating from “organic payments activity,” highlighting a huge gap between reported and authentic usage.","Despite this discrepancy, the study noted a steady growth in the number of monthly active stablecoin users, indicating a persistent interest in these assets.","This begs the question: if the majority of transactions are not driven by real users, who is driving them, and what could it mean for the crypto market?","Stablecoins are cryptocurrencies designed to maintain a stable value by pegging them to an underlying asset, typically a fiat currency like the U.S. dollar. This stability makes them attractive for various purposes, including trading, remittances, and everyday transactions.","Despite their utility, Visa’s dashboard reveals that less than 10% of stablecoin transaction volumes are considered to be from “organic payments activity.”","One major reason for this discrepancy is the prevalence of bots in the crypto space. These bots can execute transactions at high speeds and volumes, skewing the perception of real user adoption and usage patterns.","Meanwhile, the flexible nature of blockchain networks also contributes to this challenge. Blockchain allows for a wide range of use cases, including automated transactions. This flexibility can make it difficult to differentiate between transactions made by real users and those driven by automated processes.","Another factor contributing to the discrepancy in stablecoin transaction volumes is the double-counting of transactions.","For instance, converting $100 of stablecoin A to stablecoin B on any exchange would result in $200 of recorded stablecoin volume. This practice can inflate transaction volumes and create a misleading impression of the actual usage of stablecoins.","Visa and Allium Labs’ have used two filters to identify such activities.","The filters applied include a single-directional volume filter, which counts only the largest stablecoin amount transferred within a single transaction, eliminating redundant internal transactions from complex smart contract interactions.","Additionally, an inorganic user filter is applied, considering only transactions sent by accounts that have initiated less than 1000 stablecoin transactions and $10 million in transfer volume over the last 30 days.","Despite the difference in total transfer volume and bot-adjusted transfer volume, the analysis revealed a consistent increase in the number of monthly active stablecoin users. As of Apr. 24, across all chains, there were 27.5 million monthly active users, indicating a steady growth trend.","Visa’s analysis reveals striking growth in the usage of USD Coin (USDC) over the past eight months.","In September 2023, USDC accounted for 23% of all stablecoin transactions analyzed by Visa.","However, by the end of the year, this figure had more than doubled, exceeding 50% of all stablecoin transactions. Since December 2023, USDC has consistently accounted for a majority share of stablecoin transactions, reaching as high as 60% in February 2024.","This trend contrasts with the market capitalization of Tether (USDT) and USDC.","As of May 7, USDT boasts a market cap of approximately $111 billion, far higher than USDC’s market cap of just over $33 billion.","This discrepancy suggests that while USDT remains the dominant stablecoin in terms of market cap, USDC’s usage in actual transactions is outpacing USDT.","Pranav Sood, executive general manager for EMEA at payments platform Airwallex, commented that Visa’s findings indicate stablecoins are still in a nascent stage as a payment instrument. He suggested the need for improvement in existing payment systems to ensure their effectiveness.","However, not all experts agree with Visa’s analysis.","Nick van Eck, co-founder of Agora, a startup specializing in stablecoins, criticized Visa’s methodology. He argued that the data may include trading firms, which are legitimate businesses utilizing stablecoins, thus skewing the perception of actual user adoption.","Visa’s recent report aligns with the growing prominence of stablecoins in facilitating cross-border payments.","According to Sacra, a market research firm, the volume of stablecoin transactions has surged from $26 billion in January 2020 to a staggering $1.4 trillion in April 2024 and could potentially surpass Visa’s total payments volume in the second quarter of 2024.","Sacra further reported that stablecoin transactions are processed within minutes, a stark contrast to the 6 to 9 hours required by traditional systems.","Cost-wise, stablecoin transactions are cheaper too, with fees as low as $0.0037, compared to the average $12 fee for traditional methods.","Meanwhile, major banks, including Wells Fargo, JPMorgan Chase, Visa, and Mastercard, are exploring the use of stablecoins to enhance their payment infrastructure.","What remains to be understood here is whether the reports by Visa are to state the facts or if it’s trying to undermine the competition."],"create_date":"2024-05-07T11:10:54+00:00","tag":"Stablecoin","author":"Ankish Jain"}
{"url":"https://crypto.news/frances-national-assembly-approves-stricter-licensing-rules-for-crypto-firms/","web_url":"https://crypto.news/","type":"article","description":"France has taken a significant step towards implementing new cryptocurrency regulations, with the National Assembly voting in favor of stricter licensing rules for crypto firms. The move aims to bring French laws in line with anticipated European Union (EU) standards and bolster the country\u0027s reputation as a crypto hub.","title":"France\u0027s National Assembly approves stricter licensing rules for crypto firms","content":["France has taken a significant step towards implementing new cryptocurrency regulations, with the National Assembly voting in favor of stricter licensing rules for crypto firms. The move aims to bring French laws in line with anticipated European Union (EU) standards and bolster the country’s reputation as a crypto hub.","The final vote tally saw 109 Assembly members supporting the bill and 71 against, following a milder version of the legislation than initially proposed, following pressure from the crypto industry. The French Senate has already approved the bill, which will now be sent to President Emmanuel Macron, who will have 15 days to approve or reject it.","The proposed rules would require French companies offering crypto services to attain a more robust registration than currently offered by the Financial Markets Authority (AMF). The new regulations aim to ensure compliance with governance standards, rules on fund segregation, and guidelines for reporting to regulators, among other provisions.","✅ Projet de loi DDADUE dans les domaines de l’économie, de la santé, du travail, des transports et de l’agriculture | Adoption par l’Assemblée nationale, compte tenu du texte de la commission mixte paritaire. En savoir plus ➡️ https://t.co/CDlQxPrs1b#DirectAN pic.twitter.com/PZ2uuC4MrS","While many of these provisions overlap with the EU’s anticipated regulatory framework, France’s new regulations are expected to take effect well before the EU-wide legislation, which is expected to pass a final European Parliament vote in April. The proposed regulations will apply to companies registering from July 2023 onwards, with existing registered companies being allowed to continue operating until the end of the transition period in 2026.","The push for stronger regulations was initially proposed by Senator Hervé Maurey in December following the collapse of the FTX crypto exchange. While the industry feared the proposal would be damaging, regulators supported the move.","Following lengthy discussions, both the French National Assembly and Senate have agreed on a compromise proposal to tighten regulations for cryptocurrency firms. The proposal will introduce stricter registration requirements from January 2024, but companies will not be required to obtain a license."],"create_date":"2023-03-01T08:17:39+00:00","tag":"France","author":"Rony Roy"}
{"url":"https://crypto.news/crypto-hacks-on-coinbases-base-chain-rose-by-145-in-april-data-shows/","web_url":"https://crypto.news/","type":"article","description":"Coinbase\u0027s Base chain appears to be a target for scammers, with two of the top 10 largest single thefts occurring on the network, accounting for over 20% of the month\u0027s total theft","title":"Crypto hacks on Coinbase\u0027s Base chain rose by 145% in April, data shows","content":["Coinbase’s Base chain appears to be a target for scammers, with two of the top 10 largest single thefts occurring on the network, accounting for over 20% of the month’s total theft.","Although crypto hacks saw a decrease in April compared to previous months, some networks are experiencing a surge in scam activity as scammers explore new avenues to lure victims onto new platforms. According to data from Scam Sniffer, Coinbase’s Base network, built on top of the Ethereum blockchain, witnessed a 145% surge in scam activity in April.","🧵 [2/6] Despite the overall decline, theft on the Base chain saw a substantial increase of 145% from the previous month. Notably, 2 of the top 10 largest single thefts occurred on this chain, accounting for 21% of the month\u0027s total theft. pic.twitter.com/kTwteJNhJu","According to the blockchain intelligence firm, the Base network witnessed a nearly 1,900% surge in scammer activity since January, with approximately $170,000 stolen due to phishing scams. In April alone, nearly 90% of the stolen assets were ERC-20 tokens, the standard for tokens on the Ethereum network. Common phishing signatures such as Permit, IncreaseAllowance, and Uniswap Permit2 were responsible for significant losses, Scam Sniffer says.","Despite the decline in crypto attacks in April, marking the first significant decrease in 2024, large incidents still occurred. The largest hack involved Hedgey Finance, a token infrastructure platform, losing approximately $47 million worth of crypto. The second-largest hack targeted the Fix Float exchange, resulting in the theft of $3 million worth of crypto due to a vulnerability in a third-party service provider. The third-largest attack on Grand Base enriched hackers with $2.67 million.","In total, more than $401 million was stolen due to hacks and rug pulls since the beginning of the year, a 25.1% decrease compared to the same period last year, when more than $536 million worth of hacks occurred, according to Immunefi."],"create_date":"2024-05-06T11:01:51+00:00","tag":"Base","author":"Denis Omelchenko"}
{"url":"https://crypto.news/coinbase-develops-new-service-to-target-australias-664b-pension-market/","web_url":"https://crypto.news/","type":"article","description":"U.S. crypto exchange Coinbase is working on a new product offering digital assets for Australia’s growing self-managed pensions sector","title":"Coinbase develops new service to target Australia\u0027s $664b pension market","content":["U.S. crypto exchange Coinbase is working on a new product offering digital assets for Australia’s growing self-managed pensions sector.","Cryptocurrency exchange Coinbase is developing a yet-to-be-announced service that would offer crypto investment products for portfolios that make up about a quarter of Australia‘s $2.5 trillion pension system, Bloomberg reports, citing Coinbase Asia-Pacific managing director John O’Loghlen.","Speaking on the matter, O’Loghlen hinted that the exchange’s new solution is designed to cater to clients who may only make a single allocation with the service provider rather than engaging in regular or recurring transactions.","“Self-managed super funds might just make a single allocation and set it and forget it. We are working on an offering to service those clients really well on a one-off basis — to have them trade with us and stay with us.” John O’Loghlen","It’s unclear, however, when exactly Coinbase plans to roll out its new service. The exchange’s new product comes as reports indicate Australia is gearing up to embrace spot Bitcoin exchange-traded funds (ETFs) following their approvals in the U.S. and Hong Kong.","As crypto.news reported in late April, the Australian Securities Exchange (ASX) is anticipated to greenlight the first spot Bitcoin ETFs for the main board by the end of 2024. At least several issuers are already working on launching their products on ASX, including BetaShares, VanEck, and DigitalX. However, a specific timeline for the approval of spot crypto ETFs is yet to be clarified.","Jamie Hannah, deputy head of investments and capital markets for VanEck Australia, believes that self-managed superannuation programs, which hold about a quarter of the country’s $2.3 trillion pension market, could emerge as key buyers of spot-crypto funds."],"create_date":"2024-05-16T06:54:08+00:00","tag":"Australia","author":"Denis Omelchenko"}
{"url":"https://crypto.news/as-bitcoin-outpaces-fiat-whats-next-for-global-finance/","web_url":"https://crypto.news/","type":"article","description":"As Bitcoin\u0027s value overtakes major currencies by 99.5%, is this the start of a new era where digital currencies challenge traditional financial systems?","title":"As Bitcoin outpaces fiat, what\u0027s next for global finance?","content":["As Bitcoin’s value overtakes major currencies by 99.5%, is this the start of a new era where digital currencies challenge traditional financial systems?","The global economy has faced severe challenges in recent years, including rampant inflation and slowing growth rates since the post-pandemic era.","In the U.S., recent reports indicate a slower-than-expected GDP growth of 1.6% in Q1, missing forecasts of 2.5% growth and falling well below the 3.4% recorded in Q4.","Simultaneously, the core PCE (personal consumption expenditures) price index—an essential gauge of inflation for the Federal Reserve—has risen by 3.7% annually in Q1, overshooting expectations set at 3.4%.","Against this backdrop, Bitcoin (BTC) has experienced wild swings in recent weeks, trading at around $62,000 as of April 29.","With its decentralized nature, BTC has garnered both praise and criticism regarding its potential as a store of value. Proponents argue that Bitcoin offers a hedge against inflation and economic uncertainty, while critics point to its price volatility and regulatory concerns as prominent risks.","Given this context, let’s explore Bitcoin’s performance against major global currencies since its inception to determine whether it has truly served as a reliable store of value.","The U.S. dollar, historically regarded as the backbone of the global economy, has experienced a notable decline in its purchasing power relative to Bitcoin since the latter’s inception.","Once commanding considerable value, the dollar now equates to a modest 0.000016 BTC as of April 29, indicating a 99.5% decrease in value against Bitcoin.","This disparity becomes even more evident when considering Bitcoin’s impressive appreciation of nearly 800% against the dollar in just the past five years.","Traditionally, the dollar’s strength has been rooted in its role as the world’s primary reserve currency since the Bretton Woods Agreement in 1944.","USD’s dominance in global oil transactions and the reliable backing of the American economy have further bolstered its position. However, these strengths are counterbalanced by inherent weaknesses stemming from its status as a fiat currency.","Unlike Bitcoin, which boasts a capped supply ensuring scarcity and, theoretically, value retention, the U.S. dollar is susceptible to inflation and devaluation due to overproduction—a challenge that has historically plagued fiat currencies.","Recent trends in U.S. economic policy have further highlighted these vulnerabilities.","High inflation and rising national debt have raised concerns about potential monetary crises, where escalating consumer prices might compel the Federal Reserve to increase interest rates dramatically.","Such scenarios could endanger the dollar’s stability, as higher interest rates would amplify the government’s debt servicing costs, potentially eroding confidence among foreign creditors.","In contrast, Bitcoin’s design inherently avoids such pitfalls. Its decentralized nature and fixed supply cap offer an alternative to traditional monetary systems, where the risk of government-induced inflation looms large.","To accurately assess Bitcoin’s role as a store of value, it’s crucial to analyze its performance against major global currencies, including the Special Drawing Rights (SDR).","Established by the International Monetary Fund (IMF) in 1969, the SDR serves as an international reserve asset, representing a potential claim on the freely usable currencies of IMF members.","Initially linked to gold and the US dollar, the SDR evolved in 1973 into a composite of five major currencies: the U.S. dollar, euro, Chinese renminbi, Japanese yen, and British pound sterling. Its primary function is to serve as a unit of account for the IMF and other global entities.","Now, let’s explore how major global currencies have fared against Bitcoin.","The euro, a key player in the global economy after the U.S. dollar, has seen a notable decline in value relative to Bitcoin. As of April 29, the euro is valued at approximately 0.000017 BTC, indicating a depreciation of 99.49% since Bitcoin’s inception.","Similarly, the British Pound has depreciated by about 99.57% against Bitcoin, amounting to roughly 0.000020 BTC per GBP.","Despite China’s stringent regulations on crypto usage, the Yuan has depreciated by 99.55% against Bitcoin, now valued at 0.000021 BTC.","Meanwhile, the Japanese yen has experienced a depreciation of over 99.6% against BTC, recently hitting a 34-year low amid Japan’s ongoing struggles with hyperinflation and low-interest rates compared to the U.S. As of April 29, Google Finance shows that one Japanese yen equals zero BTC.","An even more drastic situation unfolds with the Argentine peso, which has nearly eroded in value against Bitcoin by over 99.99%.","This sharp decline aligns with Argentina’s battle against a 211.4% inflation rate in 2023, reaching a 34-year high.","To assess Bitcoin’s potential as a trusted store of value, we must consider historical examples of how reserve currencies evolved and the factors that drove their adoption.","Reserve currencies gained prominence due to economic stability, geopolitical power, and institutional trust.","The British pound, sterling, and later the U.S. dollar rose to prominence during periods of economic dominance and geopolitical influence.","For instance, by 1920, the pound sterling accounted for 57% of global trade settlement (less than 5% by 2020). Similarly, after World War II, the U.S. dollar became the primary reserve currency (59% as of 2020), supported by the strength of the American economy and the Bretton Woods Agreement.","However, these currencies faced challenges, such as inflationary pressures and geopolitical shifts, leading to transitions in global reserve currencies over time.","Bitcoin encounters hurdles in these areas. Despite its remarkable growth, with an average annualized return of over 671%, its volatile price swings raise concerns about its stability as a reliable store of value.","While Bitcoin’s decentralized nature offers resilience against government interference, it also presents regulatory, security, and adoption challenges.","Concerns about security breaches and illicit activities further undermine trust in crypto among mainstream investors.","Hence, only time will reveal whether Bitcoin can address these concerns and earn widespread trust as a store of value."],"create_date":"2024-04-29T10:01:34+00:00","tag":"Bitcoin","author":"Ankish Jain"}
{"url":"https://crypto.news/ripple-asks-court-to-reject-secs-2b-claims/","web_url":"https://crypto.news/","type":"article","description":"Ripple Labs rejected the U.S. SEC\u0027s request to recover $2 billion from the company for institutional sales of XRP tokens","title":"Ripple asks court to reject SEC\u0027s $2b claims","content":["Ripple Labs rejected the U.S. SEC’s request to recover $2 billion from the company for institutional sales of XRP tokens.","Ripple’s lawsuit states that the amount involved is much smaller and that the agency is trying to intimidate players in the digital asset market. The company filed a motion to dismiss the SEC‘s lawsuit alleging $2 billion. Last month, the agency sent documents to the court demanding that the company recover those funds.","The list of claims includes $876 million in compensatory damages, $198 million in interest on the amount mentioned, and another $876 million in civil penalties.","Representatives from Ripple acknowledged selling tokens to institutional clients. However, the company’s officials noted that the civil fine cannot exceed $10 million. The company also rejected the SEC’s accusations of the ongoing practice of selling XRP to institutions.","Ripple’s Chief Legal Officer, Stuart Alderoty, emphasized that the SEC’s allegations are based on a lost case for the agency. Alderoty believes the agency is trying to demonstrate its intention to persecute crypto companies to intimidate market participants.","Our opposition to the SEC’s request for $2B in penalties for legacy institutional sales is now public. In a case that had no allegations (or findings) of recklessness or fraud, and in which Ripple won on significant issues, the SEC’s ask is just more evidence of its ongoing… https://t.co/GLcdsyInZW","“In a case that had no suspicion (or findings) of recklessness or fraud, and in which Ripple won on significant issues, the SEC’s ask is just more evidence of its ongoing intimidation against all of crypto in the U.S.”","In July 2023, the company won a partial victory in an SEC lawsuit. The court found that XRP’s retail sales do not violate securities laws. However, the trial is still ongoing, with the next meeting slated to be on XRP’s institutional sales."],"create_date":"2024-04-23T16:23:28+00:00","tag":"Lawsuit","author":"Anna Kharton"}
{"url":"https://crypto.news/from-donations-to-decisions-how-crypto-pacs-target-senate-races/","web_url":"https://crypto.news/","type":"article","description":"How is PAC strategically maneuvering in key states to champion candidates aligned with the crypto industry\u0027s vision?","title":"From donations to decisions: how crypto PACs target Senate races","content":["Crypto-focused PACs, backed by the industry’s giants, are making waves in Senate campaigns to elect crypto-friendly leaders.","Crypto-focused political action committees (PACs) like Fairshake are rising, with significant financial contributions to Senate races.","Backed by prominent figures in the cryptocurrency industry, these groups aim to support political candidates who share their vision for the future of cryptocurrency and blockchain technology.","The impact of PACs was seen in the substantial $10 million campaign against Katie Porter, a critic of cryptocurrency and a Democratic Senate candidate in California, who recently lost her election.","Californians aren’t fooled: Shadowy crypto billionaires don’t want a strong voice for consumers in the Senate. They fear people who call out corporate greed, so they\u0027re spending millions on dishonest dark-money ads against me. Their ads will never stop me from fighting for YOU. https://t.co/reVyV4Ntnn","Porter has been known for her critical stance on concerns about the environmental impact of crypto mining.","Fairshake’s war chest, significantly filled by donations from industry giants like Coinbase, Ripple Labs, and Andreessen Horowitz, has amassed over $85 million.","Why this intense involvement? The crypto industry is at a crucial moment. It’s seeking legitimacy, grappling with public skepticism, and, most crucially, aiming to overcome the regulatory challenges.","Let’s investigate the goals of these well-funded political action committees and their influence on Senate races.","The strategy of these PACs is more than just financial support. They’re actively engaging in states where the competition is tough, leveraging their successes, such as the substantial investment to defeat Rep. Katie Porter in California, to move towards more critical Senate contests.","Led by Fairshake, these PACs are mobilizing substantial financial resources, including a notable $4.9 million funding from the Winklevoss twins, to support candidates sympathetic to the crypto industry while challenging those against it.","According to polls, the “crypto voters” segment is growing, making up 44% of voters across the U.S. People who either own or consider owning digital assets could sway election outcomes.","Cryptocurrency is becoming a significant topic in political campaigns, as some candidates support and promote blockchain technology as a key part of their agenda.","Politicians like Ted Budd, Blake Masters, Tim Ryan, and JD Vance have made crypto-friendly legislation a cornerstone of their past campaigns, meaning digital assets could become a crucial issue in future elections.","Fairshake focuses on four critical Senate races: the general elections in Ohio and Montana, and the Democratic primaries in Maryland and Michigan.","This choice is based on the vulnerability of incumbent Democratic senators in Ohio and Montana. These senators are known for their skeptical views on crypto, and Donald Trump won the state election in 2020.","Senator Sherrod Brown of Ohio had previously suggested a nationwide crypto ban, and Senator Jon Tester of Montana had questioned the very existence of crypto.","However, Fairshake’s approach is more complex. Rather than direct opposition, the PAC keeps its options open, suggesting that if these senators adjust their positions to be more crypto-friendly, they might still win Fairshake’s support.","In the Democratic primaries of Maryland and Michigan, the PAC is stepping into less charted territories. The candidates in these races, such as Congresswoman Elissa Slotkin in Michigan and David Trone in Maryland, have not prominently featured crypto in their campaign narratives.","Slotkin has limited her public comments on crypto to transparency in politicians’ crypto trades, while in Maryland, neither major candidate has taken a definitive public stance on crypto.","The backdrop to this strategic push is the dramatic rise and fall of Sam Bankman-Fried and his crypto exchange FTX, which previously funneled millions into congressional races.","Fairshake and its affiliated PACs, Protect Progress and Defend American Jobs, represent a new phase in this engagement, aiming to support candidates likely to foster a regulatory environment conducive to crypto’s growth.","The aggressive stance of PACs supporting crypto in the upcoming elections can be largely attributed to the regulatory environment shaped by the SEC under current and previous administrations.","The SEC, under Chairman Gary Gensler, has notably increased its scrutiny and regulatory actions against crypto, labeling the market as “rife with fraud, scams, and abuse” and likening the current state of crypto to the “Wild West” without adequate investor protection.","This perspective has led to significant enforcement actions, including against major players like Binance and Coinbase, accusing them of operating unregistered exchanges and selling unregistered securities, actions viewed by many, including Coinbase’s CEO Brian Armstrong, as stifling innovation and giving traditional financial institutions an unfair advantage.","SEC’s regulatory approach has also created a chilling effect on the decentralized finance (defi) projects and the broader crypto ecosystem, as developers and entrepreneurs face uncertainty about pursuing innovations in the face of potential SEC enforcement actions.","Moreover, the classification of popular cryptocurrencies like Solana (SOL), Cardano (ADA), and Ripple (XRP) as securities subjects them to stringent regulations, potentially hampering their growth and limiting their applications in DeFi projects.","In response to these and other similar regulatory challenges, PACs like Fairshake have become more aggressive, seeking to support candidates who favor a more innovation-friendly regulatory framework for cryptocurrencies.","Their actions suggest a blend of financial muscle, policy advocacy, and direct involvement in political campaigns, aiming to influence the immediate electoral cycle and shape the broader lines of crypto regulation and acceptance in the U.S. political mainstream."],"create_date":"2024-03-18T13:04:11+00:00","tag":"PAC","author":"Ankish Jain"}
{"url":"https://crypto.news/layerzero-ceo-85-of-addresses-may-be-ineligible-for-airdrop/","web_url":"https://crypto.news/","type":"article","description":"The LayerZero Labs team hinted at information that may disqualify the majority of airdrop hunters who farmed the expected ZRO airdrop for some two years. ","title":"LayerZero CEO: 85% of addresses may be ineligible for airdrop","content":["The LayerZero Labs team hinted at information that may disqualify the majority of airdrop hunters who farmed the expected ZRO airdrop for some two years.","LayerZero CEO Bryan Pellegrino reportedly said that less than 15% of wallets that interacted with the protocol would be eligible for the upcoming airdrop scheduled for this year’s first half.","On May 8, WuBlockchain cited a private Telegram message where Pellegrino supposedly espoused doubts regarding the validity of most addresses. In the text, the LayerZero Labs co-founder noted that fewer than three million out of six million possible addresses had only made a single transaction.","Furthermore, Pellegrino estimated that about 400,000 to 800,000 addresses were real users rather than Sybil participants.","Sybil users create a cluster of addresses to interact with protocols during airdrop participation and accrue rewards by “gaming the system.” The wallets are often controlled by a single entity or a group aiming to secure a larger allocation.","Typically, Sybils may snatch chunks of the airdropped tokens from other users, but LayerZero shared a plan to address this concern. Pellegrino and the team unveiled a “report-to-earn” scheme, allowing Sybils to self-report and retain 15% of the allocation or risk receiving zero if caught by other users.","Sybil Report LayerZero has been working with industry-leading partners @chaos_labs and @nansen_ai to conduct our sybil detection report. This analysis will consider every user’s total transactions weighted across all LayerZero applications with the goal of aligning TGE with… pic.twitter.com/5WmSHhQSYx","The platform also promised a reward for users who successfully identify and report Sybil farmers. So far, the initiative has received mixed reactions from community members.","Some have agreed that the idea will discourage Sybil hunters from diluting airdrops, while others complained that the process would nullify over 24 months of farming.","GG, 2 years of farming wasted because layer zero got these milady nerds acting like bounty hunters man what the fuck pic.twitter.com/v6G42Gkkgd"],"create_date":"2024-05-08T15:45:00+00:00","tag":"Airdrop","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/indian-crime-officials-being-probed-in-major-bitcoin-scam/","web_url":"https://crypto.news/","type":"article","description":"Several officers from the Indian Crime Branch, including an Inspector General of Police (IGP), are being probed by a Special Investigation Team (SIT) in connection with a Bitcoin scam","title":"Indian crime officials being probed in major Bitcoin scam","content":["Several officers from the Indian Crime Branch, including an Inspector General of Police (IGP), are being probed by a Special Investigation Team (SIT) in connection with a Bitcoin scam.","The SIT has issued a notice to Inspector General of Police (IGP) Sandeep Patil, head of the Crime Branch at the time, to clarify discrepancies in the investigation into a Bitcoin scam.","The scam involves hacker Srikrishna Ramesh, also known as Sriki and his associate Robin Khandelwal. Sikri, the mastermind behind the scam, hacked a cryptocurrency exchange, Unocoin, in 2017 and stole 60.6 Bitcoins worth ₹1.14 crore (approximately $137,000) at the time. He also hacked various other online platforms and laundered the funds using cryptocurrency.","Sriki then traded 150 Bitcoins worth ₹5.5 crore via Khandelwal. The duo was initially arrested in 2020 on charges of ordering drugs on the internet using Bitcoin.","According to a first information report (FIR) filed by the SIT in January, four former Crime Branch officers, Sridhar Poojar, Prashanth Babu, Chandradhar SR, and Lakshmikanthaiah, along with Santhosh Kumar, a private cyber expert, are being charged for illegal confinement, breach of trust by a public servant, and destruction of evidence related to the Bitcoin scam.","The allegations include manipulating the investigation to cover up the misappropriation of Bitcoins recovered during the probe.","The investigators initially claimed to have found 31 Bitcoins worth 9 crores from Sikri and 0.08627702 BTC from Khandelwal. However, these Bitcoins could not be found.","The explanation provided was that Sriki had “manipulated the Bitcoin core application to mislead the investigation.” Despite this claim, the Crime Branch failed to investigate further into the details of how and when the manipulation occurred.","Additionally, the SIT’s findings indicate that Inspector Chandradhar took Khandelwal into custody and coerced him to transfer money from his account to the crypto exchange Wazirx to purchase Bitcoins.","This was allegedly done to compensate for the Bitcoins that the Crime Branch could not recover from Khandelwal, who had exhausted his crypto resources.","The SIT is also investigating Rishab, the son of an Additional Director General of Police (ADGP), for alleged involvement in the scam. He has been accused of using illegal money acquired through Bitcoin trading. The SIT alleges that he received a cheque for ₹40 lakh during the period when Sriki was active and that he used this money to purchase a car.","The development comes as India has seen a rise in cryptocurrency-related scams over the years. Earlier this month, the nation’s Enforcement Directorate cracked down on two major scams and seized over $30 million. Prior to that, the ED collaborated with the FBI to take down a $360 million drug trafficking ring powered by cryptocurrencies."],"create_date":"2024-05-15T09:29:33+00:00","tag":"Bitcoin","author":"Rony Roy"}
{"url":"https://crypto.news/stablecoin-issuer-circle-plans-legal-base-shift-to-us-ahead-of-ipo/","web_url":"https://crypto.news/","type":"article","description":"USDC stablecoin issuer Circle is planning on moving its legal base from Ireland to the U.S. as an IPO looms","title":"Stablecoin issuer Circle plans legal base shift to US ahead of IPO","content":["USDC stablecoin issuer Circle is planning on moving its legal base from Ireland to the U.S. as an IPO looms.","Stablecoin issuer Circle is working on shifting its legal base to the US from Ireland, as the company gears up for an upcoming initial public offering (IPO).","According to a Bloomberg report on May 15, the company recently filed court paperwork to “re-domicile,” according to a spokesperson for Circle, who declined to elaborate on the matter. In January, the stablecoin issuer confidentially submitted plans to the U.S. Securities and Exchange Commission (SEC) for an initial public offering after a long period of fewer deals due to volatile markets.","Traditionally, IPOs serve as a capital infusion mechanism, enabling companies to enhance their infrastructure and expand their marketing efforts. For Circle, going public could mean an influx of resources that could be dedicated to promoting USDC and bolstering its competitiveness against USDT, another stablecoin issued by Tether.","The specifics of Circle’s IPO, however, including the number of shares to be offered and the proposed price range, haven’t been disclosed yet. Initially aiming for a public listing in July 2021, the Boston-based company later pursued a new deal with Concord Acquisition Corp. in 2022, valuing it at $9 billion. However, the much-anticipated SPAC deal failed to materialize due to the U.S. Securities and Exchange Commission’s (SEC) refusal to approve the filing.","Ireland was chosen by Circle as a base for its favorable tax environment, similar to other tech giants like Coinbase, Apple, Google, and Facebook, which also established their EU headquarters in the region."],"create_date":"2024-05-15T08:02:44+00:00","tag":"Circle","author":"Denis Omelchenko"}
{"url":"https://crypto.news/friend-techs-token-falls-98-following-airdrop-fiasco/","web_url":"https://crypto.news/","type":"article","description":"Users decried the friend.tech airdrop claims process as the token tumbled from a sharp spike as high as $167 and crashed from its opening price of $10. ","title":"Friend.Tech\u0027s token falls 98% following airdrop fiasco","content":["Users decried the friend.tech airdrop claims process as the token tumbled from a sharp spike as high as $167 and crashed from its opening price of $10.","SocialFi project friend.tech debuted its native token FRIEND on May 3 with an airdrop to users, along with version 2 of its protocol previously announced last month. The platform launched last year on Base, Coinbase’s Ethereum (ETH) L2 network, offering an invite-based community through “keys”, a custom ERC-20 social token type.","Shortly after FRIEND launched, DEX Screener data showed a 98% plunge in the token’s price and little liquidity. Token liquidity allows traders to buy or sell assets on the market, essentially enabling trading. Small liquidity caps can result in massive price swings since large orders will have a greater impact.","A Messari analyst noted that friend.tech’s team initially added a liquidity level far disproportionate to the amounts collected in fees.","“It’s free money bro why is CT upset” Um, it wasn’t? Users paid $60 million in fees, and $30 million(!!!) of that was extracted by Friendtech. So collectively, users paid $30m in farming costs for a token that has a liquidity pool of only $3m ETH liquidity… pic.twitter.com/aCrpmVUaNQ","Users also pointed out that the claim portal was clunky, resulting in successful claimants selling large chunks of the token and driving prices down while others could not collect the airdrop.","Watching the value of my airdrop go from 7 figs to 5 figs in the span of 2hrs while I keep refreshing the page trying to claim….still can\u0027t claim. Meanwhile I gotta watch this guy cashout while my wallet won\u0027t even load. Adds insult to injury 💀💀💀","FRIEND declined from $10 to under $2, but liquidity had improved. At press time, crypto.news noted over $8.3 million in liquidity while FRIEND’S 14.5 million supply supply held a $67 million market cap. The token also had over 20,000 holders and counting.","While liquidity improved and the number of holders increased, sellers still outmatched buyers by over 2,000. Coinbase Director Conor Grogan remarked that the friend.tech token launch presented a case study on airdrop culture, and how market participants react following distribution.","“The FriendTech airdrop is interesting because we get onchain proof of everyone’s trading acumen in an identity-linked way in about as good a natural experiment as you will ever get.”"],"create_date":"2024-05-03T17:02:57+00:00","tag":"Airdrop","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/tethers-ardoino-says-uninformed-ceo-spreads-fud-about-usdt/","web_url":"https://crypto.news/","type":"article","description":"Tether CEO Paolo Ardoino says an uninformed executive behind a company being investigated by the SEC is being reported \"spreading fear about USDT\"","title":"Tether\u0027s Ardoino says \u0027uninformed CEO\u0027 spreads FUD about USDT","content":["Tether CEO Paolo Ardoino says an uninformed executive behind a company being investigated by the SEC is being reported “spreading fear about USDT.”","Tether boss Paolo Ardoino said in a recent post on X that an “uninformed CEO” is allegedly spreading a FUD about the firm’s stablecoin, USDT, in a bid to shake the company’s dominance in the stablecoin market.","In an X post on May 13, Ardoino did not reveal the identity of the rumormonger, but noted that the individual is leading a company that is “being investigated by the SEC,” adding that the same firm is launching a “competitive stablecoin,” without elaborating on the matter. The identity of the individual to whom Ardoino is referring remains unclear.","In the post, Ardoino addressed concerns regarding the safety of the USDT ecosystem, emphasizing Tether’s commitment “to ensure that our entire community can benefit from a safe global financial ecosystem.”","In an effort to counter what Ardoino perceives as a biased narrative propagated by mainstream news outlets, he disclosed key statistics and initiatives related to Tether’s global compliance efforts. Particularly, the Tether CEO highlighted the firm’s commitment to adhere to the Office of Foreign Assets Control (OFAC) sanctions list, collaborations with law enforcement agencies worldwide, and utilization of monitoring tools provided by Chainalysis, a blockchain forensics firm.","According to Ardoino, Tether has blocked over $1.3 billion in suspicious transactions so far, including those associated with scams, hacks, and money laundering, with $1.6 million linked to terrorist financing. Moreover, the firm has cooperated with numerous law enforcement requests, both domestically and internationally, resulting in the prevention of illicit fund transfers amounting to over $639 million in collaboration with U.S. authorities alone, he added.","Ardoino’s statement comes shortly after Ripple CEO Brad Garlinghouse said in an interview for YouTube channel “World Class” that he thinks there will be more so-called back swan events, saying that “the U.S. government is going after Tether. That is clear to me.”","1/ The stablecoin market is booming – around $150B today, and projected to soar past $2.8T by 2028. There\u0027s a clear demand for trust, stability, and utility. That\u0027s why later this year we’re launching a stablecoin pegged 1:1 to the USD on the XRP Ledger and Ethereum.…","In early April, Ripple also announced it’s launching a U.S. dollar stablecoin on the XRPL and Ethereum, marking an entry into the multi-billion stablecoin market. The firm’s product is expected to be backed 1:1 by an equivalent sum of assets, including U.S. dollar deposits, U.S. government bonds and cash equivalents."],"create_date":"2024-05-13T09:20:01+00:00","tag":"Regulation","author":"Denis Omelchenko"}
{"url":"https://crypto.news/mark-cuban-from-bitcoin-basher-to-crypto-crusader/","web_url":"https://crypto.news/","type":"article","description":"Cuban has been catapulted back into the news after claiming that Gary Gensler\u0027s anti-crypto stance could cost Joe Biden the presidential election in November.","title":"Mark Cuban: From Bitcoin basher to crypto crusader","content":["Cuban has been catapulted back into the news after claiming that Gary Gensler’s anti-crypto stance could cost Joe Biden the presidential election in November.","Billionaire investor and Shark Tank star Mark Cuban hasn’t always been a fan of cryptocurrencies.","A little over four years ago, he was especially dismissive of Bitcoin — declaring that he’d rather have bananas because they have utility.","Fast forward to 2022, and things couldn’t have been more different. In an interview with the comedian Jon Stewart, Cuban revealed 80% of the investments he was making away from Shark Tank were related to digital assets.","The entrepreneur also spoke of his bullishness surrounding decentralized autonomous organizations and smart contracts — and belief that businesses powered by collective governance and self-executing agreements will dominate the 21st century.","But in his eyes, there’s one thing that’s standing in the way of digital assets achieving their full potential, especially in the U.S: regulatory paralysis.","Cuban has emerged as a scathing critic of the Securities and Exchange Commission — arguing that the body, under Gary Gensler, was asleep at the wheel when FTX collapsed.","Last summer, the 65-year-old accused the SEC of arrogance — and said the widespread financial damage caused by Sam Bankman-Fried could have been avoided. Pointing to how Japan learned lessons in the wake of Mt. Gox going bankrupt in 2014, he posted:","“When FTX crashed, NO ONE IN FTX JAPAN LOST MONEY. If the USA/SEC had followed their example by setting clear regulations that required the separation of customer and business funds and clear wallet requirements, NO ONE HERE WOULD HAVE LOST MONEY ON FTX.”","Of course, hindsight is 20/20. While Cuban’s significant public profile wasn’t connected with the spectacular collapse of FTX — unlike his fellow Shark Tank star Kevin O’Leary and countless other celebrities — the businessman has been known to back the wrong horses in the past.","Just last week, the Dallas Morning News reported that Cuban is continuing to face legal action over his involvement with the doomed crypto lending platform Voyager Digital.","Cuban is the owner of the Dallas Mavericks, and the basketball team had entered into a high-profile, five-year partnership with Voyager in 2021. At the time, the entrepreneur spoke of his ambition to introduce even more sports fans to cryptocurrencies — building on a legacy of accepting Bitcoin and Dogecoin for tickets and merchandise. In quotes at a news conference that really didn’t age well, he had said:","“I think Voyager is going to be a leader among sports fans and crypto fans around the country.”","It took just seven months for Cuban to be proven wrong — with Voyager spooking the market by suspending withdrawals and deposits in July 2022 and admitting that customers may never be made whole. A month later, a lawsuit accused him of enticing uninformed clients to place their entire savings in a “Ponzi scheme” — and pointed to a quote where Cuban said Voyager was “as near to risk-free as you’re going to get in crypto.” Ouch.","The latest Dallas Morning News report suggests that, while other sports stars have agreed to pay a total of $2.4 million in damages, Cuban is unprepared to settle — and he has long denied allegations that he misled investors.","As much as Cuban may be jumping up and down about failures to stop FTX, the billionaire’s own track record when endorsing crypto firms isn’t free of blemishes.","If @joebiden loses, there is a good chance you will be able to thank @GaryGensler and the @NewYork_SEC Crypto is a mainstay with younger and independent voters. Gensler HAS NOT PROTECTED A SINGLE INVESTOR AGAINST FRAUD All he has done is make it nearly impossible for… https://t.co/uBKupxLhS9","Cuban has been catapulted back into the news after even claiming that Gary Gensler could cost Joe Biden the presidential election in November. He went on to warn:","“This is also a warning to Congress. Crypto voters will be heard this election. You could solve this problem for Biden by passing legislation that defines registration that is specific to the crypto industry.”","Some progress is being made here. Republican Cynthia Lummis and Democrat Kirsten Gillibrand proposed legislation specific to stablecoins last month.","Meanwhile, there’s widespread excitement about news that the Financial Innovation and Technology for the 21st Century Act (FIT21) will head to a crucial floor vote within weeks — potentially giving greater certainty to crypto firms, and greater clarity as to what falls under the remit of the SEC and the Commodities Futures Trading Commission respectively.","With 8.8 million followers on X — and a public profile to boot — Cuban is arguably one of the most visible, and vocal, supporters of crypto.","And while it’s highly unlikely that Biden would lose the looming election based on crypto alone, the billionaire seems determined to use his platform to ensure the future of digital assets becomes an issue of national importance."],"create_date":"2024-05-15T09:54:41+00:00","tag":"Mark Cuban","author":"Connor Sephton"}
{"url":"https://crypto.news/poloniex-hacker-laundered-over-60-of-stolen-funds-in-just-one-week/","web_url":"https://crypto.news/","type":"article","description":"A hacker behind Poloniex, despite being allegedly identified, successfully laundered more than half of stolen funds via Tornado Cash","title":"Poloniex hacker laundered over 60% of stolen funds in just one week","content":["A hacker behind Poloniex, despite being allegedly identified, successfully laundered more than half of stolen funds via Tornado Cash.","A hacker, who attacked Poloniex in late 2023 and was later allegedly identified, laundered over $66 million out of $100 million stolen from the exchange through a sanctioned mixing protocol Tornado Cash.","#PeckShieldAlert #Poloniex hacker has transferred 4.4K $ETH (worth ~$12.8 million) to #TornadoCash. As of today (15th May 2024), the #Poloniex hacker has sent a total of 22.2K $ETH (worth ~$66.3 million) to #TornadoCash. pic.twitter.com/OCTZjhEB2B","According to data from blockchain intelligence firm PeckShield, the most recent transaction included over 4,400 ETH (worth ~$12.8 million) sent to Tornado Cash, bringing the total value of laundered funds to 22,200 ETH (worth ~$66.3 million).","👀👀👀It seems promising progress in tracking @poloniex stolen funds. @justinsuntron The whitehat reward of $10m is being offered. https://t.co/vWYgyYbEYs pic.twitter.com/6hZx72Buu2","In mid-November 2023, shortly after Poloniex suffered the attack, the team behind the project reached out to the bad actor, claiming “we have already confirmed your identity.” The exchange also offered the hacker a $10 million bounty for the return of funds, threatening to involve police “from multiple countries” should the hacker choose not to cooperate.","Despite Poloniex’s warnings that the stolen funds would be frozen, the hacker managed to launder over half of the stolen funds in just one week in early May. There have been no public indications that the exchange has made progress in freezing the funds thus far.","As crypto.news earlier reported, Poloniex’s listing data shows signs of a partially abandoned platform, with over 500 trading pairs showing no trading volume. According to data seen by crypto.news, approximately 53% of all listed pairs on the exchange had negligible or zero daily trading activity as of May 13.","In a commentary to crypto.news, a Poloniex spokesperson said that “price may be one of the reasons,” adding that “asset prices fluctuate often, leading to price differences.” However, it remains unclear why so many trading pairs on the exchange showed no daily trading activity whatsoever."],"create_date":"2024-05-15T10:24:45+00:00","tag":"hack","author":"Denis Omelchenko"}
{"url":"https://crypto.news/bybit-crypto-exchange-receives-warning-from-amf/","web_url":"https://crypto.news/","type":"article","description":"The AMF, a French Financial Market Authority, has blocked user access to the Bybit website.","title":"Bybit crypto exchange receives warning from AMF","content":["The AMF, a French Financial Market Authority, has blocked user access to the Bybit website.","The French Financial Market Authority (AMF) has blocked access to Bybit’s website, citing unauthorized operations in France. According to the AMF’s latest statement, Bybit crypto exchange is not authorized to provide digital asset services in France.","The regulatory body mandates that digital asset service providers (DASPs) must register with the AMF before offering services to the public, including operating a crypto trading platform.","The market authority said compulsory registration helps maintain public order by preventing money laundering and terrorist financing, verifying directors’ good reputations and competence, and even implementing specific measures to protect retail investors.","Since Bybit is not registered as a DASP, it operates illegally in France. Over a month ago, the AMF issued a similar warning against the cryptocurrency exchange Bitget.","Bitget is also not registered as a DASP and provides digital asset services subject to mandatory registration in France. Consequently, as of Nov. 7, 2023, Bitget has been blacklisted by the AMF for non-compliance with French regulations.","Last year, media reports said Binance’s French subsidiary had been under preliminary investigation since February 2022 for allegedly providing cryptocurrency services illegally and failing to comply with anti-money laundering obligations.","However, in May 2023, Binance received a license as a crypto service provider from the French Financial Market Supervisory Commission."],"create_date":"2024-05-16T16:35:05+00:00","tag":"AMF","author":"Anna Kharton"}
{"url":"https://crypto.news/biden-blocks-china-backed-crypto-mining-firm-from-wyoming/","web_url":"https://crypto.news/","type":"article","description":"The United States government has ordered a Chinese-backed cryptocurrency mining company to stop constructing a mine in Wyoming","title":"Biden blocks China-backed crypto mining firm from Wyoming","content":["The United States government has ordered a Chinese-backed cryptocurrency mining company to stop constructing a mine in Wyoming.","According to the May 13 order signed by President Joe Biden, MineOne Cloud Computing Investment and its partners will be required to divest the property located near the Francis E. Warren Air Force Base in Cheyenne, Wyoming.","MineOne Cloud is majority-owned by China. The company acquired the land in June 2022 and was preparing to set up a crypto-mining operation.","“There is credible evidence that leads me to believe that MineOne Partners Limited, a British Virgin Islands company ultimately majority owned by Chinese nationals […] might take action that threatens to impair the national security of the United States,” the order stated.","The order also requires the firm to remove all installed equipment from the site. It also bans Chinese-linked entities from accessing the site, which is situated closehttps://crypto.news/uniswap-founder-urges-democrats-to-immediately-change-bidens-approach-to-crypto/ to the U.S. air base.","MineOne has 120 days to wind up operations and sell the property. The firm is also prohibited from transferring these assets to any third party.","The mining site was initially flagged in October 2023 by tech giant Microsoft, which operated a data center in the area.","Microsoft issued an alert to the Federal Committee on Foreign Investment in the United States, raising concerns that the site could be a “full-spectrum intelligence collection operation.”","“We suggest the possibility that the computing power of an industrial-level crypto-mining operation, along with the presence of an unidentified number of Chinese nationals in direct proximity to Microsoft’s Data Center and one of three strategic-missile bases in the U.S., provides significant threat vectors,” Microsoft stated in its report.","The report followed an investigation by the committee that identified national security risks.","Over the past years, the U.S. has seen multiple Chinese-owned crypto-mining farms migrating to the nation following a ban in China in 2021. Some regions in the U.S. offer cheap electricity rates, which is a major selling point for these entities.","According to a New York Times report, Chinese-owned mining farms were reported in at least 12 states, including Texas, Wyoming, Arkansas, and Ohio.","Last month, the Biden government initiated a crackdown on the cryptocurrency mining sector with a 30% tax on electricity use by the miners. The move was met with criticism, with Senator Cynthia Lummis, a Wyoming Republican, claiming it would “destroy” the sector."],"create_date":"2024-05-14T09:11:34+00:00","tag":"Bitcoin","author":"Rony Roy"}
{"url":"https://crypto.news/decoding-argentinas-bitcoin-frenzy-reality-vs-rumor/","web_url":"https://crypto.news/","type":"article","description":"Why does Bitcoin struggle to find its footing in Argentina\u0027s economy? Delve into the reasons behind its limited adoption despite nationwide enthusiasm","title":"Decoding Argentina\u0027s Bitcoin frenzy: reality vs rumor","content":["Is Bitcoin’s hype in Argentina real? Discover why its adoption lags and what hurdles stand in its way despite global enthusiasm.","In Argentina, economic woes have reached critical levels, marked by an annual inflation rate soaring at a staggering 276% by Mar. 12.","As the value of the Argentine peso plummets, citizens are seeking refuge in alternative assets. One such refuge is Bitcoin (BTC), as reported by Bloomberg.","Bloomberg’s findings reveal that Bitcoin purchases on Lemon, the nation’s premier retail crypto exchange, surged to nearly 20-month highs.","Lemon recorded almost 35,000 transactions in the week ending Mar. 10, doubling the average weekly volume observed in 2023.","The driving force behind this crypto rush lies in the citizens’ search to shield their wealth amid a recession and soaring inflation, aggravated by President Javier Milei’s “shock therapy” economic policies.","Up until February 2024, Argentina had the largest purchases and holdings of stablecoins in Latin America over the previous six months, as highlighted in a report by Bitso, a Mexican-founded crypto exchange.","Digital dollars, particularly USDC and USDT, dominated preferences over other cryptocurrencies by nearly fivefold. Argentinians have allocated 60% of total crypto purchases to these stablecoins, with a mere 13% attributed to Bitcoin.","This trend starkly contrasts with neighboring Colombia, where stablecoins also wield influence, accounting for only 31% of purchases.","Let’s delve deeper into how crypto is reshaping Argentina’s economic situation and whether the BTC hype is real.","Since President Javier Milei’s rise to power in November 2023, Argentina has taken a new approach to crypto.","Under the previous administration, Argentina’s crypto holders enjoyed a fixed tax rate of 0% for holdings under $100,000 and 15% for amounts exceeding this threshold.","In January 2024, the government introduced a proposed bill titled the Law of Foundations and Initial Measures for Argentinian Liberty. As part of this initiative, the bill addresses taxation, particularly concerning crypto.","In particular, individuals in Argentina who disclose their cryptocurrency holdings by Mar. 31 will enjoy a favorable tax rate of 5%. However, this rate will progressively increase to 15% by Nov. 30.","Moreover, international cryptocurrency transfers will also be subject to taxation, with rates ranging from 5% to 15%.","While some welcomed this move, critics argue that it unfairly treats the crypto sector compared to the previous taxation rates.","In December 2023, the government announced that contractual obligations and debts can now be expressed and settled in BTC, signaling a potential avenue for the use of crypto as legal tender.","Ratificamos y confirmamos que en Argentina se podrán pactar contratos en Bitcoin.","In January 2024, Argentina further facilitated a rental contract where the tenant pays the landlord in Bitcoin.","Additionally, the launch of crypto exchange services by OKX and the introduction of Criptodólar, the region’s first stablecoin by local provider Ripio, suggest growing demand.","However, challenges persist on the regulatory front. The government’s agreement with the IMF tends to discourage crypto use and complicates the situation.","With inflation rates soaring at an alarming pace, reaching around 30% per month in recent periods, stablecoins have found their way in Argentina’s day to day transactions.","According to insights from Maxi Raimondi, Lemon’s chief financial officer, the demand for both BTC and stablecoins like USDC and USDT has surged over time.","Raimondi highlighted that at the onset of each month, as people receive their salaries, many opt to convert their funds into stablecoins to mitigate the impacts of inflation and currency devaluation. He said:","“If people buy crypto [like] Bitcoin, it’s really hard to see them selling their Bitcoin. However, if they will buy stablecoins — such as USDC or USDT, or DAI, whatever — they sell those [cryptocurrencies] in order to pay for their bills or [use] the payment service that we do have.”","This preference stems from the ease of converting stablecoins into fiat currencies for daily expenses, bills, and day-to-day transactions. Conversely, Bitcoin tends to be held as a long-term investment, with fewer instances of immediate liquidation, he added.","Meanwhile, despite reports of a surge in Bitcoin purchases, the numbers pale in comparison to the overall population. The claim of “highest volume in 20 months” may be sensationalized, as the absolute numbers are still modest, some Reddit users note.","In a country of 48 million people, the reported 34,700 weekly Bitcoin purchases may seem minuscule. Moreover, Bitcoin’s value adjusts alongside the peso when the latter strengthens, mitigating its role as a hedge against currency devaluation.","Despite the hype surrounding Bitcoin, its adoption in Argentina paints a different picture.","As shared by users on Reddit threads, Bitcoin’s usage in day-to-day transactions within Argentina is minimal. Few, if any, stores accept Bitcoin as a form of payment, making it impractical for anyone seeking to utilize their Bitcoin holdings.","There are several reasons for Bitcoin’s limited adoption in Argentina.","Firstly, there are significant hurdles to overcome regarding regulatory restrictions and practicality. Users report mandatory know-your-customer (KYC) requirements on most exchanges, including Bitcoin ATMs, limiting anonymity and accessibility.","Moreover, Bitcoin’s fluctuating value, coupled with Argentina’s volatile economic environment, makes it impractical for everyday transactions.","Unlike in more stable economies, where Bitcoin’s price fluctuations may be less pronounced, the risk associated with holding or transacting in Bitcoin is perceived as too high in Argentina.","Moreover, options are limited for those seeking to exchange their Bitcoin holdings for local currency. While there are “cuevas” (informal exchange venues) where crypto-to-peso transactions take place, these often require KYC and may not offer favorable exchange rates.","Instead, the focus among crypto users in Argentina seems to be on stablecoins. Users report that many exchange USDT for USD “blue notes” (unofficial exchange rate) for stability over the volatility associated with Bitcoin.","While there is considerable excitement surrounding Bitcoin, its integration into everyday transactions in Argentina could still be a distant dream. Regulations and economic conditions will play key roles in shaping Argentina’s crypto story, determining its course amid ongoing economic uncertainty."],"create_date":"2024-03-28T15:57:41+00:00","tag":"Argentina","author":"Ankish Jain"}
{"url":"https://crypto.news/tornado-cash-developer-jail-money-laundering/","web_url":"https://crypto.news/","type":"article","description":"Alexey Pertsev has been sentenced to 64 months in prison over his involvement in developing the Ethereum privacy tool Tornado Cash. ","title":"Tornado Cash developer sentenced to 64 months for money laundering","content":["Alexey Pertsev has been sentenced to 64 months in prison over his involvement in developing the Ethereum privacy tool Tornado Cash.","On May 14, a trio of Dutch judges found the Tornado Cash developer guilty of aiding $2.2 billion in money laundering through the Ethereum-based crypto mixer.","Lawyers defending Pertsev had argued that it was unfair to hold developers liable for building smart contract protocols accessible to anyone, a stand that crypto industry stakeholders have long since echoed.","Prosecutors in the Netherlands countered by insisting that the Tornado Cash contributor failed to stop the platform from criminal elements such as North Korea’s cybercriminal group Lazarus.","The three-judge panel sided with prosecutors, asserting that Tornado Cash was built intentionally for illicit activity. One judge also said that technological ideology does not exempt individuals from the scope of the law.","Pertsev was first arrested in the Netherlands in August 2022, days after the U.S. Treasury’s Office of Foreign Assets Control (OFAC) sanctioned Tornado Cash over money laundering and illicit finance allegations. A chief case cited by OFAC was the $600 million attack on Axis Infinity’s Ronin Bridge, which is coincidentally crypto’s largest hack to date. Following eight months in jail, he was released and placed under house arrest.","The judges ruled that his initial eight-month incarceration would be removed from his 64-month sentence. Pertsev will now serve four years and six months in prison, and his lawyers will have 14 days to appeal the verdict.","Although other Tornado Cash developers and co-founders are embroiled in litigation within other jurisdictions, Pertsev’s case could set a precedent for how global judiciaries approach decentralized privacy protocols and cases involving crypto mixers.","Tornado Cash co-founders Roman Storm and Roman Semenov are accused of violations in the U.S., with Storm’s court case still ongoing.","Authorities have also directed investigations to platforms like Samourai Wallet as the Department of Justice (DOJ) and its Financial Crimes Enforcement Network (FinCEN) clampdown on crypto mixers.","Due to a lack of concise defi and digital asset regulations in the U.S., the case against crypto mixers and privacy protocols is particularly contentious, as lawmakers and enforcement agencies are at odds regarding policy interpretation.","As crypto.news reported this week, a bipartisan duo of Senators questioned FinCEN over its crypto mixer lawsuits built on the back of classifying such entities as illegal money transmitters."],"create_date":"2024-05-14T15:27:43+00:00","tag":"court case","author":"Naga Avan-Nomayo"}
{"url":"https://crypto.news/new-stablecoins-law-proposed-in-us-but-what-are-the-pros-and-cons/","web_url":"https://crypto.news/","type":"article","description":"Elements of the Payment Stablecoin Act have the potential to be beneficial for American consumers — but critics claim other parts are \"unconstitutional.\"","title":"New stablecoins law proposed in US — but what are the pros and cons?","content":["Elements of the Payment Stablecoin Act have the potential to be beneficial for American consumers — but critics claim other parts are “unconstitutional.”","Republican Cynthia Lummis and Democrat Kirsten Gillibrand have become something of a bipartisan, pro-crypto double act in Congress — leading the charge in the push to offer regulatory clarity on digital assets in the U.S.","Their latest legislative effort has centered on stablecoins, with both arguing that a well-defined framework is needed to protect consumers and ensure the dollar remains dominant as digital payments continue to gain momentum.","One of the most significant proposals in the Lummis-Gillibrand Payment Stablecoin Act would see algorithmic stablecoins banned altogether in the U.S. — preventing coins that aren’t backed by real-world assets from launching. This is a clear nod to the catastrophe that surrounded Terraform Labs’ UST, which suffered a death spiral after losing its peg to the dollar in 2022.","This particular proposal has caused concern among some advocacy groups — namely Coin Center. While the nonprofit made clear it is no fan of UST, it’s argued that an outright ban on algorithmic stablecoins is “not just bad policy but unconstitutional as well.” The think tank’s executive director, Jerry Brito, argued:","“There can be ‘algorithmic stablecoins’ that (unlike Terra) are fully decentralized, with no issuers or promoters making any promises. In such cases a ban on ‘algorithmic stablecoins’ is essentially a ban on publishing code, which would violate free speech rights.”","Other areas of the Payment Stablecoin Act also raise more questions than answers. For one, it leaves the status of some digital assets, such as MakerDAO’s decentralized offering DAI, unclear, to say the least.","There could also be headaches for Circle which issues USDC — the world’s second-largest stablecoin with a market capitalization of $33 billion at the time of writing. The company is headquartered in Massachusetts, meaning it would firmly fall under the purview of the Payment Stablecoin Act. Given the proposals state that trust companies would only be able to issue up to $10 billion in stablecoins, Circle would be unable to operate in its current form without becoming a regulated depository institution.","Although both politicians rightly argue that USD-denominated stablecoins based in other jurisdictions “are currently writing rules for the dollar,” it’s also unclear how any of these rules could apply to Tether. USDT dominates the industry with a market cap of $110 billion, but is based offshore. Research from S\u0026P Global also suggests that — out of the $145 billion market for USD-pegged stablecoins — about 80% have been issued outside of the U.S.","Elements of the Payment Stablecoin Act have the potential to be beneficial for American consumers.","For one, any legislation that opens the door to the mass adoption of stablecoin payments is to be welcomed. As Lummis and Gillibrand note, cross-border transactions using legacy systems can take up to 10 days to clear — and often come with punishing fees attached. By contrast, stablecoins offer near-instant settlement at much lower cost.","This could be transformative for remittances, which involve foreign workers sending funds back home to their families. Data from the World Bank suggests this sector was worth an estimated $669 billion in 2023, but the typical cost of remittances stands at 6.2%. That’s $41 billion that could have benefitted local economies — all eaten up by transaction fees.","If signed into law, these proposals would introduce safeguards to ensure all stablecoins are properly backed on a one-to-one basis with dollars held in reserve, and introduce FDIC deposit insurance in the event an issuer went bust. In the banking sector, this currently protects customers to the tune of $250,000 automatically.","Lummis and Gillibrand also argue the measures could mitigate the prospect of de-dollarization as major economies around the world work to build their own financial systems — “enshrining American values and the dollar as the base currency for the $4.5 trillion global economy.” S\u0026P Global primary credit analysts Mohamed Damak and Andrew O’Neill went on to suggest that the bill’s approval could lead to banks issuing their own stablecoins.","The big question now is whether the Payments Stablecoin Act will pass, and how. The global law firm Akin warned:","“As the focus turns to the upcoming election and legislative activity slows, there are limited opportunities to move the bill through Congress.”"],"create_date":"2024-05-06T12:10:59+00:00","tag":"Circle","author":"Connor Sephton"}
{"url":"https://crypto.news/spot-btc-etfs-recorded-303m-in-inflows-amid-bullish-momentum/","web_url":"https://crypto.news/","type":"article","description":"Fidelity’s Wise Origin Fund emerges as the top performer as the broader spot Bitcoin ETF market sees $303 million in net inflows","title":"Spot BTC ETFs recorded $303m in inflows amid bullish momentum","content":["Fidelity’s Wise Origin Bitcoin Fund (FBTC) emerged as the top performer on May 15, recording an inflow of $131 million as market data shows a total net inflow of $303 million from the broader spot Bitcoin (BTC) exchange-traded fund (ETF) market.","Notably, FBTC has emerged as the front-runner in the spot Bitcoin ETF market in recent times, surpassing major investment products, including BlackRock’s iShares Trust Fund (IBIT). The broader market recorded its third consecutive day of net inflows yesterday following multiple days of outflows on the back of the crypto market turbulence.","Market data from Farside Investors indicates that multiple ETFs began the week with zero flows, including IBIT. On May 15, IBIT was the only spot Bitcoin ETF to record zero flows, marking its sixth day of zero flows in May.","Crypto.news previously reported that BlackRock’s IBIT recorded its first day of zero flows on April 24 since the launch of spot Bitcoin ETFs in January. On that day, multiple ETFs also reported zero inflows, with Fidelity’s FBTC and ARK’s ARKB being the only products to witness inflows.","Following the bullish momentum, Fidelity’s FBTC recorded consecutive days of outflows from April 29 to May 1 before seeing zero flows on May 2. It has now continued to command robust capital inflows, outperforming other ETFs for the fifth time this month.","Other top performers include the Bitwise Bitcoin ETF (BITB) and Ark 21Shares Bitcoin ETF (ARKB), with inflows of $86.3 million and $27 million, respectively. Grayscale Bitcoin Trust (GBTC) also saw inflows totaling $27 million. On May 14, GBTC recorded an outflow of $50.9 million.","Earlier in May, all spot Bitcoin ETFs witnessed inflows, but Bloomberg analyst Eric Balchunas expressed skepticism that this trend would repeat. Balchunas noted that despite the earlier capital outflows from spot Bitcoin ETFs and Bitcoin dropping below $60,000, over 95% of investors retained their investments and refrained from selling."],"create_date":"2024-05-16T08:19:51+00:00","tag":"Bitcoin ETF","author":"https://www.facebook.com/0xOneCrypto/"}
{"url":"https://crypto.news/25-year-old-canadian-crypto-guru-charged-for-30m-ponzi/","web_url":"https://crypto.news/","type":"article","description":"Canada’s self-named ‘crypto king’ has been has been charged with $30 million fraud","title":"25-year old Canadian crypto guru charged for $30m ponzi","content":["Canada’s self-named ‘crypto king’ has been has been charged with $30 million fraud.","According to a May 15 announcement from the Ontario Securities Commission, Two Canadian men, namely Aiden Pleterski, 25, and Colin Murphy, 27, have been charged for duping Canadians out of $40 million CAD (approximately $30 million USD).","Pleterski, who called himself ‘the crypto king,’ has been charged with fraud and money laundering for his role in an alleged Ponzi scheme. Meanwhile, his associate was charged with fraud.","The charges come after a 16-month investigation dubbed Project Swan, which was active alongside a bankruptcy case related to the scheme.","Documents from court and local media reports suggest that between 2021 and 2022, the duo raised around $40 million from 160 investors. They masqueraded under the name of AP Private Equity Limited and promised to invest the funds in crypto and foreign exchange markets.","Some investors reportedly took out loans to invest in Pleterski’s scheme.","However, as with every ponzi, the accused only a meager portion of the funds for investments and spent the rest on personal gains.","The Bankruptcy trustee for the case revealed that only 2% of the total funds raised had been invested. Pleterski spent the rest on buying 10 luxury cars, traveling internationally, and renting a $8.4 million lakefront mansion for $45,000 a month. In total, the self-anointed king spent at least $16 million in investor funds on himself. Authorities have seized two McLarens, two BMWs, and a Lamborghini as part of the bankruptcy proceedings.","Pleterski was often seen boasting his lavish style on social media platforms. He also live-streamed his trips and vacations and was seen driving luxury vehicles and spending lavishly.","He even claimed to have spent $150,000 on Legos in a video where he was building a Lego model of the Titanic.","During the bankruptcy proceeding, Pleterski referred to himself as a “20-something-year-old kid” who was unorganized. He also admitted to not keeping any records of his finances or payments.","He is currently out on a $100,000 bail on Tuesday. The bail was signed by his parents and requires Pleterski to surrender his passport and refrain from finance-related social media posting. He has also been ordered not to buy or trade cryptocurrencies. The Ontario Securities Commission will continue with the investigation, and more information will be released in the near future.","The charges coincide with Canada’s plan to tighten its grip on the crypto sector. Regulators are looking to enforce the Crypto-Asset Reporting Framework (CARF) by 2026. The framework will introduce fresh reporting requirements and stricter oversight to mitigate crypto tax evasion."],"create_date":"2024-05-16T08:30:01+00:00","tag":"Canada","author":"Rony Roy"}
{"url":"https://crypto.news/spot-bitcoin-etf-investments-institutions/","web_url":"https://crypto.news/","type":"article","description":"As of March 31, 937 institutions had invested over $11 billion in U.S. spot Bitcoin ETFs.","title":"K33 Research: Over 900 institutions invested $11b in spot Bitcoin ETFs","content":["As of March 31, 937 institutions had invested over $11 billion in U.S. spot Bitcoin ETFs.","Senior Analyst at K33 Research Vetle Lunde says that $11.05 billion equals 18.7% of the total funds managed by BTC-based products. For comparison, only 95 firms invested in gold ETFs over the same period.","According to 13F reporting, 937 professional firms were invested in U.S. spot ETFs as of March 31. In comparison, gold ETFs had 95 professional firms invested in their first quarter (Bitwise). Retail owns a majority of the float. Professional investors held exposure of $11.06bn… pic.twitter.com/jYEQZkpDiT","Morgan Stanley is among the 937 firms, investing $269.9 million in GBTC and becoming the second largest holder of an ETF from Grayscale after Susquehanna International Group (~$1 billion).","Institutions invested the most actively in GBTC, with a total of $4.38 billion. Following the Grayscale fund is IBIT from BlackRock, which has seen $3.23 billion in investments. FBTC from Fidelity closes the top three with investments of $2.1 billion.","On May 15, the net inflow into spot Bitcoin ETFs increased to $303 million, including $131 million in FBTC and $86.3 million in BITB. Since approval, inflows into spot Bitcoin ETFs have exceeded $12 billion, with the positive trend continuing for the third day in a row, according to SoSoValue.","On May 13, Bitwise Chief Investment Officer Matt Hougan emphasized that investing in Bitcoin ETFs is a new trend among institutions. According to him, about 563 investment companies have reportedly collectively invested about $3.5 billion in ETFs.","Hougan compares interest in spot Bitcoin ETFs to the surge in demand for gold-focused exchange-traded funds launched in 2004. Gold ETF funds were highly successful, raising over $1 billion in the first five trading days."],"create_date":"2024-05-16T15:06:31+00:00","tag":"Bitcoin ETF","author":"Anna Kharton"}
{"url":"https://crypto.news/decentralized-credit-intel-startup-synnax-onboards-ex-fidelity-head-of-digital-assets/","web_url":"https://crypto.news/","type":"article","description":"A credit rating startup Synnax has hired former Fidelity International head of digital assets to guide its commercial strategy","title":"Decentralized credit intel startup Synnax onboards ex-Fidelity head of digital assets","content":["A credit rating startup Synnax has hired former Fidelity International head of digital assets to guide its commercial strategy.","Synnax, an artificial intelligence-powered financial platform designed for credit analysis and ratings, has hired former Fidelity International head of digital assets Luc Froehlich as its new chief commercial officer to lead the firm’s commercial strategy and operations.","Before joining Synnax, Froehlich led Fidelity International’s venture focused on digital and tokenized assets as top manager for seven years. In February, Froehlich also joined Layer N, an Ethereum-based roll-up network to its advisory board.","“Credit markets, particularly private credit, have boomed over the past few decades. In contrast, the risk assessment toolkit has lagged, transparency is still lacking, and conflict of interest remains. By leveraging advanced encryption, we can now harvest the computing power of a broad network of AI models to deliver credit intelligence.”","Luc Froehlich","Synnax CEO Robert Alcorn says Froehlich’s expertise in credit markets will help the firm to work towards its mission of providing a “more trustless and privacy-preserving framework for institutional credit assessment.”","“His [Froehlich’s] appointment is also timely as we prepare to release our first public model.”","Robert Alcorn","Founded in 2023 by Robert Alcorn and Alessio Quaglini, Synnax leverages machine learning algorithms and big data analysis to provide credit evaluations for both on-chain and off-chain markets. The platform leverages the SYNAI token as a means of payment for Synnax services and as a tool to incentivize and reward data scientists for their contributions. Thus far, the firm raised $1 million from 13 investors, according to data from PitchBook.",""],"create_date":"2024-05-16T10:06:03+00:00","tag":"AI","author":"Denis Omelchenko"}
