{"url":"https://cryptodisrupt.com/best-basic-attention-token-bat-wallets/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Looking for best Basic Attention Token BAT wallet 2023 to store your BAT coin? we have complied a list of best bat wallet 2023 for you to take a look.","title":"9 Best Basic Attention Token (BAT) Wallets 2023 [UPDATED]","content":["Table of Contents","Brave Attention Token (BAT) is basically ERC20 token which is based on Ethereum blockchain technology. The main focus of the founder of BAT coin was to disrupt the online advertising domain with the span of time BAT become the most popular in the crypto market.","In this article, CryptoDisrupt Team will discover the best BAT wallets. The Brave internet browser exactly knows and tracks where users spend their time. It develops an obvious, transparent, and efficient digital advertising market with the help of blockchain technology.","Best Basic Attention Token Wallets 2023 to Store your BAT coins","Atomic Wallet is free to use a non-custodial cryptocurrency wallet that supports all ERC-20 tokens. You can create and open Atomic wallet via different operating systems such as macOS, Windows, Linux, Android, and iOS. The most interesting and reputed feature is atomic swaps on the part of this wallet which allows you to swap cryptocurrencies. The build-in exchange option lets you convert a number of cryptocurrencies using the platform of Atomic Wallet.","","The team behind the project is highly professional and reputed in the crypto community. The interface is best for new babies as well as for professional ones. The wallet also has its native token that is also an ERC-20 token.","Ledger wallet is basically one of the best hardware wallet. It is designed to store cryptocurrencies with massive security features. Crypto traders and investors passionately use ledger wallets for their cryptocurrency also praised by them.","The ledger company which developed this wallet has exposure in creating security solutions for crypto and blockchain. It was founded in 2014 and has offices in San Francisco, Paris along with the team of approx. 130 employees.","Fortunately, the company has successfully raised investments of $85 million. If we talk about the user interface of the wallet it is very simple and easy to use. Ledger supports several coins such as Bitgo, MyEtherWallet, Copay and some others as well. Also Read: Best Algorand Wallets","We are talking the best wallet for BAT token and Trezor is one of them. The wallet was launched in 2014 by a tech firm that has produced many innovative products in the domain of cryptocurrency.","","It has two products namely Trezor Model T and Trezor One that support a variety of crypto along with safety online. It is cheaper than other wallets. Trezor is very easy and simple to use especially for beginners.","It has a unique feature you can easily recover your money or funds if you lost your device. Trezor is a very safe and transparent platform through this, users can easily track their activities, the wallet supports thousands of coins.","When it comes to ERC20 tokens such as BAT and many others. MyEtherWallet is the best wallet to secure our tokens. MyEtherWallet allows users to create new wallets and keep store all tokens which are built on the standards of ERC-20.","It provides you the backup of all the tokens and wallet also encourage in-wallets swap like fiat currency into cryptocurrency, Ethereum to bitcoin, Ethereum to ERC20 tokens. Without creating any exchange account, you can convert BAT tokens into other tokens. So, if you are a newbie and looking to secure BAT token MEW is a reliable web wallet for you. Also Read: Best Kusama Wallets","The brave wallet has developed and officially launched by CEO Brendan Eich. It is one of the best crypto wallets for BAT tokens. The Brave is totally free for its user’s means users don’t need to pay for receiving and storing BAT coins.","The very first step to get started is to download the brave browser. After downloading the brave browser, you can easily add the BAT token. Brave joins hand with authorize publishers to empower users and helps them to earn more revenue than the traditional way of advertising.","With the help of the BAT wallet, you can conveniently add funds with BTC, LTC, Eth, or BAT through a transfer to the wallets and the most important thing is that BAT wallets ultimately transfer non-BAT funds sent to the wallet and keep the balance in the BAT. You can easily convert fiat currency into BAT by using several exchanges along with network fees applied.","Meta mask is another crypto wallet basically it is a browser-based wallet that supports ERC20 token. It is compatible with almost all browsers like Opera, Mozilla Firefox, and google chrome.","MetaMask is a very essential tool for blockchain enthusiasts, newcomers, traders, and developers. It allows you a unique feature to keep back up of your account and ultimately. The most important thing is its metrics collection takes a solid stance on user privacy and security.","Let me introduce you with one more feature that secure identity vault means an interface that can be used to manage your identity on different websites.","Security of data, information, and funds is the very first priority of any user. Guarda’s wallet fulfills all these things very effectively and efficiently. Guarda supports an organic and diverse range of tokens and cryptocurrencies.","It is an online-based wallet compatible with various platforms such as Linux desktop, Macintosh, and windows. A smartphone app is also available for both IOS and Android users. The option of banking cards not only inside the wallet but is available on the website as well.","The interface of Guarda is not very complex but easy and very simple to use. It supports more than 45 cryptocurrencies and a lot of fiat currencies for the empowerment of crypto. Some most popular cryptocurrencies Like BTG, BTC, ETH, ERC20 tokens, and others.","Exodus is a desktop-based wallet with an insightful user interface. It allows users to manage BAT tokens conveniently. It is compatible with Linux, macOS, and Windows systems.","Exodus not only supports the BAT token but 100 other cryptocurrencies as well. Exodus officially launched in July 2016 and continuously increasing its user base. it has three main essentials which include the portfolio section, wallet itself, and exchange integration.","It is very easy and simple to use. Exodus wallet offers users a quick way of accessing their funds, receive and send coins also helps them in tracking the transactions. It also supports you to filter out all the transactions like sent, exchanged, and received.","Exodus considers as multi-asset wallet because of the support of some most popular ones such as Bitcoin, Ethereum, Ethereum Classic, Bitcoin Cash, Bitcoin Gold, and many more. User’s privacy, data, and private keys safety are the top priority of the Exodus wallet.","Trust wallet is a very popular wallet and continuously getting its exposure. It is a (BAT) Basic Attention Token wallet that is available only for smartphone users.","","It supports and allows its users to manage ERC223, ERC20, and various coins like Bitcoin, Monero, Binance Coin, Litecoin, Dash, Bitcoin Cash. Through Trust wallet, users can easily interact with Ethereum blockchain directly.","Private keys of users stored locally and secured with several layers of protection and security. Binance officially takes over the trust wallet, through this Trust Wallet is getting more credibility. It allows users to swap their coins instantly on the decentralized exchange.","You can easily secure the BAT token on an exchange like Binance. I hope after reading this article you must become aware of the best BAT wallets and their availability in the market and features as well.","The brave wallet brings a ledger system onboard allows user attention and incentivized the publishers properly. I hope this article is worth reading for you. We will be looking forward to your kind suggestions and feedback.","Individuals can easily earn BAT coin by simply using the brave browser within a browser you get the brave ads and earn the free BAT coin or you can earn BAT coin free by just using the publish0x platform.","As we have discovered the best basic attention token wallets each have their own uniqueness and compatibility but the best one in my perception is Myetherwallet as a crypto passionate I personally use this wallet and recommend you all to secure your assets","If we talk about the best hardware wallet to secure our BAT coins ledger and Trezor are the best options for this purpose.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-10-02T06:08:03+00:00","tag":"best basic attention token wallet","author":""}
{"url":"https://cryptodisrupt.com/blockchain-in-pharmaceuticals-fighting-counterfeit-drugs/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"The role of blockchain in pharmaceuticals has long been a topic for discussion, and news has emerged that Pharma giant Merck is currently seeking a patent for a blockchain-based system that would store location coordinates of a particular object and tracks it as it progresses through the supply chain. This process will help verify the …","title":"Blockchain in Pharmaceuticals – Fighting Counterfeit Drugs - CryptoDisrupt","content":["The role of blockchain in pharmaceuticals has long been a topic for discussion, and news has emerged that Pharma giant Merck is currently seeking a patent for a blockchain-based system that would store location coordinates of a particular object and tracks it as it progresses through the supply chain.","This process will help verify the authenticity of the product.","In its patent filing Merck claims that the technology “enables a reliable, secure storage of the reading results with very high data integrity, such that it is essentially impossible to manipulate or erase or otherwise taper [sic] with or lose such data, e.g., due to unintended or deliberate deletion or due to data corruption.”","Merck goes on to explain in further detail – “Furthermore, the stored information can be accessed wherever access to the blockchain is available. This allows for a safe and distributed storage and access to the stored reading results, e.g., for integrity verification purposes such as checking whether a supplier of a product being marked with a composite security marking, as described herein, was, in fact, the originator of the product, or not.”","With internal procedures already in place to deal with counterfeiting, Merck hopes the proposed patent will fit with more comprehensive efforts to prevent counterfeiting on a larger scale.","In a related news article, Associate Director of Applied Technology at Merck & Co, Nissan Kulatilaka commented on blockchain at the MedCity Converge conference in Philadelphia –","“The blockchain is a distributed system where every node has a ledger of everything that happens. You get a new level of transparency where you can verify what happened.”","Merck & Co, known outside the USA and Canada as Merck Sharp & Dohme (MSD) is not the company which applied for the patent. The patent request was made by an unrelated business, with fundamentally the same name, the Merck group, headquartered in Darmstadt, Germany.","“There’s something that’s really cool about having your record follow you wherever you go without needing that data on you at all times. You’re no longer bound to your hospital system.”","Kulatilaka commented that healthcare could be the second-biggest industry to adopt blockchain technology after the financial services sector, but doesn’t see it becoming a huge factor for a few years yet.","A “level of boldness” is required to make sweeping changes within the healthcare industry, but Kulatilaka believes we’ll see blockchain in pharmaceuticals over the next five years.","“It’s a system that best works when you have a lot of different actors in the network, pushing the technology, using the technology,” he said. “But you’re seeing a lot of pressure being put on healthcare.”","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:19:45+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/blockchain-in-pharmaceuticals-fighting-counterfeit-drugs/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"The role of blockchain in pharmaceuticals has long been a topic for discussion, and news has emerged that Pharma giant Merck is currently seeking a patent for a blockchain-based system that would store location coordinates of a particular object and tracks it as it progresses through the supply chain. This process will help verify the …","title":"Blockchain in Pharmaceuticals – Fighting Counterfeit Drugs - CryptoDisrupt","content":["The role of blockchain in pharmaceuticals has long been a topic for discussion, and news has emerged that Pharma giant Merck is currently seeking a patent for a blockchain-based system that would store location coordinates of a particular object and tracks it as it progresses through the supply chain.","This process will help verify the authenticity of the product.","In its patent filing Merck claims that the technology “enables a reliable, secure storage of the reading results with very high data integrity, such that it is essentially impossible to manipulate or erase or otherwise taper [sic] with or lose such data, e.g., due to unintended or deliberate deletion or due to data corruption.”","Merck goes on to explain in further detail – “Furthermore, the stored information can be accessed wherever access to the blockchain is available. This allows for a safe and distributed storage and access to the stored reading results, e.g., for integrity verification purposes such as checking whether a supplier of a product being marked with a composite security marking, as described herein, was, in fact, the originator of the product, or not.”","With internal procedures already in place to deal with counterfeiting, Merck hopes the proposed patent will fit with more comprehensive efforts to prevent counterfeiting on a larger scale.","In a related news article, Associate Director of Applied Technology at Merck & Co, Nissan Kulatilaka commented on blockchain at the MedCity Converge conference in Philadelphia –","“The blockchain is a distributed system where every node has a ledger of everything that happens. You get a new level of transparency where you can verify what happened.”","Merck & Co, known outside the USA and Canada as Merck Sharp & Dohme (MSD) is not the company which applied for the patent. The patent request was made by an unrelated business, with fundamentally the same name, the Merck group, headquartered in Darmstadt, Germany.","“There’s something that’s really cool about having your record follow you wherever you go without needing that data on you at all times. You’re no longer bound to your hospital system.”","Kulatilaka commented that healthcare could be the second-biggest industry to adopt blockchain technology after the financial services sector, but doesn’t see it becoming a huge factor for a few years yet.","A “level of boldness” is required to make sweeping changes within the healthcare industry, but Kulatilaka believes we’ll see blockchain in pharmaceuticals over the next five years.","“It’s a system that best works when you have a lot of different actors in the network, pushing the technology, using the technology,” he said. “But you’re seeing a lot of pressure being put on healthcare.”","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:19:45+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/a-crucial-ripple-entity-announces-cessation-of-its-operations/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Coil, a company that was heavily backed by Ripple and played a significant role in the XRP ecosystem, has announced that it will be ending its operations. The company, led by CEO Stefan Thomas, was one of the three providers of Unique Node Lists (UNLs) for the XRPL alongside Ripple and the XRP Ledger Foundation. …","title":"A Crucial Ripple Entity Announces Cessation of its Operations - CryptoDisrupt","content":["Coil, a company that was heavily backed by Ripple and played a significant role in the XRP ecosystem, has announced that it will be ending its operations. The company, led by CEO Stefan Thomas, was one of the three providers of Unique Node Lists (UNLs) for the XRPL alongside Ripple and the XRP Ledger Foundation. In a series of tweets, Thomas stated that while the company is ending operations, it is not saying goodbye entirely, and has transferred its responsibilities related to the Interledger Protocol (ILP) to the Interledger Foundation. This transition is set to take place on March 15, 2023, when all Coil products and development efforts will come to an end.","This is farewell but not goodbye. Today, @Coil is sunsetting. I would like to thank the team that made Coil what it is, helped create the @Interledger Foundation, and an ecosystem around it.","Of course I\u0027m sad. But the work continues. 1/","Letter & FAQ @ https://t.co/JAVcJGh7GS pic.twitter.com/z75QDnjRRo","— Stefan Thomas (@justmoon) February 2, 2023","","In 2019, Coil received a major investment from Ripple’s Xpring division, which provided one billion XRP, worth approximately $260 million at the time. The funds were aimed at supporting the creation and promotion of ways to monetize digital content on the XRP Ledger. The company’s website states that the strategy of offering memberships was a short-term solution to help establish Web Monetization as the first open standard for content creators and developers to generate revenue on the internet.","Despite the end of Coil, Stefan Thomas will continue working on the Interledger project as the chairman of the board for the Interledger Foundation. Thomas has now shifted his focus to a new open-source project named Dassie, which merges the Interledger Protocol (ILP) with peer-to-peer technology. This new effort aims to simplify the process for developers to test and create on the Interledger. With over ten years of experience in XRP-related initiatives, Thomas is proud to be part of a community that prioritises practical solutions and advancements over sensationalism and beliefs.","According to a statement from Coil, the ILP has already been effectively used by a small group of early adopters. The CEO of Coil emphasised that the work on the Interledger will continue and the Interledger Foundation will be responsible for driving the project forward. Thomas is developing Dassie, a platform that will allow developers to establish nodes and process small payments using the Interledger Protocol. The company believes that full-featured Interledger wallets will be available soon and will support Web Monetization and other use cases.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/jimmy-song-on-the-death-of-eos-and-the-problems-with-roger-ver/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Bitcoin developer and entrepreneur, Jimmy Song, has stated that the EOS network will “die in a horrible dumpster fire” within the next five years. He made the remarks in a recent interview while advising young developers to stay away from ICOs and centralized blockchain organizations, instead to contribute towards decentralized currencies and open source projects. Why the …","title":"Jimmy Song on the Death of EOS and the Problems with Roger Ver - CryptoDisrupt","content":["Bitcoin developer and entrepreneur, Jimmy Song, has stated that the EOS network will “die in a horrible dumpster fire” within the next five years. He made the remarks in a recent interview while advising young developers to stay away from ICOs and centralized blockchain organizations, instead to contribute towards decentralized currencies and open source projects.","EOS has been criticized on numerous occasions for centralization issues. The fundamental idea behind decentralized currencies is that power does not reside in the hands of any one group or actor. In the case of EOS, the record-breaking USD 4 Billion ICO funds are held by a Cayman-based for-profit company called Block One. Jimmy Song is not alone in his scathing opinion of the EOS network. Satis Investment Group has released research indicating that EOS will lose 99% of its value within a year, and other figures such as Charlie Shrem have spoken out.","In truth, few cryptocurrencies, aside from Ripple, could defeat the concept of decentralization as clearly as EOS. They have an authority designed to resolve disputes called EOS Core Arbitration Forum (‘ECAF”), which is not altogether different from any other existing regulatory body such as the SEC. The network also has 21 block producers who froze some accounts associated with email scams without any authority. In other words, we have –","Aside from describing EOS as little more than a scam, the Bitcoin developer also agreed that Roger Ver was simply a politician with no interest in truth but merely seeking to score more points than his opponents. Ver is a bitcoin cash advocate who has previously spent ten months in prison for the illegal sale of explosives. Recently, Roger Ver and Jimmy Song had a controversial debate attempt on a yacht which rapidly deteriorated, primarily due to some of Ver’s aggressive techniques to dominate his adversaries.","“To him, control over a particular thing is more important than bringing self-sovereignty to the world or allowing people to control their own money. It’s all about him, that’s what that whole debate was about. It wasn’t about the merits of Bitcoin Cash or any of the actual economic theory, it was about him. He even said during his debate later on with Tone, that he was the one who made Bitcoin popular and he was going to do the same with Bitcoin Cash.”","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:15:57+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/shiba-inu-whale-goes-on-a-buying-spree-purchases-shib-worth-over-1-55m/","web_url":"https://cryptodisrupt.com/","type":"article","description":"In the past 24 hours, a prominent Shiba Inu whale bought SHIB tokens worth more than $1.55 million in three separate transactions. This purchase coincided with a significant token burn by the SHIB community, which saw over 2 million SHIB tokens sent to the dead wallet during the same timeframe. Despite the token burning, the …","title":"Shiba Inu Whale Goes on a Buying Spree: Purchases SHIB Worth Over $1.55M - CryptoDisrupt","content":["In the past 24 hours, a prominent Shiba Inu whale bought SHIB tokens worth more than $1.55 million in three separate transactions. This purchase coincided with a significant token burn by the SHIB community, which saw over 2 million SHIB tokens sent to the dead wallet during the same timeframe.","Despite the token burning, the price of Shiba Inu remains bearish compared to the broader cryptocurrency market cap.","According to Etherscan data, a top Shiba Inu whale has recently made multiple purchases of SHIB tokens worth over $1.55 million. Over the past 24 hours, the whale added SHIB tokens through three different transactions.","This buying activity happened while the SHIB community continued its token burn campaign, which resulted in over 2 million SHIB tokens being sent to the dead wallet within the same timeframe.","The Shiba Inu whale began its buying by acquiring a smaller amount of 16,099,042,840 billion SHIB a few hours prior. Shortly after this, he made a second transaction to purchase 108,040,560,167 SHIB tokens worth over $1.112 million.","The whale continued its buying spree with a third purchase of 26,413,897,870 SHIB tokens worth $272,063. This third transaction took place approximately nine hours later.","This isn’t the first time the 19th-largest SHIB holder has made a large purchase. According to data from Etherscan, the aforementioned whale accumulated more than 168.37 billion Shiba Inu tokens on April 25. The whale initiated the purchase in two transactions worth about $1.72 million.","The whale now possesses 5,178,454,552,701 SHIB tokens, which are valued at approximately $53.33 million.","","Despite the token burning, the Shiba Inu price has remained bearish compared to the other altcoins. At the time of writing this article, SHIB is trading at $0.0000102, with a 24-hour price decline of 1.06%.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/despite-ripples-strong-position-in-the-sec-lawsuit-market-sentiment-for-xrp-remains-bearish/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Despite Ripple’s clear lead in the ongoing lawsuit, market sentiment about XRP remains bearish. Market Sentiment Remains Bearish After the SEC filed the lawsuit against Ripple on 22nd December 2022, the initial couple of months were really bad for the firm. But later, thanks to Ripple’s aggressive defence, the firm recovered swiftly. Ripple continued to …","title":"Despite Ripple\u0027s Strong Position in the SEC Lawsuit, Market Sentiment for XRP Remains Bearish - CryptoDisrupt","content":["Despite Ripple’s clear lead in the ongoing lawsuit, market sentiment about XRP remains bearish.","After the SEC filed the lawsuit against Ripple on 22nd December 2022, the initial couple of months were really bad for the firm. But later, thanks to Ripple’s aggressive defence, the firm recovered swiftly.","Ripple continued to make new partnerships as it also set foot in a few emerging markets I.e. NFTs and CBDCs.","Despite all the positives surrounding Ripple, XRP’s Price does not seem to reflect the firm’s strong market position. In a recent survey featured on Coinmarketcap, community members projected the price XRP will trade at by the end of October. XRP’s median price emerged from the survey is $0.4166, 1.6% below the current price. For November the sentiment is even worse as the median is $0.3826, 9% lower then the current price.","In the past 7-days XRP has outperformed most of the mainstream coins. Despite a 5.7% decrease in the past 24-hours, XRP is still the best performing coin, among the top 10, over the week. In the meantime XRP Gained value by 4.3%.","","Further, in the week XRP has continuously changed hands above $0.40. During the period the average price of the coin has remained $0.47.","Main reason behind the recent dip in XRP’s price is the market bearish trend. Notably, the premier cryptocurrency Bitcoin is currently 7.5% in the day and 1.7% over the week.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:01:15+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/a-crucial-ripple-entity-announces-cessation-of-its-operations/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Coil, a company that was heavily backed by Ripple and played a significant role in the XRP ecosystem, has announced that it will be ending its operations. The company, led by CEO Stefan Thomas, was one of the three providers of Unique Node Lists (UNLs) for the XRPL alongside Ripple and the XRP Ledger Foundation. …","title":"A Crucial Ripple Entity Announces Cessation of its Operations - CryptoDisrupt","content":["Coil, a company that was heavily backed by Ripple and played a significant role in the XRP ecosystem, has announced that it will be ending its operations. The company, led by CEO Stefan Thomas, was one of the three providers of Unique Node Lists (UNLs) for the XRPL alongside Ripple and the XRP Ledger Foundation. In a series of tweets, Thomas stated that while the company is ending operations, it is not saying goodbye entirely, and has transferred its responsibilities related to the Interledger Protocol (ILP) to the Interledger Foundation. This transition is set to take place on March 15, 2023, when all Coil products and development efforts will come to an end.","This is farewell but not goodbye. Today, @Coil is sunsetting. I would like to thank the team that made Coil what it is, helped create the @Interledger Foundation, and an ecosystem around it.","Of course I\u0027m sad. But the work continues. 1/","Letter & FAQ @ https://t.co/JAVcJGh7GS pic.twitter.com/z75QDnjRRo","— Stefan Thomas (@justmoon) February 2, 2023","","In 2019, Coil received a major investment from Ripple’s Xpring division, which provided one billion XRP, worth approximately $260 million at the time. The funds were aimed at supporting the creation and promotion of ways to monetize digital content on the XRP Ledger. The company’s website states that the strategy of offering memberships was a short-term solution to help establish Web Monetization as the first open standard for content creators and developers to generate revenue on the internet.","Despite the end of Coil, Stefan Thomas will continue working on the Interledger project as the chairman of the board for the Interledger Foundation. Thomas has now shifted his focus to a new open-source project named Dassie, which merges the Interledger Protocol (ILP) with peer-to-peer technology. This new effort aims to simplify the process for developers to test and create on the Interledger. With over ten years of experience in XRP-related initiatives, Thomas is proud to be part of a community that prioritises practical solutions and advancements over sensationalism and beliefs.","According to a statement from Coil, the ILP has already been effectively used by a small group of early adopters. The CEO of Coil emphasised that the work on the Interledger will continue and the Interledger Foundation will be responsible for driving the project forward. Thomas is developing Dassie, a platform that will allow developers to establish nodes and process small payments using the Interledger Protocol. The company believes that full-featured Interledger wallets will be available soon and will support Web Monetization and other use cases.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/solana-and-helium-prices-soar-following-migration-announcement/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Earlier today, the Solana network team confirmed that the Helium network would be migrating to Solana on March 27, leading to a surge in prices for both SOL and HNT cryptocurrencies. The move was confirmed after Helium shared updates on the transition via a blog post last Friday. “After months of meticulous planning and technical …","title":"Solana and Helium Prices Soar Following Migration Announcement - CryptoDisrupt","content":["Earlier today, the Solana network team confirmed that the Helium network would be migrating to Solana on March 27, leading to a surge in prices for both SOL and HNT cryptocurrencies. The move was confirmed after Helium shared updates on the transition via a blog post last Friday.","“After months of meticulous planning and technical development, the Helium Foundation is proud to formally propose March 27, 2023, as the migration date to the Solana blockchain”","The migration to the Solana blockchain and deployment of Oracles is being described by Helium as the “most significant upgrade to Helium” yet, with the move set to greatly boost its scalability and reliability. The migration will see the current Helium blockchain halted for 24 hours on the transition date. Once completed, the native cryptocurrency for the Helium network, HNT, will be compatible with Solana’s ecosystem, offering more utilities for Helium users.","In addition, the Helium wallet app will become a Solana wallet, allowing users to access all their HNT tokens and Hotspots on the Solana blockchain. The move is expected to provide Helium users with a more seamless experience on the Solana network.","Following Solana‘s message today, Helium (HNT) saw a jump of nearly 10% to reach $3.22, while Solana (SOL) soared as high as 12% to reach $27. At the time of writing, SOL was trading at $26.42, with a growth of 28.39% in the past seven days, according to data from CoinMarketCap.","Despite its recent attractive growth, SOL is still down 89.85% from its historical all-time high of $260 in November 2021. Nevertheless, the move by Helium to migrate to Solana is seen as a positive development for both networks and is expected to bring more users and investors to the Solana ecosystem.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/bitcoin-as-legal-tender-el-salvadors-bold-economic-blueprint/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"In the wake of upcoming elections, El Salvador under President Nayib Bukele’s leadership, is set to continue its pioneering journey with Bitcoin as legal tender. This decision comes despite the International Monetary Fund’s (IMF) suggestion to reconsider the cryptocurrency’s status amidst financial negotiations. Vice President Felix Ulloa has confirmed the nation’s unwavering support for Bitcoin, …","title":"Bitcoin as Legal Tender: El Salvador\u0027s Bold Economic Blueprint - CryptoDisrupt","content":["In the wake of upcoming elections, El Salvador under President Nayib Bukele’s leadership, is set to continue its pioneering journey with Bitcoin as legal tender.","This decision comes despite the International Monetary Fund’s (IMF) suggestion to reconsider the cryptocurrency’s status amidst financial negotiations. Vice President Felix Ulloa has confirmed the nation’s unwavering support for Bitcoin, signaling a future where digital currency plays a central role in El Salvador’s economy.","“Bitcoin will remain legal tender in El Salvador under President Nayib Bukele’s second term,” affirmed by the Vice President, marking a significant stance against the International Monetary Fund’s (IMF) suggestions to reconsider the cryptocurrency’s legal status.","This declaration underscores El Salvador’s commitment to pioneering in the digital currency space, despite international pressures.","The government’s dedication to fostering a crypto-friendly environment is evident in its plans for “Bitcoin City, a tax-free crypto refuge,” and the innovative approach of offering “passports for investors who invest $1 million in cryptocurrency.”","These initiatives reflect a strategic move to attract global crypto investment and establish El Salvador as a leading nation in cryptocurrency adoption.","With the upcoming elections, the administration’s popularity, bolstered by a “brutal gang crackdown,” seems to secure President Bukele a second term.","The Vice President’s reiteration of Bitcoin’s legal status days before the election serves as a reassurance of the government’s direction towards embracing digital currency, despite potential financial and international challenges.","The Vice President’s statement,","“Not only will it (the law) be maintained… At this moment, it enjoys the greatest credibility in the entire world,”","highlights the international recognition and credibility El Salvador’s Bitcoin policy has achieved. This is further supported by the government’s plans to issue “bitcoin-backed bonds in the first quarter of 2024,” showcasing a forward-thinking approach to national economic development.","El Salvador’s unwavering commitment to Bitcoin, articulated through official statements and strategic initiatives, sets a precedent for how nations might leverage digital currencies for economic innovation and growth. As El Salvador continues on this path, the world watches closely, recognizing the potential impacts and opportunities that such a bold financial experiment may bring to the global economic landscape.","","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2024-02-01T11:44:27+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/in-a-recent-release-meta-announce-launch-of-its-nft-marketplace-on-instagram/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Meta, the company that owns two of the world’s most widely used social media apps; Facebook and Instagram, has recently announced the launch of its NFT marketplace. The press release stated that in the near future users will be able to create/mint, showcase and sell digital collectibles using Instagram. Meta noted, the creation of an …","title":"In a Recent Release Meta Announce Launch of Its NFT Marketplace on Instagram - CryptoDisrupt","content":["Meta, the company that owns two of the world’s most widely used social media apps; Facebook and Instagram, has recently announced the launch of its NFT marketplace.","The press release stated that in the near future users will be able to create/mint, showcase and sell digital collectibles using Instagram. Meta noted, the creation of an NFT (Non-Fungible Tokens) will be done on a polygon blockchain. Whereas, the creators will be provided with an end-to-end toolkit that will assist them in every single phase starting from the creation and showcasing of the NFT to its eventual sale.","Users of the app could be able to support their favourite NFT creations by buying the digital assets directly using Instagram. Meta highlighted that while currently these features are only available to a small group of individuals residing in the United States, it will soon be made available to larger audiences all across the globe.","Meta also mentioned that they are including other blockchains and wallets, namely Solana blockchain and Phantom wallet, in addition to the existing polygon blockchain, to expand the types of digital collectibles that could be minted and traded. The company stated:","“Information for select collections where the metadata has been enriched by OpenSea, such as collection name and descriptions, will now be available on Instagram.”","Meta further went on to state that they are now allowing more people to subscribe on Instagram, specifically in the United States, that helps them in engaging with their audience more deeply.","Earlier, Meta had disclosed in their quarterly report that the company suffered a loss 0f $3.7 billion in the Q3 of the year. However, the CEO Mark Zuckerberg, stated that company’s newly added features, namely Instagram reels and Ai, are seeing good public engagement, which is obviously a positive trend in the long-term.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:12:04+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/bitcoin-as-legal-tender-el-salvadors-bold-economic-blueprint/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"In the wake of upcoming elections, El Salvador under President Nayib Bukele’s leadership, is set to continue its pioneering journey with Bitcoin as legal tender. This decision comes despite the International Monetary Fund’s (IMF) suggestion to reconsider the cryptocurrency’s status amidst financial negotiations. Vice President Felix Ulloa has confirmed the nation’s unwavering support for Bitcoin, …","title":"Bitcoin as Legal Tender: El Salvador\u0027s Bold Economic Blueprint - CryptoDisrupt","content":["In the wake of upcoming elections, El Salvador under President Nayib Bukele’s leadership, is set to continue its pioneering journey with Bitcoin as legal tender.","This decision comes despite the International Monetary Fund’s (IMF) suggestion to reconsider the cryptocurrency’s status amidst financial negotiations. Vice President Felix Ulloa has confirmed the nation’s unwavering support for Bitcoin, signaling a future where digital currency plays a central role in El Salvador’s economy.","“Bitcoin will remain legal tender in El Salvador under President Nayib Bukele’s second term,” affirmed by the Vice President, marking a significant stance against the International Monetary Fund’s (IMF) suggestions to reconsider the cryptocurrency’s legal status.","This declaration underscores El Salvador’s commitment to pioneering in the digital currency space, despite international pressures.","The government’s dedication to fostering a crypto-friendly environment is evident in its plans for “Bitcoin City, a tax-free crypto refuge,” and the innovative approach of offering “passports for investors who invest $1 million in cryptocurrency.”","These initiatives reflect a strategic move to attract global crypto investment and establish El Salvador as a leading nation in cryptocurrency adoption.","With the upcoming elections, the administration’s popularity, bolstered by a “brutal gang crackdown,” seems to secure President Bukele a second term.","The Vice President’s reiteration of Bitcoin’s legal status days before the election serves as a reassurance of the government’s direction towards embracing digital currency, despite potential financial and international challenges.","The Vice President’s statement,","“Not only will it (the law) be maintained… At this moment, it enjoys the greatest credibility in the entire world,”","highlights the international recognition and credibility El Salvador’s Bitcoin policy has achieved. This is further supported by the government’s plans to issue “bitcoin-backed bonds in the first quarter of 2024,” showcasing a forward-thinking approach to national economic development.","El Salvador’s unwavering commitment to Bitcoin, articulated through official statements and strategic initiatives, sets a precedent for how nations might leverage digital currencies for economic innovation and growth. As El Salvador continues on this path, the world watches closely, recognizing the potential impacts and opportunities that such a bold financial experiment may bring to the global economic landscape.","","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2024-02-01T11:44:27+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/luna-airdrop-takes-place-successfully-as-the-terra-v2-goes-live/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"After being delayed for a day, Terra’s new blockchain finally goes live. Amidst all the chaos surrounding Terra its V2 blockchain has finally gone live after getting delayed for a day, due to an unknown event. With the launch of the blockchain, LUNA airdrop has also taken place successfully. Confirmed by Terra through its twitter …","title":"Luna Airdrop Takes Place Successfully as the Terra V2 Goes Live. - CryptoDisrupt","content":["After being delayed for a day, Terra’s new blockchain finally goes live.","Amidst all the chaos surrounding Terra its V2 blockchain has finally gone live after getting delayed for a day, due to an unknown event. With the launch of the blockchain, LUNA airdrop has also taken place successfully.","Confirmed by Terra through its twitter handle the first block on Terra V2 was produced at 6 UTC. As mentioned the launch was accompanied by the new LUNA airdrop. Under the airdrop plan 70% of the tokens will be allocated to investors already holding the old Luna, Lunc, UST or aUST. aUSTs are the UST Stablecoins that were staked in Terra’s flagship DeFi Protocol , Anchor Protocol, which offered investors 20% yields on their staked tokens.","1/ Block 1 of the brand new Terra blockchain (with a chain_id of “Phoenix-1”) has officially been produced at 06:00 AM UTC on May 28th, 2022!","Congratulations to the #LUNAtic community on this expeditious feat of collaboration 🎉","— Terra 🌍 Powered by LUNA 🌕 (@terra_money) May 28, 2022","","Holders of tokens mentioned above could be able to receive their share of new Luna airdrop via Terra’s website. Notably, none of the airdropped tokens are received by the Terraform Labs, the organisation behind the Terra blockchain. After the launch of Terra V2, the old Luna, Lunc and UST tokens were renamed as Luna Classic, Lunc Classic, and UST Classic. At the press time Luna Classic is trading at $16, as per bybit.","The launch of Terra V2 and new Luna airdrop was decided after the drastic fall of Terra. Because the UST was unpegged with dollars on May 18, the LUNA fell virtually to $0 within the next few days.","Later the CEO of Terraform Labs, Do Kwon, put the proposal forward of forking Terra on May 16. While initially the proposal was met with due hesitation, later, as 12 validators signaled to support the forking, the proposal was voted.","Since the downfall of Luna, Do Kwon has been scrutinized all over the globe. Especially in South Korea. As the authorities have reportedly sent Kwon a $78 million fine for tax evasion.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:13:22+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/bitcoin-etf-90-chance-of-approval/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"The bitcoin ETF is arguably the biggest news in the cryptocurrency industry thus far in 2018. If a bitcoin ETF came to pass, then it would mean a deluge of new investment, opening the floodgates to bitcoin exposure on a scale never before seen. No bitcoin ETFs have yet been approved by the SEC, and …","title":"Bitcoin ETF 90% Chance of Approval - CryptoDisrupt","content":["The bitcoin ETF is arguably the biggest news in the cryptocurrency industry thus far in 2018. If a bitcoin ETF came to pass, then it would mean a deluge of new investment, opening the floodgates to bitcoin exposure on a scale never before seen.","No bitcoin ETFs have yet been approved by the SEC, and the two companies behind the bitcoin ETF have had individual applications previously shut down before joining forces.","According to ICO Journal, the bitcoin ETF has a 90% chance of approval, citing a CFTC official who stated that –","I would call it 90% at this point. The crypto markets have moderated and regulators have watched the lack of drama surrounding Bitcoin futures across several global exchanges…. In January we were justifiably concerned about a bubble and the harm a quickly approved product could attract speculators and create losses that led to significant lawsuits. Now, those factors seem to be mitigated significantly.”","A further source of an SEC official also indicated a positive outcome, using less optimistic and specific language. Additionally, the SEC has opened the topic and has taken in public commentary, which has been over 97% positive, as previously reported by Crypto Disrupt.","The bitcoin ETF was unveiled in June and is called the VanEck SolidX Bitcoin Trust ETF (XBTC). The ETF sponsors are Van Eck (asset management) and Solid X (blockchain). The product will track an index linked to bitcoin trading desks. Though the fund will increase exposure, it is still targeted at institutional investors with a share price of $200,000.","But if this ETF is given the green light, then more bitcoin ETFs will soon come to the market. If approved, the product will most likely be listed on the Chicago Board of Exchange (CBOE).","A potential cause for concern raised by a very small number of commenters is that if the bitcoin price is indeed manipulated, then a bitcoin ETF linked to specific bitcoin trading desks would exacerbate the problem. The CBOE was the exchange where bitcoin futures were first launched when bitcoin was at its peak in December 2017, before starting its downward spiral.","An ETF (exchange traded fund) is a security that tracks another fund, such as an index fund, or any basket of assets. It trades like a stock on an exchange, with higher liquidity and lower fees. Lower fees, higher liquidity, and market access mean that a bitcoin ETF would make cryptocurrency accessible to a much larger audience. The product would also be insured against theft, fraud, and loss.","Shareholders in an ETF do not directly own the underlying instruments but have a form of indirect ownership. They are entitled to a percentage of the profits on the underlying assets appreciation.","While it is commonly believed that August 10th is the deadline for approval, the final decision will likely not be made on this date, and the earliest the decision will be announced is August 16th.","But all of the signs are pointing towards regulatory approval, and it is now a question of when, not if. It is more positive news in the crypto sphere, alongside a market bull run.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:17:15+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/shiba-inu-whale-goes-on-a-buying-spree-purchases-shib-worth-over-1-55m/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"In the past 24 hours, a prominent Shiba Inu whale bought SHIB tokens worth more than $1.55 million in three separate transactions. This purchase coincided with a significant token burn by the SHIB community, which saw over 2 million SHIB tokens sent to the dead wallet during the same timeframe. Despite the token burning, the …","title":"Shiba Inu Whale Goes on a Buying Spree: Purchases SHIB Worth Over $1.55M - CryptoDisrupt","content":["In the past 24 hours, a prominent Shiba Inu whale bought SHIB tokens worth more than $1.55 million in three separate transactions. This purchase coincided with a significant token burn by the SHIB community, which saw over 2 million SHIB tokens sent to the dead wallet during the same timeframe.","Despite the token burning, the price of Shiba Inu remains bearish compared to the broader cryptocurrency market cap.","According to Etherscan data, a top Shiba Inu whale has recently made multiple purchases of SHIB tokens worth over $1.55 million. Over the past 24 hours, the whale added SHIB tokens through three different transactions.","This buying activity happened while the SHIB community continued its token burn campaign, which resulted in over 2 million SHIB tokens being sent to the dead wallet within the same timeframe.","The Shiba Inu whale began its buying by acquiring a smaller amount of 16,099,042,840 billion SHIB a few hours prior. Shortly after this, he made a second transaction to purchase 108,040,560,167 SHIB tokens worth over $1.112 million.","The whale continued its buying spree with a third purchase of 26,413,897,870 SHIB tokens worth $272,063. This third transaction took place approximately nine hours later.","This isn’t the first time the 19th-largest SHIB holder has made a large purchase. According to data from Etherscan, the aforementioned whale accumulated more than 168.37 billion Shiba Inu tokens on April 25. The whale initiated the purchase in two transactions worth about $1.72 million.","The whale now possesses 5,178,454,552,701 SHIB tokens, which are valued at approximately $53.33 million.","","Despite the token burning, the Shiba Inu price has remained bearish compared to the other altcoins. At the time of writing this article, SHIB is trading at $0.0000102, with a 24-hour price decline of 1.06%.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/fact-check-crypto-not-propelling-amidst-war/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Despite a strong market sentiment that the Russia-Ukraine war has propelled crypto trading in the region, research shows the contrary. Crypto Not Growing Amidst War According to a recent research from ‘Crystal Blockchain’, Blockchain Analytics firm, crypto trading in the conflict zone has not propelled. In fact the downwards trend in the on-chain activity has …","title":"Fact Check: Crypto Not Propelling Amidst War - CryptoDisrupt","content":["Despite a strong market sentiment that the Russia-Ukraine war has propelled crypto trading in the region, research shows the contrary.","According to a recent research from ‘Crystal Blockchain’, Blockchain Analytics firm, crypto trading in the conflict zone has not propelled. In fact the downwards trend in the on-chain activity has continued.","After Russia invaded Ukraine on February 24, right away people from both the countries began to migrate. While Ukrainians migrated to protect themselves from the inevitable harms of the invasion, Russians fled their country citing economic difficulties they could face due to the sanctions imposed upon Russia.","In the following weeks, Russia got ousted from Swift (Society for Worldwide Interbank Financial Telecommunications), and most of the traditional financial institutions halted their operations in the region.","People’s access to their wealth became difficult on account of which masses belonging to both the countries shifted to crypto, a relatively less decentralized financial ecosystem.","As Russians, particularly, dealt with the sanctions through Crypto, US based crypto exchanges were then also restricted from providing their services to Russia. Binance, CEX.io, and CoinZoom were the first exchanges to stop their operations in Russia.","Despite all of that going on, there is a sentiment in the community that crypto is benefitting from the war, as traditional financial systems failed to fulfill people’s needs . While, during the early days of war, between February 19 and 24, crypto trading did grow by 900% to over $70 million, but since then, the activity has only been declining, with periodic spikes, the firm wrote in a blog post.","So, while it does look plausible that amidst all the financial hazards people are facing in the region, they must be transferring to crypto. But it is not the case, largely because of the sanctions that have even tied the crypto market.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:13:47+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/solana-and-helium-prices-soar-following-migration-announcement/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Earlier today, the Solana network team confirmed that the Helium network would be migrating to Solana on March 27, leading to a surge in prices for both SOL and HNT cryptocurrencies. The move was confirmed after Helium shared updates on the transition via a blog post last Friday. “After months of meticulous planning and technical …","title":"Solana and Helium Prices Soar Following Migration Announcement - CryptoDisrupt","content":["Earlier today, the Solana network team confirmed that the Helium network would be migrating to Solana on March 27, leading to a surge in prices for both SOL and HNT cryptocurrencies. The move was confirmed after Helium shared updates on the transition via a blog post last Friday.","“After months of meticulous planning and technical development, the Helium Foundation is proud to formally propose March 27, 2023, as the migration date to the Solana blockchain”","The migration to the Solana blockchain and deployment of Oracles is being described by Helium as the “most significant upgrade to Helium” yet, with the move set to greatly boost its scalability and reliability. The migration will see the current Helium blockchain halted for 24 hours on the transition date. Once completed, the native cryptocurrency for the Helium network, HNT, will be compatible with Solana’s ecosystem, offering more utilities for Helium users.","In addition, the Helium wallet app will become a Solana wallet, allowing users to access all their HNT tokens and Hotspots on the Solana blockchain. The move is expected to provide Helium users with a more seamless experience on the Solana network.","Following Solana‘s message today, Helium (HNT) saw a jump of nearly 10% to reach $3.22, while Solana (SOL) soared as high as 12% to reach $27. At the time of writing, SOL was trading at $26.42, with a growth of 28.39% in the past seven days, according to data from CoinMarketCap.","Despite its recent attractive growth, SOL is still down 89.85% from its historical all-time high of $260 in November 2021. Nevertheless, the move by Helium to migrate to Solana is seen as a positive development for both networks and is expected to bring more users and investors to the Solana ecosystem.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/despite-ripples-strong-position-in-the-sec-lawsuit-market-sentiment-for-xrp-remains-bearish/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Despite Ripple’s clear lead in the ongoing lawsuit, market sentiment about XRP remains bearish. Market Sentiment Remains Bearish After the SEC filed the lawsuit against Ripple on 22nd December 2022, the initial couple of months were really bad for the firm. But later, thanks to Ripple’s aggressive defence, the firm recovered swiftly. Ripple continued to …","title":"Despite Ripple\u0027s Strong Position in the SEC Lawsuit, Market Sentiment for XRP Remains Bearish - CryptoDisrupt","content":["Despite Ripple’s clear lead in the ongoing lawsuit, market sentiment about XRP remains bearish.","After the SEC filed the lawsuit against Ripple on 22nd December 2022, the initial couple of months were really bad for the firm. But later, thanks to Ripple’s aggressive defence, the firm recovered swiftly.","Ripple continued to make new partnerships as it also set foot in a few emerging markets I.e. NFTs and CBDCs.","Despite all the positives surrounding Ripple, XRP’s Price does not seem to reflect the firm’s strong market position. In a recent survey featured on Coinmarketcap, community members projected the price XRP will trade at by the end of October. XRP’s median price emerged from the survey is $0.4166, 1.6% below the current price. For November the sentiment is even worse as the median is $0.3826, 9% lower then the current price.","In the past 7-days XRP has outperformed most of the mainstream coins. Despite a 5.7% decrease in the past 24-hours, XRP is still the best performing coin, among the top 10, over the week. In the meantime XRP Gained value by 4.3%.","","Further, in the week XRP has continuously changed hands above $0.40. During the period the average price of the coin has remained $0.47.","Main reason behind the recent dip in XRP’s price is the market bearish trend. Notably, the premier cryptocurrency Bitcoin is currently 7.5% in the day and 1.7% over the week.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:01:15+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/will-the-sec-target-utility-tokens/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Utility tokens can be used to purchase services on a blockchain network, and they do not offer a financial stake in the underlying business or project. From this basic understanding of a utility token, it would put them outside the scope of the US Securities and Exchange Commission (SEC). Unfortunately, the SEC has previously confirmed …","title":"Will the SEC Target Utility Tokens? - CryptoDisrupt","content":["Utility tokens can be used to purchase services on a blockchain network, and they do not offer a financial stake in the underlying business or project. From this basic understanding of a utility token, it would put them outside the scope of the US Securities and Exchange Commission (SEC). Unfortunately, the SEC has previously confirmed that most ICOs for utility tokens should be regarded as securities under the Howey test. It is quite clear that many ICO participants buy tokens in the hope that the value will rise rather than using the token to purchase services on the network.","Ever since the SEC made their initial announcement, in July 2017, the crypto community has been concerned that bitcoin and ethereum could also be considered securities. As most ICOs use ERC20 tokens on the Ethereum network, there was potential for the SEC to close them all down. There are serious consequences for any promoters attempting to sell unregistered securities to US residents.","As reported by Crypto Disrupt on June 14, 2018, the SEC finally confirmed that they don’t consider bitcoin or ethereum to be securities. Although the announcement pushed up the price of all cryptocurrencies, it didn’t increase the price by as much as some pundits were expecting. This may have been due to the bears overshadowing the market since the end of 2017. Another reason for the fairly modest gains could be based on the SECs indication that many utility tokens are still considered to be securities.","According to the release by William Hinman, he emphasizes that “simply labeling a digital asset a “utility token” does not turn the asset into something that is not a security. I recognize that the Supreme Court has acknowledged that if someone is purchasing an asset for consumption only, it is likely not a security. But, the economic substance of the transaction always determines the legal analysis, not the labels. The oranges in Howey had utility. Or in my favorite example, the Commission warned in the late 1960s about investment contracts sold in the form of whisky warehouse receipts. Promoters sold the receipts to U.S. investors to finance the aging and blending processes of Scotch whisky. The whisky was real – and, for some, had exquisite utility. But Howey was not selling oranges and the warehouse receipts promoters were not selling whisky for consumption. They were selling investments, and the purchasers were expecting a return from the promoters’ efforts.”","The SEC decided bitcoin and ethereum are not securities, in part, because it considers them suitably decentralized. As decentralized networks, they feel that the success of the ecosystem is not controlled by a single entity, and therefore, is not a security. Most utility tokens are not decentralized to the level seen by bitcoin and ethereum, and this puts them at risk of SEC control. Projects considering an ICO for their utility token still need to be very careful and should obtain clarification from the SEC before releasing their whitepaper. Part of the SEC announcement provided a list of questions that promoters should review before considering an ICO.","The SEC has stated that this is not to be considered an exhaustive list, but it provides a useful starting point for projects planning an ICO. The SEC might now take a more hard-line stance against the promotion of utility tokens already in circulation or any issued in the future.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:20:02+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/luna-airdrop-takes-place-successfully-as-the-terra-v2-goes-live/","web_url":"https://cryptodisrupt.com/","type":"article","description":"After being delayed for a day, Terra’s new blockchain finally goes live. Amidst all the chaos surrounding Terra its V2 blockchain has finally gone live after getting delayed for a day, due to an unknown event. With the launch of the blockchain, LUNA airdrop has also taken place successfully. Confirmed by Terra through its twitter …","title":"Luna Airdrop Takes Place Successfully as the Terra V2 Goes Live. - CryptoDisrupt","content":["After being delayed for a day, Terra’s new blockchain finally goes live.","Amidst all the chaos surrounding Terra its V2 blockchain has finally gone live after getting delayed for a day, due to an unknown event. With the launch of the blockchain, LUNA airdrop has also taken place successfully.","Confirmed by Terra through its twitter handle the first block on Terra V2 was produced at 6 UTC. As mentioned the launch was accompanied by the new LUNA airdrop. Under the airdrop plan 70% of the tokens will be allocated to investors already holding the old Luna, Lunc, UST or aUST. aUSTs are the UST Stablecoins that were staked in Terra’s flagship DeFi Protocol , Anchor Protocol, which offered investors 20% yields on their staked tokens.","1/ Block 1 of the brand new Terra blockchain (with a chain_id of “Phoenix-1”) has officially been produced at 06:00 AM UTC on May 28th, 2022!","Congratulations to the #LUNAtic community on this expeditious feat of collaboration 🎉","— Terra 🌍 Powered by LUNA 🌕 (@terra_money) May 28, 2022","","Holders of tokens mentioned above could be able to receive their share of new Luna airdrop via Terra’s website. Notably, none of the airdropped tokens are received by the Terraform Labs, the organisation behind the Terra blockchain. After the launch of Terra V2, the old Luna, Lunc and UST tokens were renamed as Luna Classic, Lunc Classic, and UST Classic. At the press time Luna Classic is trading at $16, as per bybit.","The launch of Terra V2 and new Luna airdrop was decided after the drastic fall of Terra. Because the UST was unpegged with dollars on May 18, the LUNA fell virtually to $0 within the next few days.","Later the CEO of Terraform Labs, Do Kwon, put the proposal forward of forking Terra on May 16. While initially the proposal was met with due hesitation, later, as 12 validators signaled to support the forking, the proposal was voted.","Since the downfall of Luna, Do Kwon has been scrutinized all over the globe. Especially in South Korea. As the authorities have reportedly sent Kwon a $78 million fine for tax evasion.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:13:22+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/google-and-bing-help-hackers-to-steal-your-crypto/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Crypto Disrupt has previously reported that Google was responsible for the Binance exchange API hack by presenting the phishing site at the top of their ranked sites. Bing is also responsible for the loss of thousands of litecoins. Crypto Disrupt reported April 23, 2018, that an American litecoin owner had been hacked to the tune …","title":"Google and Bing Help Hackers to Steal Your Crypto - CryptoDisrupt","content":["Crypto Disrupt has previously reported that Google was responsible for the Binance exchange API hack by presenting the phishing site at the top of their ranked sites. Bing is also responsible for the loss of thousands of litecoins. Crypto Disrupt reported April 23, 2018, that an American litecoin owner had been hacked to the tune of $350,000.","When the article was published, there was a suggestion that the hack may have been caused by a compromised Litecoin Cash (LCC) digital wallet. The core LCC development team comprises Tanner, Loxley, Roger, and Michael “Scarlet” Wyszynski. Loxley posted in the GitHub issue, created by the individual that had been hacked, to say that there was very little evidence of a problem with their wallet. Roger has emailed Crypto Disrupt to say,","“We have more than a thousand users that have downloaded our wallet and are experiencing no issues with our wallets. The specific issue you are referring to (extra .jar files) was reported by a single reddit user, and was never able to be reproduced by any of us in the dev team, or any of our community members.”","Roger also pointed out that they recommend all wallet users verify the checksums of the files they download and the checksums are clearly shown on their website.","The mystery of how the coins were stolen has now been solved, and again, we learn that we can’t trust search engines to recommend reputable websites. The individual that was hacked normally uses the Google Chrome web browser, and he checked his history of sites that he had visited when he noticed the coins had disappeared. It turns out that after re-installing Windows 10, he temporarily used the default Microsoft Edge browser and the history shows he downloaded a fake Electrum wallet. The image below shows identical meta details for two different websites with the second one being the fake site. The fake site was registered in Kuala Lumpur on December 12, 2017, and the duplicate content alone should have been enough for Bing’s SERP algorithm to pick it up as a phishing site.","The Edge browser history shows that the default search engine, Bing, brought up this phishing site as one of the top ranked sites for “Electrum LTC.” The phishing site doesn’t have an SSL certificate, and this should have been a red flag to the coin holder.","Reddit has several threads that highlight the particular phishing site, and users have previously notified Google, but not Bing, that it’s a fake site. There is clearly something wrong with the SERP algorithms used by top search engines like Google and Bing if they recommend sites run by hackers.","Despite Google being warned of the phishing site, it still appears as the number one ranked site for a particular search term. Why hasn’t it been removed entirely from their database or flagged as a site run by hackers?","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:21:12+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/blockchain-in-pharmaceuticals-fighting-counterfeit-drugs/","web_url":"https://cryptodisrupt.com/","type":"article","description":"The role of blockchain in pharmaceuticals has long been a topic for discussion, and news has emerged that Pharma giant Merck is currently seeking a patent for a blockchain-based system that would store location coordinates of a particular object and tracks it as it progresses through the supply chain. This process will help verify the …","title":"Blockchain in Pharmaceuticals – Fighting Counterfeit Drugs - CryptoDisrupt","content":["The role of blockchain in pharmaceuticals has long been a topic for discussion, and news has emerged that Pharma giant Merck is currently seeking a patent for a blockchain-based system that would store location coordinates of a particular object and tracks it as it progresses through the supply chain.","This process will help verify the authenticity of the product.","In its patent filing Merck claims that the technology “enables a reliable, secure storage of the reading results with very high data integrity, such that it is essentially impossible to manipulate or erase or otherwise taper [sic] with or lose such data, e.g., due to unintended or deliberate deletion or due to data corruption.”","Merck goes on to explain in further detail – “Furthermore, the stored information can be accessed wherever access to the blockchain is available. This allows for a safe and distributed storage and access to the stored reading results, e.g., for integrity verification purposes such as checking whether a supplier of a product being marked with a composite security marking, as described herein, was, in fact, the originator of the product, or not.”","With internal procedures already in place to deal with counterfeiting, Merck hopes the proposed patent will fit with more comprehensive efforts to prevent counterfeiting on a larger scale.","In a related news article, Associate Director of Applied Technology at Merck & Co, Nissan Kulatilaka commented on blockchain at the MedCity Converge conference in Philadelphia –","“The blockchain is a distributed system where every node has a ledger of everything that happens. You get a new level of transparency where you can verify what happened.”","Merck & Co, known outside the USA and Canada as Merck Sharp & Dohme (MSD) is not the company which applied for the patent. The patent request was made by an unrelated business, with fundamentally the same name, the Merck group, headquartered in Darmstadt, Germany.","“There’s something that’s really cool about having your record follow you wherever you go without needing that data on you at all times. You’re no longer bound to your hospital system.”","Kulatilaka commented that healthcare could be the second-biggest industry to adopt blockchain technology after the financial services sector, but doesn’t see it becoming a huge factor for a few years yet.","A “level of boldness” is required to make sweeping changes within the healthcare industry, but Kulatilaka believes we’ll see blockchain in pharmaceuticals over the next five years.","“It’s a system that best works when you have a lot of different actors in the network, pushing the technology, using the technology,” he said. “But you’re seeing a lot of pressure being put on healthcare.”","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:19:45+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/jimmy-song-on-the-death-of-eos-and-the-problems-with-roger-ver/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Bitcoin developer and entrepreneur, Jimmy Song, has stated that the EOS network will “die in a horrible dumpster fire” within the next five years. He made the remarks in a recent interview while advising young developers to stay away from ICOs and centralized blockchain organizations, instead to contribute towards decentralized currencies and open source projects. Why the …","title":"Jimmy Song on the Death of EOS and the Problems with Roger Ver - CryptoDisrupt","content":["Bitcoin developer and entrepreneur, Jimmy Song, has stated that the EOS network will “die in a horrible dumpster fire” within the next five years. He made the remarks in a recent interview while advising young developers to stay away from ICOs and centralized blockchain organizations, instead to contribute towards decentralized currencies and open source projects.","EOS has been criticized on numerous occasions for centralization issues. The fundamental idea behind decentralized currencies is that power does not reside in the hands of any one group or actor. In the case of EOS, the record-breaking USD 4 Billion ICO funds are held by a Cayman-based for-profit company called Block One. Jimmy Song is not alone in his scathing opinion of the EOS network. Satis Investment Group has released research indicating that EOS will lose 99% of its value within a year, and other figures such as Charlie Shrem have spoken out.","In truth, few cryptocurrencies, aside from Ripple, could defeat the concept of decentralization as clearly as EOS. They have an authority designed to resolve disputes called EOS Core Arbitration Forum (‘ECAF”), which is not altogether different from any other existing regulatory body such as the SEC. The network also has 21 block producers who froze some accounts associated with email scams without any authority. In other words, we have –","Aside from describing EOS as little more than a scam, the Bitcoin developer also agreed that Roger Ver was simply a politician with no interest in truth but merely seeking to score more points than his opponents. Ver is a bitcoin cash advocate who has previously spent ten months in prison for the illegal sale of explosives. Recently, Roger Ver and Jimmy Song had a controversial debate attempt on a yacht which rapidly deteriorated, primarily due to some of Ver’s aggressive techniques to dominate his adversaries.","“To him, control over a particular thing is more important than bringing self-sovereignty to the world or allowing people to control their own money. It’s all about him, that’s what that whole debate was about. It wasn’t about the merits of Bitcoin Cash or any of the actual economic theory, it was about him. He even said during his debate later on with Tone, that he was the one who made Bitcoin popular and he was going to do the same with Bitcoin Cash.”","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:15:57+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/bitcoin-etf-90-chance-of-approval/","web_url":"https://cryptodisrupt.com/","type":"article","description":"The bitcoin ETF is arguably the biggest news in the cryptocurrency industry thus far in 2018. If a bitcoin ETF came to pass, then it would mean a deluge of new investment, opening the floodgates to bitcoin exposure on a scale never before seen. No bitcoin ETFs have yet been approved by the SEC, and …","title":"Bitcoin ETF 90% Chance of Approval - CryptoDisrupt","content":["The bitcoin ETF is arguably the biggest news in the cryptocurrency industry thus far in 2018. If a bitcoin ETF came to pass, then it would mean a deluge of new investment, opening the floodgates to bitcoin exposure on a scale never before seen.","No bitcoin ETFs have yet been approved by the SEC, and the two companies behind the bitcoin ETF have had individual applications previously shut down before joining forces.","According to ICO Journal, the bitcoin ETF has a 90% chance of approval, citing a CFTC official who stated that –","I would call it 90% at this point. The crypto markets have moderated and regulators have watched the lack of drama surrounding Bitcoin futures across several global exchanges…. In January we were justifiably concerned about a bubble and the harm a quickly approved product could attract speculators and create losses that led to significant lawsuits. Now, those factors seem to be mitigated significantly.”","A further source of an SEC official also indicated a positive outcome, using less optimistic and specific language. Additionally, the SEC has opened the topic and has taken in public commentary, which has been over 97% positive, as previously reported by Crypto Disrupt.","The bitcoin ETF was unveiled in June and is called the VanEck SolidX Bitcoin Trust ETF (XBTC). The ETF sponsors are Van Eck (asset management) and Solid X (blockchain). The product will track an index linked to bitcoin trading desks. Though the fund will increase exposure, it is still targeted at institutional investors with a share price of $200,000.","But if this ETF is given the green light, then more bitcoin ETFs will soon come to the market. If approved, the product will most likely be listed on the Chicago Board of Exchange (CBOE).","A potential cause for concern raised by a very small number of commenters is that if the bitcoin price is indeed manipulated, then a bitcoin ETF linked to specific bitcoin trading desks would exacerbate the problem. The CBOE was the exchange where bitcoin futures were first launched when bitcoin was at its peak in December 2017, before starting its downward spiral.","An ETF (exchange traded fund) is a security that tracks another fund, such as an index fund, or any basket of assets. It trades like a stock on an exchange, with higher liquidity and lower fees. Lower fees, higher liquidity, and market access mean that a bitcoin ETF would make cryptocurrency accessible to a much larger audience. The product would also be insured against theft, fraud, and loss.","Shareholders in an ETF do not directly own the underlying instruments but have a form of indirect ownership. They are entitled to a percentage of the profits on the underlying assets appreciation.","While it is commonly believed that August 10th is the deadline for approval, the final decision will likely not be made on this date, and the earliest the decision will be announced is August 16th.","But all of the signs are pointing towards regulatory approval, and it is now a question of when, not if. It is more positive news in the crypto sphere, alongside a market bull run.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:17:15+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/solana-and-helium-prices-soar-following-migration-announcement/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Earlier today, the Solana network team confirmed that the Helium network would be migrating to Solana on March 27, leading to a surge in prices for both SOL and HNT cryptocurrencies. The move was confirmed after Helium shared updates on the transition via a blog post last Friday. “After months of meticulous planning and technical …","title":"Solana and Helium Prices Soar Following Migration Announcement - CryptoDisrupt","content":["Earlier today, the Solana network team confirmed that the Helium network would be migrating to Solana on March 27, leading to a surge in prices for both SOL and HNT cryptocurrencies. The move was confirmed after Helium shared updates on the transition via a blog post last Friday.","“After months of meticulous planning and technical development, the Helium Foundation is proud to formally propose March 27, 2023, as the migration date to the Solana blockchain”","The migration to the Solana blockchain and deployment of Oracles is being described by Helium as the “most significant upgrade to Helium” yet, with the move set to greatly boost its scalability and reliability. The migration will see the current Helium blockchain halted for 24 hours on the transition date. Once completed, the native cryptocurrency for the Helium network, HNT, will be compatible with Solana’s ecosystem, offering more utilities for Helium users.","In addition, the Helium wallet app will become a Solana wallet, allowing users to access all their HNT tokens and Hotspots on the Solana blockchain. The move is expected to provide Helium users with a more seamless experience on the Solana network.","Following Solana‘s message today, Helium (HNT) saw a jump of nearly 10% to reach $3.22, while Solana (SOL) soared as high as 12% to reach $27. At the time of writing, SOL was trading at $26.42, with a growth of 28.39% in the past seven days, according to data from CoinMarketCap.","Despite its recent attractive growth, SOL is still down 89.85% from its historical all-time high of $260 in November 2021. Nevertheless, the move by Helium to migrate to Solana is seen as a positive development for both networks and is expected to bring more users and investors to the Solana ecosystem.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/jimmy-song-on-the-death-of-eos-and-the-problems-with-roger-ver/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Bitcoin developer and entrepreneur, Jimmy Song, has stated that the EOS network will “die in a horrible dumpster fire” within the next five years. He made the remarks in a recent interview while advising young developers to stay away from ICOs and centralized blockchain organizations, instead to contribute towards decentralized currencies and open source projects. Why the …","title":"Jimmy Song on the Death of EOS and the Problems with Roger Ver - CryptoDisrupt","content":["Bitcoin developer and entrepreneur, Jimmy Song, has stated that the EOS network will “die in a horrible dumpster fire” within the next five years. He made the remarks in a recent interview while advising young developers to stay away from ICOs and centralized blockchain organizations, instead to contribute towards decentralized currencies and open source projects.","EOS has been criticized on numerous occasions for centralization issues. The fundamental idea behind decentralized currencies is that power does not reside in the hands of any one group or actor. In the case of EOS, the record-breaking USD 4 Billion ICO funds are held by a Cayman-based for-profit company called Block One. Jimmy Song is not alone in his scathing opinion of the EOS network. Satis Investment Group has released research indicating that EOS will lose 99% of its value within a year, and other figures such as Charlie Shrem have spoken out.","In truth, few cryptocurrencies, aside from Ripple, could defeat the concept of decentralization as clearly as EOS. They have an authority designed to resolve disputes called EOS Core Arbitration Forum (‘ECAF”), which is not altogether different from any other existing regulatory body such as the SEC. The network also has 21 block producers who froze some accounts associated with email scams without any authority. In other words, we have –","Aside from describing EOS as little more than a scam, the Bitcoin developer also agreed that Roger Ver was simply a politician with no interest in truth but merely seeking to score more points than his opponents. Ver is a bitcoin cash advocate who has previously spent ten months in prison for the illegal sale of explosives. Recently, Roger Ver and Jimmy Song had a controversial debate attempt on a yacht which rapidly deteriorated, primarily due to some of Ver’s aggressive techniques to dominate his adversaries.","“To him, control over a particular thing is more important than bringing self-sovereignty to the world or allowing people to control their own money. It’s all about him, that’s what that whole debate was about. It wasn’t about the merits of Bitcoin Cash or any of the actual economic theory, it was about him. He even said during his debate later on with Tone, that he was the one who made Bitcoin popular and he was going to do the same with Bitcoin Cash.”","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:15:57+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/fact-check-crypto-not-propelling-amidst-war/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Despite a strong market sentiment that the Russia-Ukraine war has propelled crypto trading in the region, research shows the contrary. Crypto Not Growing Amidst War According to a recent research from ‘Crystal Blockchain’, Blockchain Analytics firm, crypto trading in the conflict zone has not propelled. In fact the downwards trend in the on-chain activity has …","title":"Fact Check: Crypto Not Propelling Amidst War - CryptoDisrupt","content":["Despite a strong market sentiment that the Russia-Ukraine war has propelled crypto trading in the region, research shows the contrary.","According to a recent research from ‘Crystal Blockchain’, Blockchain Analytics firm, crypto trading in the conflict zone has not propelled. In fact the downwards trend in the on-chain activity has continued.","After Russia invaded Ukraine on February 24, right away people from both the countries began to migrate. While Ukrainians migrated to protect themselves from the inevitable harms of the invasion, Russians fled their country citing economic difficulties they could face due to the sanctions imposed upon Russia.","In the following weeks, Russia got ousted from Swift (Society for Worldwide Interbank Financial Telecommunications), and most of the traditional financial institutions halted their operations in the region.","People’s access to their wealth became difficult on account of which masses belonging to both the countries shifted to crypto, a relatively less decentralized financial ecosystem.","As Russians, particularly, dealt with the sanctions through Crypto, US based crypto exchanges were then also restricted from providing their services to Russia. Binance, CEX.io, and CoinZoom were the first exchanges to stop their operations in Russia.","Despite all of that going on, there is a sentiment in the community that crypto is benefitting from the war, as traditional financial systems failed to fulfill people’s needs . While, during the early days of war, between February 19 and 24, crypto trading did grow by 900% to over $70 million, but since then, the activity has only been declining, with periodic spikes, the firm wrote in a blog post.","So, while it does look plausible that amidst all the financial hazards people are facing in the region, they must be transferring to crypto. But it is not the case, largely because of the sanctions that have even tied the crypto market.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:13:47+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/despite-ripples-strong-position-in-the-sec-lawsuit-market-sentiment-for-xrp-remains-bearish/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Despite Ripple’s clear lead in the ongoing lawsuit, market sentiment about XRP remains bearish. Market Sentiment Remains Bearish After the SEC filed the lawsuit against Ripple on 22nd December 2022, the initial couple of months were really bad for the firm. But later, thanks to Ripple’s aggressive defence, the firm recovered swiftly. Ripple continued to …","title":"Despite Ripple\u0027s Strong Position in the SEC Lawsuit, Market Sentiment for XRP Remains Bearish - CryptoDisrupt","content":["Despite Ripple’s clear lead in the ongoing lawsuit, market sentiment about XRP remains bearish.","After the SEC filed the lawsuit against Ripple on 22nd December 2022, the initial couple of months were really bad for the firm. But later, thanks to Ripple’s aggressive defence, the firm recovered swiftly.","Ripple continued to make new partnerships as it also set foot in a few emerging markets I.e. NFTs and CBDCs.","Despite all the positives surrounding Ripple, XRP’s Price does not seem to reflect the firm’s strong market position. In a recent survey featured on Coinmarketcap, community members projected the price XRP will trade at by the end of October. XRP’s median price emerged from the survey is $0.4166, 1.6% below the current price. For November the sentiment is even worse as the median is $0.3826, 9% lower then the current price.","In the past 7-days XRP has outperformed most of the mainstream coins. Despite a 5.7% decrease in the past 24-hours, XRP is still the best performing coin, among the top 10, over the week. In the meantime XRP Gained value by 4.3%.","","Further, in the week XRP has continuously changed hands above $0.40. During the period the average price of the coin has remained $0.47.","Main reason behind the recent dip in XRP’s price is the market bearish trend. Notably, the premier cryptocurrency Bitcoin is currently 7.5% in the day and 1.7% over the week.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:01:15+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/fact-check-crypto-not-propelling-amidst-war/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Despite a strong market sentiment that the Russia-Ukraine war has propelled crypto trading in the region, research shows the contrary. Crypto Not Growing Amidst War According to a recent research from ‘Crystal Blockchain’, Blockchain Analytics firm, crypto trading in the conflict zone has not propelled. In fact the downwards trend in the on-chain activity has …","title":"Fact Check: Crypto Not Propelling Amidst War - CryptoDisrupt","content":["Despite a strong market sentiment that the Russia-Ukraine war has propelled crypto trading in the region, research shows the contrary.","According to a recent research from ‘Crystal Blockchain’, Blockchain Analytics firm, crypto trading in the conflict zone has not propelled. In fact the downwards trend in the on-chain activity has continued.","After Russia invaded Ukraine on February 24, right away people from both the countries began to migrate. While Ukrainians migrated to protect themselves from the inevitable harms of the invasion, Russians fled their country citing economic difficulties they could face due to the sanctions imposed upon Russia.","In the following weeks, Russia got ousted from Swift (Society for Worldwide Interbank Financial Telecommunications), and most of the traditional financial institutions halted their operations in the region.","People’s access to their wealth became difficult on account of which masses belonging to both the countries shifted to crypto, a relatively less decentralized financial ecosystem.","As Russians, particularly, dealt with the sanctions through Crypto, US based crypto exchanges were then also restricted from providing their services to Russia. Binance, CEX.io, and CoinZoom were the first exchanges to stop their operations in Russia.","Despite all of that going on, there is a sentiment in the community that crypto is benefitting from the war, as traditional financial systems failed to fulfill people’s needs . While, during the early days of war, between February 19 and 24, crypto trading did grow by 900% to over $70 million, but since then, the activity has only been declining, with periodic spikes, the firm wrote in a blog post.","So, while it does look plausible that amidst all the financial hazards people are facing in the region, they must be transferring to crypto. But it is not the case, largely because of the sanctions that have even tied the crypto market.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:13:47+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/shiba-inu-whale-goes-on-a-buying-spree-purchases-shib-worth-over-1-55m/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"In the past 24 hours, a prominent Shiba Inu whale bought SHIB tokens worth more than $1.55 million in three separate transactions. This purchase coincided with a significant token burn by the SHIB community, which saw over 2 million SHIB tokens sent to the dead wallet during the same timeframe. Despite the token burning, the …","title":"Shiba Inu Whale Goes on a Buying Spree: Purchases SHIB Worth Over $1.55M - CryptoDisrupt","content":["In the past 24 hours, a prominent Shiba Inu whale bought SHIB tokens worth more than $1.55 million in three separate transactions. This purchase coincided with a significant token burn by the SHIB community, which saw over 2 million SHIB tokens sent to the dead wallet during the same timeframe.","Despite the token burning, the price of Shiba Inu remains bearish compared to the broader cryptocurrency market cap.","According to Etherscan data, a top Shiba Inu whale has recently made multiple purchases of SHIB tokens worth over $1.55 million. Over the past 24 hours, the whale added SHIB tokens through three different transactions.","This buying activity happened while the SHIB community continued its token burn campaign, which resulted in over 2 million SHIB tokens being sent to the dead wallet within the same timeframe.","The Shiba Inu whale began its buying by acquiring a smaller amount of 16,099,042,840 billion SHIB a few hours prior. Shortly after this, he made a second transaction to purchase 108,040,560,167 SHIB tokens worth over $1.112 million.","The whale continued its buying spree with a third purchase of 26,413,897,870 SHIB tokens worth $272,063. This third transaction took place approximately nine hours later.","This isn’t the first time the 19th-largest SHIB holder has made a large purchase. According to data from Etherscan, the aforementioned whale accumulated more than 168.37 billion Shiba Inu tokens on April 25. The whale initiated the purchase in two transactions worth about $1.72 million.","The whale now possesses 5,178,454,552,701 SHIB tokens, which are valued at approximately $53.33 million.","","Despite the token burning, the Shiba Inu price has remained bearish compared to the other altcoins. At the time of writing this article, SHIB is trading at $0.0000102, with a 24-hour price decline of 1.06%.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/bitcoin-as-legal-tender-el-salvadors-bold-economic-blueprint/","web_url":"https://cryptodisrupt.com/","type":"article","description":"In the wake of upcoming elections, El Salvador under President Nayib Bukele’s leadership, is set to continue its pioneering journey with Bitcoin as legal tender. This decision comes despite the International Monetary Fund’s (IMF) suggestion to reconsider the cryptocurrency’s status amidst financial negotiations. Vice President Felix Ulloa has confirmed the nation’s unwavering support for Bitcoin, …","title":"Bitcoin as Legal Tender: El Salvador\u0027s Bold Economic Blueprint - CryptoDisrupt","content":["In the wake of upcoming elections, El Salvador under President Nayib Bukele’s leadership, is set to continue its pioneering journey with Bitcoin as legal tender.","This decision comes despite the International Monetary Fund’s (IMF) suggestion to reconsider the cryptocurrency’s status amidst financial negotiations. Vice President Felix Ulloa has confirmed the nation’s unwavering support for Bitcoin, signaling a future where digital currency plays a central role in El Salvador’s economy.","“Bitcoin will remain legal tender in El Salvador under President Nayib Bukele’s second term,” affirmed by the Vice President, marking a significant stance against the International Monetary Fund’s (IMF) suggestions to reconsider the cryptocurrency’s legal status.","This declaration underscores El Salvador’s commitment to pioneering in the digital currency space, despite international pressures.","The government’s dedication to fostering a crypto-friendly environment is evident in its plans for “Bitcoin City, a tax-free crypto refuge,” and the innovative approach of offering “passports for investors who invest $1 million in cryptocurrency.”","These initiatives reflect a strategic move to attract global crypto investment and establish El Salvador as a leading nation in cryptocurrency adoption.","With the upcoming elections, the administration’s popularity, bolstered by a “brutal gang crackdown,” seems to secure President Bukele a second term.","The Vice President’s reiteration of Bitcoin’s legal status days before the election serves as a reassurance of the government’s direction towards embracing digital currency, despite potential financial and international challenges.","The Vice President’s statement,","“Not only will it (the law) be maintained… At this moment, it enjoys the greatest credibility in the entire world,”","highlights the international recognition and credibility El Salvador’s Bitcoin policy has achieved. This is further supported by the government’s plans to issue “bitcoin-backed bonds in the first quarter of 2024,” showcasing a forward-thinking approach to national economic development.","El Salvador’s unwavering commitment to Bitcoin, articulated through official statements and strategic initiatives, sets a precedent for how nations might leverage digital currencies for economic innovation and growth. As El Salvador continues on this path, the world watches closely, recognizing the potential impacts and opportunities that such a bold financial experiment may bring to the global economic landscape.","","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2024-02-01T11:44:27+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/a-crucial-ripple-entity-announces-cessation-of-its-operations/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Coil, a company that was heavily backed by Ripple and played a significant role in the XRP ecosystem, has announced that it will be ending its operations. The company, led by CEO Stefan Thomas, was one of the three providers of Unique Node Lists (UNLs) for the XRPL alongside Ripple and the XRP Ledger Foundation. …","title":"A Crucial Ripple Entity Announces Cessation of its Operations - CryptoDisrupt","content":["Coil, a company that was heavily backed by Ripple and played a significant role in the XRP ecosystem, has announced that it will be ending its operations. The company, led by CEO Stefan Thomas, was one of the three providers of Unique Node Lists (UNLs) for the XRPL alongside Ripple and the XRP Ledger Foundation. In a series of tweets, Thomas stated that while the company is ending operations, it is not saying goodbye entirely, and has transferred its responsibilities related to the Interledger Protocol (ILP) to the Interledger Foundation. This transition is set to take place on March 15, 2023, when all Coil products and development efforts will come to an end.","This is farewell but not goodbye. Today, @Coil is sunsetting. I would like to thank the team that made Coil what it is, helped create the @Interledger Foundation, and an ecosystem around it.","Of course I\u0027m sad. But the work continues. 1/","Letter & FAQ @ https://t.co/JAVcJGh7GS pic.twitter.com/z75QDnjRRo","— Stefan Thomas (@justmoon) February 2, 2023","","In 2019, Coil received a major investment from Ripple’s Xpring division, which provided one billion XRP, worth approximately $260 million at the time. The funds were aimed at supporting the creation and promotion of ways to monetize digital content on the XRP Ledger. The company’s website states that the strategy of offering memberships was a short-term solution to help establish Web Monetization as the first open standard for content creators and developers to generate revenue on the internet.","Despite the end of Coil, Stefan Thomas will continue working on the Interledger project as the chairman of the board for the Interledger Foundation. Thomas has now shifted his focus to a new open-source project named Dassie, which merges the Interledger Protocol (ILP) with peer-to-peer technology. This new effort aims to simplify the process for developers to test and create on the Interledger. With over ten years of experience in XRP-related initiatives, Thomas is proud to be part of a community that prioritises practical solutions and advancements over sensationalism and beliefs.","According to a statement from Coil, the ILP has already been effectively used by a small group of early adopters. The CEO of Coil emphasised that the work on the Interledger will continue and the Interledger Foundation will be responsible for driving the project forward. Thomas is developing Dassie, a platform that will allow developers to establish nodes and process small payments using the Interledger Protocol. The company believes that full-featured Interledger wallets will be available soon and will support Web Monetization and other use cases.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"","tag":"","author":""}
{"url":"https://cryptodisrupt.com/google-and-bing-help-hackers-to-steal-your-crypto/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Crypto Disrupt has previously reported that Google was responsible for the Binance exchange API hack by presenting the phishing site at the top of their ranked sites. Bing is also responsible for the loss of thousands of litecoins. Crypto Disrupt reported April 23, 2018, that an American litecoin owner had been hacked to the tune …","title":"Google and Bing Help Hackers to Steal Your Crypto - CryptoDisrupt","content":["Crypto Disrupt has previously reported that Google was responsible for the Binance exchange API hack by presenting the phishing site at the top of their ranked sites. Bing is also responsible for the loss of thousands of litecoins. Crypto Disrupt reported April 23, 2018, that an American litecoin owner had been hacked to the tune of $350,000.","When the article was published, there was a suggestion that the hack may have been caused by a compromised Litecoin Cash (LCC) digital wallet. The core LCC development team comprises Tanner, Loxley, Roger, and Michael “Scarlet” Wyszynski. Loxley posted in the GitHub issue, created by the individual that had been hacked, to say that there was very little evidence of a problem with their wallet. Roger has emailed Crypto Disrupt to say,","“We have more than a thousand users that have downloaded our wallet and are experiencing no issues with our wallets. The specific issue you are referring to (extra .jar files) was reported by a single reddit user, and was never able to be reproduced by any of us in the dev team, or any of our community members.”","Roger also pointed out that they recommend all wallet users verify the checksums of the files they download and the checksums are clearly shown on their website.","The mystery of how the coins were stolen has now been solved, and again, we learn that we can’t trust search engines to recommend reputable websites. The individual that was hacked normally uses the Google Chrome web browser, and he checked his history of sites that he had visited when he noticed the coins had disappeared. It turns out that after re-installing Windows 10, he temporarily used the default Microsoft Edge browser and the history shows he downloaded a fake Electrum wallet. The image below shows identical meta details for two different websites with the second one being the fake site. The fake site was registered in Kuala Lumpur on December 12, 2017, and the duplicate content alone should have been enough for Bing’s SERP algorithm to pick it up as a phishing site.","The Edge browser history shows that the default search engine, Bing, brought up this phishing site as one of the top ranked sites for “Electrum LTC.” The phishing site doesn’t have an SSL certificate, and this should have been a red flag to the coin holder.","Reddit has several threads that highlight the particular phishing site, and users have previously notified Google, but not Bing, that it’s a fake site. There is clearly something wrong with the SERP algorithms used by top search engines like Google and Bing if they recommend sites run by hackers.","Despite Google being warned of the phishing site, it still appears as the number one ranked site for a particular search term. Why hasn’t it been removed entirely from their database or flagged as a site run by hackers?","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:21:12+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/best-basic-attention-token-bat-wallets/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Looking for best Basic Attention Token BAT wallet 2023 to store your BAT coin? we have complied a list of best bat wallet 2023 for you to take a look.","title":"9 Best Basic Attention Token (BAT) Wallets 2023 [UPDATED]","content":["Table of Contents","Brave Attention Token (BAT) is basically ERC20 token which is based on Ethereum blockchain technology. The main focus of the founder of BAT coin was to disrupt the online advertising domain with the span of time BAT become the most popular in the crypto market.","In this article, CryptoDisrupt Team will discover the best BAT wallets. The Brave internet browser exactly knows and tracks where users spend their time. It develops an obvious, transparent, and efficient digital advertising market with the help of blockchain technology.","Best Basic Attention Token Wallets 2023 to Store your BAT coins","Atomic Wallet is free to use a non-custodial cryptocurrency wallet that supports all ERC-20 tokens. You can create and open Atomic wallet via different operating systems such as macOS, Windows, Linux, Android, and iOS. The most interesting and reputed feature is atomic swaps on the part of this wallet which allows you to swap cryptocurrencies. The build-in exchange option lets you convert a number of cryptocurrencies using the platform of Atomic Wallet.","","The team behind the project is highly professional and reputed in the crypto community. The interface is best for new babies as well as for professional ones. The wallet also has its native token that is also an ERC-20 token.","Ledger wallet is basically one of the best hardware wallet. It is designed to store cryptocurrencies with massive security features. Crypto traders and investors passionately use ledger wallets for their cryptocurrency also praised by them.","The ledger company which developed this wallet has exposure in creating security solutions for crypto and blockchain. It was founded in 2014 and has offices in San Francisco, Paris along with the team of approx. 130 employees.","Fortunately, the company has successfully raised investments of $85 million. If we talk about the user interface of the wallet it is very simple and easy to use. Ledger supports several coins such as Bitgo, MyEtherWallet, Copay and some others as well. Also Read: Best Algorand Wallets","We are talking the best wallet for BAT token and Trezor is one of them. The wallet was launched in 2014 by a tech firm that has produced many innovative products in the domain of cryptocurrency.","","It has two products namely Trezor Model T and Trezor One that support a variety of crypto along with safety online. It is cheaper than other wallets. Trezor is very easy and simple to use especially for beginners.","It has a unique feature you can easily recover your money or funds if you lost your device. Trezor is a very safe and transparent platform through this, users can easily track their activities, the wallet supports thousands of coins.","When it comes to ERC20 tokens such as BAT and many others. MyEtherWallet is the best wallet to secure our tokens. MyEtherWallet allows users to create new wallets and keep store all tokens which are built on the standards of ERC-20.","It provides you the backup of all the tokens and wallet also encourage in-wallets swap like fiat currency into cryptocurrency, Ethereum to bitcoin, Ethereum to ERC20 tokens. Without creating any exchange account, you can convert BAT tokens into other tokens. So, if you are a newbie and looking to secure BAT token MEW is a reliable web wallet for you. Also Read: Best Kusama Wallets","The brave wallet has developed and officially launched by CEO Brendan Eich. It is one of the best crypto wallets for BAT tokens. The Brave is totally free for its user’s means users don’t need to pay for receiving and storing BAT coins.","The very first step to get started is to download the brave browser. After downloading the brave browser, you can easily add the BAT token. Brave joins hand with authorize publishers to empower users and helps them to earn more revenue than the traditional way of advertising.","With the help of the BAT wallet, you can conveniently add funds with BTC, LTC, Eth, or BAT through a transfer to the wallets and the most important thing is that BAT wallets ultimately transfer non-BAT funds sent to the wallet and keep the balance in the BAT. You can easily convert fiat currency into BAT by using several exchanges along with network fees applied.","Meta mask is another crypto wallet basically it is a browser-based wallet that supports ERC20 token. It is compatible with almost all browsers like Opera, Mozilla Firefox, and google chrome.","MetaMask is a very essential tool for blockchain enthusiasts, newcomers, traders, and developers. It allows you a unique feature to keep back up of your account and ultimately. The most important thing is its metrics collection takes a solid stance on user privacy and security.","Let me introduce you with one more feature that secure identity vault means an interface that can be used to manage your identity on different websites.","Security of data, information, and funds is the very first priority of any user. Guarda’s wallet fulfills all these things very effectively and efficiently. Guarda supports an organic and diverse range of tokens and cryptocurrencies.","It is an online-based wallet compatible with various platforms such as Linux desktop, Macintosh, and windows. A smartphone app is also available for both IOS and Android users. The option of banking cards not only inside the wallet but is available on the website as well.","The interface of Guarda is not very complex but easy and very simple to use. It supports more than 45 cryptocurrencies and a lot of fiat currencies for the empowerment of crypto. Some most popular cryptocurrencies Like BTG, BTC, ETH, ERC20 tokens, and others.","Exodus is a desktop-based wallet with an insightful user interface. It allows users to manage BAT tokens conveniently. It is compatible with Linux, macOS, and Windows systems.","Exodus not only supports the BAT token but 100 other cryptocurrencies as well. Exodus officially launched in July 2016 and continuously increasing its user base. it has three main essentials which include the portfolio section, wallet itself, and exchange integration.","It is very easy and simple to use. Exodus wallet offers users a quick way of accessing their funds, receive and send coins also helps them in tracking the transactions. It also supports you to filter out all the transactions like sent, exchanged, and received.","Exodus considers as multi-asset wallet because of the support of some most popular ones such as Bitcoin, Ethereum, Ethereum Classic, Bitcoin Cash, Bitcoin Gold, and many more. User’s privacy, data, and private keys safety are the top priority of the Exodus wallet.","Trust wallet is a very popular wallet and continuously getting its exposure. It is a (BAT) Basic Attention Token wallet that is available only for smartphone users.","","It supports and allows its users to manage ERC223, ERC20, and various coins like Bitcoin, Monero, Binance Coin, Litecoin, Dash, Bitcoin Cash. Through Trust wallet, users can easily interact with Ethereum blockchain directly.","Private keys of users stored locally and secured with several layers of protection and security. Binance officially takes over the trust wallet, through this Trust Wallet is getting more credibility. It allows users to swap their coins instantly on the decentralized exchange.","You can easily secure the BAT token on an exchange like Binance. I hope after reading this article you must become aware of the best BAT wallets and their availability in the market and features as well.","The brave wallet brings a ledger system onboard allows user attention and incentivized the publishers properly. I hope this article is worth reading for you. We will be looking forward to your kind suggestions and feedback.","Individuals can easily earn BAT coin by simply using the brave browser within a browser you get the brave ads and earn the free BAT coin or you can earn BAT coin free by just using the publish0x platform.","As we have discovered the best basic attention token wallets each have their own uniqueness and compatibility but the best one in my perception is Myetherwallet as a crypto passionate I personally use this wallet and recommend you all to secure your assets","If we talk about the best hardware wallet to secure our BAT coins ledger and Trezor are the best options for this purpose.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-10-02T06:08:03+00:00","tag":"best basic attention token wallet","author":""}
{"url":"https://cryptodisrupt.com/in-a-recent-release-meta-announce-launch-of-its-nft-marketplace-on-instagram/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Meta, the company that owns two of the world’s most widely used social media apps; Facebook and Instagram, has recently announced the launch of its NFT marketplace. The press release stated that in the near future users will be able to create/mint, showcase and sell digital collectibles using Instagram. Meta noted, the creation of an …","title":"In a Recent Release Meta Announce Launch of Its NFT Marketplace on Instagram - CryptoDisrupt","content":["Meta, the company that owns two of the world’s most widely used social media apps; Facebook and Instagram, has recently announced the launch of its NFT marketplace.","The press release stated that in the near future users will be able to create/mint, showcase and sell digital collectibles using Instagram. Meta noted, the creation of an NFT (Non-Fungible Tokens) will be done on a polygon blockchain. Whereas, the creators will be provided with an end-to-end toolkit that will assist them in every single phase starting from the creation and showcasing of the NFT to its eventual sale.","Users of the app could be able to support their favourite NFT creations by buying the digital assets directly using Instagram. Meta highlighted that while currently these features are only available to a small group of individuals residing in the United States, it will soon be made available to larger audiences all across the globe.","Meta also mentioned that they are including other blockchains and wallets, namely Solana blockchain and Phantom wallet, in addition to the existing polygon blockchain, to expand the types of digital collectibles that could be minted and traded. The company stated:","“Information for select collections where the metadata has been enriched by OpenSea, such as collection name and descriptions, will now be available on Instagram.”","Meta further went on to state that they are now allowing more people to subscribe on Instagram, specifically in the United States, that helps them in engaging with their audience more deeply.","Earlier, Meta had disclosed in their quarterly report that the company suffered a loss 0f $3.7 billion in the Q3 of the year. However, the CEO Mark Zuckerberg, stated that company’s newly added features, namely Instagram reels and Ai, are seeing good public engagement, which is obviously a positive trend in the long-term.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:12:04+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/luna-airdrop-takes-place-successfully-as-the-terra-v2-goes-live/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"After being delayed for a day, Terra’s new blockchain finally goes live. Amidst all the chaos surrounding Terra its V2 blockchain has finally gone live after getting delayed for a day, due to an unknown event. With the launch of the blockchain, LUNA airdrop has also taken place successfully. Confirmed by Terra through its twitter …","title":"Luna Airdrop Takes Place Successfully as the Terra V2 Goes Live. - CryptoDisrupt","content":["After being delayed for a day, Terra’s new blockchain finally goes live.","Amidst all the chaos surrounding Terra its V2 blockchain has finally gone live after getting delayed for a day, due to an unknown event. With the launch of the blockchain, LUNA airdrop has also taken place successfully.","Confirmed by Terra through its twitter handle the first block on Terra V2 was produced at 6 UTC. As mentioned the launch was accompanied by the new LUNA airdrop. Under the airdrop plan 70% of the tokens will be allocated to investors already holding the old Luna, Lunc, UST or aUST. aUSTs are the UST Stablecoins that were staked in Terra’s flagship DeFi Protocol , Anchor Protocol, which offered investors 20% yields on their staked tokens.","1/ Block 1 of the brand new Terra blockchain (with a chain_id of “Phoenix-1”) has officially been produced at 06:00 AM UTC on May 28th, 2022!","Congratulations to the #LUNAtic community on this expeditious feat of collaboration 🎉","— Terra 🌍 Powered by LUNA 🌕 (@terra_money) May 28, 2022","","Holders of tokens mentioned above could be able to receive their share of new Luna airdrop via Terra’s website. Notably, none of the airdropped tokens are received by the Terraform Labs, the organisation behind the Terra blockchain. After the launch of Terra V2, the old Luna, Lunc and UST tokens were renamed as Luna Classic, Lunc Classic, and UST Classic. At the press time Luna Classic is trading at $16, as per bybit.","The launch of Terra V2 and new Luna airdrop was decided after the drastic fall of Terra. Because the UST was unpegged with dollars on May 18, the LUNA fell virtually to $0 within the next few days.","Later the CEO of Terraform Labs, Do Kwon, put the proposal forward of forking Terra on May 16. While initially the proposal was met with due hesitation, later, as 12 validators signaled to support the forking, the proposal was voted.","Since the downfall of Luna, Do Kwon has been scrutinized all over the globe. Especially in South Korea. As the authorities have reportedly sent Kwon a $78 million fine for tax evasion.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:13:22+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/best-basic-attention-token-bat-wallets/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Looking for best Basic Attention Token BAT wallet 2023 to store your BAT coin? we have complied a list of best bat wallet 2023 for you to take a look.","title":"9 Best Basic Attention Token (BAT) Wallets 2023 [UPDATED]","content":["Table of Contents","Brave Attention Token (BAT) is basically ERC20 token which is based on Ethereum blockchain technology. The main focus of the founder of BAT coin was to disrupt the online advertising domain with the span of time BAT become the most popular in the crypto market.","In this article, CryptoDisrupt Team will discover the best BAT wallets. The Brave internet browser exactly knows and tracks where users spend their time. It develops an obvious, transparent, and efficient digital advertising market with the help of blockchain technology.","Best Basic Attention Token Wallets 2023 to Store your BAT coins","Atomic Wallet is free to use a non-custodial cryptocurrency wallet that supports all ERC-20 tokens. You can create and open Atomic wallet via different operating systems such as macOS, Windows, Linux, Android, and iOS. The most interesting and reputed feature is atomic swaps on the part of this wallet which allows you to swap cryptocurrencies. The build-in exchange option lets you convert a number of cryptocurrencies using the platform of Atomic Wallet.","","The team behind the project is highly professional and reputed in the crypto community. The interface is best for new babies as well as for professional ones. The wallet also has its native token that is also an ERC-20 token.","Ledger wallet is basically one of the best hardware wallet. It is designed to store cryptocurrencies with massive security features. Crypto traders and investors passionately use ledger wallets for their cryptocurrency also praised by them.","The ledger company which developed this wallet has exposure in creating security solutions for crypto and blockchain. It was founded in 2014 and has offices in San Francisco, Paris along with the team of approx. 130 employees.","Fortunately, the company has successfully raised investments of $85 million. If we talk about the user interface of the wallet it is very simple and easy to use. Ledger supports several coins such as Bitgo, MyEtherWallet, Copay and some others as well. Also Read: Best Algorand Wallets","We are talking the best wallet for BAT token and Trezor is one of them. The wallet was launched in 2014 by a tech firm that has produced many innovative products in the domain of cryptocurrency.","","It has two products namely Trezor Model T and Trezor One that support a variety of crypto along with safety online. It is cheaper than other wallets. Trezor is very easy and simple to use especially for beginners.","It has a unique feature you can easily recover your money or funds if you lost your device. Trezor is a very safe and transparent platform through this, users can easily track their activities, the wallet supports thousands of coins.","When it comes to ERC20 tokens such as BAT and many others. MyEtherWallet is the best wallet to secure our tokens. MyEtherWallet allows users to create new wallets and keep store all tokens which are built on the standards of ERC-20.","It provides you the backup of all the tokens and wallet also encourage in-wallets swap like fiat currency into cryptocurrency, Ethereum to bitcoin, Ethereum to ERC20 tokens. Without creating any exchange account, you can convert BAT tokens into other tokens. So, if you are a newbie and looking to secure BAT token MEW is a reliable web wallet for you. Also Read: Best Kusama Wallets","The brave wallet has developed and officially launched by CEO Brendan Eich. It is one of the best crypto wallets for BAT tokens. The Brave is totally free for its user’s means users don’t need to pay for receiving and storing BAT coins.","The very first step to get started is to download the brave browser. After downloading the brave browser, you can easily add the BAT token. Brave joins hand with authorize publishers to empower users and helps them to earn more revenue than the traditional way of advertising.","With the help of the BAT wallet, you can conveniently add funds with BTC, LTC, Eth, or BAT through a transfer to the wallets and the most important thing is that BAT wallets ultimately transfer non-BAT funds sent to the wallet and keep the balance in the BAT. You can easily convert fiat currency into BAT by using several exchanges along with network fees applied.","Meta mask is another crypto wallet basically it is a browser-based wallet that supports ERC20 token. It is compatible with almost all browsers like Opera, Mozilla Firefox, and google chrome.","MetaMask is a very essential tool for blockchain enthusiasts, newcomers, traders, and developers. It allows you a unique feature to keep back up of your account and ultimately. The most important thing is its metrics collection takes a solid stance on user privacy and security.","Let me introduce you with one more feature that secure identity vault means an interface that can be used to manage your identity on different websites.","Security of data, information, and funds is the very first priority of any user. Guarda’s wallet fulfills all these things very effectively and efficiently. Guarda supports an organic and diverse range of tokens and cryptocurrencies.","It is an online-based wallet compatible with various platforms such as Linux desktop, Macintosh, and windows. A smartphone app is also available for both IOS and Android users. The option of banking cards not only inside the wallet but is available on the website as well.","The interface of Guarda is not very complex but easy and very simple to use. It supports more than 45 cryptocurrencies and a lot of fiat currencies for the empowerment of crypto. Some most popular cryptocurrencies Like BTG, BTC, ETH, ERC20 tokens, and others.","Exodus is a desktop-based wallet with an insightful user interface. It allows users to manage BAT tokens conveniently. It is compatible with Linux, macOS, and Windows systems.","Exodus not only supports the BAT token but 100 other cryptocurrencies as well. Exodus officially launched in July 2016 and continuously increasing its user base. it has three main essentials which include the portfolio section, wallet itself, and exchange integration.","It is very easy and simple to use. Exodus wallet offers users a quick way of accessing their funds, receive and send coins also helps them in tracking the transactions. It also supports you to filter out all the transactions like sent, exchanged, and received.","Exodus considers as multi-asset wallet because of the support of some most popular ones such as Bitcoin, Ethereum, Ethereum Classic, Bitcoin Cash, Bitcoin Gold, and many more. User’s privacy, data, and private keys safety are the top priority of the Exodus wallet.","Trust wallet is a very popular wallet and continuously getting its exposure. It is a (BAT) Basic Attention Token wallet that is available only for smartphone users.","","It supports and allows its users to manage ERC223, ERC20, and various coins like Bitcoin, Monero, Binance Coin, Litecoin, Dash, Bitcoin Cash. Through Trust wallet, users can easily interact with Ethereum blockchain directly.","Private keys of users stored locally and secured with several layers of protection and security. Binance officially takes over the trust wallet, through this Trust Wallet is getting more credibility. It allows users to swap their coins instantly on the decentralized exchange.","You can easily secure the BAT token on an exchange like Binance. I hope after reading this article you must become aware of the best BAT wallets and their availability in the market and features as well.","The brave wallet brings a ledger system onboard allows user attention and incentivized the publishers properly. I hope this article is worth reading for you. We will be looking forward to your kind suggestions and feedback.","Individuals can easily earn BAT coin by simply using the brave browser within a browser you get the brave ads and earn the free BAT coin or you can earn BAT coin free by just using the publish0x platform.","As we have discovered the best basic attention token wallets each have their own uniqueness and compatibility but the best one in my perception is Myetherwallet as a crypto passionate I personally use this wallet and recommend you all to secure your assets","If we talk about the best hardware wallet to secure our BAT coins ledger and Trezor are the best options for this purpose.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-10-02T06:08:03+00:00","tag":"best basic attention token wallet","author":""}
{"url":"https://cryptodisrupt.com/in-a-recent-release-meta-announce-launch-of-its-nft-marketplace-on-instagram/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Meta, the company that owns two of the world’s most widely used social media apps; Facebook and Instagram, has recently announced the launch of its NFT marketplace. The press release stated that in the near future users will be able to create/mint, showcase and sell digital collectibles using Instagram. Meta noted, the creation of an …","title":"In a Recent Release Meta Announce Launch of Its NFT Marketplace on Instagram - CryptoDisrupt","content":["Meta, the company that owns two of the world’s most widely used social media apps; Facebook and Instagram, has recently announced the launch of its NFT marketplace.","The press release stated that in the near future users will be able to create/mint, showcase and sell digital collectibles using Instagram. Meta noted, the creation of an NFT (Non-Fungible Tokens) will be done on a polygon blockchain. Whereas, the creators will be provided with an end-to-end toolkit that will assist them in every single phase starting from the creation and showcasing of the NFT to its eventual sale.","Users of the app could be able to support their favourite NFT creations by buying the digital assets directly using Instagram. Meta highlighted that while currently these features are only available to a small group of individuals residing in the United States, it will soon be made available to larger audiences all across the globe.","Meta also mentioned that they are including other blockchains and wallets, namely Solana blockchain and Phantom wallet, in addition to the existing polygon blockchain, to expand the types of digital collectibles that could be minted and traded. The company stated:","“Information for select collections where the metadata has been enriched by OpenSea, such as collection name and descriptions, will now be available on Instagram.”","Meta further went on to state that they are now allowing more people to subscribe on Instagram, specifically in the United States, that helps them in engaging with their audience more deeply.","Earlier, Meta had disclosed in their quarterly report that the company suffered a loss 0f $3.7 billion in the Q3 of the year. However, the CEO Mark Zuckerberg, stated that company’s newly added features, namely Instagram reels and Ai, are seeing good public engagement, which is obviously a positive trend in the long-term.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:12:04+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/google-and-bing-help-hackers-to-steal-your-crypto/#go-to-tie-body","web_url":"https://cryptodisrupt.com/","type":"article","description":"Crypto Disrupt has previously reported that Google was responsible for the Binance exchange API hack by presenting the phishing site at the top of their ranked sites. Bing is also responsible for the loss of thousands of litecoins. Crypto Disrupt reported April 23, 2018, that an American litecoin owner had been hacked to the tune …","title":"Google and Bing Help Hackers to Steal Your Crypto - CryptoDisrupt","content":["Crypto Disrupt has previously reported that Google was responsible for the Binance exchange API hack by presenting the phishing site at the top of their ranked sites. Bing is also responsible for the loss of thousands of litecoins. Crypto Disrupt reported April 23, 2018, that an American litecoin owner had been hacked to the tune of $350,000.","When the article was published, there was a suggestion that the hack may have been caused by a compromised Litecoin Cash (LCC) digital wallet. The core LCC development team comprises Tanner, Loxley, Roger, and Michael “Scarlet” Wyszynski. Loxley posted in the GitHub issue, created by the individual that had been hacked, to say that there was very little evidence of a problem with their wallet. Roger has emailed Crypto Disrupt to say,","“We have more than a thousand users that have downloaded our wallet and are experiencing no issues with our wallets. The specific issue you are referring to (extra .jar files) was reported by a single reddit user, and was never able to be reproduced by any of us in the dev team, or any of our community members.”","Roger also pointed out that they recommend all wallet users verify the checksums of the files they download and the checksums are clearly shown on their website.","The mystery of how the coins were stolen has now been solved, and again, we learn that we can’t trust search engines to recommend reputable websites. The individual that was hacked normally uses the Google Chrome web browser, and he checked his history of sites that he had visited when he noticed the coins had disappeared. It turns out that after re-installing Windows 10, he temporarily used the default Microsoft Edge browser and the history shows he downloaded a fake Electrum wallet. The image below shows identical meta details for two different websites with the second one being the fake site. The fake site was registered in Kuala Lumpur on December 12, 2017, and the duplicate content alone should have been enough for Bing’s SERP algorithm to pick it up as a phishing site.","The Edge browser history shows that the default search engine, Bing, brought up this phishing site as one of the top ranked sites for “Electrum LTC.” The phishing site doesn’t have an SSL certificate, and this should have been a red flag to the coin holder.","Reddit has several threads that highlight the particular phishing site, and users have previously notified Google, but not Bing, that it’s a fake site. There is clearly something wrong with the SERP algorithms used by top search engines like Google and Bing if they recommend sites run by hackers.","Despite Google being warned of the phishing site, it still appears as the number one ranked site for a particular search term. Why hasn’t it been removed entirely from their database or flagged as a site run by hackers?","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:21:12+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/will-the-sec-target-utility-tokens/#","web_url":"https://cryptodisrupt.com/","type":"article","description":"Utility tokens can be used to purchase services on a blockchain network, and they do not offer a financial stake in the underlying business or project. From this basic understanding of a utility token, it would put them outside the scope of the US Securities and Exchange Commission (SEC). Unfortunately, the SEC has previously confirmed …","title":"Will the SEC Target Utility Tokens? - CryptoDisrupt","content":["Utility tokens can be used to purchase services on a blockchain network, and they do not offer a financial stake in the underlying business or project. From this basic understanding of a utility token, it would put them outside the scope of the US Securities and Exchange Commission (SEC). Unfortunately, the SEC has previously confirmed that most ICOs for utility tokens should be regarded as securities under the Howey test. It is quite clear that many ICO participants buy tokens in the hope that the value will rise rather than using the token to purchase services on the network.","Ever since the SEC made their initial announcement, in July 2017, the crypto community has been concerned that bitcoin and ethereum could also be considered securities. As most ICOs use ERC20 tokens on the Ethereum network, there was potential for the SEC to close them all down. There are serious consequences for any promoters attempting to sell unregistered securities to US residents.","As reported by Crypto Disrupt on June 14, 2018, the SEC finally confirmed that they don’t consider bitcoin or ethereum to be securities. Although the announcement pushed up the price of all cryptocurrencies, it didn’t increase the price by as much as some pundits were expecting. This may have been due to the bears overshadowing the market since the end of 2017. Another reason for the fairly modest gains could be based on the SECs indication that many utility tokens are still considered to be securities.","According to the release by William Hinman, he emphasizes that “simply labeling a digital asset a “utility token” does not turn the asset into something that is not a security. I recognize that the Supreme Court has acknowledged that if someone is purchasing an asset for consumption only, it is likely not a security. But, the economic substance of the transaction always determines the legal analysis, not the labels. The oranges in Howey had utility. Or in my favorite example, the Commission warned in the late 1960s about investment contracts sold in the form of whisky warehouse receipts. Promoters sold the receipts to U.S. investors to finance the aging and blending processes of Scotch whisky. The whisky was real – and, for some, had exquisite utility. But Howey was not selling oranges and the warehouse receipts promoters were not selling whisky for consumption. They were selling investments, and the purchasers were expecting a return from the promoters’ efforts.”","The SEC decided bitcoin and ethereum are not securities, in part, because it considers them suitably decentralized. As decentralized networks, they feel that the success of the ecosystem is not controlled by a single entity, and therefore, is not a security. Most utility tokens are not decentralized to the level seen by bitcoin and ethereum, and this puts them at risk of SEC control. Projects considering an ICO for their utility token still need to be very careful and should obtain clarification from the SEC before releasing their whitepaper. Part of the SEC announcement provided a list of questions that promoters should review before considering an ICO.","The SEC has stated that this is not to be considered an exhaustive list, but it provides a useful starting point for projects planning an ICO. The SEC might now take a more hard-line stance against the promotion of utility tokens already in circulation or any issued in the future.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:20:02+00:00","tag":"","author":""}
{"url":"https://cryptodisrupt.com/will-the-sec-target-utility-tokens/","web_url":"https://cryptodisrupt.com/","type":"article","description":"Utility tokens can be used to purchase services on a blockchain network, and they do not offer a financial stake in the underlying business or project. From this basic understanding of a utility token, it would put them outside the scope of the US Securities and Exchange Commission (SEC). Unfortunately, the SEC has previously confirmed …","title":"Will the SEC Target Utility Tokens? - CryptoDisrupt","content":["Utility tokens can be used to purchase services on a blockchain network, and they do not offer a financial stake in the underlying business or project. From this basic understanding of a utility token, it would put them outside the scope of the US Securities and Exchange Commission (SEC). Unfortunately, the SEC has previously confirmed that most ICOs for utility tokens should be regarded as securities under the Howey test. It is quite clear that many ICO participants buy tokens in the hope that the value will rise rather than using the token to purchase services on the network.","Ever since the SEC made their initial announcement, in July 2017, the crypto community has been concerned that bitcoin and ethereum could also be considered securities. As most ICOs use ERC20 tokens on the Ethereum network, there was potential for the SEC to close them all down. There are serious consequences for any promoters attempting to sell unregistered securities to US residents.","As reported by Crypto Disrupt on June 14, 2018, the SEC finally confirmed that they don’t consider bitcoin or ethereum to be securities. Although the announcement pushed up the price of all cryptocurrencies, it didn’t increase the price by as much as some pundits were expecting. This may have been due to the bears overshadowing the market since the end of 2017. Another reason for the fairly modest gains could be based on the SECs indication that many utility tokens are still considered to be securities.","According to the release by William Hinman, he emphasizes that “simply labeling a digital asset a “utility token” does not turn the asset into something that is not a security. I recognize that the Supreme Court has acknowledged that if someone is purchasing an asset for consumption only, it is likely not a security. But, the economic substance of the transaction always determines the legal analysis, not the labels. The oranges in Howey had utility. Or in my favorite example, the Commission warned in the late 1960s about investment contracts sold in the form of whisky warehouse receipts. Promoters sold the receipts to U.S. investors to finance the aging and blending processes of Scotch whisky. The whisky was real – and, for some, had exquisite utility. But Howey was not selling oranges and the warehouse receipts promoters were not selling whisky for consumption. They were selling investments, and the purchasers were expecting a return from the promoters’ efforts.”","The SEC decided bitcoin and ethereum are not securities, in part, because it considers them suitably decentralized. As decentralized networks, they feel that the success of the ecosystem is not controlled by a single entity, and therefore, is not a security. Most utility tokens are not decentralized to the level seen by bitcoin and ethereum, and this puts them at risk of SEC control. Projects considering an ICO for their utility token still need to be very careful and should obtain clarification from the SEC before releasing their whitepaper. Part of the SEC announcement provided a list of questions that promoters should review before considering an ICO.","The SEC has stated that this is not to be considered an exhaustive list, but it provides a useful starting point for projects planning an ICO. The SEC might now take a more hard-line stance against the promotion of utility tokens already in circulation or any issued in the future.","Your email address will not be published. Required fields are marked *","Comment *","Name *","Email *","Website","Save my name, email, and website in this browser for the next time I comment.","",""],"create_date":"2023-01-19T17:20:02+00:00","tag":"","author":""}
