{"url":"https://www.unlock-bc.com/122605/reece-merrick-ripple-dance-traditional-new-finance-uae/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Interview: Ripple\u0027s MEA Managing Director, Reece Merrick, discusses the dance between traditional and new digital finance. #crypto #stablecoin","title":"Ripple\u0027s Dance Between Traditional and New Finance: Interview with Reece Merrick","content":["In the ever-evolving financial landscape, Ripple has emerged as a notable player, showcasing its innovative ability while navigating the intricate dynamics where traditional financial systems intersect with emerging digital assets. Recent milestones, such as its legal triumph against the SEC and its expansion into the stablecoin and custody business, underscore Ripple’s resilience and adaptability in an industry characterized by rapid change.","During our conversation with Reece Merrick, Ripple’s Managing Director for the Middle East and Africa, he emphasized Ripple’s unique position at the convergence of two distinct worlds: the traditional financial establishment and the realm of digital assets. Merrick’s insights shed light on Ripple’s trajectory and the evolving landscape it navigates.","Reflecting on Ripple’s origins, Merrick noted, “Our aim has always been to bridge traditional finance and decentralized finance.” Ripple’s early focus on addressing cross-border payment inefficiencies using blockchain and crypto, notably XRP and the XRP Ledger, laid the foundation for its current endeavors.","“As Ripple’s presence in the Middle East and Africa grows,” Merrick emphasized, “our mandate remains clear: to serve customers in cross-border payments while expanding into additional crypto-native services.” This includes ventures into custody solutions and forthcoming stablecoin offerings, reflecting Ripple’s commitment to innovation and meeting market demand.","The UAE’s proactive regulatory environment, particularly in the Dubai International Financial Centre (DIFC), has provided fertile ground for Ripple’s expansion. Merrick highlighted the significance of regulatory compliance and Ripple’s dedication to navigating regulatory frameworks while expanding its services in the region. It’s worth noting that in November 2023, Ripple announced the approval of the digital asset XRP for use within the DIFC by the Dubai Financial Services Authority (DFSA).","When asked about the possibility of obtaining a Virtual Asset Service Provider license from regulatory bodies like VARA or ADGM , Merrick expressed Ripple’s commitment to compliance and cooperation with regulators. He stated, “VARA, obviously a standalone regulator in the region, is doing fantastic things as well. Ripple itself has been in the DIFC since 2020. We’re very happy here. We are quite keen from a license perspective to work with regulators to deem and acquire licenses where we require.” This proactive approach underscores Ripple’s commitment to operating within the bounds of regulatory frameworks while continuing its growth trajectory in the UAE and beyond.","Discussing competition in the digital financial space, Merrick observed, “Ripple aims to address the inefficiencies of traditional methods like Swift, offering low fees and real-time settlement.” He emphasized the role of stablecoins and other players challenging the status quo, signaling a shift towards more efficient cross-border payment solutions.","In regions like Africa and Southeast Asia, where remittance businesses play a vital role, Ripple prioritizes engagement while acknowledging challenges related to regulatory readiness and market demand. “It’s a priority for Ripple to engage with these regions,” Merrick affirmed, “but progress hinges on various factors, including regulatory frameworks and market dynamics.”","On April 3rd, 2024, Ripple made a significant move by entering the lucrative stablecoin market, valued at $150 billion, introducing its own digital currency pegged to the U.S. dollar. This stablecoin will maintain a 1-to-1 backing with assets such as U.S. dollar deposits, U.S. government bonds, and cash equivalents held in reserve by Ripple.","Merrick believes Ripple’s expansion into stablecoin settlement and custody solutions aligns with its objective of institutional adoption and tokenizing real-world assets. He underscored the importance of infrastructure advancements and the immense potential for tokenization both in the UAE and globally.","Despite legal battles with the SEC, Ripple remains steadfast in its pursuit of a fair resolution. “Our recent victories affirm that XRP is not a security,” Merrick stated, expressing confidence in the legal process and Ripple’s ability to navigate regulatory challenges. Ripple’s journey mirrors the evolving landscape of finance and digital assets, characterized by innovation, partnerships, and regulatory hurdles."],"create_date":"2024-05-06T09:00:00+00:00","tag":"","author":"Walid Abou Zaki"}
{"url":"https://www.unlock-bc.com/major-gaming-token-unlocks-expected-february-potentially-harvesting-millions/","web_url":"https://www.unlock-bc.com/","type":"article","description":"A series of major token unlocks are scheduled to occur , impacting the market dynamics for gaming-related tokens like SANA and PRIME.","title":"Major Gaming Token Unlocks Expected in February, Potentially Harvesting Millions","content":["A series of major token unlocks are scheduled to occur by the end of February, potentially impacting the market dynamics for gaming-related tokens such as The Sandbox (SAND) and Parallel (PRIME).","According to estimations by crypto dashboard TokenUnlocks, The Sandbox is ready to kick off the series, with approximately 205.59 million SAND set to unlock on Wednesday.","This release includes allocations for the team, advisors, and company reserves, amounting to roughly $99.2 million at the current market price.","Following suit, on February 16, 15.6 million ApeCoin (APE) tokens are scheduled to unlock, primarily allocated to contributors of the Bored Ape Yacht Club and its founders, among others.","This release represents approximately $23.1 million worth of tokens, a mere fraction of the circulating supply.","Immutable, beginning on February 22, will initiate a 28-day linear unlock of 1.22 million IMX tokens per day, totaling $3.66 million worth based on current prices. These tokens are designated for ecosystem and project development funds, as well as private token sales.","Aptos, another notable player in the crypto space, will witness a substantial release of tokens, amounting to roughly $224.82 million worth by the end of February. This release accounts for approximately 7.32% of its total token supply, though representing less than 1% of the circulating supply.","Towards the end of the month, PRIME token holders will also see 1.66 million tokens unlocked, equivalent to nearly $16.1 million. This unlock stands at just under 5% of the current circulating supply.","In addition, Yield Guild Games is poised for an unlock of 16.69 million YGG tokens on February 27, valued at approximately $7.89 million, according to Decrypt.","These token unlocks are important moments for the respective projects, as they introduce new tokens into the market. However, they also bring the potential for sell pressure, as contributors and investors may choose to liquidate their holdings, affecting token prices.","Despite potential short-term market impacts, some of these tokens have experienced notable gains in recent weeks. IMX, for instance, has seen a 33% increase in value over the past month, while ApeCoin and PRIME have also recorded double-digit gains.","Looking ahead, major tokens like Avalanche (AVAX), Aptos (APT), and Optimism (OP) are also ready for significant unlocks in February, further shaping the crypto landscape and investor sentiment in the coming weeks."],"create_date":"2024-02-14T07:24:54+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122590/crypto-user-loses-68-million-in-address-poisoning-scam/","web_url":"https://www.unlock-bc.com/","type":"article","description":"A cryptocurrency user has been defrauded of $68 million worth of wrapped bitcoin (WBTC) in an address poisoning scam.","title":"Crypto User Loses $68 Million in Address-Poisoning Scam","content":["In a significant blow to a cryptocurrency enthusiast, a staggering $68 million worth of wrapped bitcoin (WBTC) was recently lost in a cunning address-poisoning scam, according to corroborating reports from security platform Cyvers and blockchain investigator ZachXBT.","?ALERT?Are we mistaken, or has someone truly lost $68M worth of $WBTC? Our system has detected another address falling victim to address poisoning, losing 1155 $WBTC. ? Victim: https://t.co/5NKlOFnepJ Address poisoner: https://t.co/R6fF0QipBH Poison transaction:… pic.twitter.com/UpG34ZcZvY","Address poisoning, a nefarious technique gaining traction among cybercriminals, involves the manipulation of legitimate transactions by diverting them to incorrect wallet addresses. The scam unfolds as perpetrators craft counterfeit addresses that mimic the first and last six characters of the genuine destination, capitalizing on the human tendency to overlook minute discrepancies. Given the considerable length of wallet addresses, which can extend up to 42 characters, the chances of oversight are alarmingly high without meticulous scrutiny.","In this intricate scheme of digital deception, the fraudster orchestrated a fraudulent wallet to masquerade as the intended recipient, seamlessly executing a 0.05 ETH transaction before clandestinely acquiring a sum of 1,155 WBTC from the unsuspecting victim.","Unfortunately, hackers and scammers pervade the crypto world, employing tactics to pilfer from investors. Each year, millions of dollars’ worth of cryptocurrency fall victim to such schemes, underscoring the ongoing debate between industry stakeholders and regulators, such as the SEC, regarding cryptocurrency oversight. The prevalence of scammers utilizing tactics like address poisoning highlights the importance of thorough understanding of wallet addresses before initiating any fund transfers."],"create_date":"2024-05-04T09:28:40+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122706/true-gamers-partners-with-jordanian-authorities-to-boost-esports-in-the-region/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The venue is poised to host a myriad of top-tier eSports tournaments, catering to both amateur enthusiasts and seasoned professionals.","title":"True Gamers Partners with Jordanian Authorities to Boost eSports in the Region","content":["True Gamers, a prominent international network of eSports clubs, has unveiled its latest partnership with the Jordanian authorities.","Positioned as a pioneer in gaming innovation throughout the MENA region, the company is set to play a pivotal role in the creation of a cutting-edge cyber sports arena spanning over 1000 square meters, situated within the King Hussein Business Park in Amman.","This state-of-the-art venue is poised to host a myriad of top-tier eSports tournaments, catering to both amateur enthusiasts and seasoned professionals, promising an immersive gaming experience for all participants. True Gamers will serve as a trusted advisor for the majority of these events and will curate its own series of tournaments within the arena. Moreover, the company will actively contribute to boosting the cyber sports infrastructure across the kingdom.","The primary objective of this collaborative venture is to cultivate a thriving gaming culture in Jordan, opening doors to new prospects for aspiring pro gamers and gaming aficionados alike. With the inauguration of this facility, a broader audience will have the opportunity to embrace gaming culture and become fully immersed in the cyber sports community.","Furthermore, the arena will serve as a nexus for hosting amateur tournaments among Gulf countries, an initiative spearheaded by True Gamers, aimed at fostering inclusivity and providing equal opportunities for all individuals to partake in eSports and proudly represent their nations in competitive gaming. The inaugural tournament is slated to feature teams from the UAE and Jordan.","Vlad Belyanin, Chief Product Officer of True Gamers, expressed enthusiasm about the collaboration and the prospects it holds for eSports development in Jordan. Belyanin extended gratitude to the Jordanian Esports Federation and the Royal Family, particularly His Royal Highness Prince Omar Bin Feisal, for their support, affirming confidence in the collective efforts to benefit the Kingdom and catalyze innovation, economic prosperity, and social advancement.","The official inauguration of the arena is scheduled for May 2024, during which both parties will unveil further details about the venue and the terms of collaboration."],"create_date":"2024-05-07T06:49:56+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122582/bitcoin-etfs-face-largest-outflow-amidst-gbtcs-turnaround/","web_url":"https://www.unlock-bc.com/","type":"article","description":"GBTC witnessed its first inflow since January after significant losses, with a net $63 million added on Friday, according to Farside\u0027s tally.","title":"Bitcoin ETFs Face Largest Outflow Amidst GBTC\u0027s Turnaround","content":["The Grayscale Bitcoin Trust (GBTC) witnessed a notable turnaround, experiencing its first inflow of funds since January after facing significant losses. A net $63 million was added on Friday, according to Farside’s tally. Conversely, the US spot-Bitcoin exchange-traded funds (ETFs) encountered their largest daily outflow as the digital token braced for its worst week since August 2023.","Investors withdrew a net sum of $564 million from nearly a dozen funds on Wednesday, marking the most substantial drawdown since their inception earlier in the year. The recent surge in the prospect of prolonged higher interest rates has dampened investor appetite for risky assets like cryptocurrency, causing a decline in demand for ETFs from industry giants like BlackRock Inc. and Fidelity Investments.","The Grayscale product had been the dominant conventional investment vehicle for those looking to invest in bitcoin (BTC) without directly purchasing the cryptocurrency. But it got competition in January when it was converted into an easier-to-trade ETF at the same time nine rival spot bitcoin ETFs began trading.","GBTC has much higher fees, and investors yanked billions of dollars from it. Its bitcoin holdings have dropped from more than 600,000 bitcoin to around 290,000 bitcoin, according to fund data compiled by CoinDesk.","While the Friday inflow ends the streak of net GBTC withdrawals, BlackRock’s iShares Bitcoin Trust (IBIT) is challenging the fund for the title of biggest bitcoin ETF. GBTC now has $18.1 billion in assets, versus IBIT’s $16.9 billion. IBIT, now in second place, started at zero in January, while GBTC had more than $26 billion.","Initially, Bitcoin ETFs were part of a historic wave of successful launches for a new fund category, with funds pouring in and propelling Bitcoin to an all-time high of nearly $74,000 in March. Despite this, recent tightening of financial conditions in the US, coupled with the Federal Reserve’s efforts to combat persistent inflation, have led to a slump in demand.","However, Coinbase’s Friday research report highlights that Bitcoin’s recent weakness is not confined to crypto markets. Both equities and gold have been on a downward trajectory since mid-April, coinciding with a strengthening dollar. The world’s largest cryptocurrency experienced a 16% decline in April, marking its most significant monthly drop since June 2022.","Despite the downturn, the group of ETFs still boasts a net inflow of over $11 billion to date. Caroline Bowler, CEO of crypto exchange BTC Markets Pty, remains optimistic, stating, “This is a snapshot in time… the overall picture is healthy in terms of ETF demand in different geographies.”","Meanwhile, this week saw Hong Kong‘s first listing of ETFs directly investing in Bitcoin and Ether. However, this development failed to uplift the sentiment in crypto markets. Notably, the Fidelity Wise Origin Bitcoin Fund saw its highest daily net outflow yet, with $191 million leaving the portfolio on Wednesday. BlackRock’s iShares Bitcoin Trust also faced its first drawdown of $37 million, while investors pulled $167 million from the Grayscale Bitcoin Trust, the largest spot-Bitcoin ETF.","Amidst these developments, Bitcoin experienced a significant drop, falling 23% from its recent record on March 14th to a two-month low reached on Wednesday. However, the original cryptocurrency rebounded on Thursday following three consecutive days of declines."],"create_date":"2024-05-04T06:38:16+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122672/emirates-nbd-elevates-digital-asset-innovation-with-chainalysis-partnership/","web_url":"https://www.unlock-bc.com/","type":"article","description":"This move underscores the bank\u0027s commitment to leading digital finance advancements throughout the Middle East, North Africa, and Türkiye.","title":"Emirates NBD Elevates Digital Asset Innovation with Chainalysis Partnership","content":["Emirates NBD, a prominent banking force in the MENAT region, has unveiled Chainalysis as a pivotal member of its Digital Asset Lab council.","This move underlines the bank’s commitment to pioneering advancements in the digital finance domain across the Middle East, North Africa, and Türkiye.","Chainalysis, recognized for its expertise in blockchain analysis and compliance, joins esteemed partners such as professional services firm PwC, digital asset transfer platform Fireblocks, and enterprise DLT platform R3 as a founding council member of the Lab.","The integration of Chainalysis into the Digital Asset Lab is poised to fortify the bank’s innovative strides in developing compliant and secure financial products and services. Leveraging Chainalysis’ analytical prowess, Emirates NBD aims to discern market trends, meet customer needs effectively, and enhance the integrity of its digital asset ventures.","Miguel Rio Tinto, Group Chief Digital and Information Officer at Emirates NBD, expressed pride in the bank’s collaboration with Chainalysis, emphasizing their shared commitment to pioneering solutions in the financial sector. Rio Tinto highlighted the partnership’s role in fostering a transparent and dependable digital finance environment, enhancing customer trust and confidence in the bank’s digital offerings.","Nicola Buonanno, VP Southern EMEA at Chainalysis, echoed this sentiment, stressing the pivotal role of financial institutions in shaping the future of digital assets. Buonanno highlighted the importance of secure avenues for investor engagement, emphasizing Chainalysis’ dedication to collaborating with Emirates NBD to facilitate safe and transparent digital asset services.","The Digital Asset Lab, introduced at the Dubai FinTech Summit in May 2023, marks Emirates NBD’s proactive stance in accelerating digital asset and financial services innovation within the UAE. By assembling a robust platform comprising industry experts, the bank aims to foster the development of innovative financial services ideas utilizing digital assets and underlying technologies.","With a keen focus on digital assets, the Lab endeavors to leverage underlying technologies effectively, empowering customers to navigate their financial service needs amidst the dynamic digital asset landscape.","Emirates NBD’s strategic alliance with Chainalysis signifies a significant step towards pioneering advancements in digital finance, reaffirming the bank’s position as a trailblazer in the realm of financial innovation in the MENAT region."],"create_date":"2024-05-06T12:08:03+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/121825/bitcoin-halving-sparks-major-drop-in-transaction-fees/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The halving event did not exert a major influence on Bitcoin\u0027s price, which has seen a modest 1.5% increase since then, reaching $64,840.","title":"Bitcoin Halving Sparks Major Drop in Transaction Fees","content":["Just a day after hitting an all-time high average of $128 on April 20, Bitcoin transaction fees have seen a significant drop, settling at an average of $8-10 for medium-priority transactions as of April 21, as reported by mempool.space.","The surge in fees on April 20, coinciding with the fourth Bitcoin halving, saw Bitcoin rake in $78.3 million in total fees, surpassing Ethereum by more than 24 times, according to Crypto Fees data.","A remarkable moment occurred in the Bitcoin network’s history at block height 840,000 during the halving, with a remarkable 37.7 Bitcoin (equivalent to $2.4 million) paid to the Bitcoin miner ViaBTC. This marked the highest fee ever recorded in the network’s 15-year existence.","The surge in demand at block 840,000 was primarily driven by enthusiasts of meme coins and non-fungible tokens (NFTs), vying to secure rare satoshis using the newly launched Runes protocol, a novel token standard introduced at the halving block.","The block at height 840,000 accommodated 3050 transactions, translating to an average fee of just under $800 per user, according to Cointelegraph.","Although higher-than-usual block fees persisted until approximately block 840,200, they have since subsided to around 1-2 Bitcoin.","Despite the hefty block fee payouts to miners during the halving, shielding them initially from the impact of the block subsidy reduction from 6.25 Bitcoin to 3.125 Bitcoin, the scenario has shifted with the current average block fee comfortably below 3.125 Bitcoin.","Data from block 840,266 reveals total fees amounting to 1.64 BTC, resulting in total rewards of 4.76 BTC after factoring in the new block subsidy of 3.125 BTC.","Bitcoin has now surpassed Ethereum in terms of fees for six consecutive days from April 15 to 20, with its 7-day fee average standing at $17.8 million.","Interestingly, the halving event did not exert a substantial influence on Bitcoin’s price, which has seen a modest 1.5% increase since then, reaching $64,840, according to CoinGecko.","It is worth noting that the latest Bitcoin halving has been carried out smoothly at 8:10 p.m. on Friday evening (New York time), possibly affecting companies engaged in managing the cryptocurrency’s operations. This event, happening every four years, has halved the mining reward the payment miners receive for confirming transactions on the network.","This reduction in rewards was intentionally programmed into Bitcoin’s blockchain code by its creator, Satoshi Nakamoto, to uphold a hard cap of 21 million Bitcoin and prevent inflation.","With this fourth halving since 2012, the daily reward for miners has decreased from 900 Bitcoin to 450 Bitcoin."],"create_date":"2024-04-22T05:53:38+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122807/ton-blockchain-super-app-pioneer/","web_url":"https://www.unlock-bc.com/","type":"article","description":"TON Blockchain revolutionizes as a super app, integrating seamlessly for diverse decentralized experiences #tether #Telegram","title":"TON Blockchain: A Resilient Journey Towards Becoming a Super App","content":["The journey of TON Blockchain is marked by resilience and adaptation in the face of adversity. Despite initial challenges and separation from its ties with Telegram, TON has evolved into a platform with immense potential, leveraging its association with Telegram’s 900 million users.","The recent partnership with Tether is a significant milestone, enhancing TON’s ecosystem with the integration of USD? and XAU? tokens, offering users seamless access to digital dollars and gold-backed tokens. Additionally, this partnership has significantly boosted TON Token, currently trading at $5.71 with a remarkable 185% increase in market value over the past year, reaching a market cap of $19.9 billion.","TON Blockchain encountered significant challenges early on, including regulatory hurdles such as the SEC case after raising $1.8 billion in 2018 and the subsequent settlement in 2020. However, through the dedication of its community and leadership, TON persevered, forging its path forward independently. TON prides itself on being decentralized, based on an open-source codebase, with no single controlling authority.","Behind it lies a non-profit foundation, registered in Zug, Switzerland. In 2023, TON underwent significant restructuring, which included the establishment of The Open Network Foundation. This non-profit organization, funded entirely by community contributions and based in Switzerland, embodies the ethos of decentralization and community-driven innovation. The Open Network Foundation serves as a catalyst for community-driven initiatives within the TON ecosystem, supporting projects that align with TON’s mission of fostering innovation and accessibility.","The separation from Telegram provided TON with the opportunity to chart a new course and redefine its vision. Rather than being tethered to a single platform, TON embraced its independence and focused on building a comprehensive ecosystem that extends beyond messaging to encompass a wide range of decentralized services. This shift in focus laid the foundation for TON to emerge as a potential super app with widespread adoption and utility.","One of TON’s greatest assets is its association with Telegram, boasting a user base of over 900 million individuals. By tapping into this vast network, TON gains access to a ready-made audience eager to explore decentralized applications and services. This integration not only enhances TON’s user base but also positions it as a frontrunner in the race to mainstream adoption of decentralized technologies.","The story of TON Blockchain is one of resilience, adaptation, and growth. While TON’s journey is impressive, questions remain about its integration into local ecosystems like UAE, where Pavel Durov has been based for the last 10 years. How TON will integrate into the local ecosystem remains an unanswered question, presenting an area for future exploration and development."],"create_date":"2024-05-08T12:31:15+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122395/qatar-finance-centre-digital-asset-framework-maha-al-saadi-insights/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Insights into Qatar Finance Centre\u0027s Digital Asset Framework \u0026 Islamic Finance integration , as shared by Maha Al-Saadi. #Tokenization","title":"Qatar Finance Centre Authority\u0027s Digital Asset Framework: Accommodating Real World Asset Tokenization and Islamic Finance Instruments","content":["In a dynamic move to fortify its position as a leading financial hub in the region, the Qatar Finance Centre Authority (QFCA) has unveiled its groundbreaking Digital Asset Framework, accompanied by the establishment of a Digital Asset Lab. These initiatives signal a significant leap forward for the Authority as it delves deeper into the realm of fintech and digital assets, catering to the evolving needs of the market while ensuring regulatory compliance.","Maha Al-Saadi, Head of Regulatory Affairs at the Qatar Finance Centre Authority, explains that FinTech’s, digital assets and digitalization are key pillars that are being enabled. “We have expanded our non-regulated licenses to include certain fintech service providers. These include entities providing Application Programming Interface (API), cybersecurity and blockchain activities, to name a few”.","“However, the moment the entities providing fintech-related services touch upon regulated activities, we then defer them to the Central Bank and the Qatar Financial Centre Regulatory Authority. We are able to register these firms and ensure they are licensed to operate in Qatar. In certain cases, we also provide incentives and assist them to expand their network,” says Al-Saadi.","The Qatar Finance Centre Authority is an onshore jurisdiction based on English common law, with its own company registration and employment standards office. “We allow 100% foreign ownership for entities established within our jurisdiction. What makes the Authority so interesting is the fact that you can engage with businesses within the State of Qatar. We also have our own court, and our tax regime is very favorable because entities are only required to pay 10% on locally sourced revenue,” says Al-Saadi.","She reveals that, within the ambit it’s Digital Asset Framework, The QFC has launched the Digital Asset Lab specifically to look into various use cases, “to see which regulations apply, how we can develop them, and what sorts of licenses would be needed,” says Al-Saadi.","“The Digital Asset Framework represents a pivotal milestone in our journey towards fostering innovation and growth within Qatar’s financial landscape. With the establishment of the Digital Asset Lab, we are poised to explore novel use cases and streamline the regulatory process for digital asset ventures,” remarks Al-Saadi.","The Digital Asset Framework, developed jointly with the Qatar Central Bank and other relevant regulatory authorities, provides a structured approach to incorporating digital assets into the financial ecosystem. This framework encompasses guidelines for real world asset tokenization, a rising trend that has gained significant traction in global financial markets. Al-Saadi elaborates on the process for companies seeking to tokenize real world assets within the authority’s jurisdiction. “Entities interested in participating in real world asset tokenization can register and express their interest in the Digital Assets Lab. Following an assessment process, wherein the nature of the service or product is evaluated, we determine the regulatory implications and licensing requirements,” she explains.","A key characteristic of the authority’s approach is its flexibility to address regulatory requirements on a case-by-case basis. Al-Saadi stresses the importance of balancing regulatory oversight with fostering innovation. “We strive to strike a balance between regulatory compliance and fostering innovation. While certain activities may fall under regulated domains, we are committed to providing a conducive environment for digital asset ventures to thrive,” she affirms.","The Digital Asset Lab serves as a sandbox environment wherein companies can explore the regulatory landscape and refine their offerings before entering the market. This controlled environment enables collaboration between industry stakeholders and regulators, facilitating the development of robust regulatory frameworks.","Real world asset tokenization, a process wherein tangible assets such as real estate or commodities are represented as digital tokens on a blockchain, holds immense potential for unlocking liquidity and enhancing market efficiency. By leveraging the Digital Asset Framework, companies can navigate the complexities of tokenizing real-world assets while adhering to regulatory standards.","In addition to real world asset tokenization, the authority spearheads initiatives to incorporate Islamic finance principles into its digital asset ecosystem. Al-Saadi highlights the unique regulatory framework developed to accommodate Islamic finance instruments within the Digital Asset Framework. “Our regulatory framework facilitates the issuance of Islamic bonds and securities, thereby expanding the scope of Islamic finance in the digital realm,” she adds.","Despite the progressive strides in digital asset regulation, Qatar maintains a cautious stance towards cryptocurrencies, with regulatory measures in place to ensure consumer protection and mitigate risks associated with speculative trading. Qatar Central Bank has prohibited trading in cryptocurrencies such as Bitcoin. “The reason behind that was primarily to ensure consumer protection, because back then it was unregulated. Some people were of the opinion that it was because of its speculative nature,” comments Al-Saadi.","Looking ahead, Al-Saadi says the Qatar Finance Centre Authority remains committed to fostering a conducive environment for fintech innovation while upholding regulatory standards. The Digital Asset Framework and the Digital Asset Laboratory represent key milestones in the Authority’s journey towards becoming a leading hub for digital finance and innovation in the region.",""],"create_date":"2024-05-02T09:29:33+00:00","tag":"","author":"Henzie Healley"}
{"url":"https://www.unlock-bc.com/122837/sec-digital-asset-custody-rules-defeated-house-vote/","web_url":"https://www.unlock-bc.com/","type":"article","description":"In a significant blow to SEC regulations, the House voted to overturn custody rules for digital assets, impacting banks and crypto firms alike","title":"SEC\u0027s Custody Rules for Digital Assets Dealt Another Blow in House Vote","content":["House lawmakers voted Wednesday evening (May 8, 2024) to nullify a Securities and Exchange Commission staff bulletin concerning the accounting of digital asset custody.","The bulletin, SAB 121, has stirred considerable debate, drawing both cryptocurrency firms and major banks into opposition against the SEC.","In essence, the contested Staff Accounting Bulletin (SAB) 121 requires custodians of digital assets to treat them as liabilities on their financial statements. Critics argue this could hinder banks from expanding into crypto due to increased capital requirements.","The situation gains prominence as traditional Wall Street banks confront the rise of 11 spot bitcoin funds. Industry groups have voiced concerns to SEC Chair Gary Gensler, citing challenges in serving as custodians for these funds at scale.","The pushback against SAB 121 culminated in a resolution introduced by Representatives Mike Flood and Wiley Nickel, contesting the SEC’s authority to establish such rules without proper public input.","On the other side, Gensler maintains support for SAB 121, citing a Government Accountability Office report that classified the bulletin as a rule, thus subject to oversight under the Congressional Review Act.","The resolution now advances to the Senate, where it is expected to garner substantial support from Republicans."],"create_date":"2024-05-09T07:37:25+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/121845/tether-issues-60-million-worth-of-usdt-on-telegrams-open-network-ton/","web_url":"https://www.unlock-bc.com/","type":"article","description":"As part of the new partnership, Tether began minting its USDT stablecoin on TON and also introduced Tether Gold (XAUT) on the platform.","title":"Tether Issues $60 Million Worth of USDT on Telegram\u0027s Open Network TON","content":["Tether (USDT) has already issued $60 million worth of its stablecoin on The Open Network (TON) since integrating with the blockchain on April 19. This development places TON as the 11th-largest blockchain for Tether out of 16 supported platforms.","The collaboration between Tether and the TON Foundation was announced during the Token2049 crypto conference in Dubai on April 19. As part of this partnership, Tether began minting its USDT stablecoin on TON and also introduced Tether Gold (XAUT) on the platform.","The Open Network team highlighted the benefits of their platform, stating that cross-border payments on TON are instant, free, and as simple as sending a text message to Telegram’s 900 million users.","Paolo Ardoino, CEO of Tether, expressed satisfaction with the progress, noting that $35 million USDT had been issued on TON by April 21. However, according to the latest Tether Transparency report, the authorized supply of USDT issued on TON has now increased to $60 million.","The collaboration enables Telegram users to send transfers seamlessly among all platform users, requiring only a direct message without the need for blockchain addresses or additional app downloads.","USDT on TON will feature fully integrated on-ramps from most fiat currencies globally at launch, with plans to introduce integrated global off-ramps to enable users to withdraw supported fiat currencies directly to bank accounts or cards.","While the majority of Tether’s circulating supply remains on the Tron network, with $57.8 billion, Ethereum hosts $51 billion USDT. To address high network fees on Ethereum, Tether has deployed USDT on various blockchains, including Solana, Avalanche, Omni, Cosmos, Tezos, Near, EOS, and Celo.","Tether dominates 69% of the entire stablecoin market capitalization, valued at approximately $159.5 billion, according to CoinGecko. Its main competitor, Circle, holds a 21% market share with its stablecoin, USD Coin (USDC), which has $33.7 billion in circulation.","Following the announcement, Toncoin (TON) experienced a 22% spike in prices but quickly reverted to previous levels, according to Cointelegraph."],"create_date":"2024-04-22T07:26:13+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122318/new-theory-on-bitcoins-future-price-sparks-debate-what-is-it/","web_url":"https://www.unlock-bc.com/","type":"article","description":"These differing perspectives highlight the complexity of predicting Bitcoin\u0027s future, with various factors influencing market sentiment.","title":"New Theory on Bitcoin\u0027s Future Price Sparks Debate, What Is It?","content":["Bitcoin’s trajectory remains a topic of important discussion in financial circles, with veteran trader Peter Brandt proposing an intriguing theory that could disrupt traditional forecasts.","Brandt suggests that Bitcoin may have already reached its cycle peak at the $70,000 mark, citing an “exponential decay” pattern observed in previous market cycles.","This pattern, as Brandt outlines, entails each successive cycle peaking at around 20% of the previous cycle’s peak gain. If this trend holds, it could imply that Bitcoin’s current cycle may see a modest 4.5x gain from its low point of around $15,500, leading to a cycle top around $70,000. In fact, Bitcoin briefly surpassed this level in March, reaching prices exceeding $73,000.","Despite Brandt’s analysis, skepticism remains prevalent, with some experts challenging the validity of his theory.","Giovanni Santostasi, CEO and director of research at Quantonomy, counters Brandt’s claims with an alternate model based on long-term power law behavior, according to Cointelegraph. Santostasi’s analysis suggests a potential peak for this cycle around December 2025, with Bitcoin reaching approximately $210,000.","These differing perspectives highlight the complexity of predicting Bitcoin’s future trajectory, with various models and factors influencing market sentiment.","Pav Hundal, lead analyst at Swyftx, anticipates Bitcoin doubling in value by the next halving in 2028, projecting a price of around $120,000. Meanwhile, Laurent Benayoun, CEO of Acheron Trading, envisages a potential cycle top of $180,000.","Amidst these speculations, Fidelity Digital Assets recently revised its medium-term outlook for Bitcoin, highlighting the cryptocurrency’s changing valuation dynamics.","It is worth noting that the latest Bitcoin halving has been carried out smoothly this month, possibly affecting companies engaged in managing the cryptocurrency’s operations. This event, happening every four years, has halved the mining reward the payment miners receive for confirming transactions on the network.","Moreover, a remarkable moment occurred in the Bitcoin network’s history at block height 840,000 during the halving, with a remarkable 37.7 Bitcoin (equivalent to $2.4 million) paid to the Bitcoin miner ViaBTC. This marked the highest fee ever recorded in the network’s 15-year existence."],"create_date":"2024-04-29T11:00:36+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122611/bitcoin-hits-1b-transactions-a-milestone-15-years-in-the-making/","web_url":"https://www.unlock-bc.com/","type":"article","description":"This milestone comes 15 years, 4 months, and 4 days after Satoshi Nakamoto mined Bitcoin\u0027s first block on January 3, 2009.","title":"Bitcoin Hits 1B Transactions, a Milestone 15 Years in the Making","content":["In a new milestone for the Bitcoin network, it has recently processed its one billionth transaction, marking a major moment in its 15-year history.","This achievement arrives 15 years, four months, and four days after Satoshi Nakamoto, the mysterious creator of Bitcoin, mined the network’s inaugural block on January 3, 2009.","Data from Clark Moody’s Bitcoin dashboard indicates that transaction number 1,000,000,000 was recorded in block 842,241 at 9:34 pm UTC on May 5. This translates to an average of 178,475 daily transactions over Bitcoin’s 5,603-day existence.","It’s worth noting that the Lightning Network, a layer 2 solution for Bitcoin primarily catering to microtransactions, isn’t included in this count. According to figures from the Bitcoin-only exchange River, the Lightning Network processed approximately 6.6 million transactions in August 2023 alone. This suggests that Lightning Network transactions may number in the hundreds of millions since its launch in January 2018.","Bitcoin’s daily transaction volume experienced a notable surge around its fourth halving event on April 20, with a record-breaking 926,000 transactions processed on April 23. This uptick in activity was partially attributed to the introduction of the Runes protocol, a novel Bitcoin token standard implemented at block 840,000.","However, daily transaction numbers have since moderated, with 660,260 transactions recorded on May 4. Despite being the oldest cryptocurrency network, Bitcoin isn’t the first to reach the one billion transaction milestone. Its major competitor, Ethereum, has processed well over 2 billion transactions since its launch in July 2015, according to Etherscan data.","Regarding market performance, Bitcoin’s price currently stands at $63,750, marking a 12% increase since reaching a two-month low of $56,800 on May 2. However, it remains 13.6% below its all-time high of $73,740 set on March 13, as reported by CoinGecko."],"create_date":"2024-05-06T05:42:33+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/121895/centralized-exchanges-jump-on-board-with-bitcoin-runes-listing/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The rush to launch Runes tokens post-protocol release resulted in unprecedented network fees on Bitcoin, surpassing previous records.","title":"Centralized Exchanges Jump on Board With Bitcoin Runes Listing","content":["Bitcoin’s latest venture into tokenization through the Runes fungible token standard has ignited considerable excitement in the cryptocurrency community.","Launched concurrently with the halving event, Runes tokens have already begun reshaping the landscape of digital asset trading on the original blockchain network. Notably, this surge in activity has prompted significant attention from centralized exchanges (CEXs), with Cayman Islands-based exchange Gate.io leading the charge.","Gate.io wasted no time in listing three of the earliest Runes tokens on Bitcoin: SATOSHI•NAKAMOTO, MEME•ECONOMICS, and WANKO•MANKO•RUNES.","While the naming convention may seem peculiar, these tokens represent the pioneering efforts in tokenizing assets via the Runes protocol. Of particular interest is the inclusion of WANKO•MANKO•RUNES, inspired by a story penned by Runes protocol creator Casey Rodarmor.","The rush to launch Runes tokens post-protocol release resulted in unprecedented network fees on Bitcoin, surpassing previous records. This frenzy highlights the importance of securing early slots for Runes tokens, imbuing them with provenance and potential value in the eyes of traders. Similar trends emerged with NFT-like assets on Bitcoin last year, further enhancing the appeal of early token inscriptions.","The involvement of centralized exchanges in listing Runes tokens signifies a major milestone for the protocol’s adoption. These exchanges play a crucial role in legitimizing assets, bridging the gap between the mainstream and decentralized crypto communities.","Gate.io’s proactive stance in embracing emerging trends, exemplified by its previous listing of ORDI tokens, positions it as a frontrunner in the Runes ecosystem.","While speculation lingers regarding the future listing of Runes tokens on major exchanges like Binance, the prospect remains uncertain. Conversely, OKX has explored Runes through its Web3 marketplace but has yet to list any tokens on its core CEX platform.","It is worth noting that Runes represents a paradigm shift in token creation on the Bitcoin blockchain, offering a more efficient alternative to previous standards like BRC-20. Unlike NFTs, Runes tokens are fungible and can be exchanged, mirroring the functionality of major networks like Ethereum and Solana. As Bitcoiners anticipate broader adoption of Runes, its integration into mainstream exchanges could propel the protocol to new heights of success."],"create_date":"2024-04-23T06:28:32+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122718/uae-blockchain-growth-attracts-10600-talents-crypto-oasis-report/","web_url":"https://www.unlock-bc.com/","type":"article","description":"UAE\u0027s blockchain growth: Active companies surge by 13%, drawing 10,600 talents. Insights from Crypto Oasis reports","title":"Crypto Oasis Report Reveals UAE Blockchain Ecosystem Surges by 13.3%, Attracting Over 10,600 Talents","content":["At the Dubai FinTech Summit 2024, Crypto Oasis unveiled the latest insights into the ever-evolving UAE blockchain ecosystem. Over the past year, the sector has witnessed remarkable growth, with active companies surging from 1,800 to 2,040, marking a significant 13.3% year-on-year increase. This surge underscores the industry’s robustness and innovation, bolstered by a workforce of over 10,600 professionals, comprising 71% native blockchain organizations and 29% non-native companies contributing to the ecosystem.","Within the vibrant UAE blockchain landscape, a diverse array of organizations fuels its continuous success. Traders, brokers, and asset managers dominate with 20.6%, closely followed by technology and advisory services at 19.9%. Notably, NFT platforms, venture capitalists, and the metaverse each contribute significantly. However, despite efforts to attract Web3 gaming companies, their presence remains modest at 3%, highlighting room for growth amidst competition, particularly from Saudi Arabia. Tokenization platforms carve out a niche, representing 1.5% of the country’s blockchain organizations.","The past year has been pivotal for the UAE’s blockchain space, solidifying its position as a global leader in innovation and disruption. Regulatory initiatives, spearheaded by the Virtual Asset Regulatory Authority (VARA), have ensured responsible growth and market integrity. Notable milestones include granting licenses to leading crypto service providers like Binance, OKX, Crypto.com, and others, enhancing the region’s appeal to blockchain enterprises.","Cryptocurrency adoption has surged in the UAE, bolstering its status as a burgeoning center for digital finance. Regulatory approvals, such as Ripple’s XRP token by the Dubai Financial Services Authority (DFSA), and the establishment of the Iota Ecosystem DLT Foundation in ADGM further underscore the country’s embrace of cutting-edge technologies.","The UAE has emerged as a hub for landmark blockchain events, hosting gatherings like Ripple Swell and Cardano Summit. TOKEN2049’s premier blockchain event in Dubai, with over 20,000 attendees, highlights the country’s premier status in global blockchain discourse.","Ralf Glabischnig, co-founder of Crypto Oasis, reflects on the remarkable journey, stating, “The Crypto landscape in the UAE and Middle East region is the fastest-growing ecosystem worldwide. This past year has been nothing short of phenomenal for the Crypto Oasis Ecosystem.” Glabischnig’s optimism underscores the UAE’s commitment to fostering a vibrant blockchain and Web3 environment through initiatives like Crypto Oasis.","As the Dubai FinTech Summit showcased, the UAE’s blockchain ecosystem continues to thrive, propelled by innovation, regulatory clarity, and global recognition. With a talented workforce and unwavering commitment to innovation, Crypto Oasis stands poised to lead the next wave of blockchain evolution. As stakeholders navigate challenges and seize opportunities, the journey towards Web3 dominance promises to be both transformative and exhilarating."],"create_date":"2024-05-07T09:14:43+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122665/bitcoin-privacy-service-zksnacks-ceases-operations-prompting-concerns-in-bitcoin-ecosystem/","web_url":"https://www.unlock-bc.com/","type":"article","description":"This move, impacting users seeking enhanced privacy in their cryptocurrency transactions, has stirred many discussions within the community.","title":"Bitcoin Privacy Service zkSNACKs Ceases Operations, Prompting Concerns in Bitcoin Ecosystem","content":["In a recent announcement, zkSNACKs, a prominent player in the Bitcoin ecosystem, revealed its decision to discontinue its CoinJoin coordination service.","This move, impacting users seeking enhanced privacy in their cryptocurrency transactions, has stirred discussions within the community and raised questions about the future of privacy-enhancing tools in the United States.","Max Hillebrand, CEO of zkSNACKs, shared insights into the decision exclusively with Cointelegraph. He cited the evolving legal landscape in the U.S. as a key factor driving the cessation of the CoinJoin service. Amidst regulatory uncertainties surrounding cryptocurrencies and privacy tools, maintaining compliance became paramount.","The closure of this service has also sparked reactions from notable figures, including former NSA whistleblower Edward Snowden, who expressed disappointment over the loss of a tool known for its privacy features.","Hillebrand emphasized the importance of the CoinJoin service in enhancing privacy within the Bitcoin ecosystem, acknowledging the setback its discontinuation represents. Despite this, he assured users that Wasabi Wallet, developed by zkSNACKs and incorporating the CoinJoin feature, will continue to operate as a standard Bitcoin wallet, without the privacy-enhancing service.","While alternatives such as Tor integration and custom coin selection still offer privacy benefits, Hillebrand acknowledged that the level of anonymity provided by CoinJoins remains unmatched. The closure of zkSNACKs’ CoinJoin coordination service also impacts other products and services within the ecosystem, including Trezor Suite and BTCPayServer, which will cease to offer the service to their users from June 2024.","In light of these developments, concerns linger about the broader implications for user privacy and the future of privacy protocols in the cryptocurrency space. Hillebrand refrained from speculating on potential crackdowns in jurisdictions beyond the U.S., underscoring the uncertainty prevailing in the regulatory landscape.","CoinJoin, as explained by Hillebrand, operates by combining multiple inputs and outputs from different users into a single transaction, obscuring transaction details and enhancing privacy. Wasabi Wallet, known for its rigorous privacy features, was launched in 2018 and has since been a favored choice among privacy-conscious users due to its robust architecture and commitment to anonymity."],"create_date":"2024-05-06T11:33:45+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122233/tokenization-insights-challenges/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Expert insights from a Chatham House rules roundtable on financial tokenization complexity and technology advancements","title":"Unveiling the Potential of Tokenization in Financial Markets: Insights from Industry Thought Leaders","content":["Tokenization, the transformative process of converting real-world assets into digital tokens on a blockchain, is poised to revolutionize the financial landscape. In a recent in-depth roundtable discussion among industry leaders, participants explored the multifaceted opportunities and challenges surrounding tokenization. This comprehensive report provides an extensive analysis of the key discussion points and nuanced insights shared during the dialogue.","The discourse commenced with a deep dive into the role of tokenization as a catalyst for financial evolution. By fragmenting assets into tradable tokens, tokenization offers unprecedented liquidity and accessibility, democratizing investment opportunities. Participants delved into diverse use cases spanning real estate, private equity, and alternative investments, highlighting how tokenization unlocks value in traditionally illiquid markets. Moreover, the discussion underscored the potential for tokenization to foster financial inclusion by enabling fractional ownership, thereby empowering a broader spectrum of investors.","In the UAE, tokenization has become a focal point of discussion, with regulators closely scrutinizing its potential, as emphasized in the latest statement from the CEO of VARA. Anticipated consultation papers from ADGM on the Regulatory Framework for Tokenized Real World Assets (RWA) are expected to begin possibly in early 2025. While the United States presents a challenging environment for cryptocurrencies, there is a noticeable surge in RWA tokenization projects originating from the US. Additionally, Europe, notably countries like Luxembourg and Switzerland, are witnessing significant engagement in the realm of tokenization.","Amidst these regulatory discussions, industry leaders emphasize the importance of avoiding overregulation. The sentiment within the industry is that there is a lot that can be accomplished within the current regulatory framework. “We are hoping to avoid overregulating,” remarks one industry insider. “Because I think that there is a lot of things that we can do today in the current regulatory environment. There’s not necessarily a need for new regulation, but there is a need to enforce existing ones”","Regulatory considerations emerged as a pivotal aspect of the discussion, with participants emphasizing the imperative of navigating evolving regulatory landscapes. While acknowledging the need for regulatory oversight to protect investors and ensure market integrity, stakeholders highlighted the importance of regulatory clarity and harmonization to foster innovation. Insights were shared on engaging with regulators to address legal ambiguities and promote compliance while championing the benefits of tokenization for market efficiency and transparency.","The dialogue pivoted to explore evolving market dynamics and investor sentiment surrounding tokenized assets. Participants exchanged perspectives on the growing appetite among both institutional and retail investors for exposure to tokenized assets. The discussion delved into the evolution of traditional financial assets like securities, highlighting the potential for technology to enhance existing processes. Alongside, there was a notable interest in exploring fund tokenization, evident from the recent consultation paper by the Investment Association in the UK.","Participants emphasized the significance of innovating financial market infrastructure to streamline operations effectively. Rather than solely pursuing new use cases such as fund tokenization, the focus remained on optimizing existing frameworks. This perspective resonated with broader conversations on investor sentiment, which also addressed concerns surrounding market volatility, security, and custody solutions. These discussions underscored the necessity for robust risk management frameworks and investor education initiatives.","Technology’s transformative role in facilitating tokenization and driving operational enhancements within financial markets was a focal point of discussion. Participants elucidated on the potential of blockchain technology to streamline processes, reduce intermediaries, and enhance transparency. Insights were shared on leveraging smart contracts for automated compliance and programmable functionalities to enable innovative financial products. Furthermore, discussions extended to interoperability challenges, scalability concerns, and the evolution of decentralized finance (DeFi) ecosystems as integral components of the tokenization landscape.","The observation made is that while there have been numerous attempts to tokenize existing products, participant believes the real potential lies in crafting digitally native products directly on a blockchain. This method not only ensures adherence to regulatory standards but also maximizes the advantages offered by blockchain technology. They stress the importance of transitioning towards engaging with market structures built on smart contracts and interoperable protocols, rather than focusing solely on end-users. Additionally, they underscore the necessity for regulators to recognize and accommodate this shift in their approaches.","There appears to be significant potential in leveraging blockchain technology to disrupt existing markets and broaden distribution opportunities, particularly for retail investors. However, regulatory concerns often arise as projects target retail investors, focusing on token safety and investor protection. Institutional support currently seems more robust. Nevertheless, a recurring question remains: why tokenize in the first place? Many fail to grasp the immediate benefits, but these often manifest once critical mass is attained. These benefits include expanded distribution and increased liquidity in secondary markets. However, these advantages may take time to materialize and are not immediate.","As the industry charts a course towards embracing tokenization, concerted efforts must be directed towards regulatory engagement, market education, and technological innovation. Continued dialogue, research, and pilot projects will be instrumental in navigating the evolving landscape and capitalizing on emerging opportunities. By fostering an ecosystem conducive to innovation and collaboration, stakeholders can pave the way for a more inclusive, resilient, and efficient financial future.","Special thanks to participants: Gabrielle Inzirillo, Oscar Wendel, Henzie Healley, Waqas Mirza, Jay Lee, Anthony Bassili, Daniel Coheur, Prakash Somosundram, Ashish Kumar Singh, Anver Jaladeen and Amna Alvi / Moderated by Walid Abou Zaki"],"create_date":"2024-04-26T15:24:40+00:00","tag":"","author":"Walid Abou Zaki"}
{"url":"https://www.unlock-bc.com/122510/cardano-foundation-dubai-blockchain-education/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Cardano Foundation and Dubai Blockchain Center join forces to enhance blockchain education. Integrating Cardano Academy content for training","title":"Cardano Foundation Partners with Dubai Blockchain Center to Boost Blockchain Education","content":["The Cardano Foundation has unveiled a significant alliance with the Dubai Blockchain Center (DBCC), renowned for its strides in technological innovation. This dynamic partnership aims to fortify and broaden the Cardano community, extending a warm invitation to both existing enthusiasts and newcomers to delve into the distinctive features of Cardano’s technology. This collaboration will introduce a specialized certification program tailored for Cardano enthusiasts, featuring educational seminars geared towards equipping individuals and organizations with comprehensive knowledge of the advanced functionalities and practical applications of the Cardano blockchain.","Both the Cardano Foundation and the Dubai Blockchain Center share a profound commitment to advancing blockchain education and awareness. Leveraging expertise from the Cardano Foundation’s subject matter specialists, this partnership will integrate content from the Cardano Academy into customized, face-to-face training sessions. This enduring collaboration aims to significantly elevate blockchain literacy and adoption throughout the MENA region, with plans to offer certified courses.","Expressing enthusiasm for the partnership, Frederik Gregaard, CEO of the Cardano Foundation, remarked: “Today, we’re thrilled to announce our partnership with the Dubai Blockchain Center. Blockchain stands as a pivotal technology with the potential to reshape societal norms for the better. Education stands as the cornerstone to realizing this change. Through partnerships with esteemed leaders like the Dubai Blockchain Center, we aim to broaden the scope and impact of our educational endeavors.”","Dr. Marwan Alzarouni, CEO of Dubai Blockchain Center and Senior Advisor to Dubai’s Department of Economy and Tourism, echoed this sentiment, stating: “We are excited to announce our collaboration with the Cardano Foundation, aligning with DBCC’s mission to advance education, training, and research in blockchain technology. Together, we aim to equip a new generation of blockchain enthusiasts with tailored educational programs and innovative technology solutions, specifically designed to support the application and understanding of Cardano’s advanced blockchain technology.”","Moreover, this partnership strengthens the burgeoning ties between the Cardano Foundation and key institutions in Dubai and the Middle East. Following the success of bringing the Cardano Summit to Dubai in 2023, the Foundation will once again host the summit from October 23rd to 24th this year.","In conclusion, Frederik Gregaard emphasized: “Dubai is increasingly recognized as a hub for blockchain technology, with ongoing investments and commitments to its advancement. By deepening our engagement in Dubai and the wider region, the Cardano Foundation remains steadfast in propelling the adoption and operational resilience of this pivotal technology.”"],"create_date":"2024-05-02T17:27:24+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/121885/x-platform-to-integrate-payments-with-in-app-wallet-what-about-crypto/","web_url":"https://www.unlock-bc.com/","type":"article","description":"\"If you ever have any incentive to take money out of our system, then we have failed,\" Head of Payments at X commented.","title":"X Platform to Integrate Payments with In-App Wallet, What About Crypto?","content":["Christopher Stanley, the head of payments at X, has unveiled ambitious plans for the platform, envisioning a future where users can seamlessly send money, make purchases, and earn interest within the app.","In an April 22 post, Stanley emphasized that X’s payment capabilities will extend far beyond simple transactions, offering users a comprehensive financial experience similar to traditional banking services.","Stanley likened X’s payment features to popular platforms like Venmo, indicating that users will initially be able to store and send money to other X users effortlessly. However, he emphasized that the platform’s evolution will see the integration of additional functionalities, including interest accrual, in-app purchases, and even support for retail transactions similar to Apple Pay.","The ultimate objective, according to Stanley, is to establish X as a self-contained financial ecosystem where users have little to no need to withdraw funds for their day-to-day transactions.","“If you ever have any incentive to take money out of our system, then we have failed,” Stanley asserted, highlighting X’s commitment to providing comprehensive financial services within its platform.","These revelations come shortly after X obtained a money transmitter license in Tennessee on April 19, bringing the total number of states where X holds such licenses to 25. This regulatory milestone highlights X’s dedication to compliance and its ongoing efforts to expand its financial services offerings across the United States.","Elon Musk, X’s executive chairman, previously announced plans to introduce in-app payment services midway through 2024 during a conversation with ARK Invest CEO Cathie Wood last December.","Despite delays attributed to bureaucratic processes, Musk’s vision for X’s financial services remains unwavering, with plans to integrate fiat currencies initially and potentially incorporate cryptocurrencies in the future.","While Musk has demonstrated enthusiasm for cryptocurrencies in the past, including Tesla’s holdings of Bitcoin and acceptance of Dogecoin as payment, he has tempered expectations regarding crypto integration on X. In a recent statement, Musk indicated a lack of focus on cryptocurrency matters, casting doubt on the immediate prospects of crypto utilization within the X platform, according to Cointelegraph.","As X continues to advance its payment capabilities and navigate regulatory landscapes, stakeholders eagerly anticipate the platform’s evolution into a comprehensive financial hub, reshaping the landscape of digital transactions and financial services."],"create_date":"2024-04-23T05:36:20+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122635/enocs-bold-step-visionary-partnership-loyyal-zaid-alqufaidi/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Dive into ENOC Group\u0027s transformative collaboration with Loyyal. Explore how this partnership is reshaping loyalty programs in the UAE,","title":"Pioneering Loyalty: ENOC\u0027s Bold Step with Loyyal, According to Zaid Alqufaidi","content":["In a bold move towards innovation, ENOC Group, a stalwart in the energy sector, has embarked on a transformative journey by partnering with Loyyal, a pioneering force in technology solutions. This groundbreaking collaboration heralds a new era for ENOC’s acclaimed ‘YES’ Rewards program, promising unprecedented opportunities for its members and reshaping the landscape of loyalty programs in the UAE. Unlock Blockchain had the chance to uncover the profound impact of this groundbreaking collaboration when we discuss it with Zaid Alqufaidi, the Managing Director of ENOC Retail.","“ENOC’s partnership with Loyyal represents our commitment to fostering a responsible and eco-conscious digital ecosystem, in alignment with the nation’s aspirations to lead the future of finance and technology,” states Zaid Alqufaidi, Managing Director of ENOC Retail.","Alqufaidi elaborates on the alignment of the blockchain-based loyalty program with the UAE’s vision, emphasizing, “The global financial landscape is undergoing significant transformation driven by unprecedented digital payment adoption. The UAE is a frontrunner in the global digital payments market and is today redefining the future of finance by embracing innovative blockchain technology and cryptocurrencies.”","“The introduction of a blockchain points exchange platform enables Yes Rewards to become a far more agile program, allowing for partnership complexities and legalities around point swaps on a single platform,” Alqufaidi explains. “Under ENOC Group’s digital transformation strategy, we remain committed to fostering a responsible and eco-conscious digital landscape.”","“Loyyal’s Access Point platform organically expands our partner network, offering an extensive ecosystem for our customers to enjoy a wide spectrum of loyalty benefits,” notes Alqufaidi. “Members can now earn points from a variety of new merchants outside of the ENOC ecosystem, allowing them to accumulate points faster.”","Alqufaidi further elaborates on the collaboration’s benefits, stating, “The platform is built on Loyyal’s proprietary blockchain technology, delivering decentralized ledger technology combined with tokenized loyalty to drive greater efficiency, transparency, and complete traceability combined with fully governed automated smart contracts.”","“Our collaboration with Loyyal underpins our commitment to reshape customer engagement experiences,” Alqufaidi emphasizes. “Prioritizing the needs of our customers and leveraging optimized digital solutions, we aim to set new benchmarks for excellence in the UAE’s dynamic marketplace.”","Alqufaidi envisions the role of YES Rewards in ENOC’s long-term customer engagement strategy, stating, “Digitalization is a key enabler of our customer engagement strategy. By integrating technology to enhance our customer interactions, we are focused on creating a brand experience that’s interactive and customer-centric.”","“Data security and customer privacy are paramount for ENOC,” assures Alqufaidi. “The blockchain adds another strong layer, ensuring transparency and complete data security for all our members.”","Alqufaidi also elaborates on profitability, stating, “Our collaboration with Loyyal’s wider ecosystem ensures that ‘YES’ Rewards emerges as a beacon of profitability and sustainability. By enabling swift partnerships and facilitating cost-effective operations, Loyyal’s platform revolutionizes the economics of loyalty programs.”","In essence, ENOC’s partnership with Loyyal signifies a bold step towards redefining loyalty in the digital age, unlocking a future where innovation, customer-centricity, and technological prowess converge to create unparalleled value for members and stakeholders alike."],"create_date":"2024-05-06T07:18:19+00:00","tag":"","author":"Walid Abou Zaki"}
{"url":"https://www.unlock-bc.com/122784/bitpanda-mena-stellar-team-uae-crypto-expansion/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Explore how Bitpanda MENA\u0027s strong team leads UAE market entry and expansion from the thriving DMCC Crypto Centre","title":"Bitpanda MENA: Unlocking Crypto Potential in the UAE with a Stellar Team","content":["Bitpanda, as Europe’s premier cryptocurrency exchange platform and Austria’s inaugural unicorn company, has made a significant stride into the Middle East by launching Bitpanda MENA. This strategic move not only underscores Bitpanda’s commitment to global expansion but also signals the region’s growing appetite for digital assets.","Bitpanda’s entrance into the UAE market is bolstered by a robust team of industry veterans, each bringing a wealth of expertise and experience to the table. Led by Walid Benothman, formerly associated with 1inch Network, Bitpanda MENA is poised to make a splash in the region’s crypto landscape.","Joining Benothman is Nadeem Ladki, appointed as Vice President, Commercial – International \u0026 MENA. With a proven track record at changer.ae and as the former Executive Director, Head of Business Development \u0026 Partnerships – EU/UK \u0026 MENA at Binance, Ladki’s deep understanding of regulatory compliance and business development positions Bitpanda MENA for success in navigating the local market.","Waleed Rassuli, with his background as Managing Director at Tezos Foundation, assumes the critical role of Head of Operations. Rassuli’s expertise in blockchain technology and operational management adds another layer of strength to Bitpanda MENA’s leadership team.","Bitpanda’s strategic move to set up its inaugural office in Dubai at the DMCC Crypto Centre reflects its dedication to capitalizing on the region’s flourishing crypto ecosystem. Ahmed Bin Sulayem, Executive Chairman and CEO of DMCC, expressed, “DMCC is delighted that Bitpanda has announced its expansion to the Middle East via Dubai. As one of the leading names in the European crypto space, we look forward to working with Bitpanda through the DMCC Crypto Centre and its over 600 member companies as the ecosystem grows. We’re thrilled to welcome another unicorn to Dubai.” With this strategic location, Bitpanda is well-positioned to harness the expertise and resources available at the DMCC Crypto Centre to fine-tune its offerings and cater to the distinctive requirements of the UAE market.","Eric Demuth, co-founder and CEO of Bitpanda, expressed confidence in the region’s potential in an interview with the Emirates News Agency (WAM), citing the UAE’s favorable regulatory environment for crypto innovation. Through Bitpanda Technology Solutions (BTS), the company aims to provide the infrastructure necessary to drive trading growth and unlock digital assets for millions of investors in the region.","As Bitpanda MENA moves forward in its pursuit of obtaining the Virtual Asset Regulatory Authority licenses as announced by DMCC Crypto Centre, and prepares to introduce its trading solutions, attention is drawn to its accomplished team. With a focus on maintaining high standards and following a clear path to success, Bitpanda MENA aims to establish itself as a significant player in the region’s crypto ecosystem."],"create_date":"2024-05-08T09:46:30+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/119050/bitcoins-rise-challenges-wall-street-embrace-or-resist/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Despite criticism, Bitcoin\u0027s recent surge to record levels highlights its resilience and enduring appeal across diverse demographics.","title":"Bitcoin\u0027s Rise Challenges Wall Street: Embrace or Resist?","content":["Jamie Dimon dismisses it as nothing better than a “pet rock,” the late Charlie Munger, longtime lieutenant to Warren Buffett, deems it “massively stupid,” and US Senator Elizabeth Warren regards it as a great tool for terrorists, drug dealers, or fraudsters (Bloomberg). Despite the criticism, Bitcoin is demonstrating resilience and longevity. Its recent surge, reaching record levels like $40,000, $50,000, and then $60,000, underscores the unwavering demand across diverse demographics.","Even as traditional Wall Street figures, like Vanguard, continue to resist embracing the volatile cryptocurrency, others, such as Bank of America’s Merrill Lynch and Wells Fargo \u0026 Co., are gradually succumbing to the pressure by offering limited access to Bitcoin exchange-traded funds (ETFs). Michael Novogratz, the billionaire founder and chief executive officer of Galaxy Digital Holdings Ltd, emphasizes that public belief in its value persists despite criticism from influential figures like Jamie Dimon and Elizabeth Warren. He states in an interview on Bloomberg TV, “Doesn’t matter what Jamie Dimon or Elizabeth Warren, his good buddy, said. A lot of people believe there’s value here.”","This persistent demand presents a dilemma for the investment industry. Some firms, like Vanguard, maintain a cautious approach, while others, like Bank of America and Wells Fargo, are giving clients what they want by providing access to Bitcoin ETFs without endorsing them outright. The influx of funds into these ETFs is substantial, with approximately $8 billion in net inflows, primarily led by investment giants Fidelity and BlackRock. Michael Novogratz stated “Wall Street will embrace whatever will raise them money so that doesn’t let you know whether it’s good or bad.”","However, the surge in demand and the rapid rise in Bitcoin’s price pose potential risks. Concerns range from scams, such as “rug pulls,” to market risks due to high leverage, warns Jimmy Su, chief security officer at Binance. As the self-described “degen” traders chase the rally, they are loading up on borrowed funds to help max out trading profits after such leverage all but dried up with the demise of crypto lenders like Celsius almost two years ago.","The cumulative open interest in Bitcoin derivatives, with the potential for leverage up to 100 times, has surged by nearly 90% since October on centralized exchanges. This increase has propelled it to the highest level observed since the onset of 2022, marking a period when the previous crypto bull run came to an end, as reported by CCData. Crypto exchanges such as Binance, OKX, and Bybit are all witnessing a notable spike in open interest, reminiscent of levels not witnessed since the peak of the 2021 bull market, according to CCData.","Additionally, the loan book at Ledn, a platform that lends money secured by Bitcoin collateral, has rebounded to levels last witnessed before the collapse of the FTX exchange in late 2022, according to Mauricio Di Bartolomeo, the co-founder of Ledn. Consequently, many anticipate that a reversal, to some extent, of the recent rally is more a matter of when than if. CME Group’s digital asset products are concurrently registering record volumes, reflecting the increasing interest from Wall Street investors seeking traditional avenues to hedge their risk.","Despite these risks, the legitimacy conferred by new Bitcoin ETFs marks a significant shift in the perception of cryptocurrencies on Wall Street. This contrasts with previous crypto cycles driven by speculators and risky products that eventually collapsed. The current wave of investors includes a broader demographic, with Baby Boomers and older individuals entering the crypto market for the first time.","While hope and hype have historically fueled crypto bull markets, the entrance of traditional financial institutions and the approval of Bitcoin ETFs by SEC Chairman Gary Gensler add a layer of irony to the crypto narrative. The founder of Bitcoin, Satoshi Nakamoto, envisioned it as an alternative to mainstream finance, free from centralized regulation. Michael O’Riordan, founding partner of Blackwater, an ETF consulting firm, remarks, “With Bitcoin ETFs, the opposite has happened. Satoshi would be turning in his grave.”","The market’s future remains uncertain, and the recent renewal of the digital asset market is not without its complexities and contradictions. Yet, the enduring presence of Bitcoin suggests that, for better or worse, Satoshi’s creation is thriving over 15 years after its inception, even as the identity and fate of its enigmatic creator remain unknown."],"create_date":"2024-03-02T08:05:17+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/121749/medad-franklin-templeton-yieldcoin-uae/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Yieldcoin, is a token combining stability \u0026 growth, is poised to transform UAE investments. Medad Holding \u0026 Franklin Templeton partner","title":"Medad Holding and Franklin Templeton Forge Strategic Partnership to Introduce Yieldcoin Innovation in the UAE","content":["Medad Holding and Franklin Templeton have united in a groundbreaking partnership set to transform the financial landscape of the United Arab Emirates (UAE). This collaboration is centered on introducing a pioneering tokenized digital asset – the yieldcoin. Yieldcoins represent a fusion of traditional financial instruments with cutting-edge blockchain technology, offering investors a new paradigm for investment.","By amalgamating the stability of a money market fund security with the accessibility and flexibility of a stablecoin, yieldcoins provide investors with an enticing proposition for cash and collateral transactions. This innovative concept fills a crucial market gap, delivering the benefits of stability alongside growth potential.","Franklin Templeton assumes a pivotal role in this partnership, offering more than mere collaboration. They provide essential infrastructure and servicing for yieldcoins through their innovative BENJI tokenization suite. Launched in 2021, the BENJI suite tokenizes shares of the Franklin OnChain U.S. Government Money Market Fund (FOBXX). This fund invests significantly in U.S. government securities, cash, and repurchase agreements, aiming to deliver high current income while ensuring liquidity and maintaining a stable $1 share price.","Moreover, holding a stablecoin that represents BENJI stablecoin with all collaterals information available on a public blockchain, which naturally accrues interest, can integrate a mechanism where the holding wallet or liquidity pool is regularly topped up with the accrued yield. This mechanism enhances the value proposition of yieldcoins by providing investors with a steady stream of income.","Medad Holding’s affiliation with Al Hail Holding adds another layer of depth to this partnership. Both entities, along with Franklin Templeton, are major investors in Zand Bank, a recently established digital bank. Zand Bank’s crypto-friendly approach positions it to capitalize on the growing acceptance of cryptocurrencies in the UAE. Indications suggest that the bank is exploring becoming a digital asset custodian, solidifying its role in the crypto landscape.","Medad Holding is set to actively engage with VARA and the Abu Dhabi Global Market (ADGM) to determine the optimal launch location for a USD stablecoin. This initiative further cements the UAE’s status as a hub for blockchain innovation. The Central Bank of the UAE (CBUAE) is expected to announce regulations regarding stablecoins and Central Bank Digital Currency (CBDC) by late April or early May 2024. These regulations mark a pivotal moment for the UAE, showcasing the country’s commitment to fostering a progressive environment for digital asset innovation.","With Medad Holding and Franklin Templeton’s expertise and strategic partnerships leading the way, the UAE is poised to become a leader in blockchain technology and digital asset adoption. The introduction of yieldcoins, alongside impending regulatory frameworks, underscores the UAE’s steadfast commitment to shaping the future of finance."],"create_date":"2024-04-19T03:00:00+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122683/sec-does-it-again-robinhood-under-regulatory-review-over-crypto-operations/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The U.S. Securities and Exchange Commission (SEC) has issued a Wells notice to the firm, indicating its intention to pursue legal action.","title":"SEC Does It Again: Robinhood Under Regulatory Review Over Crypto Operations","content":["Robinhood, a leading player in the financial services sector, finds itself under the regulatory spotlight once again.","The U.S. Securities and Exchange Commission (SEC) has issued a Wells notice to the firm, indicating its intention to pursue legal action. This development comes amidst growing concerns regarding the firm’s alleged securities violations, as disclosed in an 8-K filing.","The SEC’s move is part of a broader trend of regulatory scrutiny towards crypto-related activities. Robinhood’s cooperation with the SEC’s investigative subpoenas regarding its crypto operations seemingly triggered the issuance of the notice.","A Wells notice typically represents the final opportunity for the accused party to defend itself before facing legal proceedings, although such notices often culminate in lawsuits.","Dan Gallagher, Robinhood’s legal, compliance, and corporate lead, emphasized the firm’s ongoing dialogue with the SEC regarding its crypto offerings over the years. Despite Robinhood’s proactive engagement with regulators, the specific tokens considered securities by the SEC remain unclear. The firm had previously delisted several tokens in response to regulatory actions against competitors.","In response to the SEC’s demands, Robinhood sought to register as a special purpose broker-dealer with the agency, a process fraught with challenges. Notably, former SEC commissioner Dan Gallagher testified before Congress about the inefficiencies of this registration process, highlighting regulatory hurdles faced by firms attempting compliance.","The SEC’s enforcement actions against crypto firms, including Robinhood, are seen by many as attempts to assert authority over a rapidly evolving industry. Despite legal victories, the SEC’s approach has faced criticism and legal challenges. The outcome of Robinhood’s situation remains uncertain, with potential implications for the broader crypto market.","While the regulatory landscape for crypto remains uncertain, the market’s response to Robinhood’s situation suggests a degree of resilience. Nevertheless, ongoing regulatory battles highlight the need for clearer guidance and effective dialogue between regulators and industry stakeholders, which is an instance that the SEC has been avoiding."],"create_date":"2024-05-07T05:45:59+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122518/cryptocurrency-in-the-uae-vasps-economic-impact-regulatory-framework-and-stakeholder-insights/","web_url":"https://www.unlock-bc.com/","type":"article","description":"This report delves into cryptocurrency\u0027s impact on the UAE, including market trends, regulations, and insights from an industry roundtable.","title":"Cryptocurrency in the UAE: VASPs\u0027 Economic Impact, Regulatory Framework, and Stakeholder Insights","content":["The global rise of cryptocurrencies has sparked a myriad of discussions surrounding their economic impact, market dynamics, and regulatory frameworks. This report delves into these topics within the context of the United Arab Emirates (UAE), exploring the economic impact of Virtual Asset Service Providers (VASPs), market trends, and the regulatory landscape. Through an in-depth roundtable discussion among industry experts, this report provides insights into the evolving crypto ecosystem in the UAE, shedding light on both opportunities and challenges in this rapidly developing sector.","Dubai’s global appeal, with over 200 nationalities, fosters a dynamic environment for business and leisure. The Virtual Assets Regulatory Authority (VARA), born from Dubai’s pandemic resilience, seized the crypto industry’s potential, licensing 18 VASPs in 18 months. Recognizing both the industry’s need for regulation and the potential for economic diversification, VARA was established in March 2022. This aligns with Dubai’s D33 agenda for digital transformation, aiming to position the city as a blockchain and crypto innovation hub.","Upholding investor protection and international standards like FATF, VARA ensures Dubai’s status as a trusted financial jurisdiction. VARA stands out as the sole dedicated virtual asset regulator in the UAE, building its framework from scratch. Through industry consultation and collaboration, VARA remains agile in its regulatory role, supporting the ecosystem’s growth. Recent workshops with law enforcement agencies demonstrate VARA’s commitment to ensuring a comprehensive understanding of regulations across all stakeholders.","The roundtable discussion delved into the complexity of the regulatory landscape in the UAE, acknowledging the confusion it may pose to many, particularly foreign investors. While VARA stands out for its dynamic approach, other regulatory bodies like Abu Dhabi Global Market (ADGM) in Abu Dhabi and Dubai International Financial Centre (DIFC) in Dubai add layers to the regulatory framework.","Efforts are underway to harmonize licensing and regulatory practices between VARA and other authorities, aiming to prevent regulatory arbitrage. For instance, an MOU (Memorandum of Understanding) is being developed to allow licensed entities in Dubai by VARA to operate across different regulatory jurisdictions without additional licensing requirements. The MOU being worked on will facilitate the passportability of licenses between VARA and the Securities and Commodities Authority (SCA). This initiative aims to ensure consistency and prevent regulatory arbitrage between the two regulatory bodies.","All regulatory bodies collaborate through committees like the AML Compliance Committee to ensure consistency and transparency, fostering dialogue and cooperation among regulators. This collaborative approach aims to address challenges and maintain regulatory integrity across the UAE. Additionally, awareness initiatives and education programs are in place to empower individuals and investors with the knowledge needed to navigate the regulatory environment effectively.","Despite the perceived complexity, participants highlighted the necessity of regulatory processes, tailored to the type of activity undertaken. While VARA and ADGM adhere to minimum federal standards, operational differences exist between mainland and financial free zones. Ultimately, the choice of jurisdiction depends on individual business requirements and strategies.","Participants stressed the importance of understanding business objectives before selecting a regulatory jurisdiction and called for clearer guidance for companies entering the UAE to navigate the regulatory landscape effectively.","Discussion also centered on the economic impact of VASPs in the UAE. Since VARA’s inception, there has been an increase of at least 30% in the number of companies operating in virtual assets, web3 technologies, and blockchain mining. To support these firms, VARA has implemented initiatives like reduced fees and regulatory assistance, emphasizing the importance of companies enhancing internal capabilities and seeking professional guidance.","Taking a global perspective, a participant noted the cryptocurrency industry’s substantial funding, reaching approximately $3 billion in the first quarter of the year. They emphasized the role of suitable jurisdictions for VASPs to thrive, attracting investments from around the world and fostering employment opportunities across various sectors.","The discussion also shed light on the crypto sector’s allure for both international enterprises seeking regional presence and local startups eyeing expansion, underscoring its potential to stimulate economic development and accommodate diverse players.","Furthermore, the significance of human capital management within exchanges and brokerages was highlighted, with considerations ranging from operational efficiency to strategic objectives, shaping organizational structures and resource allocation.","Praising Dubai’s regulatory environment for its clarity and ease of navigation compared to other jurisdictions, participants lauded VARA’s dedicated focus on the crypto space, facilitating transparent communication and guidance for industry stakeholders. Dubai’s regulatory clarity, coupled with the cryptocurrency industry’s potential for substantial economic growth, positions the city as an attractive destination for global players.","According to the annual crypto adoption index reported by Chainalysis, the UAE has emerged as a significant crypto hub. This is attributed to various initiatives and the presence of diverse actors in the region. In absolute terms, the UAE ranked second in the region in terms of the value of crypto it received. Turkey topped the list in the region.","Notable trends in institutional adoption were also observed. Transactions above $10,000 to a million are considered professional investments, while those over a million are classified as institutional investments. Data suggests that 60 to 67% of transactions in the UAE fall into these higher value categories, indicating growing institutional interest.","Additionally, Chainalysis research on decentralized finance activity revealed that the UAE leads the MENA region, with almost 48% of crypto activity occurring on decentralized exchanges. Furthermore, UAE residents saw significant capital gains in 2023, totaling approximately $204 million, ranking the country among the top 50 globally for capital gains. Also, in terms of NFT website visits, the UAE recorded an impressive figure of almost 4 million visits from mid-2022 to mid-2023.","With regulatory bodies like VARA, SCA, and ADGM, the UAE has emerged as a global hub for investors. Numerous VASPs operate in the market, yet it’s not gaining traction. One participant observed a parallel with other industries like traditional finance, where an abundance of brokers led to acquisitions eventually. They anticipate a similar trend in this sector, with plans already underway. Many players aim for long-term growth and potential buyouts.","While some question if there’s enough business for everyone, the panel remains optimistic. However, they foresee many VASPs closing down in the coming years. Success hinges on operational efficiency and a strong management team with industry expertise and good compliance officers, not just the desire for quick profits. Experienced and qualified individuals are favored over large teams. They caution that companies from outside the region may struggle due to underestimating the complexities and cultural nuances of doing business here.","The discussion on compliance in the crypto industry highlighted various challenges and strategies for ensuring regulatory adherence while minimizing costs and risks. One concern raised was the lack of readily available tools for monitoring secondary markets and the stable coin ecosystem, leading to high costs for compliance. The alternative, however, is facing substantial fines for non-compliance, making effective compliance efforts a preferable option.","Vara CEO, Matthew White’s proposal to have big players handle or share compliance costs sparked discussions on how this could be implemented without compromising user privacy. Some participants questioned whether big players would willingly bear the compliance costs of smaller entities.","The panel emphasized the importance of having dedicated compliance officers to ensure accountability and regulatory adherence. While finding capable compliance officers may be challenging, the benefits of technology in automating compliance processes and outsourcing certain activities to industry experts. Additionally, the panelists highlighted the benefits of blockchain technology for compliance efforts. The transparency and traceability offered by blockchain make it easier to understand counterparties and track transactions, thereby streamlining compliance processes.","The discussion also touched on VARA’s approach to assessing smaller companies utilizing shared service providers from larger entities. While no decision has been reached yet, VARA maintains the requirement for dedicated compliance officers and accountability within firms, even if certain activities are outsourced.","Overall, the panel discussion underscored the importance of effective compliance measures in navigating the complexities of the crypto industry while upholding regulatory standards and protecting stakeholders’ interests.","During the recent FATF meeting, significant emphasis was placed on the travel rule, a topic of ongoing interest within the VASP sector. However, this discussion revealed various challenges, particularly in transactions between jurisdictions where the travel rule may not apply on one end. The inconsistency in travel rule requirements across jurisdictions presents hurdles for local licensees, leading to reliance on a risk-based approach. For instance, while Europe sets the threshold at 1000 euros and Singapore at one Singaporean dollar, the UAE lacks a specific threshold, opting for a conservative approach with minimal thresholds. Looking ahead, it is anticipated that the travel rule will continue to be a pressing issue until a global regulatory framework aligns on common thresholds.","Prioritizing investor protection and compliance with international standards, such as those set by FATF, is vital for the UAE. The recent removal of the country from the FATF grey list underscores its commitment to combating financial crimes like money laundering. While being on the green list provides certain advantages, such as facilitating on and off ramps for crypto transactions, sustaining this status necessitates continuous investment in anti-money laundering measures and regulatory frameworks.","The travel rule, though not new to the financial industry, poses complexities for crypto businesses. Implementing reporting requirements akin to traditional finance has proven challenging. However, compliance is non-negotiable, and companies must navigate these requirements through technology or manpower. Concerns arise regarding transactions involving jurisdictions not yet compliant with the travel rule. While solutions are being developed, manual processes currently prevail, necessitating meticulous record-keeping and reporting. Despite ongoing efforts by external service providers, achieving full automation remains a work in progress.","VARA has mandated specific compliance and risk management guidelines for VASPs, requiring them to meet minimum data requirements for the travel rule. There are ongoing efforts to integrate KYC tools into the licensing system, ensuring institutional compliance. Additionally, VARA is exploring the creation of a centralized hub for VASPs to access services, enhancing compliance efficiency for larger institutional companies. Regarding cross-border transactions, they noted the availability of tools for implementing the travel rule and conducting enhanced due diligence, though initial costs may be high. However, they anticipate a decrease in costs over time with technology adoption. Overall, they expressed confidence in the industry’s synchronization and predicted that travel rule compliance would become standard practice akin to other technologies or tools in the industry.","Special thanks to participants: Dr. Ayesha Binlootah, Oscar Wendel, Arushi Goel, Eric Turner, Henzie Healley, Daniel Ahmed, Talal Tabbaa, Mehtap Önder, and Deepak Garg / Moderated by Walid Abou Zaki"],"create_date":"2024-05-03T04:40:26+00:00","tag":"","author":"Salma Naueihed"}
{"url":"https://www.unlock-bc.com/122225/web3-acceleration-cohort-3-elysium-chain/","web_url":"https://www.unlock-bc.com/","type":"article","description":"TDeFi and DMCC present Web3 Acceleration Program Cohort-3 with Elysium Chain partnership. Propel blockchain innovation","title":"TDeFi and DMCC Introduce Cohort-3 of Web3 Acceleration Program, Partnering with Elysium Chain","content":["The Web3 Acceleration Program, a collaborative effort between TDeFi and DMCC aimed at supporting founders in scaling their Web3 ventures, has teamed up with Elysium Chain as its blockchain partner for the program’s Cohort-3. Elysium Chain, developed by Vulcan Forged, renowned for its fast transaction speeds and scalability, offers potential in various areas such as AI, Metaverse, and Gamefi.","Cohort-3 of the Web3 Acceleration Program spans two months, assisting projects in their transformation into fully-fledged businesses. The program features mentorship from industry leaders like Mario Nawfal, Ravikant Agrawal, Aamir Ghai, Jamie Thomson, and others, providing valuable insights on fundraising, compliance, tokenomics, and go-to-market strategies through immersive sessions.","Gaurav Dubey, CEO of TDeFi, emphasizes the program’s role in empowering crypto product developers with essential skills and feedback crucial for their journey from product development to business establishment.","During the Demo Day, startups will present their ideas to a select group of investors, with Elysium Chain committing to invest US$150,000 in the top three startups. Jamie Thomson of Elysium Chain underscores the chain’s alignment with future technologies and sustainability, expressing support for innovative projects through this investment.","Building upon the success of previous iterations, Cohort-3 will follow a three-phased approach covering induction, mentor sessions, and Demo Day, addressing key operational areas such as product development, scaling, recruitment, fundraising strategy, compliance, marketing, and community growth. Ahmad Hamza, Executive Director Free Zone at DMCC, highlights the program’s alignment with DMCC’s vision of supporting entities from ideation to robust business establishment, reflecting its commitment to fostering business growth and innovation."],"create_date":"2024-04-26T11:30:06+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122741/block-issue-1-5b-senior-notes-alongside-bitcoin-integration-strong-earnings/","web_url":"https://www.unlock-bc.com/","type":"article","description":"In terms of its debt structure, Block has mostly relied on the convertible debt market for external capital since its initial public offering.","title":"Block Set to Issue $1.5B in Senior Notes Alongside Bitcoin Integration and Strong Earnings","content":["Fintech firm Block (formerly Square) has unveiled plans to issue $1.5 billion in senior notes through a private placement aimed at qualified institutional investors.","The specifics of the notes, including interest rates and maturity dates, are currently under negotiation with initial purchasers. The round is open to investors such as pension funds, banks, mutual funds, and high-net-worth individuals.","Following the announcement, Block’s shares surged over 4%, reaching $72.40 at the time of reporting.","Private placements serve as a means of raising capital by selling securities to a limited pool of investors rather than through a public offering. Block intends to utilize the funds raised for various purposes, including debt repayment, potential acquisitions, capital expenditures, investments, and working capital.","According to Cointelegraph, Block is strategically positioned to benefit from the growth opportunities in payments and consumer financial services sectors.","In terms of its debt structure, Block has predominantly relied on the convertible debt market for external capital since its initial public offering. As of March 2024, the company had approximately $2.15 billion in outstanding convertible notes, along with a revolving credit facility of $775 million available until June 2028, and $2 billion in senior unsecured notes due in 2026 and 2031.","Fitch Ratings noted that the announced debt raise would facilitate the refinancing of upcoming maturities while enhancing the company’s already robust balance sheet.","It is worth noting that Block made headlines as one of the earliest public companies to add Bitcoin to its balance sheet. Co-founder Jack Dorsey recently disclosed plans to allocate 10% of the gross profit from Bitcoin products towards BTC purchases on a monthly basis. Between the fourth quarter of 2020 and the first quarter of 2021, Block purchased $220 million worth of Bitcoin.","In the first quarter of 2024, Block exceeded market expectations with its earnings performance. The firm’s Bitcoin gross profit amounted to $80 million, representing 3% of its $2.73 billion Bitcoin revenue. Additionally, its mobile payments and crypto platform Cash App generated $1.26 billion in gross profits for Q1, marking a 25% increase from the previous year.","Overall, Block reported a total gross profit of $2.09 billion for the first quarter, up 22% year-on-year, with total revenue reaching $5.96 billion and per-share earnings surpassing analysts’ forecasts at $0.85.","With this said, Jack Dorsey has emerged as a prominent advocate for Bitcoin and cryptocurrency adoption. His recent revelation regarding Block’s monthly dollar-cost averaging strategy into Bitcoin has captured widespread attention across the crypto community.","By committing 10% of Block’s gross profit from Bitcoin products to regular Bitcoin purchases, Dorsey signals his enduring bullish stance on the leading cryptocurrency.","As mentioned above, Block’s latest quarterly report unveiled a remarkable surge in Bitcoin revenue, soaring to $2.73 billion year-over-year. This uptick highlights the increasing demand for Bitcoin-related products and services offered by the company. With a portion of profits dedicated to Bitcoin purchases, Block aims to amplify its exposure to the cryptocurrency market and capitalize on its potential for future value appreciation. This proactive investment strategy aligns seamlessly with Block’s overarching vision of embracing digital assets as integral components of its business model.","Moreover, Block’s fundraising initiative and strategic emphasis on Bitcoin epitomize broader shifts within the fintech industry. As cryptocurrencies gain traction as legitimate asset classes, fintech firms like Block are strategically positioning themselves to capitalize on this evolving market landscape. By integrating Bitcoin-related offerings into their platforms, fintech companies stand to attract a fresh cohort of investors and customers seeking exposure to digital assets.","Block, Inc.’s ambitious endeavor to raise $1.5 billion underscores its commitment to innovation and growth within the fintech and cryptocurrency realms. Jack Dorsey’s bold vision for incorporating Bitcoin into Block’s operational framework also highlights the transformative potential of digital assets in reshaping traditional finance.","As Block continues to expand its footprint in the industry, its fundraising endeavors are poised to catalyze broader adoption and acceptance of cryptocurrencies, notably Bitcoin, within the financial ecosystem."],"create_date":"2024-05-07T11:25:51+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122834/ftx-bankruptcy-cash-reimbursement-not-crypto/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Explore how FTX\u0027s bankruptcy plan prioritizes full CASH reimbursement for creditors over CRYPTO , without factoring in asset value gains","title":"FTX Bankruptcy Plan Offers Full Cash Reimbursement to Creditors, not crypto! The House Wins","content":["In a significant development following its bankruptcy filing, cryptocurrency exchange FTX is moving forward with a plan that could see some of its creditors fully reimbursed for their losses. However, the catch is that these reimbursements will be in cash, omitting any gains from the surge in digital asset prices since the exchange’s collapse in November 2022.","The proposed bankruptcy plan, detailed in a recent news release by FTX, outlines a path to provide relief to 98% of its creditors, including individual investors who had $50,000 or less with the company. If approved by both the court and creditors, these individuals can expect to receive the full amount of their lost funds within 60 days of the plan’s implementation.","The proposed Plan aims to distribute the majority of FTX’s assets, valued between $14.5 and $16.3 billion, to creditors and customers worldwide, surpassing the total debts owed to creditors, which are estimated at $11 billion.","FTX’s rationale behind this decision lies in the massive shortfall it faced at the time of filing for bankruptcy, particularly in its holdings of bitcoin and Ethereum. With only a fraction of the digital assets that customers believed the platform possessed, FTX has had to explore alternative avenues to repay creditors, focusing on monetizing other assets to generate funds for reimbursement.","John J. Ray III, Chief Executive Officer and Chief Restructuring Officer of FTX, expressed the company’s perspective on the plan, stating, “We are pleased to be in a position to propose a chapter 11 plan that contemplates the return of 100% of bankruptcy claim amounts plus interest for non-governmental creditors.”","While the plan promises full repayment to non-governmental creditors based on the valuation of their claims as determined by the Bankruptcy Court, the exclusion of digital asset gains underscores the complexities of managing assets in the volatile cryptocurrency market, especially in the context of bankruptcy proceedings.","Interestingly, FTX’s press release did not address the fate of FTT holders. FTT continues to circulate on major exchanges, currently trading at $1.85 per token, marking a 50% increase in value since last year. Notably, the current price of FTT mirrors its launch price in 2019, although it reached a peak of $77 in September 2021. The absence of any mention of FTT holders in the bankruptcy plan implies that their status may be viewed differently, potentially as part of the overall debts owed by FTX."],"create_date":"2024-05-09T07:08:11+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/121853/shiba-inu-to-launch-its-blockchain-raises-12m/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The blockchain is scheduled to release a testnet in the third quarter of this year, followed by the mainnet after thorough testing.","title":"Shiba Inu to Launch Its Blockchain, Raises $12M","content":["Shiba Inu, the team behind the popular memecoin SHIB, has secured $12 million by selling its unreleased token, TREAT, to non-U.S. venture capital investors.","Among these investors are Polygon Ventures, Mechanism Capital, Big Brain Holdings, and others, as announced by Shiba Inu on Monday.","While some investors like Mechanism Capital and Shima Capital are seemingly based in the U.S., Shiba Inu’s lead developer, known as Shytoshi Kusama, clarified that none of the investors are U.S.-based, although full entity names may not be disclosed.","The fundraising process for the round began a few months ago and concluded earlier this month, according to Kusama. However, details regarding the valuation remain undisclosed. Sources familiar with the matter revealed that it was a tranched round, with valuations ranging from $75 million to $200 million.","The TREAT token, described as the “utility and governance token” of Shiba Inu’s new privacy-focused Layer 3 blockchain built on Shibarium, serves as the final non-stable token in the ecosystem. Kusama mentioned that a new token called Shi will be introduced later this year, alongside existing tokens like SHIB, BONE, and LEASH.","Despite not being released yet, certain TREAT tokens are already showing trading volume on platforms like CoinGecko and CoinMarketCap. Kusama dismissed these as scams, emphasizing that the authentic TREAT token will be minted by The Shiba Inu Mint S.A., a Panama corporation.","It is worth noting that Shiba Inu is developing its Layer 3 blockchain using fully homomorphic encryption (FHE) technology from Zama, a cryptography company. FHE is hailed as the “holy grail” of cryptography, ensuring end-to-end data encryption even during processing. The new blockchain aims to address privacy and trust issues within Shiba Inu’s community and comply with regulatory requirements.","The blockchain is scheduled to release a testnet in the third quarter of this year, followed by the mainnet after thorough testing, according to The Block.","The name of the Layer 3 blockchain remains undisclosed to prevent potential scams associated with fake TREAT tokens."],"create_date":"2024-04-22T11:16:22+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122637/vodafone-to-transform-sim-cards-into-crypto-guardians/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The strategy envisions SIM cards evolving from communication tools to guardians of digital and financial identities.","title":"Vodafone to Transform SIM Cards Into Crypto Guardians","content":["British telecommunication giant Vodafone is embarking on an innovative journey by merging cryptocurrency wallets with SIM cards, effectively transforming every smartphone into a secure digital wallet.","This new move aims to bring the power of blockchain technology directly to users’ fingertips.","The strategy revolves around a forward-looking vision where SIM cards transcend their traditional role as mere communication tools to become guardians of digital and financial identities. By integrating crypto wallets onto SIMs, Vodafone is not only democratizing access to blockchain but also reshaping the utility of smartphones.","However, this ambitious project comes with substantial financial requirements. Vodafone has initiated efforts to raise approximately $2.9 billion, underscoring the magnitude of its commitment to this transformative innovation.","Despite its potential, Vodafone’s endeavor is not without challenges. The complexity of the crypto market and associated security concerns pose significant hurdles. Moreover, the financial instability of Vodafone Idea in India, which is also seeking funds to stabilize its operations, adds another layer of uncertainty.","Nevertheless, the outlook remains promising. According to David Palmer, Vodafone’s Blockchain Lead, the aim is for a substantial portion of the projected 20 billion mobile phones worldwide to be equipped with this technology by 2030.","This move towards democratizing access to crypto via phones could revolutionize how individuals engage with digital assets, making cryptocurrency more accessible and integrated into everyday life.","Beyond integrating crypto into SIM cards, Vodafone continues to drive innovation in artificial intelligence. Its recent partnership with Microsoft to incorporate generative AI highlights its commitment to remaining at the forefront of technological advancement.","The convergence of AI, crypto, and mobile connectivity paints a future where smartphones play an even more pivotal role in shaping digital and financial identities.","Vodafone’s initiative to fuse crypto and SIM technology could mark the dawn of a technological revolution. By converting every smartphone into a secure crypto wallet, Vodafone is not merely following trends but pioneering them."],"create_date":"2024-05-06T07:31:17+00:00","tag":"","author":"News Desk"}
{"url":"https://www.unlock-bc.com/122751/maktoum-bin-mohammed-dubai-fintech-summit-global-leader-engagement/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Maktoum bin Mohammed connects with global leaders at Dubai FinTech Summit, driving innovation and collaboration in finance.","title":"Maktoum bin Mohammed Engages With Global Policy Makers and Financial Industry Leaders at Dubai FinTech Summit","content":["His Highness Sheikh Maktoum bin Mohammed bin Rashid Al Maktoum, First Deputy Ruler of Dubai, Deputy Prime Minister and Minister of Finance of the UAE, as well as President of the Dubai International Financial Centre (DIFC), convened with influential global policymakers and financial leaders on the sidelines of the second Dubai FinTech Summit (DFS).","Among the notable figures Sheikh Maktoum interacted with were Adena T Friedman, Chair and CEO of Nasdaq; Oh Se-Hoon, Mayor of Seoul, South Korea; Nic Dreckman, Group CEO of Julius Baer; and Nik Storonsky, Founder and CEO of Revolut.","The two-day Dubai FinTech Summit, organized by DIFC, the leading global financial center in the MEASA region, commenced today, gathering over 8,000 decision-makers, 300 thought leaders, and 200 exhibitors to explore the latest innovations and challenges while showcasing cutting-edge technologies.","His Highness’s discussions encompassed various topics, including the exchange of expertise in FinTech innovation, urban infrastructure development, and emerging opportunities in new capital markets, wealth management, and FinTech as a result of Dubai’s recent policies and initiatives.","Sheikh Maktoum underscored Dubai’s strategic initiatives aimed at boosting its stock market volume to AED3 trillion and enhancing its capital market ecosystem, positioning it as a key destination for global investors. He stressed the importance of collaboration with global entities like Nasdaq to bolster investment growth and technological innovation in financial services.","Additionally, Sheikh Maktoum emphasized Dubai’s dedication to forging partnerships with prominent global cities such as Seoul to facilitate the exchange of expertise and best practices for sustainable growth and prosperity. He highlighted the shared development trajectories and financial industry growth between Dubai and Seoul, underscoring the potential for mutual advancement.","Furthermore, His Highness reiterated Dubai’s commitment to fostering an enabling environment for wealth management, investment, and financial technology excellence, citing strategic initiatives aimed at attracting high-net-worth individuals, family offices, and innovative FinTech firms.","Aligned with Dubai’s Economic Agenda D33 objective to establish itself as one of the world’s top four global financial hubs by 2033, the Dubai FinTech Summit promotes cross-border collaboration and innovation crucial for transforming the global FinTech landscape. The event serves as a platform to explore emerging FinTech trends and their potential to drive financial progress in the MEASA region."],"create_date":"2024-05-07T20:54:36+00:00","tag":"","author":"News Desk"}
