{"url":"https://blockonomi.com/floki-inu-floki-price-surge-fueled-by-token-burn-exchange-listings-more/","web_url":"https://blockonomi.com/","type":"article","description":"Floki Inu (FLOKI) has witnessed a significant price surge and growing investor optimism, driven by a token burn proposal, a Binance Thailand listing, and favorable technical indicators","title":"Floki Inu (FLOKI) Price Surge: Fueled by Token Burn, Exchange Listings & More - Blockonomi","content":["Floki Inu (FLOKI), the dog-themed memecoin, has been making significant strides in the cryptocurrency market, with its price surging over 15% in the last 24 hours and crossing the key resistance level of $0.0001790.","One of the primary factors contributing to the bullish sentiment surrounding FLOKI is the recent proposal by the Floki DAO to burn 15 billion tokens, worth approximately $2.8 million.","This strategic move is expected to reduce the overall supply of FLOKI, potentially driving up its value in the long run.","The proposal has been well-received by the community, with many investors viewing it as a positive step towards the long-term growth and sustainability of the project.","NEW DAO PROPOSAL: BURN 15,246,000,000 $FLOKI TOKENS","A new Floki DAO proposal just went live on whether or not to burn 15,246,000,000 $FLOKI tokens.","Please read the proposal and vote here ????????????https://t.co/UVzQdYQUpu pic.twitter.com/j1mi6XrVZ0","— FLOKI (@RealFlokiInu) May 13, 2024","","FLOKI has also benefited from a recent listing on Binance Thailand. This listing provides exposure to the largest Web3 community and is expected to significantly increase the adoption and usage of FLOKI in the region.","Thailand has emerged as a leader in cryptocurrency adoption, with 12% of its population using crypto for daily transactions. The country ranks 10th on the 2023 Global Cryptocurrency Adoption Index, highlighting its importance in the global crypto ecosystem.","Binance Thailand has just listed $FLOKI! ????","Thailand, where #Floki enjoys immense popularity, boasts a significant crypto adoption rate. Approximately 12% of the population, or nearly 10 million people, own crypto in Thailand. This places Thailand 10th in Chainanalysis\u0027 \u00272023… pic.twitter.com/rsEnxHcgW8","— FLOKI (@RealFlokiInu) May 14, 2024","","From a technical perspective, FLOKI appears to be well-positioned for a potential breakout. Out of 26 technical indicators analyzed, 15 are signaling a buy call, while only one suggests a sell signal.","The remaining 10 indicators are neutral, indicating that the overall sentiment is skewed towards the bullish side. The trading volume has also displayed significant buying activity, spiking over 265.10% to $626.15 million in the last 24 hours.","Another positive sign for FLOKI is the smart recovery in weighted sentiment data, which suggests that demand for the cryptocurrency has increased across the market.","Price volatility has risen over 22% to 0.051, indicating heightened investor speculation and the potential for an upcoming bullish wave.","The futures open interest data also paints a bullish picture, with fresh long buildup by investors leading to a 52.38% surge to $17.16 million in the last 24 hours. The GIOM indicator reveals that around 84% of in-the-money holders at the current price level are in profit, while only 15% are looking to secure their gains, further confirming the uptrend ahead.","As FLOKI continues to gain traction and attract investor interest, it is crucial to keep an eye on the key support and resistance levels.","The immediate support levels for FLOKI are $0.0001950 and $0.0001870, while the key upside hurdle is around $0.0002120, followed by $0.0002230.","If FLOKI manages to break through these resistance levels, it could signal the beginning of a new bull run for the memecoin."],"create_date":"2024-05-15T08:59:07+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/consensys-vs-sec-crypto-industry-pushes-back-against-secs-enforcement-campaign/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Consensys has filed a lawsuit against the SEC in an attempt to prevent the agency from regulating Ethereum and to protect its MetaMask wallet product","title":"Consensys vs. SEC: Crypto Industry Pushes Back Against SEC\u0027s Enforcement Campaign - Blockonomi","content":["Consensys, a prominent Ethereum software firm, has filed a lawsuit against the U.S. Securities and Exchange Commission (SEC) in a Texas federal court. The move comes as a response to the SEC’s increasing scrutiny of the Ethereum blockchain and its native token, Ether (ETH).","The lawsuit aims to prevent the SEC from regulating Ethereum and to push back against what Consensys calls the agency’s “campaign to seize control over the future of cryptocurrency.”","The legal battle began when Consensys received a Wells notice from the SEC on April 10, indicating the agency’s intention to bring an enforcement action against the company for allegedly violating securities laws through its popular MetaMask wallet product.","The SEC claims that by offering the MetaMask wallet, Consensys is acting as an unregistered securities broker. However, Consensys denies these allegations, stating that the wallet is “simply an interface” and does not hold customers’ digital assets or carry out any transaction functions.","In its complaint, Consensys argues that the SEC’s attempt to exert authority over Ethereum contradicts the agency’s previous statements, which suggested that Ether was not a security but rather a commodity.","The company also points out that the SEC’s move goes against the Commodity Futures Trading Commission’s (CFTC) authority over Ethereum, as the CFTC oversees derivative products tied to Ether.","Consensys claims that it has built its business based on the regulatory consensus that Ethereum is not a security. The company warns that the SEC’s “unlawful seizure of authority” over Ethereum would have disastrous consequences for the Ethereum network and the broader crypto industry.","If the SEC were to treat Ether as a security, it could potentially bring the use of the Ethereum blockchain in the United States to a halt, as every Ether holder would fear violating securities laws when transferring the token on the network.","The lawsuit also highlights the SEC’s recent enforcement actions against various crypto companies, including Binance, Kraken, and Uniswap Labs.","Many in the crypto industry have criticized the SEC for failing to provide clear regulations and guidance for blockchain technology, instead opting for an aggressive enforcement approach.","Consensys founder Joseph Lubin stated that the SEC’s investigations into companies and developers involved with the Ethereum codebase are “only accelerating.” He believes that the agency’s actions are an attempt to stifle innovation and prevent the launch of Ether spot ETFs, which could potentially bring significant capital into the crypto ecosystem.","The Consensys lawsuit seeks several court rulings, including a declaration that Ether is not a security, that MetaMask is not operating as an unlicensed broker-dealer, and that the SEC is violating the Administrative Procedure Act and the Constitution’s guarantee of due process.","The company also seeks an injunction to prevent the SEC from conducting investigations based on the premise that Ethereum is a security."],"create_date":"2024-04-26T07:12:27+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/gamestop-amc-prices-surge-meme-stocks-return-as-trading-is-halted-38-times/","web_url":"https://blockonomi.com/","type":"article","description":"The sudden surge in GameStop and AMC stock prices, triggered by the return of \"Roaring Kitty\" to social media, has led to multiple trading halts and renewed interest in meme stocks","title":"Gamestop & AMC Prices Surge: Meme Stocks Return as Trading is Halted 38 Times - Blockonomi","content":["GameStop and AMC, the two companies at the heart of the original meme stock phenomenon, have seen their share prices skyrocket this week, with GameStop rising by an astonishing 340% and AMC by 133% in May alone.","The catalyst for this sudden surge appears to be the return of Keith Gill, known online as “Roaring Kitty,” to social media after a three-year hiatus. Gill, considered a key figure in the 2021 meme stock craze, posted a cryptic image on Twitter that gamers recognize as a meme indicating that “things are getting serious.”","pic.twitter.com/YgjVqtgcNS","— Roaring Kitty (@TheRoaringKitty) May 13, 2024","","This single tweet seems to have reignited the passion and enthusiasm of retail investors who had previously banded together to challenge Wall Street norms.","As a result of the increased volatility, trading on these meme stocks has been halted multiple times this week.","The New York Stock Exchange (NYSE) alone halted trading on GameStop and AMC a combined 38 times on Tuesday. These trading halts are a standard mechanism employed by exchanges to protect against excessive volatility and ensure orderly market functioning.","However, the current trading halts differ from the events of 2021, when platforms like Robinhood blocked access to meme stocks, citing the need to protect users from excessively volatile markets.","Traditional brokers, such as TD Ameritrade, IG Group, and Charles Schwab, also restricted trading on these stocks at the time. In contrast, the current halts are triggered by the exchanges’ automatic defensive mechanisms, rather than being initiated by individual platforms.","The meme stock phenomenon began in early 2021 when a group of retail investors, primarily organized on social media platforms like Reddit, collectively decided to buy shares of struggling companies such as GameStop and AMC.","Their goal was twofold: to profit from the rising stock prices and to challenge institutional investors, particularly hedge funds that had heavily shorted these stocks, betting on their decline.","The sudden and dramatic increase in the stock prices of GameStop and AMC led to significant volatility in the market, with prices reaching levels far beyond what traditional financial metrics would justify.","This surge forced short sellers to buy back shares at much higher prices to cover their positions, resulting in substantial losses for these hedge funds.","Retail investors saw this as a form of financial rebellion, leveraging their collective power to challenge the status quo on Wall Street."],"create_date":"2024-05-15T09:22:16+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/andrew-tate-to-invest-100-million-in-bitcoin-abandoning-fiat-currency/","web_url":"https://blockonomi.com/","type":"article","description":"Andrew Tate announces a $100 million investment in Bitcoin, denouncing traditional banking and \"scams,\" as the cryptocurrency surges","title":"Andrew Tate to Invest $100 Million in Bitcoin, Abandoning Fiat Currency - Blockonomi","content":["Former kickboxer and controversial social media personality Andrew Tate has announced his intention to invest over $100 million in Bitcoin, completely abandoning fiat currency. Tate’s decision comes amidst his ongoing legal challenges in Romania and a period of significant growth for the world’s largest cryptocurrency.","Tate, known for his provocative opinions and lavish lifestyle, expressed his disillusionment with the traditional banking system in a series of posts on social media platform X (formerly Twitter).","“I’m done with the banks. I’m done with their money. Done with the scams,”","Tate stated, hinting at his motivation for the substantial investment in Bitcoin.","I know I’m not supposed to do this in chaotic times but I’m about to leave fiat completely and ape over 100M into btc.","And I’ll even prove I did it.","I’m done with the banks.","I’m done with their money.","Done with the scams.","Then I’m going boating.","— Andrew Tate (@Cobratate) May 15, 2024","","This announcement coincides with a bullish period for Bitcoin, which has seen a 7% increase in the last 24 hours, surpassing the $66,000 resistance level.","Industry experts, such as the co-founders of on-chain analysis company Glassnode, have attributed this growth to factors like lower-than-expected U.S. inflation data and weaker retail sales, which could lead the Federal Reserve to adopt a more “dovish” monetary policy.","These developments have strengthened confidence in the cryptocurrency market, with predictions that Bitcoin could reach $84,000 in the near future.","Tate’s endorsement of Bitcoin comes as a surprise to many, given his recent criticism of cryptocurrency investors, whom he dubbed “dorks” just a few weeks ago.","However, his decision to invest heavily in Bitcoin while simultaneously denouncing “scams” suggests a change of heart and a belief in the cryptocurrency’s legitimacy.","Despite the positive market sentiment, Tate’s personal life remains mired in legal controversies.","The former kickboxer is currently facing serious charges in Romania, including human trafficking and rape.","Authorities have already seized various assets belonging to Tate, including 21 Bitcoins worth $560,000, luxury cars, and real estate valued at millions of dollars.","As Bitcoin continues to consolidate its position and potentially gear up for further growth, it remains to be seen how Tate’s substantial investment will impact his personal wealth and the public perception of his association with the cryptocurrency.","Regardless of the outcome, Tate’s announcement has undoubtedly sparked conversations about the future of money and the role of cryptocurrencies in an increasingly digital world."],"create_date":"2024-05-16T07:36:06+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/u-s-spot-bitcoin-etf-inflows-reach-303-million-amid-surging-bitcoin-prices/#","web_url":"https://blockonomi.com/","type":"article","description":"U.S. spot Bitcoin ETF inflows surged to $303 million as institutional investors and public pension funds allocated substantial funds to Bitcoin ETFs, driven by positive CPI data and a favorable market sentiment.","title":"U.S. Spot Bitcoin ETF Inflows Reach $303 Million Amid Surging Bitcoin Prices - Blockonomi","content":["The cryptocurrency market experienced a boost on May 15, 2024, as U.S. spot Bitcoin ETF inflows reached a two-week high of $303 million.","This surge in institutional investment coincided with Bitcoin’s price climbing beyond $66,000, marking a notable milestone for the world’s largest cryptocurrency.","Leading the charge in Bitcoin ETF inflows was Fidelity’s FBTC, which attracted an impressive $131.3 million. Bitwise’s BITB also had a strong showing, with inflows of $86.3 million.","Interestingly, Grayscale’s GBTC, which had been facing outflows over the past four months, saw a reversal in sentiment, registering an inflow of $27 million.","This shift could indicate a change in the perspective of investors who have been investing in the biggest Bitcoin investment resources globally.","The recent quarterly 13F filings with the U.S. Securities and Exchange Commission (SEC) revealed that institutional investors have been actively buying into spot Bitcoin ETFs.","Prominent hedge fund Millennium Management, with over $64 billion in assets under management, holds a substantial $2 billion portfolio across various spot Bitcoin ETFs, including BlackRock’s IBIT, Fidelity’s FBTC, Grayscale’s GBTC, Ark Invest’s ARKB, and Bitwise’s BITB. Other notable investors include Elliot Capital and Apollo Management Holdings.","In a groundbreaking move, the State of Wisconsin’s Investment Board allocated $163 million to Bitcoin ETFs, becoming one of the first U.S. public pension funds to do so.","This allocation was split between BlackRock’s IBIT ($99.1 million) and Grayscale’s GBTC ($63.6 million). The decision by a state pension fund to invest in Bitcoin ETFs marks a significant step towards mainstream adoption of cryptocurrencies.","The positive market sentiment can be attributed to the release of the April U.S. Consumer Price Index (CPI) data, which came in lower than expected at 0.3%.","This key indicator of inflation has increased optimism among investors about the possibility of the Federal Reserve reducing interest rates and injecting more liquidity into the market – a scenario that has historically been favorable for high-risk assets like cryptocurrencies.","As Bitcoin ETFs witnessed renewed interest, the price of Bitcoin experienced a significant surge, reaching a high of $66,350 during early Asian trading on May 16.","This marks a notable recovery for the cryptocurrency, which is now just 10% away from its all-time high of $73,750, reached on March 14."],"create_date":"2024-05-16T11:20:39+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/mit-brothers-arrested-for-alleged-25m-ethereum-blockchain-manipulation/","web_url":"https://blockonomi.com/","type":"article","description":"Two MIT-educated brothers have been arrested and charged with allegedly stealing $25 million in cryptocurrency by exploiting vulnerabilities in the Ethereum blockchain","title":"MIT Brothers Arrested for Alleged $25M Ethereum Blockchain Manipulation - Blockonomi","content":["In an unprecedented case, two brothers who studied math and computer science at the prestigious Massachusetts Institute of Technology (MIT) have been arrested and charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering for allegedly stealing $25 million in cryptocurrency by exploiting vulnerabilities in the Ethereum blockchain.","Anton Peraire-Bueno, 24, of Boston, and James Pepaire-Bueno, 28, of New York, are accused of engaging in a sophisticated scheme that manipulated the Ethereum blockchain’s protocols, allowing them to gain access to pending transactions and alter the movement of electronic currency.","The U.S. Department of Justice (DOJ) alleges that the brothers used their specialized skills and education to carry out the theft, which took only 12 seconds to complete.","According to the unsealed indictment, the Peraire-Bueno brothers spent months planning the heist, leveraging their expertise in crypto trading and their understanding of the Ethereum blockchain’s inner workings.","The alleged scheme exploited a vulnerability in the process commonly used to structure blocks, enabling the brothers to reorder transactions to their advantage before adding the block to the blockchain.","Victims of the alleged theft attempted to request the return of their funds, but the DOJ claims that the brothers rejected these requests and instead took steps to hide their gains.","The Peraire-Bueno brothers allegedly set up shell companies and used multiple private cryptocurrency addresses and foreign exchanges that did not rely on detailed “know your customer” (KYC) procedures to conceal their activities.","The brothers’ online search history revealed that they had researched the crimes they were eventually charged with, as well as methods to evade detection and potential legal consequences.","Searches included phrases such as “how to wash crypto,” “exchanges with no KYC,” “top crypto lawyers,” “money laundering statute of limitations,” and inquiries about extradition from specific foreign countries.","U.S. Attorney Damian Williams emphasized the severity of the alleged crime, stating that the brothers’ actions","“call the very integrity of the blockchain into question.”","He added that regardless of the sophistication of the fraud or the novelty of the techniques used, prosecutors would be relentless in pursuing those who attack the integrity of financial systems.","The arrests come at a time when the U.S. Securities and Exchange Commission (SEC) is considering the approval of an Ethereum exchange-traded fund (ETF). Some experts believe that this alleged fraud could fuel the SEC’s skepticism and potentially impact their decision.","If convicted, the Peraire-Bueno brothers face a maximum penalty of 20 years in prison for each count."],"create_date":"2024-05-16T08:53:56+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/u-s-spot-bitcoin-etf-inflows-reach-303-million-amid-surging-bitcoin-prices/","web_url":"https://blockonomi.com/","type":"article","description":"U.S. spot Bitcoin ETF inflows surged to $303 million as institutional investors and public pension funds allocated substantial funds to Bitcoin ETFs, driven by positive CPI data and a favorable market sentiment.","title":"U.S. Spot Bitcoin ETF Inflows Reach $303 Million Amid Surging Bitcoin Prices - Blockonomi","content":["The cryptocurrency market experienced a boost on May 15, 2024, as U.S. spot Bitcoin ETF inflows reached a two-week high of $303 million.","This surge in institutional investment coincided with Bitcoin’s price climbing beyond $66,000, marking a notable milestone for the world’s largest cryptocurrency.","Leading the charge in Bitcoin ETF inflows was Fidelity’s FBTC, which attracted an impressive $131.3 million. Bitwise’s BITB also had a strong showing, with inflows of $86.3 million.","Interestingly, Grayscale’s GBTC, which had been facing outflows over the past four months, saw a reversal in sentiment, registering an inflow of $27 million.","This shift could indicate a change in the perspective of investors who have been investing in the biggest Bitcoin investment resources globally.","The recent quarterly 13F filings with the U.S. Securities and Exchange Commission (SEC) revealed that institutional investors have been actively buying into spot Bitcoin ETFs.","Prominent hedge fund Millennium Management, with over $64 billion in assets under management, holds a substantial $2 billion portfolio across various spot Bitcoin ETFs, including BlackRock’s IBIT, Fidelity’s FBTC, Grayscale’s GBTC, Ark Invest’s ARKB, and Bitwise’s BITB. Other notable investors include Elliot Capital and Apollo Management Holdings.","In a groundbreaking move, the State of Wisconsin’s Investment Board allocated $163 million to Bitcoin ETFs, becoming one of the first U.S. public pension funds to do so.","This allocation was split between BlackRock’s IBIT ($99.1 million) and Grayscale’s GBTC ($63.6 million). The decision by a state pension fund to invest in Bitcoin ETFs marks a significant step towards mainstream adoption of cryptocurrencies.","The positive market sentiment can be attributed to the release of the April U.S. Consumer Price Index (CPI) data, which came in lower than expected at 0.3%.","This key indicator of inflation has increased optimism among investors about the possibility of the Federal Reserve reducing interest rates and injecting more liquidity into the market – a scenario that has historically been favorable for high-risk assets like cryptocurrencies.","As Bitcoin ETFs witnessed renewed interest, the price of Bitcoin experienced a significant surge, reaching a high of $66,350 during early Asian trading on May 16.","This marks a notable recovery for the cryptocurrency, which is now just 10% away from its all-time high of $73,750, reached on March 14."],"create_date":"2024-05-16T11:20:39+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/why-is-bitcoin-up-today-btc-breaks-66k-new-all-time-high-incoming/","web_url":"https://blockonomi.com/","type":"article","description":"Bitcoin\u0027s price surged past $66,000 on Wednesday, driven by positive economic indicators, a shift in central bank policies, and growing institutional interest in spot Bitcoin ETFs.","title":"Why is Bitcoin Up Today? BTC Breaks $66k, New All Time High Incoming? - Blockonomi","content":["Bitcoin (BTC) experienced a significant rally on Wednesday, rising over 7.5% to reach $66,250, marking its best single-day performance since March 20.","This surge in price can be attributed to several factors, including weak U.S. economic data, a shift in central bank policies, and increased institutional interest in spot Bitcoin ETFs.","The U.S. Labor Department released data showing that the consumer price index (CPI) increased less than consensus estimates in April, signaling a downward shift in the cost of living.","Retail sales growth stalled, with the “control group” category declining 0.3% month-on-month.","These economic indicators have strengthened the case for a Fed rate cut in September, with markets expecting the Bank of England (BOE) and the European Central Bank (ECB) to follow suit in June.","As central banks worldwide pivot toward monetary easing, the net percentage of banks cutting rates is on the rise. This shift in policy is seen as a positive sign for risk assets, including cryptocurrencies, as it could help improve market liquidity.","Institutional investors have also shown renewed interest in Bitcoin, with spot Bitcoin ETF inflows surging to a two-week high of $303 million on May 15. Fidelity’s FBTC fund saw $131 million in inflows, while Bitwise’s BITB fund recorded an inflow of $86 million. Even Grayscale’s GBTC saw a return to inflows after four months of outflows.","SEC filings reveal that one of the world’s largest hedge funds, Millennium Management, holds a substantial $2 billion spot Bitcoin ETF portfolio, comprising stakes in various ETFs such as BlackRock’s IBIT, Fidelity’s FBTC, and Grayscale’s GBTC.","Other major hedge funds, like Elliott Capital and Apollo Management Holdings, have also disclosed significant stakes in spot Bitcoin ETFs.","The recent Bitcoin price rally has mirrored the performance of major global stock indexes, with the S&P 500 reaching a new all-time high.","Analysts believe that the rising traded volume for spot BTC ETFs demonstrates heightened demand from institutional investors, which has helped rejuvenate the bullish sentiment in the market.","As Bitcoin continues to gain momentum, analysts are setting their sights on potential price targets.","Some predict that Bitcoin could reach $84,000, while veteran trader Peter Brandt suggests that the cryptocurrency is on the verge of printing a new all-time high based on the hump, slump, bump, dump, pump (HSBDP) indicator.","I have shown this chart many times in the past in slightly different iterations and it remains my preferred interpretation $BTC pic.twitter.com/dr47wYBsw3","— Peter Brandt (@PeterLBrandt) May 15, 2024","","As central banks continue to ease monetary policies and institutional investors increase their exposure to Bitcoin through spot ETFs, the stage appears to be set for another crack at the ATH in the coming months."],"create_date":"2024-05-16T07:30:38+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/tether-freezes-5-2m-in-usdt-linked-to-phishing-scams-as-ceo-defends-usdt/","web_url":"https://blockonomi.com/","type":"article","description":"Tether freezes $5.2 million in USDT linked to phishing scams, as the company continues to combat illicit activities and defend its stablecoin against criticism.","title":"Tether Freezes $5.2M in USDT Linked to Phishing Scams as CEO Defends USDT - Blockonomi","content":["Tether, the world’s largest stablecoin issuer, recently froze $5.2 million worth of its USDT stablecoin linked to phishing scams.","The funds were stored in 12 Ethereum wallets tagged as “USDT Banned Address” by on-chain analytics firm SlowMist.","⚠️MistTrack Alert????","Just now, #Tether froze ~5.2 million $USDT on 12 addresses. These addresses are associated with addresses tagged as \"USDT Banned Address\" by #MistTrack.https://t.co/OzPQkfCehS pic.twitter.com/msAShbbl73","— MistTrack????️ (@MistTrack_io) May 14, 2024","","This move is part of Tether’s ongoing efforts to combat illicit activities and cooperate with law enforcement agencies worldwide.","Since its launch, Tether has frozen over $1 billion in assets linked to hacks, exploits, scams, and terrorist financing. The company has collaborated with 24 law enforcement agencies across more than 40 countries, responding to 198 requests to block wallets in the last 12 months and 339 in the last three years.","Tether’s proactive approach to freezing assets has drawn both praise and criticism.","While some appreciate the company’s efforts to combat illegal activities, others question the centralized nature of stablecoins and the power wielded by their issuers.","Recently, Tether CEO Paolo Ardoino took to social media to defend the company against suggestions that USDT is a target of the U.S. government.","An uniformed CEO, leading a company being investigated by the SEC, launching a competitive stablecoin (cui prodest), is being reported spreading fear about USDt.","Let me give you an update on Tether USDt ecosystem safety.","USDt is the most used stablecoin in the world, with…","— Paolo Ardoino ???? (@paoloardoino) May 13, 2024","","His comments came in response to remarks made by Ripple CEO Brad Garlinghouse, who stated that the U.S. government is “going after Tether.”","Ripple, currently engaged in a lawsuit with the Securities and Exchange Commission, is also launching its own stablecoin, which will compete directly with Tether’s USDT.","Ardoino’s defense of Tether highlights the ongoing debate surrounding stablecoins and their role in the cryptocurrency ecosystem.","As regulators worldwide grapple with the challenges posed by digital assets, stablecoin issuers like Tether find themselves under increasing scrutiny."],"create_date":"2024-05-14T11:06:43+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/sonne-finance-suffers-20-million-exploit-token-plummets-60/","web_url":"https://blockonomi.com/","type":"article","description":"Sonne Finance, a decentralized lending protocol, has suffered a $20 million exploit due to a vulnerability in its Compound v2 forks, leading to a 60% drop in its native token\u0027s value","title":"Sonne Finance Suffers $20 Million Exploit, Token Plummets 60% - Blockonomi","content":["Sonne Finance, a decentralized lending protocol built on the Optimism and Base blockchains, has fallen victim to a $20 million exploit, causing its native SONNE token to plummet by 60%.","The attack, which occurred on Wednesday, took advantage of a vulnerability in the protocol’s Compound v2 forks, enabling the hacker to manipulate markets and steal various tokens, including ether, velo, and stablecoins.","The attacker employed a “donation” attack, a method that involves manipulating the exchange rate between two tokens by donating large amounts of cryptocurrency.","This effectively tricked the platform into believing it had more collateral than was actually available, allowing the hacker to siphon off funds.","Blockchain data reveals that the attacker managed to transfer millions of VELO, ether, and USD Coin (USDC) following the manipulation.","They later converted $8 million of the stolen funds into bitcoin and ether, transferring them to a new wallet address in the early hours of the morning.","#PeckShieldAlert @SonneFinance exploiter-labeled address has transferred $7.8M worth of cryptos, including 100 $WBTC & 556.1 $ETH, to a new address 0x6277…4c07 #Optimism pic.twitter.com/g4oiP5akr4","— PeckShieldAlert (@PeckShieldAlert) May 15, 2024","","The exploit occurred shortly after Sonne Finance added token markets for Velodrome Finance’s VELO, following a recent community proposal.","The attacker took advantage of a two-day timelock to execute four transactions, creating markets and adding collateral factors. Timelocks are smart contracts that execute transactions at a specific time, in this case, two days after being locked.","In response to the attack, Sonne Finance’s developers were able to mitigate the damage and pause all markets on the Optimism blockchain.","However, the protocol’s markets on the Base blockchain remained operational, as the exploit only affected the Optimism version of the platform.","The incident had a significant impact on the value of Sonne Finance’s native token, SONNE, which plummeted by 60% to 2.5 cents, its lowest level in over a year.","This drop in price cut the token’s market cap to $20 million, despite the developers’ efforts to prevent an additional $6.5 million from being stolen once the attack was discovered.","Sonne Finance has stated that they are working on retrieving the stolen funds and have offered a bounty to the hacker in exchange for their return.","However, the attacker has already moved a large portion of the loot, approximately $7.8 million worth of cryptocurrencies, to a new wallet address, suggesting that they may not be interested in negotiating a return of the funds.","The exploit has raised questions about the security of decentralized lending protocols and the risks associated with using forked versions of existing platforms.","Some members of the crypto community have criticized Sonne Finance for using Compound v2 despite being aware of its known vulnerabilities, with one individual even suggesting that the exploit may have been a premeditated backdoor."],"create_date":"2024-05-16T08:35:10+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/andrew-tate-to-invest-100-million-in-bitcoin-abandoning-fiat-currency/#","web_url":"https://blockonomi.com/","type":"article","description":"Andrew Tate announces a $100 million investment in Bitcoin, denouncing traditional banking and \"scams,\" as the cryptocurrency surges","title":"Andrew Tate to Invest $100 Million in Bitcoin, Abandoning Fiat Currency - Blockonomi","content":["Former kickboxer and controversial social media personality Andrew Tate has announced his intention to invest over $100 million in Bitcoin, completely abandoning fiat currency. Tate’s decision comes amidst his ongoing legal challenges in Romania and a period of significant growth for the world’s largest cryptocurrency.","Tate, known for his provocative opinions and lavish lifestyle, expressed his disillusionment with the traditional banking system in a series of posts on social media platform X (formerly Twitter).","“I’m done with the banks. I’m done with their money. Done with the scams,”","Tate stated, hinting at his motivation for the substantial investment in Bitcoin.","I know I’m not supposed to do this in chaotic times but I’m about to leave fiat completely and ape over 100M into btc.","And I’ll even prove I did it.","I’m done with the banks.","I’m done with their money.","Done with the scams.","Then I’m going boating.","— Andrew Tate (@Cobratate) May 15, 2024","","This announcement coincides with a bullish period for Bitcoin, which has seen a 7% increase in the last 24 hours, surpassing the $66,000 resistance level.","Industry experts, such as the co-founders of on-chain analysis company Glassnode, have attributed this growth to factors like lower-than-expected U.S. inflation data and weaker retail sales, which could lead the Federal Reserve to adopt a more “dovish” monetary policy.","These developments have strengthened confidence in the cryptocurrency market, with predictions that Bitcoin could reach $84,000 in the near future.","Tate’s endorsement of Bitcoin comes as a surprise to many, given his recent criticism of cryptocurrency investors, whom he dubbed “dorks” just a few weeks ago.","However, his decision to invest heavily in Bitcoin while simultaneously denouncing “scams” suggests a change of heart and a belief in the cryptocurrency’s legitimacy.","Despite the positive market sentiment, Tate’s personal life remains mired in legal controversies.","The former kickboxer is currently facing serious charges in Romania, including human trafficking and rape.","Authorities have already seized various assets belonging to Tate, including 21 Bitcoins worth $560,000, luxury cars, and real estate valued at millions of dollars.","As Bitcoin continues to consolidate its position and potentially gear up for further growth, it remains to be seen how Tate’s substantial investment will impact his personal wealth and the public perception of his association with the cryptocurrency.","Regardless of the outcome, Tate’s announcement has undoubtedly sparked conversations about the future of money and the role of cryptocurrencies in an increasingly digital world."],"create_date":"2024-05-16T07:36:06+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/consensys-vs-sec-crypto-industry-pushes-back-against-secs-enforcement-campaign/#","web_url":"https://blockonomi.com/","type":"article","description":"Consensys has filed a lawsuit against the SEC in an attempt to prevent the agency from regulating Ethereum and to protect its MetaMask wallet product","title":"Consensys vs. SEC: Crypto Industry Pushes Back Against SEC\u0027s Enforcement Campaign - Blockonomi","content":["Consensys, a prominent Ethereum software firm, has filed a lawsuit against the U.S. Securities and Exchange Commission (SEC) in a Texas federal court. The move comes as a response to the SEC’s increasing scrutiny of the Ethereum blockchain and its native token, Ether (ETH).","The lawsuit aims to prevent the SEC from regulating Ethereum and to push back against what Consensys calls the agency’s “campaign to seize control over the future of cryptocurrency.”","The legal battle began when Consensys received a Wells notice from the SEC on April 10, indicating the agency’s intention to bring an enforcement action against the company for allegedly violating securities laws through its popular MetaMask wallet product.","The SEC claims that by offering the MetaMask wallet, Consensys is acting as an unregistered securities broker. However, Consensys denies these allegations, stating that the wallet is “simply an interface” and does not hold customers’ digital assets or carry out any transaction functions.","In its complaint, Consensys argues that the SEC’s attempt to exert authority over Ethereum contradicts the agency’s previous statements, which suggested that Ether was not a security but rather a commodity.","The company also points out that the SEC’s move goes against the Commodity Futures Trading Commission’s (CFTC) authority over Ethereum, as the CFTC oversees derivative products tied to Ether.","Consensys claims that it has built its business based on the regulatory consensus that Ethereum is not a security. The company warns that the SEC’s “unlawful seizure of authority” over Ethereum would have disastrous consequences for the Ethereum network and the broader crypto industry.","If the SEC were to treat Ether as a security, it could potentially bring the use of the Ethereum blockchain in the United States to a halt, as every Ether holder would fear violating securities laws when transferring the token on the network.","The lawsuit also highlights the SEC’s recent enforcement actions against various crypto companies, including Binance, Kraken, and Uniswap Labs.","Many in the crypto industry have criticized the SEC for failing to provide clear regulations and guidance for blockchain technology, instead opting for an aggressive enforcement approach.","Consensys founder Joseph Lubin stated that the SEC’s investigations into companies and developers involved with the Ethereum codebase are “only accelerating.” He believes that the agency’s actions are an attempt to stifle innovation and prevent the launch of Ether spot ETFs, which could potentially bring significant capital into the crypto ecosystem.","The Consensys lawsuit seeks several court rulings, including a declaration that Ether is not a security, that MetaMask is not operating as an unlicensed broker-dealer, and that the SEC is violating the Administrative Procedure Act and the Constitution’s guarantee of due process.","The company also seeks an injunction to prevent the SEC from conducting investigations based on the premise that Ethereum is a security."],"create_date":"2024-04-26T07:12:27+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/canadian-crypto-king-aiden-pleterski-arrested-for-30-million-ponzi-scheme/","web_url":"https://blockonomi.com/","type":"article","description":"Aiden Pleterski, a 25-year-old self-proclaimed \"Crypto King\" from Ontario, Canada, and his associate have been arrested and charged with fraud for allegedly running a $30 million Ponzi scheme","title":"Canadian \u0027Crypto King\u0027 Aiden Pleterski Arrested for $30 Million Ponzi Scheme - Blockonomi","content":["Aiden Pleterski, a 25-year-old self-proclaimed “Crypto King” from Ontario, Canada, and his associate Colin Murphy have been arrested and charged with fraud for their alleged involvement in a $30 million Ponzi scheme.","The arrests come after a 16-month investigation by Canadian authorities, dubbed “Project Swan,” into the alleged investment fraud.","According to court documents and local media reports, between 2021 and 2022, Pleterski and his company, AP Private Equity Limited, convinced approximately 160 investors to hand over around $40 million CAD ($30 million USD) to invest on their behalf in the crypto and foreign exchange markets. Pleterski promised investors high returns, with some taking out loans to invest in the scheme.","However, a bankruptcy trustee overseeing Pleterski’s case concluded that the self-proclaimed “Crypto King” only invested 2% of the funds he received.","Instead, Pleterski allegedly spent at least $16 million on a lavish lifestyle, purchasing luxury cars, traveling internationally, and renting an $8.4 million lakefront mansion for $45,000 per month.","During the bankruptcy process, two McLarens, two BMWs, and a Lamborghini were seized from Pleterski.","The young entrepreneur, who is also a small-time livestreamer, documented his extravagant lifestyle on social media, posting videos of his vacations, driving rented sports cars, and even detailing his expenditures on Lego sets, which he estimated to be around $150,000 since 2021.","Pleterski was allegedly kidnapped, beaten, and tortured by five of his alleged victims in December 2022.","The perpetrators held him for three days, demanding a $3 million ransom from his landlord-turned-mentor. Pleterski was eventually released, but a video of him apologizing to investors, appearing bruised and swollen, was posted on social media. His lawyer later claimed that the apology was coerced.","Pleterski was released on $100,000 bail, signed for by his parents. As part of his bail conditions, he must surrender his passport, refrain from posting about financial matters on social media, and not buy or trade cryptocurrencies.","The case has garnered significant media attention in Canada, with the lavish lifestyle and alleged criminal activities of the “Crypto King” capturing the public’s imagination.","As the legal proceedings unfold, investors who fell victim to the alleged Ponzi scheme hope to recover some of their lost funds, while authorities work to bring those responsible to justice."],"create_date":"2024-05-16T08:13:32+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/ripples-upcoming-stablecoin-under-sec-scrutiny-another-legal-battle-looms/","web_url":"https://blockonomi.com/","type":"article","description":"Ripple Labs is once again coming under the scrutiny of the US Securities and Exchange Commission (SEC) with the launch of a stablecoin.","title":"Ripple\u0027s Upcoming Stablecoin Under SEC Scrutiny: Another Legal Battle Looms - Blockonomi","content":["Ripple Labs is once again coming under the scrutiny of the US Securities and Exchange Commission (SEC) after the federal agency suggested in a recent reply brief that Ripple’s upcoming stablecoin is an “unregistered cryptocurrency asset.”","“Ripple’s primary business continues to be, as it has been since 2013, unregistered sales of XRP. It also plans to issue a new unregistered crypto asset,” the document stated.","While the SEC did not specify that the “new unregistered crypto asset” was Ripple’s not-yet-launched stablecoin, Ripple’s latest announcement of a new cryptocurrency issuance confirmed this.","Table of Contents","Last month, the tech firm announced its plans to launch a new stablecoin that consistently maintains a backing of assets such as US dollar deposits, US government bonds, and cash equivalents. To date, Ripple hasn’t shared further details about its upcoming stablecoin.","However, following the SEC’s move, Ripple issued a blog post discussing stablecoins, their potential, and their benefits.","Apart from Ripple’s stablecoin, the SEC’s filing also shows that it maintains its stance on Ripple’s primary business. The agency said Ripple’s sale of XRP tokens constituted unregistered securities offerings.","As noted in the filing, Ripple claims that because it has licenses from other jurisdictions that don’t consider XRP a security, it won’t violate US securities laws. However, the SEC dismisses this argument as irrelevant. The agency compares it to “a New York restaurant need not obtain a liquor license because it obtained a fishing license in California.”","In response to Ripple’s request to change the wording of the court orders, the SEC defended its proposed injunctions as clear, necessary, and based on legal precedent.","In his response, Ripple’s chief legal officer, Stuart Alderoty, called the SEC’s filing baseless, saying the agency is lacking cooperation with international regulators on crypto regulations.","The mounting pressure from the SEC on Ripple likely originated from a lawsuit filed in 2020. In this legal battle, despite XRP itself not being considered a security, the sales of $728.9 million XRP to hedge funds and sophisticated buyers were found to be unlawful.","Consequently, the SEC is pursuing $2 billion in damages from Ripple for its XRP transactions.","Stablecoins have long been an integral part of the cryptocurrency system. Not only Ripple, digital payment giant PayPal has also engaged in this lucrative market.","1/ The stablecoin market is booming – around $150B today, and projected to soar past $2.8T by 2028. There\u0027s a clear demand for trust, stability, and utility.","That\u0027s why later this year we’re launching a stablecoin pegged 1:1 to the USD on the XRP Ledger and Ethereum.…","— Ripple (@Ripple) April 4, 2024","","Though this is Ripple’s first launch and potentially facing big competition from the big names like Tether’s USDT or Circle’s USDC, Ripple CEO Brad Garlinghouse, remains positive about the competition. He said Ripple’s new stablecoin targets the US market but might expand to other European and Asian countries in the future.","However, the SEC’s target on Ripple’s stablecoin could prevent the company from reaching its goal. It could also raise concerns among other stablecoin issuers.","Besides Ripple, the SEC’s allegations also previously aimed against Binance concerning the issuance of BUSD- Binance’s stablecoin. Though Binance’s response and potential judicial interpretation may differ, the SEC’s message is clear: stablecoins may be viewed as securities, prompting heightened scrutiny among stablecoin issuers.","In recent years, the U.S. SEC has taken a multifaceted approach to regulating digital assets, including stablecoins. Despite recognizing and validating the potential benefits of blockchain technology and digital innovation at some levels, the SEC remains cautious in its approach.","The growing number of legal cases like the SEC’s lawsuit against Ripple also shows the lack of mutual understanding between cryptocurrency companies and regulators.","This ambiguity in regulations creates uncertainty for companies, potentially leading to missteps that result in financial losses. This situation also raises questions about lawmakers’ responsibility to provide clear regulatory frameworks for digital assets.","The SEC recently generated headlines after threatening legal lawsuits against several prominent crypto entities. The latest targets are Uniswap Labs, Consensys, and Robinhood."],"create_date":"2024-05-09T09:47:28+00:00","tag":"","author":"Nicholas Say"}
{"url":"https://blockonomi.com/roaring-kitty-keith-gills-return-fuels-meme-stock-and-coin-surges/","web_url":"https://blockonomi.com/","type":"article","description":"Keith Gill\u0027s return to social media has sparked a resurgence in meme stock and coin trading, but analysts doubt a repeat of the 2021 rally","title":"Roaring Kitty: Keith Gill\u0027s Return Fuels Meme Stock and Coin Surges - Blockonomi","content":["The return of Keith Gill, also known as “Roaring Kitty” or “DeepF***ingValue,” to social media has once again stirred excitement in the financial markets. Gill, who gained fame during the GameStop short squeeze of 2021, posted a meme on X indicating his return, which led to a significant uptick in the prices of meme stocks and coins.","pic.twitter.com/YgjVqtgcNS","— Roaring Kitty (@TheRoaringKitty) May 13, 2024","","This development has rekindled memories of the dramatic market events of 2021, but analysts caution that the current economic environment is vastly different.","Table of Contents","Keith Gill’s influence on the market cannot be understated. His detailed analysis and strategic posting on Reddit’s WallStreetBets were pivotal during the 2021 GameStop saga.","At that time, his advocacy for buying GameStop options helped the stock price surge by over 1,000% in under a month, causing significant financial losses for hedge funds betting against the company. Gill’s meme-filled return to social media after a nearly three-year break sparked immediate market reactions.","Following Gill’s post, GameStop shares saw a dramatic rise of 111%, though they later stabilized at around $30. This initial surge was mirrored in the world of meme coins, with GameStop coin (GME) increasing by over 1,775%, an AMC token soaring by over 4,500%, and the KITTY coin jumping by over 8,000%.","These movements demonstrate the strong influence of Gill and the meme stock phenomenon on both traditional and crypto markets.","Other meme stocks like AMC Entertainment also saw notable increases. The rapid price changes led to multiple trading halts due to volatility, reminiscent of the trading frenzy seen in 2021.","Despite the excitement, market analysts are not convinced that history will repeat itself. Josh Gilbert, an eToro market analyst, expressed doubts about the longevity of this rally.","He pointed out that the current economic conditions are vastly different from those in 2021.","Back then, low interest rates, fiscal stimulus, and minimal inflation created a unique environment conducive to such speculative trading.","In contrast, today’s economic landscape is characterized by high interest rates and a global cost of living crisis. Consumers and investors are more cautious, making a similar large-scale rally less likely.","The number of outstanding shorts on assets like GameStop is smaller now, reducing the potential impact of a short squeeze.","Robinhood, the trading platform that played a significant role in the 2021 GameStop event, remains influential. Its recent integration with the decentralized exchange Uniswap could facilitate easier trading of memecoins and other cryptocurrencies.","This development has led some to speculate that a new wave of trading could be imminent, driven by the same retail investors who were active in 2021."],"create_date":"2024-05-14T08:33:55+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/tether-cracks-down-on-phishing-5-2-million-in-usdt-frozen/#It_Isnt_A_Free_For_All","web_url":"https://blockonomi.com/","type":"article","description":"Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to scams.","title":"Tether Cracks Down on Phishing: $5.2 Million in USDT Frozen - Blockonomi","content":["Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to phishing scams.","The move comes amid a debate between Tether and Ripple.","The frozen funds were located in 12 Ethereum wallets that were flagged as “USDT Banned Address,” according to on-chain analytics firm SlowMist. As reported, the flagged wallets were being used to launder money obtained from phishing scams.","Table of Contents","It’s not the first time Tether has demonstrated proactive steps to ensure regulatory compliance and safeguard users against fraud. The firm has consistently performed similar acts over the past few years. It’s estimated that Tether has frozen over $1 billion in assets, targeting a wide range of illicit actions, including hacks, exploits, and scams.","In January 2022, Tether made headlines by blacklisting three Ethereum addresses holding over $150 million worth of USDT. Later that year, in October, Tether froze $8.2 million in USDT on Ethereum and blacklisted 215 Ethereum-based USDT addresses. By the end of 2022, Tether’s asset-freezing efforts amounted to a staggering $360 million.","Last October, the firm once again demonstrated its commitment to combating illicit activities by freezing $817,000 in USDT linked to terrorist activities in Ukraine and Israel. Just a month later, Tether intervened to freeze $225 million in USDT connected to romance scammers.","Also, over the past year, Tether has collaborated with 24 law enforcement agencies across more than 40 countries. During this period, they have successfully processed 198 requests to block wallets associated with illicit activities.","In addition to addressing requests to freeze funds, Tether provides secondary market controls that enable them to freeze any transactions linked to individuals and entities listed on the United States Office of Foreign Assets Control (OFAC) Specially Designated Nationals list.","Earlier this month, Tether announced its partnership with leading blockchain analysis firm Chainalysis to create a custom set of tools to monitor the secondary market.","According to the US Department of Justice (DOJ), cryptocurrency is the preferred payment method for ransomware and other digital extortion activities.","US Senator Elizabeth Warren has recently called on US law enforcement agencies to crack down on crypto payments for child sexual abuse material (CSAM). According to Chainalysis, cryptocurrency has become the key payment method for CSAM content.","However, while Tether has shown efforts to comply with regulatory requirements, the company’s actions have sparked controversies. Some argue that the ability of stablecoin issuers to freeze funds for anti-fraud purposes somewhat contrasts with the neutralized nature of cryptocurrency.","And despite Tether’s ongoing work with regulators, Brad Garlinghouse, CEO of Ripple, doesn’t think it’s enough to help the company escape the US government’s scrutiny. Speaking in a recent podcast, Garlinghouse said US lawmakers are taking measures against the world’s largest stablecoin company.","According to him, the crackdown could bring serious harm to the entire cryptocurrency market. He linked it to one of the worst scenarios – the black swan. He claimed that the US government placing Tether in its sights could be the main factor leading to this event.","In response, Tether’s CEO Paolo Ardoino countered that Ripple was spreading FUD about USDT to create opportunities for the stablecoin it is building. In April, Ripple announced plans to issue new stablecoins.","Its coming product, however, has already been targeted by the US Securities and Exchange Commission (SEC). The SEC suggested in a recent filing that Ripple’s stablecoin is an unregistered security.","Garlinghouse’s statement was made amid concerns that Tether is being used by terrorist organizations and embargoed countries like Russia to circumvent US economic sanctions.","US Senate Banking Committee, Adewale Adeyemo, US Deputy Secretary of the Treasury, previously noted that Russia has switched to using payment alternatives, like USDT, to circumvent sanctions."],"create_date":"2024-05-16T07:23:20+00:00","tag":"","author":"Nicholas Say"}
{"url":"https://blockonomi.com/vanguards-new-ceo-salim-ramji-maintains-stance-against-bitcoin-etf/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Incoming Vanguard CEO Salim Ramji has affirmed that he will not reverse the company\u0027s decision to refrain from launching a spot Bitcoin ETF","title":"Vanguard\u0027s New CEO Salim Ramji Maintains Stance Against Bitcoin ETF - Blockonomi","content":["Salim Ramji, the incoming CEO of Vanguard and former head of BlackRock’s global ETF business, has made it clear that he will not reverse the company’s decision to refrain from launching a spot Bitcoin ETF.","In a recent interview with Barron’s, Ramji emphasized the importance of consistency in Vanguard’s investment philosophy and product offerings, stating that the firm’s current stance on crypto-related investment products aligns with its values.","Vanguard, one of the world’s largest asset management firms with $8.6 trillion in assets under management, has faced criticism from some clients for not offering access to spot Bitcoin ETFs, which have gained popularity among rival investment firms.","However, Ramji’s comments suggest that the company will maintain its cautious approach to the cryptocurrency market, despite his previous experience overseeing the launch of BlackRock’s iShares Bitcoin Trust (IBIT).","During his tenure at BlackRock, Ramji played a key role in the development and approval of IBIT, which has since amassed an impressive $18 billion in assets under management.","His move to Vanguard had sparked speculation among industry watchers about potential changes in the firm’s approach to Bitcoin and other digital assets.","However, Ramji’s recent statements indicate that he supports the views expressed by Vanguard’s Chief Investment Officer, Greg Davis, regarding the consistency of the company’s investment philosophy.","This philosophy, which prioritizes long-term, low-cost investing, has led Vanguard to view cryptocurrencies as speculative assets that do not align with its core principles.","Vanguard’s outgoing CEO, Tim Buckley, has also been vocal about his skepticism regarding the suitability of Bitcoin ETFs for long-term retirement portfolios.","In March, Buckley stated that he did not believe a Bitcoin ETF belongs in the portfolio of someone saving for retirement, as he considers crypto to be a speculative asset.","Despite the growing popularity of spot Bitcoin ETFs among rival investment firms, such as Fidelity and BlackRock, Vanguard has chosen to prioritize its established investment philosophy over the potential short-term gains associated with offering crypto-related products.","This decision has led to some backlash from clients, with a number of Vanguard customers threatening to close their accounts in January due to the firm’s decision to block access to spot Bitcoin ETFs.","While Ramji’s appointment as CEO had initially raised questions about the potential for a shift in Vanguard’s stance on Bitcoin, analysts now believe that a significant change in the company’s approach is unlikely.","Bloomberg ETF analyst James Seyffart, for example, has expressed doubt that Ramji’s leadership will lead to the introduction of a Vanguard spot Bitcoin ETF."],"create_date":"2024-05-16T08:43:49+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/ripple-xrp-price-holds-above-0-50-support-amid-ongoing-ripple-sec-legal-battle/","web_url":"https://blockonomi.com/","type":"article","description":"The ongoing legal battle between Ripple and the SEC over alleged securities law violations intensifies, with Ripple facing substantial penalties and criticizing the regulator\u0027s conduct, while XRP price remains in a tight range amid the uncertainty.","title":"Ripple (XRP) Price Holds Above $0.50 Support Amid Ongoing Ripple-SEC Legal Battle - Blockonomi","content":["The ongoing legal battle between Ripple and the U.S. Securities and Exchange Commission (SEC) continues to intensify, with the SEC seeking substantial penalties and the disclosure of sensitive financial information.","The case, which centers around Ripple’s alleged violations of securities laws through the sale of XRP to institutional clients, has drawn attention to the broader challenges faced by cryptocurrency firms navigating regulatory hurdles.","Ripple’s Chief Legal Officer, Stuart Alderoty, has been vocal in his criticism of the SEC’s handling of the case, comparing their actions to the absurdities depicted in Franz Kafka’s novel, “The Trial.”","Alderoty argues that the regulator’s conduct has been marked by inconsistency and unfairness, not only towards Ripple but also affecting other cryptocurrency companies like Robinhood and Coinbase.","At the heart of the dispute is the SEC’s demand for nearly $2 billion in penalties from Ripple. The regulator seeks disgorgement of what it considers “ill-gotten gains” from discounts offered to Ripple’s institutional clients, alongside prejudgment interest and civil penalties.","Ripple, however, maintains that any civil penalty should be capped at $10 million, deeming the SEC’s pursuit of such substantial fines as excessively punitive.","In response to the SEC’s demands, Ripple has taken legal steps to protect sensitive financial information by filing motions to seal certain documents.","The company argues that disclosing specific details about earnings, revenues, expenses, and discounts offered to institutions could harm its business interests and relationships.","Ripple’s stance emphasizes the need for confidentiality in order to operate effectively in the market.","The case has also highlighted broader tensions between regulatory enforcement and business operations within the cryptocurrency industry.","Alderoty has praised bipartisan efforts in the U.S. House of Representatives to limit the SEC’s perceived overreach in cryptocurrency regulation, such as the recent vote to overturn Staff Accounting Bulletin No. 121 (SAB 121).","As the legal proceedings continue, the XRP token has experienced price fluctuations. Despite the ongoing legal uncertainty, XRP has managed to sustain above the $0.50 support level.","However, technical indicators suggest a potential decline in the near future, with the possibility of XRP testing lower support levels.","As the final stages of the case unfold, investors and industry participants alike will be closely monitoring developments, seeking to understand the potential impact on Ripple, XRP, and the broader cryptocurrency market."],"create_date":"2024-05-15T11:18:00+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/uniswap-vs-sec-the-clash-that-could-define-the-future-of-crypto/","web_url":"https://blockonomi.com/","type":"article","description":"The SEC has warned Uniswap of its intention to bring an enforcement action against the leading DeFi platform, causing a sharp drop in the value of its native token, UNI, and sparking a vow from the company\u0027s founder to fight the charges","title":"Uniswap vs. SEC: The Clash That Could Define the Future of Crypto - Blockonomi","content":["The U.S. Securities and Exchange Commission (SEC) has sent a Wells Notice to Uniswap, the leading decentralized finance (DeFi) platform, signaling its intention to bring an enforcement action against the company.","The notice, which provides Uniswap with a final opportunity to rebut the allegations, has sent shockwaves through the crypto industry and raised concerns about the future of DeFi.","While the specific nature of the SEC’s allegations against Uniswap Labs remains unknown, the agency is likely to claim that the firm illegally offered unregistered securities to the public or failed to register as a broker or exchange.","This move comes amidst a sweeping crackdown on the crypto industry by the SEC, which has already led to high-profile lawsuits against companies like Coinbase and Ripple.","Today Uniswap Labs received a Wells notice from the SEC","And we\u0027re ready to fight","This is the latest political effort to target even the best actors in crypto like Uniswap and Coinbase","All Uniswap products and the Uniswap Protocol are unaffectedhttps://t.co/i2p5LubELk","— Uniswap Labs ???? (@Uniswap) April 10, 2024","","The news of the impending enforcement action had an immediate impact on Uniswap’s native token, UNI, which dropped by 10% in the hour following the announcement. The token reached a six-week low, trading at $9.66, its lowest point since late February.","Uniswap Labs founder Hayden Adams expressed his frustration with the SEC’s actions, stating that he was “annoyed, disappointed, and ready to fight.” Adams warned that the fight could take years and potentially reach the Supreme Court, with the future of financial technology and the crypto industry hanging in the balance.","Today @Uniswap Labs received a Wells notice from the SEC.","I’m not surprised. Just annoyed, disappointed, and ready to fight.","I am confident that the products we offer are legal and that our work is on the right side of history. But it’s been clear for a while that rather than…","— hayden.eth ???? (@haydenzadams) April 10, 2024","","The crypto industry has long complained that the SEC has been operating in bad faith when it comes to the sector, pursuing enforcement actions despite a lack of clear rules and failing to account for the unique nature of blockchain-based technology. SEC Chairman Gary Gensler, however, maintains that existing securities laws are clear and that the crypto sector has sought special treatment while failing to comply.","The outcome of the potential lawsuit between the SEC and Uniswap Labs is particularly unpredictable given the unique nature of DeFi technology and a notable legal victory for the company last year in a class-action suit. In that case, a federal judge sided with Uniswap Labs, acknowledging that the technology it had built was neutral and that the company was not responsible for how individuals used the platform.","Legal experts and industry insiders have mixed opinions on the potential outcome of the case. Some believe that the SEC will prevail on securities issues but lose on claims that Uniswap is a securities exchange or broker.","Paul Grewal, the legal chief of Coinbase, pointed to a recent ruling in the SEC’s suit against his company, which determined that the SEC failed to allege Coinbase conducted brokerage activity through its decentralized wallet.","Sometimes you have to laugh or else you\u0027ll cry. Question: how can you square the @SECGov\u0027s claim that @Uniswap acts as a broker with the Court\u0027s ruling against the @SECGov just a handful of days ago? Answer: you can\u0027t. https://t.co/K42aKw5YZc pic.twitter.com/OcegMnDWVu","— paulgrewal.eth (@iampaulgrewal) April 10, 2024","","The stakes are high for both Uniswap Labs and the broader DeFi sector, which has grown rapidly in recent years. Uniswap recently announced that its protocol has facilitated over $2 trillion in transactions, and there is growing interest from mainstream finance in the potential of the underlying technology.","As the crypto industry navigates this challenging period, the outcome of the potential lawsuit between the SEC and Uniswap Labs will have far-reaching implications.","A victory for the SEC could hobble the fast-growing DeFi sector and set a precedent for future enforcement actions against other DeFi platforms. On the other hand, a win for Uniswap Labs could provide much-needed clarity on the regulatory landscape and pave the way for further innovation in the space.","Regardless of the outcome, the battle between the SEC and Uniswap Labs is likely to be a lengthy and complex one, with both sides presenting sophisticated arguments and drawing on recent legal precedents.","The resolution of this case could serve as a turning point in the ongoing debate over the future of DeFi and the role of regulators in the world of digital assets."],"create_date":"2024-04-11T07:26:39+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/why-is-bitcoin-up-today-btc-breaks-66k-new-all-time-high-incoming/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Bitcoin\u0027s price surged past $66,000 on Wednesday, driven by positive economic indicators, a shift in central bank policies, and growing institutional interest in spot Bitcoin ETFs.","title":"Why is Bitcoin Up Today? BTC Breaks $66k, New All Time High Incoming? - Blockonomi","content":["Bitcoin (BTC) experienced a significant rally on Wednesday, rising over 7.5% to reach $66,250, marking its best single-day performance since March 20.","This surge in price can be attributed to several factors, including weak U.S. economic data, a shift in central bank policies, and increased institutional interest in spot Bitcoin ETFs.","The U.S. Labor Department released data showing that the consumer price index (CPI) increased less than consensus estimates in April, signaling a downward shift in the cost of living.","Retail sales growth stalled, with the “control group” category declining 0.3% month-on-month.","These economic indicators have strengthened the case for a Fed rate cut in September, with markets expecting the Bank of England (BOE) and the European Central Bank (ECB) to follow suit in June.","As central banks worldwide pivot toward monetary easing, the net percentage of banks cutting rates is on the rise. This shift in policy is seen as a positive sign for risk assets, including cryptocurrencies, as it could help improve market liquidity.","Institutional investors have also shown renewed interest in Bitcoin, with spot Bitcoin ETF inflows surging to a two-week high of $303 million on May 15. Fidelity’s FBTC fund saw $131 million in inflows, while Bitwise’s BITB fund recorded an inflow of $86 million. Even Grayscale’s GBTC saw a return to inflows after four months of outflows.","SEC filings reveal that one of the world’s largest hedge funds, Millennium Management, holds a substantial $2 billion spot Bitcoin ETF portfolio, comprising stakes in various ETFs such as BlackRock’s IBIT, Fidelity’s FBTC, and Grayscale’s GBTC.","Other major hedge funds, like Elliott Capital and Apollo Management Holdings, have also disclosed significant stakes in spot Bitcoin ETFs.","The recent Bitcoin price rally has mirrored the performance of major global stock indexes, with the S&P 500 reaching a new all-time high.","Analysts believe that the rising traded volume for spot BTC ETFs demonstrates heightened demand from institutional investors, which has helped rejuvenate the bullish sentiment in the market.","As Bitcoin continues to gain momentum, analysts are setting their sights on potential price targets.","Some predict that Bitcoin could reach $84,000, while veteran trader Peter Brandt suggests that the cryptocurrency is on the verge of printing a new all-time high based on the hump, slump, bump, dump, pump (HSBDP) indicator.","I have shown this chart many times in the past in slightly different iterations and it remains my preferred interpretation $BTC pic.twitter.com/dr47wYBsw3","— Peter Brandt (@PeterLBrandt) May 15, 2024","","As central banks continue to ease monetary policies and institutional investors increase their exposure to Bitcoin through spot ETFs, the stage appears to be set for another crack at the ATH in the coming months."],"create_date":"2024-05-16T07:30:38+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/pepe-coin-pepe-reaches-new-all-time-high-amid-meme-coin-surge/#","web_url":"https://blockonomi.com/","type":"article","description":"Meme coins, led by Pepe coin (PEPE), have emerged as top performers in the cryptocurrency market, attracting significant attention from both retail investors and \"smart money\" traders","title":"Pepe Coin (PEPE) Reaches New All-Time High Amid Meme Coin Surge - Blockonomi","content":["Amidst a recent surge in the cryptocurrency market, meme coins have emerged as some of the best performers among the top 100 digital assets by market capitalization.","Leading the pack is Pepe coin (PEPE), which has recently hit a new all-time high (ATH), drawing the attention of both retail investors and seasoned traders known as “smart money.”","On-chain data reveals that smart money addresses have been actively trading PEPE, with a staggering 250.5 billion PEPE tokens moved in the past 24 hours.","This increased activity has been accompanied by a significant price rally, with PEPE surging nearly 20% at press time. The token’s 24-hour trading volume has also skyrocketed by 280.38% to $2.11 billion, further indicating strong bullish sentiment.","Technical indicators suggest that PEPE’s upward momentum may continue, as the price remains above key support levels such as the 100-day Simple Moving Average (SMA) and the trendline.","The Relative Strength Index (RSI), Moving Average Convergence Divergence (MACD), and Alligator indicators all point towards a potentially sustained uptrend.","Some analysts caution that a correction may be on the horizon, as the RSI currently hovers around 70, signaling overbought conditions.","PEPE is not the only meme coin enjoying success in the current market environment. Other notable performers include Shiba Inu (SHIB), Floki (FLOKI), and Bonk (BONK), all of which have demonstrated significant growth over the past 24 hours.","SHIB, in particular, has seen a 7.4% increase, while FLOKI and BONK have gained 9.8% and 6.7%, respectively. Even Dogecoin (DOGE), the largest meme coin by market cap and the only “dog coin” in the top 10 cryptocurrencies, has experienced a 5.6% surge, pushing its capitalization above $21 billion.","The success of meme coins comes amid a broader recovery in the crypto market, with Bitcoin (BTC) rising by 2.7% and the overall market adding 1.7% overnight.","Altcoin segments associated with meme coins, such as cat-themed and dog-themed tokens, have also shown impressive growth rates, with cat-themed coins adding 14.5% in the past 24 hours."],"create_date":"2024-05-14T08:02:24+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/u-s-spot-bitcoin-etf-inflows-reach-303-million-amid-surging-bitcoin-prices/#respond","web_url":"https://blockonomi.com/","type":"article","description":"U.S. spot Bitcoin ETF inflows surged to $303 million as institutional investors and public pension funds allocated substantial funds to Bitcoin ETFs, driven by positive CPI data and a favorable market sentiment.","title":"U.S. Spot Bitcoin ETF Inflows Reach $303 Million Amid Surging Bitcoin Prices - Blockonomi","content":["The cryptocurrency market experienced a boost on May 15, 2024, as U.S. spot Bitcoin ETF inflows reached a two-week high of $303 million.","This surge in institutional investment coincided with Bitcoin’s price climbing beyond $66,000, marking a notable milestone for the world’s largest cryptocurrency.","Leading the charge in Bitcoin ETF inflows was Fidelity’s FBTC, which attracted an impressive $131.3 million. Bitwise’s BITB also had a strong showing, with inflows of $86.3 million.","Interestingly, Grayscale’s GBTC, which had been facing outflows over the past four months, saw a reversal in sentiment, registering an inflow of $27 million.","This shift could indicate a change in the perspective of investors who have been investing in the biggest Bitcoin investment resources globally.","The recent quarterly 13F filings with the U.S. Securities and Exchange Commission (SEC) revealed that institutional investors have been actively buying into spot Bitcoin ETFs.","Prominent hedge fund Millennium Management, with over $64 billion in assets under management, holds a substantial $2 billion portfolio across various spot Bitcoin ETFs, including BlackRock’s IBIT, Fidelity’s FBTC, Grayscale’s GBTC, Ark Invest’s ARKB, and Bitwise’s BITB. Other notable investors include Elliot Capital and Apollo Management Holdings.","In a groundbreaking move, the State of Wisconsin’s Investment Board allocated $163 million to Bitcoin ETFs, becoming one of the first U.S. public pension funds to do so.","This allocation was split between BlackRock’s IBIT ($99.1 million) and Grayscale’s GBTC ($63.6 million). The decision by a state pension fund to invest in Bitcoin ETFs marks a significant step towards mainstream adoption of cryptocurrencies.","The positive market sentiment can be attributed to the release of the April U.S. Consumer Price Index (CPI) data, which came in lower than expected at 0.3%.","This key indicator of inflation has increased optimism among investors about the possibility of the Federal Reserve reducing interest rates and injecting more liquidity into the market – a scenario that has historically been favorable for high-risk assets like cryptocurrencies.","As Bitcoin ETFs witnessed renewed interest, the price of Bitcoin experienced a significant surge, reaching a high of $66,350 during early Asian trading on May 16.","This marks a notable recovery for the cryptocurrency, which is now just 10% away from its all-time high of $73,750, reached on March 14."],"create_date":"2024-05-16T11:20:39+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/vanguards-new-ceo-salim-ramji-maintains-stance-against-bitcoin-etf/","web_url":"https://blockonomi.com/","type":"article","description":"Incoming Vanguard CEO Salim Ramji has affirmed that he will not reverse the company\u0027s decision to refrain from launching a spot Bitcoin ETF","title":"Vanguard\u0027s New CEO Salim Ramji Maintains Stance Against Bitcoin ETF - Blockonomi","content":["Salim Ramji, the incoming CEO of Vanguard and former head of BlackRock’s global ETF business, has made it clear that he will not reverse the company’s decision to refrain from launching a spot Bitcoin ETF.","In a recent interview with Barron’s, Ramji emphasized the importance of consistency in Vanguard’s investment philosophy and product offerings, stating that the firm’s current stance on crypto-related investment products aligns with its values.","Vanguard, one of the world’s largest asset management firms with $8.6 trillion in assets under management, has faced criticism from some clients for not offering access to spot Bitcoin ETFs, which have gained popularity among rival investment firms.","However, Ramji’s comments suggest that the company will maintain its cautious approach to the cryptocurrency market, despite his previous experience overseeing the launch of BlackRock’s iShares Bitcoin Trust (IBIT).","During his tenure at BlackRock, Ramji played a key role in the development and approval of IBIT, which has since amassed an impressive $18 billion in assets under management.","His move to Vanguard had sparked speculation among industry watchers about potential changes in the firm’s approach to Bitcoin and other digital assets.","However, Ramji’s recent statements indicate that he supports the views expressed by Vanguard’s Chief Investment Officer, Greg Davis, regarding the consistency of the company’s investment philosophy.","This philosophy, which prioritizes long-term, low-cost investing, has led Vanguard to view cryptocurrencies as speculative assets that do not align with its core principles.","Vanguard’s outgoing CEO, Tim Buckley, has also been vocal about his skepticism regarding the suitability of Bitcoin ETFs for long-term retirement portfolios.","In March, Buckley stated that he did not believe a Bitcoin ETF belongs in the portfolio of someone saving for retirement, as he considers crypto to be a speculative asset.","Despite the growing popularity of spot Bitcoin ETFs among rival investment firms, such as Fidelity and BlackRock, Vanguard has chosen to prioritize its established investment philosophy over the potential short-term gains associated with offering crypto-related products.","This decision has led to some backlash from clients, with a number of Vanguard customers threatening to close their accounts in January due to the firm’s decision to block access to spot Bitcoin ETFs.","While Ramji’s appointment as CEO had initially raised questions about the potential for a shift in Vanguard’s stance on Bitcoin, analysts now believe that a significant change in the company’s approach is unlikely.","Bloomberg ETF analyst James Seyffart, for example, has expressed doubt that Ramji’s leadership will lead to the introduction of a Vanguard spot Bitcoin ETF."],"create_date":"2024-05-16T08:43:49+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/compliance-revolution-ai-assists-in-the-battle-against-money-laundering/","web_url":"https://blockonomi.com/","type":"article","description":"AI and deep learning models are revolutionizing the way fintechs and financial institutions combat fraud and money laundering","title":"Compliance Revolution: AI Assists in the Battle Against Money Laundering - Blockonomi","content":["The financial industry is facing an ever-growing threat of fraud, with global losses exceeding $1 trillion annually. As digital interactions continue to increase, fraudsters are finding new ways to exploit the system, making it crucial for fintechs and financial institutions to stay ahead of the curve.","To combat this issue, many are turning to artificial intelligence (AI) and deep learning models to detect and prevent fraudulent activities more effectively.","AI-powered solutions offer several advantages over traditional rule-based systems. Deep learning models can analyze vast amounts of complex data, identifying patterns and anomalies that humans alone would struggle to detect.","This not only improves the accuracy of fraud detection but also reduces the number of false positives, ensuring a better customer experience. By leveraging AI, financial institutions can adapt quickly to new fraud techniques, updating their models in as little as a few hours.","In addition to fraud prevention, AI is also playing a vital role in helping financial institutions meet anti-money laundering (AML) regulations.","Companies like ComplyAdvantage use AI to identify individuals and organizations targeted by government sanctions, enabling banks to promptly update their screening services.","This is particularly important in light of the tougher stance regulators are taking on financial crimes.","To further streamline compliance processes, First AML has recently launched its AI Assist tool. This innovation aims to revolutionize the extraction of key details from trust deeds, reducing the time needed for Know Your Customer (KYC) and AML tasks to just 60 seconds or less.","By automating data entry and beneficial owner identification, AI Assist helps compliance professionals focus on core tasks and enhances their ability to prevent fraudulent activities.","Similarly, Oracle has introduced its AI-powered platform, Oracle Financial Services Compliance Agent, to assist banks in reducing money laundering risks.","The platform allows financial institutions to carry out hypothetical scenario testing, adjust thresholds and controls, and proactively assess and mitigate risks associated with high-risk typologies.","By providing empirical data to support business decisions, the Compliance Agent enables banks to make evidence-based compliance decisions more swiftly and economically."],"create_date":"2024-05-15T10:27:21+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/andrew-tate-to-invest-100-million-in-bitcoin-abandoning-fiat-currency/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Andrew Tate announces a $100 million investment in Bitcoin, denouncing traditional banking and \"scams,\" as the cryptocurrency surges","title":"Andrew Tate to Invest $100 Million in Bitcoin, Abandoning Fiat Currency - Blockonomi","content":["Former kickboxer and controversial social media personality Andrew Tate has announced his intention to invest over $100 million in Bitcoin, completely abandoning fiat currency. Tate’s decision comes amidst his ongoing legal challenges in Romania and a period of significant growth for the world’s largest cryptocurrency.","Tate, known for his provocative opinions and lavish lifestyle, expressed his disillusionment with the traditional banking system in a series of posts on social media platform X (formerly Twitter).","“I’m done with the banks. I’m done with their money. Done with the scams,”","Tate stated, hinting at his motivation for the substantial investment in Bitcoin.","I know I’m not supposed to do this in chaotic times but I’m about to leave fiat completely and ape over 100M into btc.","And I’ll even prove I did it.","I’m done with the banks.","I’m done with their money.","Done with the scams.","Then I’m going boating.","— Andrew Tate (@Cobratate) May 15, 2024","","This announcement coincides with a bullish period for Bitcoin, which has seen a 7% increase in the last 24 hours, surpassing the $66,000 resistance level.","Industry experts, such as the co-founders of on-chain analysis company Glassnode, have attributed this growth to factors like lower-than-expected U.S. inflation data and weaker retail sales, which could lead the Federal Reserve to adopt a more “dovish” monetary policy.","These developments have strengthened confidence in the cryptocurrency market, with predictions that Bitcoin could reach $84,000 in the near future.","Tate’s endorsement of Bitcoin comes as a surprise to many, given his recent criticism of cryptocurrency investors, whom he dubbed “dorks” just a few weeks ago.","However, his decision to invest heavily in Bitcoin while simultaneously denouncing “scams” suggests a change of heart and a belief in the cryptocurrency’s legitimacy.","Despite the positive market sentiment, Tate’s personal life remains mired in legal controversies.","The former kickboxer is currently facing serious charges in Romania, including human trafficking and rape.","Authorities have already seized various assets belonging to Tate, including 21 Bitcoins worth $560,000, luxury cars, and real estate valued at millions of dollars.","As Bitcoin continues to consolidate its position and potentially gear up for further growth, it remains to be seen how Tate’s substantial investment will impact his personal wealth and the public perception of his association with the cryptocurrency.","Regardless of the outcome, Tate’s announcement has undoubtedly sparked conversations about the future of money and the role of cryptocurrencies in an increasingly digital world."],"create_date":"2024-05-16T07:36:06+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/banking-elites-behind-us-crypto-hostility-ethereum-co-founder-speaks-out/","web_url":"https://blockonomi.com/","type":"article","description":"Ethereum co-founder Joseph Lubin criticizes the SEC for stifling innovation and potentially threatening the future of decentralized finance in the US, as ConsenSys engages in a legal battle with the regulator to seek clarity on Ethereum\u0027s regulatory status.","title":"Banking Elites Behind US Crypto Hostility? Ethereum Co-Founder Speaks Out - Blockonomi","content":["Ethereum co-founder Joseph Lubin has recently voiced concerns over the United States government’s increasingly hostile stance towards cryptocurrencies.","In an interview during FT Live’s Crypto and Digital Asset summit in London, Lubin suggested that the root cause of this hostility might go beyond individual politicians or political parties, and could be influenced by banking elites who feel threatened by the potential of decentralization.","Lubin specifically criticized the U.S. Securities and Exchange Commission (SEC) for its approach to regulating the cryptocurrency industry.","He argued that the SEC’s enforcement actions, rather than open discourse and clear rulemaking, are creating a climate of fear, uncertainty, and doubt, which effectively stifles innovation and growth.","At FT Live’s summit, #Ethereum\u0027s Joseph Lubin accused the #SEC of harming financial innovation by using enforcement over clear rules, hinting at an unannounced reclassification of Ether as a security. #CryptoRegulation #SEC #Innovationhttps://t.co/mlctKOFSjP","— 1ATH.Studio (@1ATHStudio) May 10, 2024","","The situation escalated when ConsenSys, the company behind the popular MetaMask wallet, received a Wells notice from the SEC.","In response, ConsenSys filed a preemptive lawsuit against the regulator, challenging its reported position that the buying and selling of ETH constitutes an illegal unregistered securities offering.","Lubin emphasized the significance of this legal action, as a victory for the SEC could potentially spell the end of the Ethereum blockchain in the United States.","Lubin also pointed out the inconsistencies in the regulatory landscape, noting that while the Commodity Futures Trading Commission (CFTC) had previously classified Ether as a commodity, the SEC now suggests it may be a security.","This lack of clarity has led to confusion and uncertainty within the industry.","Lubin highlighted the suspicious timing of the SEC’s actions against Ethereum, which coincide with the agency’s upcoming deadline to decide on Ether spot exchange-traded funds (ETFs).","He speculated that these enforcement actions might be a strategic move to justify denying the ETFs, as the SEC had previously allowed Bitcoin ETFs, which led to a significant influx of capital into the ecosystem.","The broader implications of ConsenSys’s legal battle with the SEC extend beyond Ethereum. Lubin condemned the SEC’s stance that digital wallets like Coinbase and MetaMask should be regulated as broker-dealers, calling it a “preposterous notion.”","He argued that such regulation could severely restrict technological innovation and user freedom in the United States."],"create_date":"2024-05-15T09:59:09+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/tether-cracks-down-on-phishing-5-2-million-in-usdt-frozen/#Tether_And_Ripple_Clash","web_url":"https://blockonomi.com/","type":"article","description":"Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to scams.","title":"Tether Cracks Down on Phishing: $5.2 Million in USDT Frozen - Blockonomi","content":["Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to phishing scams.","The move comes amid a debate between Tether and Ripple.","The frozen funds were located in 12 Ethereum wallets that were flagged as “USDT Banned Address,” according to on-chain analytics firm SlowMist. As reported, the flagged wallets were being used to launder money obtained from phishing scams.","Table of Contents","It’s not the first time Tether has demonstrated proactive steps to ensure regulatory compliance and safeguard users against fraud. The firm has consistently performed similar acts over the past few years. It’s estimated that Tether has frozen over $1 billion in assets, targeting a wide range of illicit actions, including hacks, exploits, and scams.","In January 2022, Tether made headlines by blacklisting three Ethereum addresses holding over $150 million worth of USDT. Later that year, in October, Tether froze $8.2 million in USDT on Ethereum and blacklisted 215 Ethereum-based USDT addresses. By the end of 2022, Tether’s asset-freezing efforts amounted to a staggering $360 million.","Last October, the firm once again demonstrated its commitment to combating illicit activities by freezing $817,000 in USDT linked to terrorist activities in Ukraine and Israel. Just a month later, Tether intervened to freeze $225 million in USDT connected to romance scammers.","Also, over the past year, Tether has collaborated with 24 law enforcement agencies across more than 40 countries. During this period, they have successfully processed 198 requests to block wallets associated with illicit activities.","In addition to addressing requests to freeze funds, Tether provides secondary market controls that enable them to freeze any transactions linked to individuals and entities listed on the United States Office of Foreign Assets Control (OFAC) Specially Designated Nationals list.","Earlier this month, Tether announced its partnership with leading blockchain analysis firm Chainalysis to create a custom set of tools to monitor the secondary market.","According to the US Department of Justice (DOJ), cryptocurrency is the preferred payment method for ransomware and other digital extortion activities.","US Senator Elizabeth Warren has recently called on US law enforcement agencies to crack down on crypto payments for child sexual abuse material (CSAM). According to Chainalysis, cryptocurrency has become the key payment method for CSAM content.","However, while Tether has shown efforts to comply with regulatory requirements, the company’s actions have sparked controversies. Some argue that the ability of stablecoin issuers to freeze funds for anti-fraud purposes somewhat contrasts with the neutralized nature of cryptocurrency.","And despite Tether’s ongoing work with regulators, Brad Garlinghouse, CEO of Ripple, doesn’t think it’s enough to help the company escape the US government’s scrutiny. Speaking in a recent podcast, Garlinghouse said US lawmakers are taking measures against the world’s largest stablecoin company.","According to him, the crackdown could bring serious harm to the entire cryptocurrency market. He linked it to one of the worst scenarios – the black swan. He claimed that the US government placing Tether in its sights could be the main factor leading to this event.","In response, Tether’s CEO Paolo Ardoino countered that Ripple was spreading FUD about USDT to create opportunities for the stablecoin it is building. In April, Ripple announced plans to issue new stablecoins.","Its coming product, however, has already been targeted by the US Securities and Exchange Commission (SEC). The SEC suggested in a recent filing that Ripple’s stablecoin is an unregistered security.","Garlinghouse’s statement was made amid concerns that Tether is being used by terrorist organizations and embargoed countries like Russia to circumvent US economic sanctions.","US Senate Banking Committee, Adewale Adeyemo, US Deputy Secretary of the Treasury, previously noted that Russia has switched to using payment alternatives, like USDT, to circumvent sanctions."],"create_date":"2024-05-16T07:23:20+00:00","tag":"","author":"Nicholas Say"}
{"url":"https://blockonomi.com/wallstreetbet-celebrates-roaring-kitty-return-gamestock-stock-surges-trading-halted/","web_url":"https://blockonomi.com/","type":"article","description":"Keith \"Roaring Kitty\" Gill\u0027s return to social media sparked a significant rally in GameStop stock, evoking memories of the 2020-2021 meme stock frenzy","title":"WallStreetBets Celebrates \"Roaring Kitty\" Return: Gamestock Stock Surges & Trading Halted - Blockonomi","content":["GameStop (GME) stock experienced a sudden resurgence on Monday, May 13, 2024, as shares soared over 90% following the return of Keith Gill, a prominent figure in the 2020-2021 meme stock frenzy. Gill, known by his online persona “Roaring Kitty,” took to social media platform X on Sunday evening, breaking a nearly three-year silence since his last post in 2021.","Gill’s initial post featured a meme of a person playing video games, leaning forward in their chair to indicate a more serious approach to the game.","pic.twitter.com/YgjVqtgcNS","— Roaring Kitty (@TheRoaringKitty) May 13, 2024","","This cryptic message was enough to ignite a frenzy among retail traders, particularly those in the online community WallStreetBets, which played a central role in the original GameStop surge.","As the market opened on Monday, GameStop shares quickly skyrocketed, triggering multiple trading halts due to the extreme volatility.","Gill followed up his initial post with two more, featuring short videos that nodded to his absence and return, using clips from popular movies and TV shows such as “Ferris Bueller’s Day Off” and “Breaking Bad.”","Prior to his rise to fame during the meme stock craze, Gill had invested $53,000 in GameStop shares in 2019, convinced that the retailer was undervalued.","At the height of the surge, his position was worth an estimated $48 million. Alongside other key figures like activist investor Ryan Cohen, who is now GameStop’s CEO, Gill’s enthusiasm for the stock helped drive the unprecedented online excitement and subsequent price action.","The WallStreetBets community celebrated Gill’s return, with numerous top posts on the subreddit discussing his recent activity and the impact on GameStop’s stock price.","Both “GameStop” and “GME” trended on X as users shared their excitement and investment plans.","Despite the significant surge, GameStop shares remained well below their all-time high of $120.75 reached on January 28, 2021. However, the stock has more than doubled in value since the beginning of May, trading at $28.24 as of 11:45 a.m. ET on Monday.","As the news of Gill’s return and GameStop’s stock movement continues to spread, it remains to be seen whether this sudden resurgence will have the same lasting impact as the original meme stock frenzy.","Market participants and regulators alike will be closely monitoring the situation to determine if this is a temporary blip or the beginning of another retail trader-driven market disruption."],"create_date":"2024-05-14T09:12:54+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/pepe-coin-pepe-soars-to-third-largest-memecoin-by-market-cap-as-trader-reaps-massive-profits/","web_url":"https://blockonomi.com/","type":"article","description":"An unknown crypto trader turned a $3,000 investment in the Pepe memecoin into a staggering $46 million in just one month, representing a 15,718x return","title":"Pepe Coin (PEPE) Soars to Third-Largest Memecoin by Market Cap as Trader Reaps Massive Profits - Blockonomi","content":["An unknown cryptocurrency trader has managed to transform a mere $3,000 investment in the Pepe (PEPE) memecoin into a staggering $46 million in just one month.","This feat represents a jaw-dropping 15,718x return on the initial investment, highlighting the potential for astronomical gains in the volatile world of memecoins.","According to data from the on-chain tracking platform Lookonchain, the savvy trader purchased 4.9 trillion PEPE tokens for $3,000 on April 15, 2023, when the token first launched.","As Pepe’s price skyrocketed in the following weeks, the value of the trader’s holdings soared to over $56 million. The trader has since sold 1.41 trillion PEPE for $7.4 million and currently sits on 3.5 trillion PEPE, worth an astonishing $38.9 million.","Earned more than $46M on $PEPE with only $3K, a gain of 15,718x!????","This super big winner sold 255B $PEPE($2.3M) for profits again after the price of $PEPE increased.","He spent only $3K to buy 4.9T $PEPE($56M currently) on Apr 15, 2023, and sold 1.41T $PEPE for $7.4M, with 3.5T… pic.twitter.com/VKGxmK9gCt","— Lookonchain (@lookonchain) May 15, 2024","","Pepe’s meteoric rise has propelled it to become the third-largest memecoin by market capitalization, trailing only behind the well-established Dogecoin and Shiba Inu.","The token recently achieved a new all-time high, surpassing the $0.00001 mark and reaching a market cap of $4.5 billion.","The success of memecoins like Pepe is being attributed to a growing sense of disillusionment among younger generations of investors.","Hao Yang, head of financial products at Bybit exchange, suggests that the popularity of these tokens can be seen as a symptom of young investors who have witnessed the disappearance of opportunities that were once available to their parents.","By creating tokens out of thin air and pumping them to billion-dollar valuations, memecoin creators are showcasing the absurdity of the current fiat system, according to Yang.","Pepe’s recent price surge may also be linked to the resurgence of the GameStop stock craze.","The memecoin hit its all-time high just a day after Keith Gill, the man widely credited with initiating the 2021 GameStop short squeeze, unexpectedly returned to social media after a nearly three-year absence.","GameStop shares rallied over 111% in the 24 hours following Gill’s return, surpassing Bitcoin’s yearly returns.","While predicting the start of a full-fledged memecoin run is challenging, some traders believe that profits from the GameStop rally will find their way into altcoins, mirroring the patterns observed during the 2021 bull run.","Aleksandra Artamonovskaja, head of art at TriliTech, Tezos, suggests that Pepe is well-positioned to benefit from the GameStop saga, as it offers a relatable narrative of freedom and hope against the establishment, resonating with retail investors.","However, the timing of the trader’s investment in Pepe has raised questions about potential insider knowledge.","The fact that the trader swapped a relatively obscure token, Timeless (LIT), for PEPE on the same day as the initial purchase has fueled speculation about the possibility of insider information."],"create_date":"2024-05-16T09:13:16+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/sonne-finance-suffers-20-million-exploit-token-plummets-60/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Sonne Finance, a decentralized lending protocol, has suffered a $20 million exploit due to a vulnerability in its Compound v2 forks, leading to a 60% drop in its native token\u0027s value","title":"Sonne Finance Suffers $20 Million Exploit, Token Plummets 60% - Blockonomi","content":["Sonne Finance, a decentralized lending protocol built on the Optimism and Base blockchains, has fallen victim to a $20 million exploit, causing its native SONNE token to plummet by 60%.","The attack, which occurred on Wednesday, took advantage of a vulnerability in the protocol’s Compound v2 forks, enabling the hacker to manipulate markets and steal various tokens, including ether, velo, and stablecoins.","The attacker employed a “donation” attack, a method that involves manipulating the exchange rate between two tokens by donating large amounts of cryptocurrency.","This effectively tricked the platform into believing it had more collateral than was actually available, allowing the hacker to siphon off funds.","Blockchain data reveals that the attacker managed to transfer millions of VELO, ether, and USD Coin (USDC) following the manipulation.","They later converted $8 million of the stolen funds into bitcoin and ether, transferring them to a new wallet address in the early hours of the morning.","#PeckShieldAlert @SonneFinance exploiter-labeled address has transferred $7.8M worth of cryptos, including 100 $WBTC & 556.1 $ETH, to a new address 0x6277…4c07 #Optimism pic.twitter.com/g4oiP5akr4","— PeckShieldAlert (@PeckShieldAlert) May 15, 2024","","The exploit occurred shortly after Sonne Finance added token markets for Velodrome Finance’s VELO, following a recent community proposal.","The attacker took advantage of a two-day timelock to execute four transactions, creating markets and adding collateral factors. Timelocks are smart contracts that execute transactions at a specific time, in this case, two days after being locked.","In response to the attack, Sonne Finance’s developers were able to mitigate the damage and pause all markets on the Optimism blockchain.","However, the protocol’s markets on the Base blockchain remained operational, as the exploit only affected the Optimism version of the platform.","The incident had a significant impact on the value of Sonne Finance’s native token, SONNE, which plummeted by 60% to 2.5 cents, its lowest level in over a year.","This drop in price cut the token’s market cap to $20 million, despite the developers’ efforts to prevent an additional $6.5 million from being stolen once the attack was discovered.","Sonne Finance has stated that they are working on retrieving the stolen funds and have offered a bounty to the hacker in exchange for their return.","However, the attacker has already moved a large portion of the loot, approximately $7.8 million worth of cryptocurrencies, to a new wallet address, suggesting that they may not be interested in negotiating a return of the funds.","The exploit has raised questions about the security of decentralized lending protocols and the risks associated with using forked versions of existing platforms.","Some members of the crypto community have criticized Sonne Finance for using Compound v2 despite being aware of its known vulnerabilities, with one individual even suggesting that the exploit may have been a premeditated backdoor."],"create_date":"2024-05-16T08:35:10+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/tether-ceo-defends-compliance-efforts-criticizes-ripples-garlinghouse/","web_url":"https://blockonomi.com/","type":"article","description":"Ripple CEO Brad Garlinghouse believes the U.S. government is targeting Tether, raising concerns about the potential impact on the crypto ecosystem, while Tether CEO Paolo Ardoino criticizes Garlinghouse\u0027s statements and defends the company\u0027s compliance efforts amidst Ripple\u0027s own legal challenges and upcoming stablecoin launch.","title":"Tether CEO Defends Compliance Efforts, Criticizes Ripple\u0027s Garlinghouse - Blockonomi","content":["Ripple CEO Brad Garlinghouse recently expressed his belief that the United States government is targeting Tether, the world’s largest stablecoin issuer by market capitalization.","Speaking on the World Class podcast, Garlinghouse stated, “The U.S. government is going after Tether, that is clear to me.” While acknowledging Tether’s importance within the cryptocurrency ecosystem, he admitted uncertainty about the potential impact of U.S. regulatory action against the company.","Tether, which issues the USDT stablecoin, has faced ongoing scrutiny regarding its transparency and the reserves backing its token.","","The company has been criticized for its lack of clarity surrounding its holdings and has been investigated for alleged misconduct. In October 2021, Tether paid a $41 million fine to the Commodity Futures Trading Commission for misrepresenting its reserve holdings.","Garlinghouse’s comments come as Ripple, the company behind the XRP cryptocurrency, prepares to launch its own stablecoin in 2024.","The Ripple CEO’s statements have drawn criticism from Tether CEO Paolo Ardoino, who took to social media to call Garlinghouse an “uninformed CEO.” Ardoino pointed out that Ripple itself is currently under investigation by the U.S. Securities and Exchange Commission (SEC) and suggested that Garlinghouse’s comments were motivated by Ripple’s forthcoming stablecoin, which could compete with USDT.","An uniformed CEO, leading a company being investigated by the SEC, launching a competitive stablecoin (cui prodest), is being reported spreading fear about USDt.","Let me give you an update on Tether USDt ecosystem safety.","USDt is the most used stablecoin in the world, with…","— Paolo Ardoino ???? (@paoloardoino) May 13, 2024","","Ardoino defended Tether’s compliance efforts, highlighting the company’s collaboration with blockchain analytics firm Chainalysis and law enforcement agencies worldwide.","He emphasized that Tether leverages blockchain technology’s transparency to meet regulatory requirements.","As the cryptocurrency industry continues to evolve, the role of stablecoins and their regulation remains a topic of ongoing discussion. The potential impact of U.S. regulatory action against Tether is difficult to predict, given the company’s significant market presence.","However, the emergence of new stablecoin competitors, such as Ripple’s upcoming offering, may reshape the landscape and provide alternatives for investors and users."],"create_date":"2024-05-13T08:25:23+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/oklahoma-becomes-first-u-s-state-to-protect-crypto-self-custody-rights/","web_url":"https://blockonomi.com/","type":"article","description":"Oklahoma\u0027s landmark \u0027Bitcoin Rights\u0027 bill, the first of its kind in the U.S., protects citizens\u0027 rights to self-custody digital assets and engage in crypto mining activities, establishing a legal framework for blockchain technology and digital assets in the state.","title":"Oklahoma Becomes First U.S. State to Protect Crypto Self-Custody Rights - Blockonomi","content":["Oklahoma has become the first U.S. state to pass a comprehensive law protecting citizens’ rights to self-custody digital assets and engage in crypto mining activities. Governor Kevin Stitt signed the ‘Bitcoin Rights’ bill, HB3594, into law on Monday, establishing a legal framework for blockchain technology and digital assets in the state.","The new legislation, inspired by the Satoshi Action Fund’s model policy, ensures that Oklahomans cannot be prevented from holding and controlling digital assets using hardware wallets.","It also prohibits the state government from banning or restricting the use of cryptocurrency to purchase legal goods and services, providing a level playing field for crypto users.","One of the key aspects of the bill is the protection it offers to crypto miners. Home digital asset mining is now legal in Oklahoma, as long as miners comply with local noise ordinances.","The law also allows businesses to engage in industrial-scale mining operations without facing specific noise limits beyond those already in place for data centers.","The legislation safeguards individuals and businesses engaged in crypto mining or node operation from liabilities related solely to validating transactions. It establishes that no money transmitter license is required for engaging in digital asset mining, operating nodes, or participating in blockchain staking.","The passage of this bill comes at a time when the crypto industry faces increasing regulatory scrutiny at the federal level. In the absence of a clear regulatory framework from Congress, federal regulators have been left to regulate the crypto industry largely through enforcement actions against companies and developers.","Recent crackdowns on crypto mixing services and privacy tools have raised concerns among crypto advocates about the potential for a future ban on self-custody.","Oklahoma’s new law proactively addresses these concerns by enshrining the right to self-custody as a fundamental right.","The bill’s sponsor, Republican state Rep. Brian Hill, emphasized the importance of the legislation in protecting individuals’ rights to their digital assets.","The Satoshi Action Fund, which helped introduce similar legislation in 15 other states, believes that more states will follow Oklahoma’s lead in passing crypto-friendly laws.","As the new law goes into effect on November 1, 2024, Oklahoma is positioning itself as a welcoming destination for crypto companies and investors.","The state has already attracted significant investments in the crypto mining industry, with companies like Polaris Technologies announcing plans to build large-scale mining facilities in the state."],"create_date":"2024-05-16T08:04:21+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/consensys-vs-sec-crypto-industry-pushes-back-against-secs-enforcement-campaign/","web_url":"https://blockonomi.com/","type":"article","description":"Consensys has filed a lawsuit against the SEC in an attempt to prevent the agency from regulating Ethereum and to protect its MetaMask wallet product","title":"Consensys vs. SEC: Crypto Industry Pushes Back Against SEC\u0027s Enforcement Campaign - Blockonomi","content":["Consensys, a prominent Ethereum software firm, has filed a lawsuit against the U.S. Securities and Exchange Commission (SEC) in a Texas federal court. The move comes as a response to the SEC’s increasing scrutiny of the Ethereum blockchain and its native token, Ether (ETH).","The lawsuit aims to prevent the SEC from regulating Ethereum and to push back against what Consensys calls the agency’s “campaign to seize control over the future of cryptocurrency.”","The legal battle began when Consensys received a Wells notice from the SEC on April 10, indicating the agency’s intention to bring an enforcement action against the company for allegedly violating securities laws through its popular MetaMask wallet product.","The SEC claims that by offering the MetaMask wallet, Consensys is acting as an unregistered securities broker. However, Consensys denies these allegations, stating that the wallet is “simply an interface” and does not hold customers’ digital assets or carry out any transaction functions.","In its complaint, Consensys argues that the SEC’s attempt to exert authority over Ethereum contradicts the agency’s previous statements, which suggested that Ether was not a security but rather a commodity.","The company also points out that the SEC’s move goes against the Commodity Futures Trading Commission’s (CFTC) authority over Ethereum, as the CFTC oversees derivative products tied to Ether.","Consensys claims that it has built its business based on the regulatory consensus that Ethereum is not a security. The company warns that the SEC’s “unlawful seizure of authority” over Ethereum would have disastrous consequences for the Ethereum network and the broader crypto industry.","If the SEC were to treat Ether as a security, it could potentially bring the use of the Ethereum blockchain in the United States to a halt, as every Ether holder would fear violating securities laws when transferring the token on the network.","The lawsuit also highlights the SEC’s recent enforcement actions against various crypto companies, including Binance, Kraken, and Uniswap Labs.","Many in the crypto industry have criticized the SEC for failing to provide clear regulations and guidance for blockchain technology, instead opting for an aggressive enforcement approach.","Consensys founder Joseph Lubin stated that the SEC’s investigations into companies and developers involved with the Ethereum codebase are “only accelerating.” He believes that the agency’s actions are an attempt to stifle innovation and prevent the launch of Ether spot ETFs, which could potentially bring significant capital into the crypto ecosystem.","The Consensys lawsuit seeks several court rulings, including a declaration that Ether is not a security, that MetaMask is not operating as an unlicensed broker-dealer, and that the SEC is violating the Administrative Procedure Act and the Constitution’s guarantee of due process.","The company also seeks an injunction to prevent the SEC from conducting investigations based on the premise that Ethereum is a security."],"create_date":"2024-04-26T07:12:27+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/sec-strikes-again-robinhood-crypto-receives-sec-wells-notice-this-time/","web_url":"https://blockonomi.com/","type":"article","description":"Robinhood Crypto received a Wells notice from the SEC, indicating a potential enforcement action related to alleged securities violations","title":"SEC Strikes Again! Robinhood Crypto Receives SEC Wells Notice This Time - Blockonomi","content":["Robinhood Markets, the popular retail trading platform, disclosed on Monday that its cryptocurrency arm, Robinhood Crypto, received a Wells notice from the U.S. Securities and Exchange Commission (SEC) on May 4, 2024.","The notice indicates that the SEC staff has made a preliminary determination to recommend an enforcement action against Robinhood Crypto, alleging violations of Sections 15(a) and 17A of the Securities Exchange Act of 1934, which pertain to registration as a securities broker and transfer agent.","The potential enforcement action comes amidst a broader crackdown by the SEC on the cryptocurrency industry. The regulator has taken a firm stance, arguing that most cryptocurrency tokens are securities and subject to its registration rules. This position has been met with opposition from crypto firms, who accuse the SEC of overreach.","Over the last three years, we’ve reached a state of regulatory onslaught that is harmful to American companies and consumers. The SEC’s continued attack on crypto, coupled with recent rule proposals like the one related to predictive data analytics, mark yet another improper…","— Vlad Tenev (@vladtenev) May 6, 2024","","In response to the Wells notice, Robinhood’s Chief Legal, Compliance, and Corporate Affairs Officer, Dan Gallagher, expressed disappointment, stating that the company had made “good faith attempts” to work with the SEC for regulatory clarity.","Gallagher, a former SEC commissioner himself, firmly believes that the assets listed on Robinhood’s platform are not securities and looks forward to engaging with the SEC to make their case.","The potential action from the SEC could have significant consequences for Robinhood Crypto. It may include a civil injunctive action, public administrative proceeding, and/or a cease-and-desist order.","The remedies sought by the SEC could encompass an injunction, a cease-and-desist order, disgorgement, pre-judgment interest, civil money penalties, and censure, as well as revocation and limitations on activities.","This development comes on the heels of similar actions taken by the SEC against other prominent players in the cryptocurrency space.","In June 2023, the agency filed lawsuits against Coinbase and Binance, the two largest cryptocurrency exchanges, alleging that they were operating unregistered exchanges by allowing the sale of certain crypto tokens the SEC considers to be investment securities.","In response to these lawsuits, Robinhood took preemptive measures and ended support for Cardano (ADA), Polygon (MATIC), and Solana (SOL) on June 27, 2023. These three tokens were specifically named as securities in the SEC’s lawsuits against Binance and Coinbase.","Despite the legal challenges, Robinhood’s stock price showed resilience, closing up nearly 2% on Monday after paring earlier losses.","Mizuho analyst Dan Dolev noted that the concerns regarding the Wells notice might be overblown, given that Robinhood earns a relatively small portion of its total revenue from crypto trading compared to more crypto-focused firms. In the fourth quarter of 2023, only 9.13% of Robinhood’s total net revenue came from crypto-related transaction fees.","The company has expressed its willingness to contest the matter in court if necessary, setting the stage for another legal battle between a crypto firm and the anti-crypto SEC."],"create_date":"2024-05-07T09:40:18+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/sec-strikes-again-robinhood-crypto-receives-sec-wells-notice-this-time/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Robinhood Crypto received a Wells notice from the SEC, indicating a potential enforcement action related to alleged securities violations","title":"SEC Strikes Again! Robinhood Crypto Receives SEC Wells Notice This Time - Blockonomi","content":["Robinhood Markets, the popular retail trading platform, disclosed on Monday that its cryptocurrency arm, Robinhood Crypto, received a Wells notice from the U.S. Securities and Exchange Commission (SEC) on May 4, 2024.","The notice indicates that the SEC staff has made a preliminary determination to recommend an enforcement action against Robinhood Crypto, alleging violations of Sections 15(a) and 17A of the Securities Exchange Act of 1934, which pertain to registration as a securities broker and transfer agent.","The potential enforcement action comes amidst a broader crackdown by the SEC on the cryptocurrency industry. The regulator has taken a firm stance, arguing that most cryptocurrency tokens are securities and subject to its registration rules. This position has been met with opposition from crypto firms, who accuse the SEC of overreach.","Over the last three years, we’ve reached a state of regulatory onslaught that is harmful to American companies and consumers. The SEC’s continued attack on crypto, coupled with recent rule proposals like the one related to predictive data analytics, mark yet another improper…","— Vlad Tenev (@vladtenev) May 6, 2024","","In response to the Wells notice, Robinhood’s Chief Legal, Compliance, and Corporate Affairs Officer, Dan Gallagher, expressed disappointment, stating that the company had made “good faith attempts” to work with the SEC for regulatory clarity.","Gallagher, a former SEC commissioner himself, firmly believes that the assets listed on Robinhood’s platform are not securities and looks forward to engaging with the SEC to make their case.","The potential action from the SEC could have significant consequences for Robinhood Crypto. It may include a civil injunctive action, public administrative proceeding, and/or a cease-and-desist order.","The remedies sought by the SEC could encompass an injunction, a cease-and-desist order, disgorgement, pre-judgment interest, civil money penalties, and censure, as well as revocation and limitations on activities.","This development comes on the heels of similar actions taken by the SEC against other prominent players in the cryptocurrency space.","In June 2023, the agency filed lawsuits against Coinbase and Binance, the two largest cryptocurrency exchanges, alleging that they were operating unregistered exchanges by allowing the sale of certain crypto tokens the SEC considers to be investment securities.","In response to these lawsuits, Robinhood took preemptive measures and ended support for Cardano (ADA), Polygon (MATIC), and Solana (SOL) on June 27, 2023. These three tokens were specifically named as securities in the SEC’s lawsuits against Binance and Coinbase.","Despite the legal challenges, Robinhood’s stock price showed resilience, closing up nearly 2% on Monday after paring earlier losses.","Mizuho analyst Dan Dolev noted that the concerns regarding the Wells notice might be overblown, given that Robinhood earns a relatively small portion of its total revenue from crypto trading compared to more crypto-focused firms. In the fourth quarter of 2023, only 9.13% of Robinhood’s total net revenue came from crypto-related transaction fees.","The company has expressed its willingness to contest the matter in court if necessary, setting the stage for another legal battle between a crypto firm and the anti-crypto SEC."],"create_date":"2024-05-07T09:40:18+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/why-is-bitcoin-up-today-btc-breaks-66k-new-all-time-high-incoming/#","web_url":"https://blockonomi.com/","type":"article","description":"Bitcoin\u0027s price surged past $66,000 on Wednesday, driven by positive economic indicators, a shift in central bank policies, and growing institutional interest in spot Bitcoin ETFs.","title":"Why is Bitcoin Up Today? BTC Breaks $66k, New All Time High Incoming? - Blockonomi","content":["Bitcoin (BTC) experienced a significant rally on Wednesday, rising over 7.5% to reach $66,250, marking its best single-day performance since March 20.","This surge in price can be attributed to several factors, including weak U.S. economic data, a shift in central bank policies, and increased institutional interest in spot Bitcoin ETFs.","The U.S. Labor Department released data showing that the consumer price index (CPI) increased less than consensus estimates in April, signaling a downward shift in the cost of living.","Retail sales growth stalled, with the “control group” category declining 0.3% month-on-month.","These economic indicators have strengthened the case for a Fed rate cut in September, with markets expecting the Bank of England (BOE) and the European Central Bank (ECB) to follow suit in June.","As central banks worldwide pivot toward monetary easing, the net percentage of banks cutting rates is on the rise. This shift in policy is seen as a positive sign for risk assets, including cryptocurrencies, as it could help improve market liquidity.","Institutional investors have also shown renewed interest in Bitcoin, with spot Bitcoin ETF inflows surging to a two-week high of $303 million on May 15. Fidelity’s FBTC fund saw $131 million in inflows, while Bitwise’s BITB fund recorded an inflow of $86 million. Even Grayscale’s GBTC saw a return to inflows after four months of outflows.","SEC filings reveal that one of the world’s largest hedge funds, Millennium Management, holds a substantial $2 billion spot Bitcoin ETF portfolio, comprising stakes in various ETFs such as BlackRock’s IBIT, Fidelity’s FBTC, and Grayscale’s GBTC.","Other major hedge funds, like Elliott Capital and Apollo Management Holdings, have also disclosed significant stakes in spot Bitcoin ETFs.","The recent Bitcoin price rally has mirrored the performance of major global stock indexes, with the S&P 500 reaching a new all-time high.","Analysts believe that the rising traded volume for spot BTC ETFs demonstrates heightened demand from institutional investors, which has helped rejuvenate the bullish sentiment in the market.","As Bitcoin continues to gain momentum, analysts are setting their sights on potential price targets.","Some predict that Bitcoin could reach $84,000, while veteran trader Peter Brandt suggests that the cryptocurrency is on the verge of printing a new all-time high based on the hump, slump, bump, dump, pump (HSBDP) indicator.","I have shown this chart many times in the past in slightly different iterations and it remains my preferred interpretation $BTC pic.twitter.com/dr47wYBsw3","— Peter Brandt (@PeterLBrandt) May 15, 2024","","As central banks continue to ease monetary policies and institutional investors increase their exposure to Bitcoin through spot ETFs, the stage appears to be set for another crack at the ATH in the coming months."],"create_date":"2024-05-16T07:30:38+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/pepe-coin-pepe-reaches-new-all-time-high-amid-meme-coin-surge/","web_url":"https://blockonomi.com/","type":"article","description":"Meme coins, led by Pepe coin (PEPE), have emerged as top performers in the cryptocurrency market, attracting significant attention from both retail investors and \"smart money\" traders","title":"Pepe Coin (PEPE) Reaches New All-Time High Amid Meme Coin Surge - Blockonomi","content":["Amidst a recent surge in the cryptocurrency market, meme coins have emerged as some of the best performers among the top 100 digital assets by market capitalization.","Leading the pack is Pepe coin (PEPE), which has recently hit a new all-time high (ATH), drawing the attention of both retail investors and seasoned traders known as “smart money.”","On-chain data reveals that smart money addresses have been actively trading PEPE, with a staggering 250.5 billion PEPE tokens moved in the past 24 hours.","This increased activity has been accompanied by a significant price rally, with PEPE surging nearly 20% at press time. The token’s 24-hour trading volume has also skyrocketed by 280.38% to $2.11 billion, further indicating strong bullish sentiment.","Technical indicators suggest that PEPE’s upward momentum may continue, as the price remains above key support levels such as the 100-day Simple Moving Average (SMA) and the trendline.","The Relative Strength Index (RSI), Moving Average Convergence Divergence (MACD), and Alligator indicators all point towards a potentially sustained uptrend.","Some analysts caution that a correction may be on the horizon, as the RSI currently hovers around 70, signaling overbought conditions.","PEPE is not the only meme coin enjoying success in the current market environment. Other notable performers include Shiba Inu (SHIB), Floki (FLOKI), and Bonk (BONK), all of which have demonstrated significant growth over the past 24 hours.","SHIB, in particular, has seen a 7.4% increase, while FLOKI and BONK have gained 9.8% and 6.7%, respectively. Even Dogecoin (DOGE), the largest meme coin by market cap and the only “dog coin” in the top 10 cryptocurrencies, has experienced a 5.6% surge, pushing its capitalization above $21 billion.","The success of meme coins comes amid a broader recovery in the crypto market, with Bitcoin (BTC) rising by 2.7% and the overall market adding 1.7% overnight.","Altcoin segments associated with meme coins, such as cat-themed and dog-themed tokens, have also shown impressive growth rates, with cat-themed coins adding 14.5% in the past 24 hours."],"create_date":"2024-05-14T08:02:24+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/binance-co-founder-yi-he-responds-to-wsj-report-reaffirms-commitment-to-market-surveillance/","web_url":"https://blockonomi.com/","type":"article","description":"Binance and DWF Labs deny allegations of market manipulation reported by The Wall Street Journal","title":"Binance Co-Founder Yi He Responds to WSJ Report, Reaffirms Commitment to Market Surveillance - Blockonomi","content":["Binance, one of the world’s largest cryptocurrency exchanges, has found itself embroiled in a controversy following a report by The Wall Street Journal (WSJ) alleging that the company fired an investigator who uncovered evidence of market manipulation by its client, DWF Labs.","The report has reignited the debate surrounding market manipulation in the crypto industry and the role of market makers in ensuring fair and transparent trading practices.","According to the WSJ, Binance’s market-surveillance team, which was hired to identify signs of market manipulation and other prohibited activities, discovered that DWF Labs, a prominent market maker and investor in the crypto space, had engaged in pump-and-dump schemes, wash trading, and price manipulation of several tokens.","The alleged manipulative activities amounted to $300 million in wash trades in 2023 alone.","The investigators submitted a report detailing their findings, but Binance reportedly determined that there was insufficient evidence of market abuse by DWF Labs.","Interestingly, just a week after the report’s submission, the head of the investigations team was fired, raising questions about the exchange’s handling of the situation.","Both Binance co-founder Yi He and DWF Labs have vehemently denied the allegations. In an X (formerly Twitter) post,","#Binance #BNB #Bitcoin #BTC #Crypto People are inevitably influenced by their own culture, background, and biases. I am very grateful to the WSJ for their consistent and long-term devotion to Binance, which has greatly increased our exposure and saved us a lot of marketing…","— Yi He (@heyibinance) May 9, 2024","","He described the media report as an occurrence that “greatly increased our exposure and saved us a lot of marketing budget.”","She also criticized the media for being driven by emotions and biases rather than facts, while reaffirming Binance’s strict market surveillance program and its commitment to not tolerating market abuse.","Similarly, DWF Labs stated that the allegations were “unfounded and distort the facts,” emphasizing that the firm operates with the highest standards of integrity, transparency, and ethics.","DWF Labs CEO Andrei Grachev has previously denied accusations of market manipulation in a September 2023 interview with Blockbeats, stating, “We are not involved in any manipulation.”","The controversy surrounding DWF Labs is not an isolated incident in the cryptocurrency industry.","Market making, which involves ensuring token liquidity across exchanges and minimizing price volatility, has been mired in controversy, with numerous accusations of foul play directed at the firms involved.","Other prominent market makers, such as Wintermute, have also faced scrutiny over their practices, with a class-action lawsuit against defunct crypto lender Celsius alleging that Wintermute helped prop up the value of Celsius’ CEL token through wash trading.","This is coming at a time when regulators worldwide are closely monitoring the industry, and exchanges like Binance are under pressure to demonstrate their commitment to preventing market manipulation and protecting investors."],"create_date":"2024-05-10T08:45:16+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/floki-inu-floki-price-surge-fueled-by-token-burn-exchange-listings-more/#","web_url":"https://blockonomi.com/","type":"article","description":"Floki Inu (FLOKI) has witnessed a significant price surge and growing investor optimism, driven by a token burn proposal, a Binance Thailand listing, and favorable technical indicators","title":"Floki Inu (FLOKI) Price Surge: Fueled by Token Burn, Exchange Listings & More - Blockonomi","content":["Floki Inu (FLOKI), the dog-themed memecoin, has been making significant strides in the cryptocurrency market, with its price surging over 15% in the last 24 hours and crossing the key resistance level of $0.0001790.","One of the primary factors contributing to the bullish sentiment surrounding FLOKI is the recent proposal by the Floki DAO to burn 15 billion tokens, worth approximately $2.8 million.","This strategic move is expected to reduce the overall supply of FLOKI, potentially driving up its value in the long run.","The proposal has been well-received by the community, with many investors viewing it as a positive step towards the long-term growth and sustainability of the project.","NEW DAO PROPOSAL: BURN 15,246,000,000 $FLOKI TOKENS","A new Floki DAO proposal just went live on whether or not to burn 15,246,000,000 $FLOKI tokens.","Please read the proposal and vote here ????????????https://t.co/UVzQdYQUpu pic.twitter.com/j1mi6XrVZ0","— FLOKI (@RealFlokiInu) May 13, 2024","","FLOKI has also benefited from a recent listing on Binance Thailand. This listing provides exposure to the largest Web3 community and is expected to significantly increase the adoption and usage of FLOKI in the region.","Thailand has emerged as a leader in cryptocurrency adoption, with 12% of its population using crypto for daily transactions. The country ranks 10th on the 2023 Global Cryptocurrency Adoption Index, highlighting its importance in the global crypto ecosystem.","Binance Thailand has just listed $FLOKI! ????","Thailand, where #Floki enjoys immense popularity, boasts a significant crypto adoption rate. Approximately 12% of the population, or nearly 10 million people, own crypto in Thailand. This places Thailand 10th in Chainanalysis\u0027 \u00272023… pic.twitter.com/rsEnxHcgW8","— FLOKI (@RealFlokiInu) May 14, 2024","","From a technical perspective, FLOKI appears to be well-positioned for a potential breakout. Out of 26 technical indicators analyzed, 15 are signaling a buy call, while only one suggests a sell signal.","The remaining 10 indicators are neutral, indicating that the overall sentiment is skewed towards the bullish side. The trading volume has also displayed significant buying activity, spiking over 265.10% to $626.15 million in the last 24 hours.","Another positive sign for FLOKI is the smart recovery in weighted sentiment data, which suggests that demand for the cryptocurrency has increased across the market.","Price volatility has risen over 22% to 0.051, indicating heightened investor speculation and the potential for an upcoming bullish wave.","The futures open interest data also paints a bullish picture, with fresh long buildup by investors leading to a 52.38% surge to $17.16 million in the last 24 hours. The GIOM indicator reveals that around 84% of in-the-money holders at the current price level are in profit, while only 15% are looking to secure their gains, further confirming the uptrend ahead.","As FLOKI continues to gain traction and attract investor interest, it is crucial to keep an eye on the key support and resistance levels.","The immediate support levels for FLOKI are $0.0001950 and $0.0001870, while the key upside hurdle is around $0.0002120, followed by $0.0002230.","If FLOKI manages to break through these resistance levels, it could signal the beginning of a new bull run for the memecoin."],"create_date":"2024-05-15T08:59:07+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/consensys-seeks-court-ruling-to-protect-ether-and-metamask-from-sec-overreach/","web_url":"https://blockonomi.com/","type":"article","description":"Consensys, the company behind MetaMask, has filed a lawsuit against the U.S. Securities and Exchange Commission (SEC).","title":"Consensys Seeks Court Ruling to Protect Ether and MetaMask from SEC Overreach - Blockonomi","content":["Consensys, the company behind MetaMask, has filed a lawsuit against the U.S. Securities and Exchange Commission (SEC) in a bid to prevent the agency’s attempt to regulate Ether, the native cryptocurrency of the Ethereum network, as a security.","The company didn’t let the SEC have a chance to start the fight.","In a press release published on Thursday, Consensys claimed that the SEC is overstepping its authority by trying to regulate Ether as a security. The company believes regulatory overreach would stifle innovation and harm the US economy.","“Ethereum is a world-changing technology, and ether itself has the potential to be a significant driver of the U.S. economy of the future,” said Joe Lubin, Co-founder of Ethereum and Founder/CEO of Consensys. “Unlawful SEC regulation, however, threatens to jeopardize this potential and impedes the U.S.’s ability to use blockchain technology as the basis for countless new innovations and technologies – even as other nations race ahead.”","Table of Contents","According to Consensys, the SEC has historically considered Ether a commodity, not a security. Putting Ether under securities regulation could ultimately hurt millions of Ether holders, cripple Ethereum’s use in the US, and make it difficult for US developers to build on Ethereum.","The company argued that the SEC has no legal right to regulate either Ether itself or user-controlled software interfaces built on Ethereum, like MetaMask.","With the latest legal action against the SEC, Consensys seeks a threefold court ruling. First, they aim to secure a declaration that Ether is not a security.","Second, they hope the ruling will prevent the SEC from taking legal action against Consensys based on these arguments. Finally, Consensys seeks a court decision clarifying that its MetaMask wallet does not function as a securities broker.","The lawsuit, filed in the U.S. District Court for the Northern District of Texas, comes in response to the SEC’s Wells Notice sent to Consensys earlier this month. A Wells Notice is typically a formal notification informing the recipients that the agency plans to bring civil enforcement actions against them for potential violations of securities laws.","Before Consensys, the SEC also sent a Wells Notice to Uniswap Labs, the developer behind the major decentralized exchange (DEX) Uniswap. Instead of waiting for the SEC to take action, Consensys initiated the legal battle.","Securities classification and the Howey test are mainly the SEC’s core arguments in precedent cases. Therefore, even though the Uniswap team hasn’t specified the SEC’s reason for targeting Uniswap, it’s highly possible that the agency still relies on the classification method.","Uniswap’s Chief Legal Officer Marvin Ammori said the SEC wants to pursue Uniswap’s responsibility for allegedly being an unregistered stock exchange and brokerage.","Both Uniswap and Consensys vow to defend their rights. Uniswap claimed that in the US, there is still no specific law for the cryptocurrency sector, no case law on crypto exchanges or brokers being declared as processing securities transactions, and its UNI token does not meet the criteria of the Howey Test to be listed as a security.","Earlier today, Reuters reported that the SEC will likely reject applications to launch spot Ethereum exchange-traded funds (ETFs). Sources familiar with the matter say ETF issuers’ meetings with the SEC lacked expected detail on the products, unlike the in-depth discussions that preceded the approval of several spot Bitcoin ETFs in January.","Ten issuers, including BlackRock, Grayscale, Bitwise, Fidelity, VanEck, and ARK Investment Management, have filed with the SEC to list ETFs tracking Ethereum’s spot price. The SEC is expected to decide on VanEck’s and ARK’s filings by May 23-24, respectively.","Unlike spot Bitcoin ETFs, the current situation around spot Ethereum ETF progress has shown less optimism. Analysts suggest that if the SEC rejects these ETF filings, it may face a new legal battle from the ETF issuers."],"create_date":"2024-04-29T09:00:18+00:00","tag":"","author":"Nicholas Say"}
{"url":"https://blockonomi.com/sec-strikes-again-robinhood-crypto-receives-sec-wells-notice-this-time/#","web_url":"https://blockonomi.com/","type":"article","description":"Robinhood Crypto received a Wells notice from the SEC, indicating a potential enforcement action related to alleged securities violations","title":"SEC Strikes Again! Robinhood Crypto Receives SEC Wells Notice This Time - Blockonomi","content":["Robinhood Markets, the popular retail trading platform, disclosed on Monday that its cryptocurrency arm, Robinhood Crypto, received a Wells notice from the U.S. Securities and Exchange Commission (SEC) on May 4, 2024.","The notice indicates that the SEC staff has made a preliminary determination to recommend an enforcement action against Robinhood Crypto, alleging violations of Sections 15(a) and 17A of the Securities Exchange Act of 1934, which pertain to registration as a securities broker and transfer agent.","The potential enforcement action comes amidst a broader crackdown by the SEC on the cryptocurrency industry. The regulator has taken a firm stance, arguing that most cryptocurrency tokens are securities and subject to its registration rules. This position has been met with opposition from crypto firms, who accuse the SEC of overreach.","Over the last three years, we’ve reached a state of regulatory onslaught that is harmful to American companies and consumers. The SEC’s continued attack on crypto, coupled with recent rule proposals like the one related to predictive data analytics, mark yet another improper…","— Vlad Tenev (@vladtenev) May 6, 2024","","In response to the Wells notice, Robinhood’s Chief Legal, Compliance, and Corporate Affairs Officer, Dan Gallagher, expressed disappointment, stating that the company had made “good faith attempts” to work with the SEC for regulatory clarity.","Gallagher, a former SEC commissioner himself, firmly believes that the assets listed on Robinhood’s platform are not securities and looks forward to engaging with the SEC to make their case.","The potential action from the SEC could have significant consequences for Robinhood Crypto. It may include a civil injunctive action, public administrative proceeding, and/or a cease-and-desist order.","The remedies sought by the SEC could encompass an injunction, a cease-and-desist order, disgorgement, pre-judgment interest, civil money penalties, and censure, as well as revocation and limitations on activities.","This development comes on the heels of similar actions taken by the SEC against other prominent players in the cryptocurrency space.","In June 2023, the agency filed lawsuits against Coinbase and Binance, the two largest cryptocurrency exchanges, alleging that they were operating unregistered exchanges by allowing the sale of certain crypto tokens the SEC considers to be investment securities.","In response to these lawsuits, Robinhood took preemptive measures and ended support for Cardano (ADA), Polygon (MATIC), and Solana (SOL) on June 27, 2023. These three tokens were specifically named as securities in the SEC’s lawsuits against Binance and Coinbase.","Despite the legal challenges, Robinhood’s stock price showed resilience, closing up nearly 2% on Monday after paring earlier losses.","Mizuho analyst Dan Dolev noted that the concerns regarding the Wells notice might be overblown, given that Robinhood earns a relatively small portion of its total revenue from crypto trading compared to more crypto-focused firms. In the fourth quarter of 2023, only 9.13% of Robinhood’s total net revenue came from crypto-related transaction fees.","The company has expressed its willingness to contest the matter in court if necessary, setting the stage for another legal battle between a crypto firm and the anti-crypto SEC."],"create_date":"2024-05-07T09:40:18+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/coinbase-suffers-system-wide-outage-assures-users-funds-are-safe/","web_url":"https://blockonomi.com/","type":"article","description":"Coinbase experienced a significant system-wide outage on May 14, 2024, affecting both its desktop and mobile users.","title":"Coinbase Suffers System-Wide Outage, Assures Users\u0027 Funds Are Safe - Blockonomi","content":["Coinbase, one of the largest cryptocurrency exchanges in the United States, experienced a significant system-wide outage on May 14, 2024, leaving users unable to access their accounts or execute trades.","The outage, which began at approximately 00:25 a.m. EST, affected both desktop and mobile users, causing concern among the exchange’s extensive user base.","In response to the incident, Coinbase quickly acknowledged the issue through its official support channels on X (formerly Twitter). The exchange reassured users that their funds were secure and that a team was actively investigating the problem and working on a solution.","We\u0027re seeing some services recover. We know customers may still be encountering connectivity problems and we appreciate your patience while we work to correct this. We\u0027re still monitoring this closely. https://t.co/AAzEMPaJGL","— Coinbase Support (@CoinbaseSupport) May 14, 2024","","The Coinbase status page provided updates on the situation, indicating that some services were gradually recovering, although users might still encounter connectivity issues.","This is not the first time Coinbase has faced technical difficulties during periods of high market activity. Earlier this year, the exchange crashed amid a surge in transactions as Bitcoin rallied to all-time highs.","Such outages have become increasingly common for Coinbase during times of peak trading volume, often coinciding with significant price movements in the cryptocurrency market.","Interestingly, the crypto community has come to view these outages as a potential indicator of a bull market.","The reasoning behind this sentiment is that increased trading activity, often associated with bullish market conditions, can overwhelm the exchange’s servers, leading to temporary disruptions in service.","Some traders even took to social media to express their belief that the recent outage could signal a positive trend for the market.","Coinbase down.","We are so fucking back. pic.twitter.com/sZaqdwELlA","— Castillo Trading (@CastilloTrading) May 14, 2024","","However, it is essential to note that the current outage does not appear to be directly linked to market volatility.","At the time of the incident, both Bitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, showed minimal price movements. Bitcoin gained around 1% in the 24 hours following the outage, while Ethereum remained relatively stable, suggesting that the disruption was likely caused by internal technical issues rather than a sudden influx of trading activity.","While Coinbase has managed to restore some of its services following the two-hour outage, the incident serves as a reminder of the risks associated with relying on centralized platforms for cryptocurrency trading.","Decentralized exchanges, which operate on blockchain technology and do not rely on a single point of failure, offer an alternative solution, albeit with their own set of challenges and limitations."],"create_date":"2024-05-14T08:40:34+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/canadian-crypto-king-aiden-pleterski-arrested-for-30-million-ponzi-scheme/#","web_url":"https://blockonomi.com/","type":"article","description":"Aiden Pleterski, a 25-year-old self-proclaimed \"Crypto King\" from Ontario, Canada, and his associate have been arrested and charged with fraud for allegedly running a $30 million Ponzi scheme","title":"Canadian \u0027Crypto King\u0027 Aiden Pleterski Arrested for $30 Million Ponzi Scheme - Blockonomi","content":["Aiden Pleterski, a 25-year-old self-proclaimed “Crypto King” from Ontario, Canada, and his associate Colin Murphy have been arrested and charged with fraud for their alleged involvement in a $30 million Ponzi scheme.","The arrests come after a 16-month investigation by Canadian authorities, dubbed “Project Swan,” into the alleged investment fraud.","According to court documents and local media reports, between 2021 and 2022, Pleterski and his company, AP Private Equity Limited, convinced approximately 160 investors to hand over around $40 million CAD ($30 million USD) to invest on their behalf in the crypto and foreign exchange markets. Pleterski promised investors high returns, with some taking out loans to invest in the scheme.","However, a bankruptcy trustee overseeing Pleterski’s case concluded that the self-proclaimed “Crypto King” only invested 2% of the funds he received.","Instead, Pleterski allegedly spent at least $16 million on a lavish lifestyle, purchasing luxury cars, traveling internationally, and renting an $8.4 million lakefront mansion for $45,000 per month.","During the bankruptcy process, two McLarens, two BMWs, and a Lamborghini were seized from Pleterski.","The young entrepreneur, who is also a small-time livestreamer, documented his extravagant lifestyle on social media, posting videos of his vacations, driving rented sports cars, and even detailing his expenditures on Lego sets, which he estimated to be around $150,000 since 2021.","Pleterski was allegedly kidnapped, beaten, and tortured by five of his alleged victims in December 2022.","The perpetrators held him for three days, demanding a $3 million ransom from his landlord-turned-mentor. Pleterski was eventually released, but a video of him apologizing to investors, appearing bruised and swollen, was posted on social media. His lawyer later claimed that the apology was coerced.","Pleterski was released on $100,000 bail, signed for by his parents. As part of his bail conditions, he must surrender his passport, refrain from posting about financial matters on social media, and not buy or trade cryptocurrencies.","The case has garnered significant media attention in Canada, with the lavish lifestyle and alleged criminal activities of the “Crypto King” capturing the public’s imagination.","As the legal proceedings unfold, investors who fell victim to the alleged Ponzi scheme hope to recover some of their lost funds, while authorities work to bring those responsible to justice."],"create_date":"2024-05-16T08:13:32+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/tether-cracks-down-on-phishing-5-2-million-in-usdt-frozen/#","web_url":"https://blockonomi.com/","type":"article","description":"Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to scams.","title":"Tether Cracks Down on Phishing: $5.2 Million in USDT Frozen - Blockonomi","content":["Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to phishing scams.","The move comes amid a debate between Tether and Ripple.","The frozen funds were located in 12 Ethereum wallets that were flagged as “USDT Banned Address,” according to on-chain analytics firm SlowMist. As reported, the flagged wallets were being used to launder money obtained from phishing scams.","Table of Contents","It’s not the first time Tether has demonstrated proactive steps to ensure regulatory compliance and safeguard users against fraud. The firm has consistently performed similar acts over the past few years. It’s estimated that Tether has frozen over $1 billion in assets, targeting a wide range of illicit actions, including hacks, exploits, and scams.","In January 2022, Tether made headlines by blacklisting three Ethereum addresses holding over $150 million worth of USDT. Later that year, in October, Tether froze $8.2 million in USDT on Ethereum and blacklisted 215 Ethereum-based USDT addresses. By the end of 2022, Tether’s asset-freezing efforts amounted to a staggering $360 million.","Last October, the firm once again demonstrated its commitment to combating illicit activities by freezing $817,000 in USDT linked to terrorist activities in Ukraine and Israel. Just a month later, Tether intervened to freeze $225 million in USDT connected to romance scammers.","Also, over the past year, Tether has collaborated with 24 law enforcement agencies across more than 40 countries. During this period, they have successfully processed 198 requests to block wallets associated with illicit activities.","In addition to addressing requests to freeze funds, Tether provides secondary market controls that enable them to freeze any transactions linked to individuals and entities listed on the United States Office of Foreign Assets Control (OFAC) Specially Designated Nationals list.","Earlier this month, Tether announced its partnership with leading blockchain analysis firm Chainalysis to create a custom set of tools to monitor the secondary market.","According to the US Department of Justice (DOJ), cryptocurrency is the preferred payment method for ransomware and other digital extortion activities.","US Senator Elizabeth Warren has recently called on US law enforcement agencies to crack down on crypto payments for child sexual abuse material (CSAM). According to Chainalysis, cryptocurrency has become the key payment method for CSAM content.","However, while Tether has shown efforts to comply with regulatory requirements, the company’s actions have sparked controversies. Some argue that the ability of stablecoin issuers to freeze funds for anti-fraud purposes somewhat contrasts with the neutralized nature of cryptocurrency.","And despite Tether’s ongoing work with regulators, Brad Garlinghouse, CEO of Ripple, doesn’t think it’s enough to help the company escape the US government’s scrutiny. Speaking in a recent podcast, Garlinghouse said US lawmakers are taking measures against the world’s largest stablecoin company.","According to him, the crackdown could bring serious harm to the entire cryptocurrency market. He linked it to one of the worst scenarios – the black swan. He claimed that the US government placing Tether in its sights could be the main factor leading to this event.","In response, Tether’s CEO Paolo Ardoino countered that Ripple was spreading FUD about USDT to create opportunities for the stablecoin it is building. In April, Ripple announced plans to issue new stablecoins.","Its coming product, however, has already been targeted by the US Securities and Exchange Commission (SEC). The SEC suggested in a recent filing that Ripple’s stablecoin is an unregistered security.","Garlinghouse’s statement was made amid concerns that Tether is being used by terrorist organizations and embargoed countries like Russia to circumvent US economic sanctions.","US Senate Banking Committee, Adewale Adeyemo, US Deputy Secretary of the Treasury, previously noted that Russia has switched to using payment alternatives, like USDT, to circumvent sanctions."],"create_date":"2024-05-16T07:23:20+00:00","tag":"","author":"Nicholas Say"}
{"url":"https://blockonomi.com/sonne-finance-suffers-20-million-exploit-token-plummets-60/#","web_url":"https://blockonomi.com/","type":"article","description":"Sonne Finance, a decentralized lending protocol, has suffered a $20 million exploit due to a vulnerability in its Compound v2 forks, leading to a 60% drop in its native token\u0027s value","title":"Sonne Finance Suffers $20 Million Exploit, Token Plummets 60% - Blockonomi","content":["Sonne Finance, a decentralized lending protocol built on the Optimism and Base blockchains, has fallen victim to a $20 million exploit, causing its native SONNE token to plummet by 60%.","The attack, which occurred on Wednesday, took advantage of a vulnerability in the protocol’s Compound v2 forks, enabling the hacker to manipulate markets and steal various tokens, including ether, velo, and stablecoins.","The attacker employed a “donation” attack, a method that involves manipulating the exchange rate between two tokens by donating large amounts of cryptocurrency.","This effectively tricked the platform into believing it had more collateral than was actually available, allowing the hacker to siphon off funds.","Blockchain data reveals that the attacker managed to transfer millions of VELO, ether, and USD Coin (USDC) following the manipulation.","They later converted $8 million of the stolen funds into bitcoin and ether, transferring them to a new wallet address in the early hours of the morning.","#PeckShieldAlert @SonneFinance exploiter-labeled address has transferred $7.8M worth of cryptos, including 100 $WBTC & 556.1 $ETH, to a new address 0x6277…4c07 #Optimism pic.twitter.com/g4oiP5akr4","— PeckShieldAlert (@PeckShieldAlert) May 15, 2024","","The exploit occurred shortly after Sonne Finance added token markets for Velodrome Finance’s VELO, following a recent community proposal.","The attacker took advantage of a two-day timelock to execute four transactions, creating markets and adding collateral factors. Timelocks are smart contracts that execute transactions at a specific time, in this case, two days after being locked.","In response to the attack, Sonne Finance’s developers were able to mitigate the damage and pause all markets on the Optimism blockchain.","However, the protocol’s markets on the Base blockchain remained operational, as the exploit only affected the Optimism version of the platform.","The incident had a significant impact on the value of Sonne Finance’s native token, SONNE, which plummeted by 60% to 2.5 cents, its lowest level in over a year.","This drop in price cut the token’s market cap to $20 million, despite the developers’ efforts to prevent an additional $6.5 million from being stolen once the attack was discovered.","Sonne Finance has stated that they are working on retrieving the stolen funds and have offered a bounty to the hacker in exchange for their return.","However, the attacker has already moved a large portion of the loot, approximately $7.8 million worth of cryptocurrencies, to a new wallet address, suggesting that they may not be interested in negotiating a return of the funds.","The exploit has raised questions about the security of decentralized lending protocols and the risks associated with using forked versions of existing platforms.","Some members of the crypto community have criticized Sonne Finance for using Compound v2 despite being aware of its known vulnerabilities, with one individual even suggesting that the exploit may have been a premeditated backdoor."],"create_date":"2024-05-16T08:35:10+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/floki-inu-floki-price-surge-fueled-by-token-burn-exchange-listings-more/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Floki Inu (FLOKI) has witnessed a significant price surge and growing investor optimism, driven by a token burn proposal, a Binance Thailand listing, and favorable technical indicators","title":"Floki Inu (FLOKI) Price Surge: Fueled by Token Burn, Exchange Listings & More - Blockonomi","content":["Floki Inu (FLOKI), the dog-themed memecoin, has been making significant strides in the cryptocurrency market, with its price surging over 15% in the last 24 hours and crossing the key resistance level of $0.0001790.","One of the primary factors contributing to the bullish sentiment surrounding FLOKI is the recent proposal by the Floki DAO to burn 15 billion tokens, worth approximately $2.8 million.","This strategic move is expected to reduce the overall supply of FLOKI, potentially driving up its value in the long run.","The proposal has been well-received by the community, with many investors viewing it as a positive step towards the long-term growth and sustainability of the project.","NEW DAO PROPOSAL: BURN 15,246,000,000 $FLOKI TOKENS","A new Floki DAO proposal just went live on whether or not to burn 15,246,000,000 $FLOKI tokens.","Please read the proposal and vote here ????????????https://t.co/UVzQdYQUpu pic.twitter.com/j1mi6XrVZ0","— FLOKI (@RealFlokiInu) May 13, 2024","","FLOKI has also benefited from a recent listing on Binance Thailand. This listing provides exposure to the largest Web3 community and is expected to significantly increase the adoption and usage of FLOKI in the region.","Thailand has emerged as a leader in cryptocurrency adoption, with 12% of its population using crypto for daily transactions. The country ranks 10th on the 2023 Global Cryptocurrency Adoption Index, highlighting its importance in the global crypto ecosystem.","Binance Thailand has just listed $FLOKI! ????","Thailand, where #Floki enjoys immense popularity, boasts a significant crypto adoption rate. Approximately 12% of the population, or nearly 10 million people, own crypto in Thailand. This places Thailand 10th in Chainanalysis\u0027 \u00272023… pic.twitter.com/rsEnxHcgW8","— FLOKI (@RealFlokiInu) May 14, 2024","","From a technical perspective, FLOKI appears to be well-positioned for a potential breakout. Out of 26 technical indicators analyzed, 15 are signaling a buy call, while only one suggests a sell signal.","The remaining 10 indicators are neutral, indicating that the overall sentiment is skewed towards the bullish side. The trading volume has also displayed significant buying activity, spiking over 265.10% to $626.15 million in the last 24 hours.","Another positive sign for FLOKI is the smart recovery in weighted sentiment data, which suggests that demand for the cryptocurrency has increased across the market.","Price volatility has risen over 22% to 0.051, indicating heightened investor speculation and the potential for an upcoming bullish wave.","The futures open interest data also paints a bullish picture, with fresh long buildup by investors leading to a 52.38% surge to $17.16 million in the last 24 hours. The GIOM indicator reveals that around 84% of in-the-money holders at the current price level are in profit, while only 15% are looking to secure their gains, further confirming the uptrend ahead.","As FLOKI continues to gain traction and attract investor interest, it is crucial to keep an eye on the key support and resistance levels.","The immediate support levels for FLOKI are $0.0001950 and $0.0001870, while the key upside hurdle is around $0.0002120, followed by $0.0002230.","If FLOKI manages to break through these resistance levels, it could signal the beginning of a new bull run for the memecoin."],"create_date":"2024-05-15T08:59:07+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/tether-cracks-down-on-phishing-5-2-million-in-usdt-frozen/","web_url":"https://blockonomi.com/","type":"article","description":"Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to scams.","title":"Tether Cracks Down on Phishing: $5.2 Million in USDT Frozen - Blockonomi","content":["Tether (USDT), the world’s leading stablecoin issuer, recently made a decision to freeze $5.2 million worth of USDT, which was tied to phishing scams.","The move comes amid a debate between Tether and Ripple.","The frozen funds were located in 12 Ethereum wallets that were flagged as “USDT Banned Address,” according to on-chain analytics firm SlowMist. As reported, the flagged wallets were being used to launder money obtained from phishing scams.","Table of Contents","It’s not the first time Tether has demonstrated proactive steps to ensure regulatory compliance and safeguard users against fraud. The firm has consistently performed similar acts over the past few years. It’s estimated that Tether has frozen over $1 billion in assets, targeting a wide range of illicit actions, including hacks, exploits, and scams.","In January 2022, Tether made headlines by blacklisting three Ethereum addresses holding over $150 million worth of USDT. Later that year, in October, Tether froze $8.2 million in USDT on Ethereum and blacklisted 215 Ethereum-based USDT addresses. By the end of 2022, Tether’s asset-freezing efforts amounted to a staggering $360 million.","Last October, the firm once again demonstrated its commitment to combating illicit activities by freezing $817,000 in USDT linked to terrorist activities in Ukraine and Israel. Just a month later, Tether intervened to freeze $225 million in USDT connected to romance scammers.","Also, over the past year, Tether has collaborated with 24 law enforcement agencies across more than 40 countries. During this period, they have successfully processed 198 requests to block wallets associated with illicit activities.","In addition to addressing requests to freeze funds, Tether provides secondary market controls that enable them to freeze any transactions linked to individuals and entities listed on the United States Office of Foreign Assets Control (OFAC) Specially Designated Nationals list.","Earlier this month, Tether announced its partnership with leading blockchain analysis firm Chainalysis to create a custom set of tools to monitor the secondary market.","According to the US Department of Justice (DOJ), cryptocurrency is the preferred payment method for ransomware and other digital extortion activities.","US Senator Elizabeth Warren has recently called on US law enforcement agencies to crack down on crypto payments for child sexual abuse material (CSAM). According to Chainalysis, cryptocurrency has become the key payment method for CSAM content.","However, while Tether has shown efforts to comply with regulatory requirements, the company’s actions have sparked controversies. Some argue that the ability of stablecoin issuers to freeze funds for anti-fraud purposes somewhat contrasts with the neutralized nature of cryptocurrency.","And despite Tether’s ongoing work with regulators, Brad Garlinghouse, CEO of Ripple, doesn’t think it’s enough to help the company escape the US government’s scrutiny. Speaking in a recent podcast, Garlinghouse said US lawmakers are taking measures against the world’s largest stablecoin company.","According to him, the crackdown could bring serious harm to the entire cryptocurrency market. He linked it to one of the worst scenarios – the black swan. He claimed that the US government placing Tether in its sights could be the main factor leading to this event.","In response, Tether’s CEO Paolo Ardoino countered that Ripple was spreading FUD about USDT to create opportunities for the stablecoin it is building. In April, Ripple announced plans to issue new stablecoins.","Its coming product, however, has already been targeted by the US Securities and Exchange Commission (SEC). The SEC suggested in a recent filing that Ripple’s stablecoin is an unregistered security.","Garlinghouse’s statement was made amid concerns that Tether is being used by terrorist organizations and embargoed countries like Russia to circumvent US economic sanctions.","US Senate Banking Committee, Adewale Adeyemo, US Deputy Secretary of the Treasury, previously noted that Russia has switched to using payment alternatives, like USDT, to circumvent sanctions."],"create_date":"2024-05-16T07:23:20+00:00","tag":"","author":"Nicholas Say"}
{"url":"https://blockonomi.com/vanguards-new-ceo-salim-ramji-maintains-stance-against-bitcoin-etf/#","web_url":"https://blockonomi.com/","type":"article","description":"Incoming Vanguard CEO Salim Ramji has affirmed that he will not reverse the company\u0027s decision to refrain from launching a spot Bitcoin ETF","title":"Vanguard\u0027s New CEO Salim Ramji Maintains Stance Against Bitcoin ETF - Blockonomi","content":["Salim Ramji, the incoming CEO of Vanguard and former head of BlackRock’s global ETF business, has made it clear that he will not reverse the company’s decision to refrain from launching a spot Bitcoin ETF.","In a recent interview with Barron’s, Ramji emphasized the importance of consistency in Vanguard’s investment philosophy and product offerings, stating that the firm’s current stance on crypto-related investment products aligns with its values.","Vanguard, one of the world’s largest asset management firms with $8.6 trillion in assets under management, has faced criticism from some clients for not offering access to spot Bitcoin ETFs, which have gained popularity among rival investment firms.","However, Ramji’s comments suggest that the company will maintain its cautious approach to the cryptocurrency market, despite his previous experience overseeing the launch of BlackRock’s iShares Bitcoin Trust (IBIT).","During his tenure at BlackRock, Ramji played a key role in the development and approval of IBIT, which has since amassed an impressive $18 billion in assets under management.","His move to Vanguard had sparked speculation among industry watchers about potential changes in the firm’s approach to Bitcoin and other digital assets.","However, Ramji’s recent statements indicate that he supports the views expressed by Vanguard’s Chief Investment Officer, Greg Davis, regarding the consistency of the company’s investment philosophy.","This philosophy, which prioritizes long-term, low-cost investing, has led Vanguard to view cryptocurrencies as speculative assets that do not align with its core principles.","Vanguard’s outgoing CEO, Tim Buckley, has also been vocal about his skepticism regarding the suitability of Bitcoin ETFs for long-term retirement portfolios.","In March, Buckley stated that he did not believe a Bitcoin ETF belongs in the portfolio of someone saving for retirement, as he considers crypto to be a speculative asset.","Despite the growing popularity of spot Bitcoin ETFs among rival investment firms, such as Fidelity and BlackRock, Vanguard has chosen to prioritize its established investment philosophy over the potential short-term gains associated with offering crypto-related products.","This decision has led to some backlash from clients, with a number of Vanguard customers threatening to close their accounts in January due to the firm’s decision to block access to spot Bitcoin ETFs.","While Ramji’s appointment as CEO had initially raised questions about the potential for a shift in Vanguard’s stance on Bitcoin, analysts now believe that a significant change in the company’s approach is unlikely.","Bloomberg ETF analyst James Seyffart, for example, has expressed doubt that Ramji’s leadership will lead to the introduction of a Vanguard spot Bitcoin ETF."],"create_date":"2024-05-16T08:43:49+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/canadian-crypto-king-aiden-pleterski-arrested-for-30-million-ponzi-scheme/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Aiden Pleterski, a 25-year-old self-proclaimed \"Crypto King\" from Ontario, Canada, and his associate have been arrested and charged with fraud for allegedly running a $30 million Ponzi scheme","title":"Canadian \u0027Crypto King\u0027 Aiden Pleterski Arrested for $30 Million Ponzi Scheme - Blockonomi","content":["Aiden Pleterski, a 25-year-old self-proclaimed “Crypto King” from Ontario, Canada, and his associate Colin Murphy have been arrested and charged with fraud for their alleged involvement in a $30 million Ponzi scheme.","The arrests come after a 16-month investigation by Canadian authorities, dubbed “Project Swan,” into the alleged investment fraud.","According to court documents and local media reports, between 2021 and 2022, Pleterski and his company, AP Private Equity Limited, convinced approximately 160 investors to hand over around $40 million CAD ($30 million USD) to invest on their behalf in the crypto and foreign exchange markets. Pleterski promised investors high returns, with some taking out loans to invest in the scheme.","However, a bankruptcy trustee overseeing Pleterski’s case concluded that the self-proclaimed “Crypto King” only invested 2% of the funds he received.","Instead, Pleterski allegedly spent at least $16 million on a lavish lifestyle, purchasing luxury cars, traveling internationally, and renting an $8.4 million lakefront mansion for $45,000 per month.","During the bankruptcy process, two McLarens, two BMWs, and a Lamborghini were seized from Pleterski.","The young entrepreneur, who is also a small-time livestreamer, documented his extravagant lifestyle on social media, posting videos of his vacations, driving rented sports cars, and even detailing his expenditures on Lego sets, which he estimated to be around $150,000 since 2021.","Pleterski was allegedly kidnapped, beaten, and tortured by five of his alleged victims in December 2022.","The perpetrators held him for three days, demanding a $3 million ransom from his landlord-turned-mentor. Pleterski was eventually released, but a video of him apologizing to investors, appearing bruised and swollen, was posted on social media. His lawyer later claimed that the apology was coerced.","Pleterski was released on $100,000 bail, signed for by his parents. As part of his bail conditions, he must surrender his passport, refrain from posting about financial matters on social media, and not buy or trade cryptocurrencies.","The case has garnered significant media attention in Canada, with the lavish lifestyle and alleged criminal activities of the “Crypto King” capturing the public’s imagination.","As the legal proceedings unfold, investors who fell victim to the alleged Ponzi scheme hope to recover some of their lost funds, while authorities work to bring those responsible to justice."],"create_date":"2024-05-16T08:13:32+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/pepe-coin-pepe-reaches-new-all-time-high-amid-meme-coin-surge/#respond","web_url":"https://blockonomi.com/","type":"article","description":"Meme coins, led by Pepe coin (PEPE), have emerged as top performers in the cryptocurrency market, attracting significant attention from both retail investors and \"smart money\" traders","title":"Pepe Coin (PEPE) Reaches New All-Time High Amid Meme Coin Surge - Blockonomi","content":["Amidst a recent surge in the cryptocurrency market, meme coins have emerged as some of the best performers among the top 100 digital assets by market capitalization.","Leading the pack is Pepe coin (PEPE), which has recently hit a new all-time high (ATH), drawing the attention of both retail investors and seasoned traders known as “smart money.”","On-chain data reveals that smart money addresses have been actively trading PEPE, with a staggering 250.5 billion PEPE tokens moved in the past 24 hours.","This increased activity has been accompanied by a significant price rally, with PEPE surging nearly 20% at press time. The token’s 24-hour trading volume has also skyrocketed by 280.38% to $2.11 billion, further indicating strong bullish sentiment.","Technical indicators suggest that PEPE’s upward momentum may continue, as the price remains above key support levels such as the 100-day Simple Moving Average (SMA) and the trendline.","The Relative Strength Index (RSI), Moving Average Convergence Divergence (MACD), and Alligator indicators all point towards a potentially sustained uptrend.","Some analysts caution that a correction may be on the horizon, as the RSI currently hovers around 70, signaling overbought conditions.","PEPE is not the only meme coin enjoying success in the current market environment. Other notable performers include Shiba Inu (SHIB), Floki (FLOKI), and Bonk (BONK), all of which have demonstrated significant growth over the past 24 hours.","SHIB, in particular, has seen a 7.4% increase, while FLOKI and BONK have gained 9.8% and 6.7%, respectively. Even Dogecoin (DOGE), the largest meme coin by market cap and the only “dog coin” in the top 10 cryptocurrencies, has experienced a 5.6% surge, pushing its capitalization above $21 billion.","The success of meme coins comes amid a broader recovery in the crypto market, with Bitcoin (BTC) rising by 2.7% and the overall market adding 1.7% overnight.","Altcoin segments associated with meme coins, such as cat-themed and dog-themed tokens, have also shown impressive growth rates, with cat-themed coins adding 14.5% in the past 24 hours."],"create_date":"2024-05-14T08:02:24+00:00","tag":"","author":"Oliver Dale"}
{"url":"https://blockonomi.com/shiba-inu-shib-price-surges-as-shibaswap-launches-on-shibarium/","web_url":"https://blockonomi.com/","type":"article","description":"Shiba Inu (SHIB) surges 8% as ShibaSwap\u0027s migration to Shibarium fuels ecosystem growth, increases burn rate, and attracts developers.","title":"Shiba Inu (SHIB) Price Surges as ShibaSwap Launches on Shibarium - Blockonomi","content":["Shiba Inu (SHIB), the popular meme-inspired cryptocurrency, has experienced a surge in price, soaring by more than 8% as the Shiba Inu ecosystem celebrates a major milestone.","The excitement surrounding the project stems from the announcement that ShibaSwap, the decentralized exchange (DEX) associated with Shiba Inu, is now hosted on Shibarium, the project’s layer-2 scaling solution.","The transition of ShibaSwap from Ethereum to Shibarium marks an important development for the Shiba Inu ecosystem.","With the DEX now operating on Shibarium, project innovators have a ready marketplace to host their projects, potentially encouraging an influx of developers into the ecosystem. This move is expected to further strengthen the already vibrant Shiba Inu community.","???? #ShibArmy the wait is finally over — ShibaSwap is coming home to Shibarium!","ShibaSwap is more than just an exchange; it\u0027s where our community’s spirit meets innovation, where your community tokens not only exist but thrive pic.twitter.com/fVGEZjynIJ","— Shib (@Shibtoken) May 15, 2024","","One of the key benefits of ShibaSwap’s migration to Shibarium is the potential impact on the total transaction count on the L2 platform.","The daily transaction count on Shibarium has flattened out since at least April 20, but with more swaps taking place on the platform, this metric is likely to revive.","An increase in transactions could also contribute to the growth in the total number of SHIB tokens sent to burn addresses, effectively reducing the token’s circulating supply.","The Shiba Inu price revival can also be attributed to the realization of the impact of the DEX on staking within the Shibarium ecosystem.","As more users engage in staking and provide liquidity, the circulating supply of SHIB may be better controlled, potentially influencing the token’s price valuation over time.","The ShibaSwap upgrade brings a host of new features to the platform, including a new dashboard, improved user experience, discovery charts for new and trending tokens, and a streamlined onboarding process for new tokens on the DEX.","These enhancements are expected to attract more users and developers to the Shiba Inu ecosystem, further driving its growth and adoption.","Currently, the price of Shiba Inu stands at $0.00002549, having surpassed the $0.000023 resistance point that had been a crucial barrier for over a month.","With this breakthrough, the token may continue its upward trajectory and potentially reclaim the $0.00003 mark. While the token’s future outlook is supported by a confluence of fundamentals, the launch of ShibaSwap on Shibarium is likely to play a significant role in shaping its trajectory."],"create_date":"2024-05-16T11:28:18+00:00","tag":"","author":"Oliver Dale"}
