{"url":"https://decrypt.co/25472/ellipal-titan-review-beginner-friendly-security/","web_url":"https://decrypt.co/","type":"article","description":"The ELLIPAL Titan combines an unusual smartphone-style design with air-gapped security and a robust build. However, at $169, it\u0027s a pricey option.","title":"ELLIPAL Titan review: Beginner-friendly security - Decrypt","content":["In the last five years, cryptocurrency hardware wallets have gone from being an obscure way to securely manage digital assets, to a popular tool used by even inexperienced crypto investors.","With an explosion in the number and variety of different digital assets available, the number of hardware wallets on the market has surged; each with their own unique feature set.","The ELLIPAL Titan is just one of a number of options in a crowded field of hardware wallets. First released in 2018 and priced at $169, it\u0027s heftier than many of its USB stick-sized rivals, with a bulky build that\u0027s reminiscent of a smartphone. It\u0027s also completely air-gapped for extra security, with no wireless connectivity.","Does the ELLIPAL Titan stack up against its sleeker, more modern rivals? We go hands-on to find out.","The ELLIPAL Titan resembles a small, robust smartphone, with an aluminum alloy frame that measures a sizable 118 x 66 x 9.7mm. The wallet\u0027s completely sealed, making it tamper-resistant; anyone who attempts to disassemble and reassemble the device will leave obvious damage. Its sealed design also makes the ELLIPAL Titan one of the few dust and water-resistant hardware wallets available.","The front of the device is dominated by a 4-inch touchscreen display, while the rear adorned with a textured metal rear panel and features a slightly protruding 5-megapixel camera. There is only one button to speak of—a power button located on the right side of the device.","The ELLIPAL Titan comes in a flip box that lacks the security seal or holographic sticker some other hardware wallet manufacturers package their products with.","Inside, you will find the ELLIPAL Titan device itself, along with a flat micro-USB charging cable, a security adapter used for updating and charging the device, and several stickers.","You also get a quick start guide, thank you note and a card used for storing your 12-word mnemonic recovery phrase.","Initializing the ELLIPAL Titan is a fairly painless process, and should only take a few minutes for most people. You\u0027ll need your smartphone nearby to complete the process.","After selecting your language from the four available options, the ELLIPAL Titan will ask you to download the associated ELLIPAL app. You\u0027ll then need to create an account on the device by selecting an account name and a password, following which the ELLIPAL Titan will display your 12-word mnemonic recovery phrase. This needs to be stored in a safe place and confirmed on the device before you can choose which cryptocurrencies to manage on your device.","Once that\u0027s done, you\u0027ll be able to connect each wallet to the ELLIPAL app individually by scanning the QR code presented on the ELLIPAL Titan through its associated smartphone app. Once connected, this cryptocurrency can then be directly managed through the app, while sensitive actions such as sending cryptocurrency will need to be confirmed on the ELLIPAL Titan.","Unlike most hardware wallets, which draw power through a USB cable, the ELLIPAL Titan features a built-in 1,400 mAh battery with a standby time of up to 259 hours. That means you don\u0027t need to plug it into a computer or smartphone to function, and you can tote your wallet about for more than a week without needing to recharge.","Most wallet management operations are performed on the associated ELLIPAL app, which is available for both iOS and Android devices. Through the app, users can create transactions, before signing them on their ELLIPAL device. The ELLIPAL Titan uses its built-in camera to scan transaction QR codes created on the app—enabling you to verify the transaction address on the Titan\u0027s screen before signing it and helping to prevent address-swap attacks. It\u0027s typically a quick process, which should take less than a minute if performed correctly.","The ELLIPAL Titan\u0027s large color touchscreen and Android-like OS make navigating around the device a simple task compared to the miniscule displays and two-button interfaces seen on devices like the Ledger Nano S and Trezor One.","As a completely air-gapped device, the ELLIPAL Titan lacks any sort of wireless connectivity. It also lacks any input ports and instead has to be updated using the supplied security adapter, which has a built-in microSD card port.","The Titan is also rated IP65 for dust and water resistance, meaning that it\u0027s completely dust resistant and is able to withstand weak water jets but not complete submersion. Nevertheless, that\u0027s more water-resistant than bestselling wallets like the Ledger Nano X and Trezor One, though it\u0027s pipped to the post by the IP68-rated Cobo Vault.","The ELLIPAL\u0027s associated mobile app comes with some additional features; as well as letting users directly exchange cryptocurrencies with the added security of the associated hardware wallet, it includes market tracking tools and lending products similar to those found on Binance.","The Titan is also one of the few cryptocurrency hardware wallets that allow owners to create multiple accounts on the same device. With this feature, users can easily separate their finances into separate accounts, allowing for improved budget and portfolio management. ELLIPAL claims that users can store as many as 10 accounts on a single device, but this can vary based on the size of each account.","Although the ELLIPAL Titan offers features that are difficult to find elsewhere, it does lack the additional functionality provided by some of its rivals, including FIDO U2F support and multi-signature compatibility.","Unlike many new cryptocurrency hardware wallets, the ELLIPAL Titan completely lacks USB and wireless connectivity. This makes the device immune to network-based and other types of remote attacks. Since the ELLIPAL Titan is an air-gapped cold storage wallet, remote attacks are practically impossible. Physical attacks are similarly difficult, since the wallet will automatically wipe itself if it detects a physical breach.","The ELLIPAL Titan\u0027s secure enclosure is impact and crush resistant, ensuring funds are kept safe even if the hardware wallet is dropped or knocked.","Access to the device is protected by an 8-32 character password which can include symbols. If this password is entered incorrectly too many times, the wallet will be automatically erased. For those who want to add an additional layer of security to their device, the ELLIPAL Titan also supports passphrase protection. This passphrase takes the form of an extra word added to the 12-word recovery phrase, and will need to be entered when attempting to recover the wallet using its recovery seed.","However, like many hardware wallets, including the Trezor One, the Titan can be breached if a sophisticated attacker is able to gain physical access to the device—as was demonstrated by the Ledger Donjon team. Moreover, the ELLIPAL Titan lacks a secure element like those seen in some competing wallets, like the Ledger Nano X and Cobo Vault, which is widely considered to be the gold standard in hardware wallet security.","Nonetheless, most potential exploits can be avoided by simply restricting physical access to the wallet, while keeping its firmware up-to-date.","The ELLIPAL Titan supports a total of 33 different blockchains and more than 7,000 tokens—including most of the top 10 cryptocurrencies by market capitalization, as well as some offbeat choices.","Some of the major supported assets include;","According to its website, ELLIPAL adds new coins to the Titan every month. A full list of supported cryptocurrencies can be found on the ELLIPAL Coin List page. Titan users will need to update the device\u0027s firmware using a microSD card to begin managing newly added assets.","Although the ELLIPAL Titan supports a wide range of cryptocurrencies, privacy coin holders may be disappointed to find a lack of Monero (XMR) and Zcash (ZEC) support.","At its current price of $169 (barring discounts), the ELLIPAL Titan sits firmly in the mid-range price bracket, competing with the likes of the Ledger Nano X and Trezor Model T.","That $169 buys you a robust device that should thwart practically any remote attack, while allowing you to store dozens of different cryptocurrencies in a single wallet. At around the same size as a small smartphone, the ELLIPAL Titan certainly isn\u0027t one of the smallest hardware wallets on the market. However, it does feature one of the largest screens of any hardware wallet, as well as an intuitive user interface, making it suitable for less experienced cryptocurrency holders.","Whether the ELLIPAL Titan is suitable for your needs will likely depend on whether you favor absolute portability and security, or prefer a mix of security and usability—since the Titan squarely fits the latter option. All-in-all, the Titan is a solid contender in today\u0027s hardware wallet market."],"create_date":"2020-04-17T16:32:07","tag":"ELLIPAL,ELLIPAL Titan,hardware wallet,review","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/203441/bitcoin-etf-launch-flop-market-demand","web_url":"https://decrypt.co/","type":"article","description":"Bitcoin hopefuls are crossing their fingers for the approval of a spot crypto ETF. But will demand match the hype?","title":"A Bitcoin ETF Could Soon Finally Launch. What If It Flops? - Decrypt","content":["Investors have been waiting a decade for a spot Bitcoin ETF—and now it looks like one might be just around the corner.","The price of Bitcoin jumped last week after talk that the world’s biggest asset manager, BlackRock, was closer to getting approval from the U.S. Securities and Exchange Commission on its Bitcoin ETF application.","Analysts and experts in the space have said a crypto ETF (exchange-traded fund) will probably hit the market in January—or maybe even sooner.","It\u0027s still far from a certainty, and the SEC has in the past been reluctant to approve the long-awaited product. An ETF would track the price of Bitcoin, allowing investors to get exposure via buying shares and not dealing with digital wallets, exchanges, or private keys. Because an ETF would remove the technical hurdles, some analysts and Bitcoin preachers have said that such a fund could lead to an influx of capital into the Bitcoin market.","But will a Bitcoin ETF live up to the hype?","Not everyone thinks so. J.P. Morgan researchers pointed out back in July that spot crypto exchange-traded products in Canada and Europe haven’t yet moved markets with large investor interest.","Bloomberg Intelligence analyst Eric Balchunas told Decrypt that there “might be a bit of a gap between the hype and the actual demand early on,” adding that when a Bitcoin ETF finally does start trading on a stock exchange, it might not do as well as when the first futures crypto ETF kicked off two years ago—and broke records.","A futures crypto ETF differs from a spot market ETF in that investors buy shares that offer exposure to contacts that bet on the future price of crypto—rather than the asset itself. The SEC greenlit the futures product at the height of the bull market despite denying spot market applications for years.","“I wouldn’t be surprised [if a spot market Bitcoin ETF] way underperforms flow-wise BITO [ProShares Bitcoin Strategy ETF] because BITO was launched at the peak of the mania,” he said. “I’m preparing for something that’s much more mild than BITO but I want to think in three years, five years, it’ll be pretty successful.”","BITO started trading in October 2021, when Bitcoin was selling for $64,000 per coin. Back then, there was a huge appetite for everything crypto—the product traded $280 million-worth of shares in just the first 20 minutes.","By the time the market closed on day one, nearly $1 billion in shares had changed hands.","But since then, the price of every digital asset has plummeted and the industry has been plagued by bankruptcies, hacks, and scams, which could scare away would-be Bitcoin ETF investors—especially those who already have racked up losses.","Ethereum futures ETFs launched earlier this month to a slow start. “A lot has happened, a lot of baggage has set in—even though Bitcoin came back this year—I think that it\u0027ll be somewhat subdued,” added Balchunas.","Adam Guren, co-founder of crypto hedge fund Hunting Hill Digital, said that liquidity constraints in today’s exchanges compared to 2021 are something to consider, too, pointing out that analysts have said “even attaining $500 million in day-one inflows as a noteworthy challenge.”","And the SEC currently has a long list of Bitcoin ETF applications to approve. There has been speculation that they all might get the green light at the same time, which would lead to a disperse of interest, experts told Decrypt.","But ETF Store president Nathan Geraci told Decrypt that if multiple Bitcoin ETFs launch on the same day, records will be broken. “My expectation is that spot bitcoin ETFs will break every existing ETF launch record out there,” he said.","“I can’t recall a past situation where multiple ETFs in an area with so much investor interest and pent-up demand all launched on the same day,” said Geraci.","While VettaFi financial futurist Dave Nadig added that there’s “no question that the first few days of trading will seem an enormous amount of volume.”","Whether the ETFs get off to an explosive start immediately or not, one thing that experts agreed with was that in the long-term, the approval of such a product would be good for Bitcoin.","Bloomberg Intelligence analyst James Seyyfart told Decrypt that “more and more investors are going to be interested in a spot product than they would be in a futures product.”","“If you\u0027re looking at this over the year timeframe, I think that will show that the spot ETFs will have more demand in the futures ETFs,” he said.","Guren added that a spot Bitcoin ETF approval would represent a “momentous milestone,” paving the way for “a more favorable environment for cryptocurrency investments in the United States.”","Edited by Guillermo Jimenez","Editor\u0027s note: This post was originally published on October 26 and updated with additional comments from Nathan Geraci and Dave Nadig on October 30."],"create_date":"2023-10-30T17:47:47","tag":"investing,finance,money,SEC,Bitcoin ETF,bitcoin,BlackRock,cryptocurrency,wall street,trading","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/33472/brd-review-mobile-wallets-dont-get-any-easier-than-this","web_url":"https://decrypt.co/","type":"article","description":"This mobile wallet is simple, attractive, and easy to use. But is it the best thing since sliced bread?","title":"BRD review: mobile wallets don\u0027t get any easier than this - Decrypt","content":["BRD is a mobile wallet that is designed to make spending and using cryptocurrencies as simple and accessible as possible.","Formerly known as BreadWallet (and later Bread), but now known simply as BRD, the wallet first sprang into popularity in 2017 after raising $32 million selling BRD tokens through the Binance Launchpad.","Since then, the wallet has been regularly upgraded with new features, but the BRD token has been reduced to a background feature on the app. BRD is currently available for Android and iOS devices via Google Play and the Apple App Store, but there’s no indication of a desktop version on the way any time soon.","It\u0027s safe to say that BRD has one of the most attractive designs out there. The wallet has a minimalist, modern aesthetic that’s reminiscent of some popular social media apps.","The wallet is separated into three simple sections: buy, trade, and more—which contains the preferences, settings, and less frequently-used features. Most features are intuitive to use, while the more advanced features load with an introductory screen, explaining what the feature does and how to use it.","BRD provides various customization options to control how the wallet works, including a fast-sync feature for Bitcoin to cut down on the sync time that can be experienced when loading balances and transacting with Bitcoin.","Getting your own BRD wallet is a quick process that begins with setting up a six-digit secure PIN code. Once set, BRD will ask you to back up your paper key—BRD\u0027s term for a 12-word recovery phrase. You\u0027ll then need to confirm that you\u0027ve stored the correct paper key before re-entering two randomly selected words, after which BRD will finalize and load your wallet.","If you already have a 12-word recovery phrase, you can also import this wallet directly into BRD by selecting the \"Restore wallet\" option at startup. You\u0027ll then be prompted to enter your paper key or 12-word recovery phrase, which BRD will use to restore your wallet.","Note that BRD requires you to have a lock screen set up on your device before it will allow you to create a wallet. You will be prompted if this is an issue when BRD loads.","Unlike many other mobile cryptocurrency wallets, BRD offers a wide array of features without ending up with an overly cluttered user interface. Because of this, it\u0027s one of the most usable wallets around.","Sending payments is a doddle thanks to QR code address support and a simplified payment setup, but BRD does not allow users to manually adjust their transaction fee for most cryptocurrencies. Receiving payments is similarly simple, since BRD features built-in sharing options and the ability to generate payment request QR codes.","For some of the more complicated options, BRD provides links to relevant help pages, providing useful guidance for less experienced users. Despite its simple user interface, BRD manages to cram in an array of features, making it ideal for both crypto newcomers and more experienced users.","BRD is designed to help make managing cryptocurrencies as painless as possible, something that’s immediately apparent from its feature set.","First up, BRD features built-in cryptocurrency purchase functionality, allowing users in hundreds of countries to purchase cryptocurrencies in-app directly with their debit or credit card. This is supplemented by a simple trading feature, which lets users exchange a small handful of digital assets held in their wallets. These features are commonplace among mobile wallets nowadays, but BRD does an excellent job of making them accessible.","The BRD Rewards feature is one of its few genuinely unique features. Users can earn a variety of rather niche rewards for holding a fixed sum of BRD tokens—such as 2,500 or more tokens to unlock telephone support, 5,000 BRD for a US security box, and a whopping 100,000 BRD (currently ~$12,000) if you fancy a call with the CEO of BRD.","The wallet also includes a simple ATM map feature for users from the United States, showing the location of the nearest Bitcoin ATMs along with some key details.","Like most popular mobile wallets, BRD supports a wide variety of digital assets—but not all of these are enabled by default.","After creating a wallet on BRD for the first time, only Bitcoin (BTC), Ethereum (ETH), and BRD will be ready to manage.","Well over 100 other digital assets can be manually added, including a wide variety of stablecoins, ERC20 tokens, and popular cryptocurrencies. Some of the most prominent include:","The vast majority of additional assets available on BRD are small to medium-cap ERC20 tokens, while several major digital assets are missing, including Monero (XMR), Zcash (ZEC), Litecoin (LTC), EOS and others. As such, BRD is best suited to those with a predominantly ERC20 portfolio.","BRD offers an above-average suite of security features. Like most wallets, the first layer of security is a PIN code that needs to be entered before the wallet will open. BRD goes one step further with its optional fingerprint security option, allowing users to add a layer of biometric authentication to their cryptocurrency wallets.","BRD is a no lock-in wallet, meaning users are free to transfer their entire portfolio to another wallet using their 12-word recovery seed (termed a \"Recovery Key\" by BRD). The wallet also features a secure erase tool, allowing users to wipe their wallets from their device and prevent it from being easily recovered.","However, there are a couple of omissions; BRD doesn’t offer offline transaction functionality or two-factor authentication.","If simplicity is what you\u0027re after, then few mobile cryptocurrency wallets can match the outright usability of BRD. It\u0027s simple, but packed with features that both newer and more experienced cryptocurrency users will appreciate.","There\u0027s cryptocurrency purchase and trading functionality built right into the app, and support for north of 100 digital assets, including many of the most popular ones. However, a lack of privacy-coin support might be an issue for the privacy-conscious.","As a no lock-in wallet, BRD users are free to move their assets to any other app that supports 12-word recovery phrases, while ensuring they can always recover their funds even if they lose their phone or BRD shuts down.","While BRD is a good wallet for beginners, though, its main unique feature—the BRD token—is practically a dud."],"create_date":"2020-07-10T16:51:46","tag":"ios,mobile wallet,software wallets,android,BRD,BreadWallet,wallet","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/199754/grayscale-files-convert-ethereum-trust-spot-etf","web_url":"https://decrypt.co/","type":"article","description":"If approved, the conversion would likely help drop the hefty discount on Grayscale\u0027s Ethereum trust.","title":"Grayscale Files to Convert Ethereum Trust Into Spot ETF - Decrypt","content":["After ongoing efforts to convert its Bitcoin (BTC) Trust into an exchange-traded fund, Grayscale now intends to do the same with its Ethereum (ETH) product.","NYSE Arca filed a 19b-4 with the Securities and Exchange Commission (SEC) to convert the Grayscale Ethereum Trust (ETHE) into a spot Ethereum ETF shortly after the first series of futures Ethereum ETFs reached the U.S. market.","When listing a new crypto ETF, regulatory permission is always sought from the exchange listing the new fund’s shares, rather than the sponsor itself.","“As we file to convert ETHE to an ETF, the natural next step in the product’s evolution, we recognize this as an important moment to bring Ethereum even further into the U.S. regulatory perimeter,” said Grayscale CEO Michael Sonnenshein in a Monday statement.","Grayscale did not immediately respond to Decrypt’s request for comment.","As with its Bitcoin fund, the Grayscale Ethereum Trust is the largest Ethereum investment vehicle worldwide, comprising 2.5% of all circulating ETH.","Since launching in 2019, conversion into a spot ETF has always been the “final stage” of its intended lifecycle, per the press release.","Right now, ETHE shares trade at a whopping 30% discount to the underlying ETH held by the fund. Whereas the total value of the fund’s ETH holdings amount to $5.14 billion at writing time, its shares total to just $3.6 billion.","Under an ETF structure, ETHE shares would be directly redeemable for the underlying ETH. This would likely bring the firm’s net asset value and share value to parity.","Following the announcement, shares for ETHE spiked 6.15% on the day.","Thus far, the company’s long battle to convert the Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF is yet to bear fruit.","However, a major court victory over the SEC in August boosted confidence among both Grayscale and its rivals that the agency may have no choice but to allow a spot Bitcoin ETF to list on U.S. markets. The court found that the SEC was being “arbitrary and capricious” toward Grayscale in denying its spot Bitcoin ETF application while permitting alternative futures Bitcoin ETFs.","Since then, GBTC’s share discount has narrowed from 25% to 20%.","Grayscale was one of many firms to file for a futures Ethereum ETF last month, which is backed by cash-settled futures contracts rather than actual ETH.","A futures contract is an agreement to buy or sell a given financial asset at a later date at a pre-determined price, effectively making them speculations on an asset’s price trajectory."],"create_date":"2023-10-02T16:09:11","tag":"Grayscale,futures,ETF,ETH,Ethereum,SEC,Securities and Exchange Commission,bitcoin","author":"Decrypt / Andrew Throuvalas"}
{"url":"https://decrypt.co/44987/trezor-bitcoin-wallet-users-get-a-desktop-app","web_url":"https://decrypt.co/","type":"article","description":"Trezor users can now manage their cryptocurrencies on desktop using Trezor Suite.","title":"Trezor Bitcoin Wallet Users Get a Desktop App - Decrypt","content":["SatoshiLabs, the parent firm behind the Trezor line of cryptocurrency hardware wallets, has launched a desktop client known as Trezor Suite.","As per a recent blog post, Trezor Suite is designed to improve the Trezor user experience by providing a more consistent experience across both desktop and mobile platforms. The new desktop application offers improvements in three key areas: security, usability, and privacy.","It eliminates the risk of phishing attacks by allowing users to manage their funds without using their internet browser and also features a number of user interface improvements to help make managing cryptocurrencies a simpler task. This includes a new account and coin management system and improved hidden wallet (i.e. passphrase) management tools.","Users can now use Trezor Suite to run a Bitcoin full node, improving transactional privacy by letting users broadcast their own transactions and participate in transaction validation. Trezor has also added a simple discreet mode for an additional layer of privacy and plans to implement Tor support soon.","“With Trezor Suite, we would like to unify the Trezor experience across your devices, starting with this desktop version, to allow more flexibility in how you use Bitcoin,\" said Marek Palatinus (Slush), CEO of SatoshiLabs, in a press release.","Prior to the release of Trezor Suite, hardware wallet users would need to connect their Trezor device to a computer running the Trezor Bridge app and the associated Trezor Wallet browser plugin. Now users will have the choice to use either a standalone desktop application through Trezor Suite or the older browser app.","Trezor\u0027s new desktop wallet features a similar design to Ledger Live—a competing desktop client offered by Ledger, the firm behind the Ledger Nano line of hardware wallets.","Trezor Suite is currently in public beta until around January 2021 and the team is currently soliciting feedback from the community to help build a better product. Trezor plans to release a mobile version of Trezor Suite sometime next year and will deprecate the old Trezor wallet plugin once the desktop wallet exits beta."],"create_date":"2020-10-14T15:14:41","tag":"ledger,full node,bitcoin,Trezor,Trezor Suite","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/7104/vitalik-buterin-secret-store-seed-phrase-key-recovery","web_url":"https://decrypt.co/","type":"article","description":"Ethereum’s co-founder offers a neat little math hack to protect a 12-word seed phrase.","title":"Vitalik Buterin’s secret: How to store your seed phrase - Decrypt","content":["Vitalk Buterin, Ethereum’s co-founder and all-’round crypto-genius,’ took to Twitter over the weekend to decry the increasing popularity of, what he termed, “ultra-heat-protective survive-a-nuclear-war, seed phrase storage devices.”","A seed phrase is a list of words which store all the information needed to recover the cryptocurrency in your hardware wallet, if it’s lost or stolen. But remembering the 12-word phrase—typically made up of random words—can be challenging. So most people either write it down or store it in a flash drive, or other storage device.","What triggered Buterin was the proliferation of seemingly indestructible storage devices—targeted those fearing a catastrophe such as fire, flooding, home invasion or nuclear war. He believes these devices are being developed at the cost of building better UX for other, more secure, methods of storage.","So what does he recommend exactly?","“My whole point is that these systems are not as secure [as] you think they are. It\u0027s still a single point of failure. I\u0027m a huge evangelist for more secure systems, hence why I pump multisig wallets, vault contracts and social key recovery at every opportunity,” he tweeted.","","","Initially, Buterin’s recommendations were ”multisig,” which requires more than one trusted person to sign off on a transaction; vault contracts, which provide developers with a tool to make secure, automated payments to recipients; and social-key recovery, whereby one chooses three to five trusted contacts who can help recover one’s funds.","But it almost goes without saying that storing your key phrase in your brain—that is, memorizing it—ultimately emerged as Buterin’s primary recommendation followed by a nifty social-key recovery formula the math-maestro cooked up:","The second best way is to generate 3 seed phrases out of `k+x`, `k+2x` and `k+3x` where k is your key and x is a random number, give one to your mom, another to your best friend and third to a coworker. None of the three can recover k alone but any two can cooperate to recover k.","— Vitalik Non-giver of Ether (@VitalikButerin) May 19, 2019","","Buterin admitted that this method may not be straightforward enough for “non-math-nerds” and would require “special tools” for figuring out the equation. These, he suggested, are what we should be developing.","We asked our math tutor how to work it out. Basically, you assign each person a number, X. Be sure to tell them whether they are the 1x person 2x or 3x person. The number, X, has to be easily divisible, so it doesn\u0027t end up as a decimal. Then, you take the difference between any two people\u0027s numbers to work out the key number. Easy! Easy? More tools, please."],"create_date":"2019-05-20T16:26:04","tag":"Ethereum,Technology,cryptocurrency","author":"Decrypt / Adriana Hamacher"}
{"url":"https://decrypt.co/229761/trump-defeating-biden-good-bitcoin-standard-chartered","web_url":"https://decrypt.co/","type":"article","description":"Analysts at British bank Standard Chartered today said that a second Donald Trump presidency could do Bitcoin good.","title":"Trump Defeating Biden Would Be Good for Bitcoin: Standard Chartered - Decrypt","content":["Donald Trump used to be anti-crypto. But if he wins in November and becomes United States President for a second term, Bitcoin could benefit, according to British banking giant Standard Chartered.","In a Tuesday note, Standard Chartered digital assets researcher Geoffrey Kendrick said that another Trump administration would not be as strict on Bitcoin as a Biden one might be.","And if Trump wins, then foreign official buyers of U.S. treasuries may want to shift to alternative financial assets like Bitcoin out of caution, he added—which would push the asset’s price up.","“While officials in the Biden administration have taken a relatively tough stance on digital assets, Trump said in a March interview that if elected, he would not crack down on Bitcoin or other digital assets,” the note reads.","It adds that import tariffs under a Trump presidency would lead “several large reserve managers to be buying BTC in 2025.”","Back in March, Trump—who previously slammed Bitcoin—said he’d enjoyed making money and playing around with the asset and other cryptocurrencies.","“I make money with it, I have fun with it too,” he said. “Crazy new currencies, that’s what I call them. They’re crazy new currencies, whether it’s Bitcoin or others.”","Donald Trump—who was U.S. President from 2017-2021—will likely go head-to-head against current president Joe Biden as the presumptive Republican candidate in the November elections.","Standard Chartered last month predicted that the newly approved Bitcoin exchange-traded funds ETFs will continue to be popular, and inflows could lead the price of Bitcoin to rocket to $150,000 by the end of this year.","Edited by Andrew Hayward"],"create_date":"2024-05-07T18:01:33","tag":"Donald Trump,Joe Biden,bitcoin,United States,Standard Chartered","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/223776/hashdex-bitcoin-spot-etf-futures-conversion","web_url":"https://decrypt.co/","type":"article","description":"Originally a Bitcoin Futures ETF, Hashdex now offers direct Bitcoin market exposure starting with 5,500 BTC.","title":"There Are Now 11 Bitcoin ETFs Trading as One More Launches - Decrypt","content":["Crypto asset management Hashdex announced on Tuesday that it launched its Bitcoin ETF on the New York Stock Exchange, making it the eleventh Bitcoin ETF to go live since the SEC approved the bulk of fund applications in January.","Hashdex\u0027s entry originally launched in September 2022 as a Bitcoin Futures ETF trading on the New York Stock Exchange as DEFI. The Brazil-based firm said it had converted that product to a spot Bitcoin ETF to offer investors more immediate exposure to the number one cryptocurrency.","Unlike other spot Bitcoin ETFs, however, Hashdex launched its product within the Chicago Mercantile Exchange (CME). And the new fund will continue to incorporate Bitcoin futures.","“Going forward and under normal market conditions, the fund’s investment policy is to maximize its holdings of physical Bitcoin such that it is expected that at least 95% of the fund’s assets will be invested in spot Bitcoin,” Hashdex said. “Up to 5% of the fund’s remaining assets may be invested in CME-traded Bitcoin futures contracts and in cash and cash equivalents.”","A Bitcoin Futures ETF refers to investments in futures contracts that offer indirect Bitcoin exposure, whereas a spot Bitcoin ETF holds actual Bitcoin, providing direct market price exposure.","Hashdex says the Bitcoin ETF holds 5,500 Bitcoins, currently worth around $377.2 million.","The spot Bitcoin ETF is sponsored by Tidal ETF Services, Hashdex said, which serves as the fund’s administrator along with BitGo, which acts as the custodian of the Bitcoin underpinning the ETF.","“We are thrilled to complete the conversion of DEFI and, with it, deliver an innovative product in coordination with Tidal that furthers our mission of empowering individuals and institutions around the world to access this revolutionary innovation,” Hashdex co-founder and CEO Marcelo Sampaio said in a statement.","In January, the U.S. Securities and Exchange Commission approved ten spot Bitcoin ETFs from investment firms, including BlackRock, Bitwise, Grayscale, VanEck, Franklin Templeton, and ARK 21 Shares.","While Hashdex did file a Bitcoin ETF application with the SEC, the regulatory agency was still reviewing the final registration statement when the other firms\u0027 applications were approved in January, delaying the company’s launch plans.","“DEFI originally received its 19b-4 approval first alongside other issuers, and this latest announcement is regarding the product going effective and converting from a futures to a spot Bitcoin ETF,” a Hashdex spokesperson told Decrypt. “To that end, its tracking of a new benchmark index became effective today, March 27, 2024.”","Edited by Ryan Ozawa."],"create_date":"2024-03-27T20:30:15","tag":"Hashdex,New York Stock Exchange,Bitcoin ETF,bitcoin,Hashdex Bitcoin ETF","author":"Decrypt / Jason Nelson"}
{"url":"https://decrypt.co/52136/ledger-customers-now-getting-threatening-emails-for-bitcoin-ransoms","web_url":"https://decrypt.co/","type":"article","description":"One Ledger customer was asked to pay $500 or face his home being invaded.","title":"Ledger Owners Receive Threatening Emails for Bitcoin Ransoms - Decrypt","content":["Ledger customers are being targeted for Bitcoin ransoms after their personal details were leaked and published on a public forum.","One Ledger customer received an email threatening physical violence if they did not pay $500 to the sender.","Wouldn\u0027t want to be a Ledger customer right now 👇 pic.twitter.com/wZoH3OwTLL","— Riku Raisanen (@rikuraisanen) December 21, 2020","","\"If not, I\u0027m not afraid to show up when you least expect it and see how my wrench works against your face, or maybe even wait for you to leave your home and take your belongings whilst you\u0027re not there to call the police,\" the anonymous person said in the email.","The Ledger customer said they are not worried, and that they receive several of these emails and text messages per day now.","\"I now get 3-4 emails a day, and 5-6 text messages a day. GO TO HELL,\" the customer said.","The Ledger hack was a leak of names, physical addresses and phone numbers of Ledger customers. It came from a hack of Ledger\u0027s e-commerce database in June. Ledger has pointed out that data on users\u0027 holdings has not been released, nor access to their cryptocurrencies (which Ledger doesn\u0027t possess).","But the identifying data, however, has enabled those who have seen the database to identify who owns a Ledger wallet and in some cases find out where they live. Since Ledger wallets are expensive, those owning such wallets are likely to own reasonable amounts of cryptocurrency—making them prime targets.","This suggests that these kinds of email will soon be commonplace to those who had their data stolen. Or as Casa CTO Jameson Lopp put it, \"Strap in for scareware.\""],"create_date":"2020-12-21T12:06:01","tag":"ledger,hack,Ransom,bitcoin,blackmail","author":"Decrypt / Scott Chipolina"}
{"url":"https://decrypt.co/19326/best-cryptocurrency-hardware-wallets","web_url":"https://decrypt.co/","type":"article","description":"Hardware wallets are the safest way to store your cryptocurrencies securely. But which is the best option? We review the leading devices.","title":"Best Crypto Wallet: The Top 8 Hardware Wallets - Decrypt","content":["When it comes to storing cryptocurrencies safely, hardware wallets are widely considered to be the gold standard.","Hardware wallets keep the private keys to your crypto stored in a secure offline environment—meaning that unlike software wallets, they\u0027re completely immune to online attacks. The best hardware wallets are also resistant to physical tampering.","Hardware wallets are ideal for anybody looking to safely store a substantial cryptocurrency portfolio, or carry their portfolio with them on the move. They are also an excellent choice for anybody looking to store their crypto assets long-term, with little need to access them regularly.","There are currently dozens of options on the market, each with their own pros and cons, and target userbase; we\u0027ve rounded up some of the leading contenders.","The most recent addition to Ledger\u0027s hardware wallet range, the Ledger Nano S Plus sits in-between the flagship Nano X and the base-level Nano S in the lineup.","It sports the same large screen seen on the Nano X, as well as greater storage capacity than the Nano S, and charges using a USB-C cable rather than the old micro-USB seen on the Nano S. The only area where it loses out against the Nano X is its lack of a Bluetooth connection and internal battery—leaving iOS users with no way to connect the wallet to their iPhone (Android users can use a cable to connect their Ledger to their mobile device).","With a beginner-friendly setup procedure and support for a wide range of cryptocurrencies, it\u0027s ideally suited to crypto newbies—and unless you desperately need to connect your hardware wallet to your iPhone, it\u0027s probably the best all-round wallet currently on the market.","Read our full review of the Ledger Nano S Plus","First released in 2019, the Ledger Nano X is the flagship model in Ledger\u0027s hardware wallet line-up. It\u0027s a marked step up from the older Ledger Nano S, with increased internal memory enabling you to store up to 100 apps, instead of the two or three that the Nano S can manage. It also has a revamped design with a larger display, an internal battery, and Bluetooth support—enabling you to use the device to sync wirelessly with the Ledger Live smartphone app.","Like its predecessor, the Nano X supports a huge variety of cryptocurrencies and is one of the most portable wallets available, making it ideal for those regularly on the move.","At launch Ledger Connect will be compatible with the Ledger Nano X and Safari on iOS (mobile). Learn more here: https://t.co/29HNTkVcT2","— Ledger (@Ledger) May 18, 2022","","A series of firmware updates since the Nano X\u0027s release have added features including streamlining the update process for the device, and full support for Ethereum 2.0. It\u0027s also the only model in Ledger\u0027s line-up that will be compatible with its forthcoming Ledger Connect browser extension at launch.","However, with the release of the Ledger Nano S Plus, the Nano X struggles to justify its premium price tag—unless the S Plus\u0027 lack of Bluetooth connectivity is a dealbreaker.","Read our full review of the Ledger Nano X","The Trezor Model T is SatoshiLabs\u0027 latest foray into the hardware market. The Model T is similar in design to the older Trezor Model One—albeit with a larger touchscreen interface, and support for a much wider range of cryptocurrencies.","Although pricey, the Trezor Model T is regarded as one of the best hardware wallets on the market, particularly for those concerned with the security implications of the Bluetooth connectivity that many recent flagship wallets come equipped with.","July 2021 saw the launch of Trezor Suite, a full desktop app that replaced the previous Trezor Wallet web app as the main interface for Trezor wallets. It makes for a more streamlined and secure user experience, with features including one-click Tor integration and the option to buy crypto and have it sent directly to your hardware wallet.","Read our full review of the Trezor Model T","Not long for this world, the Ledger Nano S is set to be discontinued in 2022, having been superseded by the Nano S Plus. But don\u0027t discount the old workhorse; the Nano S is an attractive, easy-to-use wallet that is suitable for those looking for robust security on a budget.","The Ledger Nano S features support for well over 5,000 cryptocurrencies, and packs a built-in bank-grade secure element. Its small screen does make interacting with the device a pain—you have to cycle through multiple screens for each crypto address—but that\u0027s a small compromise to make given its bargain-basement price.","Periodic updates have refreshed the user experience, even as the hardware becomes increasingly outdated; including the Nano X\u0027s Control Center feature, which enables you to adjust settings and delete apps on the device, without having to use the Ledger Live desktop software. A streamlined onboarding process keeps things newbie-friendly, too. An ideal wallet for users on a budget, or power users looking for a cheap backup device.","Read our full review of the Ledger Nano S","First released by SatoshiLabs in 2014, the Trezor Model One was one of the first hardware wallets to hit the market. Despite its age, the Trezor One still impresses with its security features, support for a huge range of cryptocurrencies and compatibility with dozens of external wallets.","As one of the older wallets on the market, the Trezor One is attractively priced, but still hangs with some of the best in terms of features.","Like its more expensive cousin, the Model T, the Model One also benefits from being able to employ the Trezor Suite app as a wallet interface.","Read our full review of the Trezor Model One","The CoolWallet S is a slimline hardware wallet that\u0027s designed to fit in your wallet alongside your debit and credit cards. The CoolWallet S features support for most major cryptocurrencies and is one of the few waterproof hardware wallets available.","The CoolWallet S also comes with Bluetooth connectivity, allowing you to manage your portfolio from almost any Bluetooth-capable device.","Read our full review of the CoolWallet S","The KeepKey is a simple hardware wallet with a premium design and feel. Designed to be easily accessible, the KeepKey allows users to store most popular cryptocurrencies in cold storage and exchange assets directly on the device thanks to its built-in ShapeShift functionality.","As one of the cheapest hardware wallets on this list, the KeepKey provides excellent bang for your buck, particularly for those that don\u0027t need top-end features.","Read our full review of the KeepKey","The Binance backed SafePal S1 is a lesser-known hardware wallet that looks to make cryptocurrency storage more secure through a completely self-contained device that lacks USB, Bluetooth, Wi-Fi and any other connection methods.","This relatively cheap device features a built-in camera and six physical buttons, which are all you need to store and access thousands of different cryptocurrencies by scanning QR codes on the associated mobile app.","Read our full review of the Safepal S1","As with most things, selecting the cryptocurrency hardware wallet that works best for you will likely come down to your individual needs and preferences. Every wallet on this list will provide better security than a standard software or mobile wallet, but not all offer the same ease of use, features, and range of supported cryptocurrencies.","Based on security alone, Ledger\u0027s line-up is arguably the most battle-tested of the bunch, benefiting from the insights garnered by the company\u0027s Donjon security team.","The KeepKey is one of the easiest wallets to use, making it a good choice for newcomers to the crypto space; the Ledger Nano S and X are also extremely accessible thanks to the intuitive Ledger Live application. On the flip side, the SafePal S1 is less accessible to inexperienced users.","As for asset support, the Ledger Nano X and S Plus simply mop the floor with everything else on the list—but that versatility comes with a relatively high price tag. For a good mix of value for money and asset support, the Ledger Nano S Plus should represent an acceptable middle ground for most users, and the Trezor Model One offers similar value for those with a diverse cryptocurrency portfolio.","Additional features like 2FA functionality can be found on several devices on the list, including the Trezor Model One and Ledger Nano X and S Plus, while the Trezor Model T, CoolWallet S, and Ledger Nano X offer Bluetooth support for increased flexibility.","Overall, we believe the Ledger Nano S Plus represents the best mix of security, asset support, and additional features, offering essentially the same spec as its Nano X sibling, minus the pricey addition of Bluetooth connectivity."],"create_date":"2022-06-09T13:20:47","tag":"KeepKey,ledger,Ledger Blue,Ledger Nano S,Ledger Nano X,Ethereum,safepal s1,bitcoin hardware wallet,bitcoin,CoolWallet S","author":"Decrypt / Daniel Phillips, Stephen Graves"}
{"url":"https://decrypt.co/resources/what-is-bitcoin-four-minute-instant-guide-explainer","web_url":"https://decrypt.co/","type":"article","description":"Bitcoin, launched in 2009, is the world\u0027s first peer-to-peer cryptocurrency. It runs on a decentralized, peer-to-peer ledger that needs no bank.","title":"What Is Bitcoin (BTC)? The Beginner’s Guide - Decrypt","content":["—Bitcoin started it all.","It was the first cryptocurrency, and it launched an industry that now includes thousands. But who invented it, how does it work, and why is it so important?","Bitcoin (BTC) is a peer-to-peer cryptocurrency. Think of it as a digital token. You can\u0027t physically touch or hold Bitcoins, and all Bitcoin transactions are logged on a public, decentralized, immutable ledger.","The first official purchase using Bitcoin was for pizza in May 2010. Two pizzas from Papa John’s were exchanged for 10,000 BTC. May 22 is now known as Bitcoin Pizza Day.","Many found Bitcoin appealing because it was a new way to pay for goods and services that didn\u0027t rely on a centralized bank, government, or credit provider. These days, there are ongoing debates over whether Bitcoin really functions as everyday money, or more as a store of value (aka \"digital gold\").","No one really knows for sure. But the person (or persons) most directly responsible used the pseudonym Satoshi Nakamoto when they authored a white paper in October 2008 called \"Bitcoin: A Peer-to-Peer Electronic Cash System.\" It was published on a small mailing list for cryptography fans.","In January 2009, the software to create the currency was released, followed shortly after by the first ever block mined on the network, known as the Genesis Block.","The first identifiable person to get involved in Bitcoin was a programmer named Hal Finney, who downloaded the software required to run it, and on January 12, 2009, received 10 Bitcoins—the first-ever Bitcoin transaction.","For a while, Satoshi Nakamoto and a few others mined currency on the network (read more about how mining works in our mining guide) before mysteriously disappearing, handing over control to another programmer named Gavin Andresen.","Bitcoin had qualities that no other form of digital cash had ever gotten quite right:","Around 25% of all Bitcoins have been lost from people losing their \"keys,\" which you can think of as access codes. In November 2013, an IT consultant accidentally threw away a hard drive with the private keys to 7,500 Bitcoins. Whoops.","Picture gold under the ground. We know it\u0027s there, but its value is hidden until a miner digs it up. In the Bitcoin world, a miner unearths Bitcoins by using expensive computers to solve cryptographic puzzles in real time that \"mine\" bundles of transaction records (\"blocks\") to the blockchain.","Miners get rewarded for their efforts with a small amount of new Bitcoins, and the mining reward is halved every four years as a measure to slow the creation of new Bitcoins. In Satoshi Nakamoto\u0027s white paper, they said only ever be 21 million Bitcoins could be mined—so at the current rate, all Bitcoins will be mined by somewhere around 2140.","There are two ways to acquire Bitcoin:","What can you do with Bitcoin?","In 2013, the FBI made $48 million by selling 144,000 Bitcoins it had seized from criminals using the currency.","Like a regular wallet, it’s a place to keep your valuables—but digital. (Read more about crypto wallets in our handy guide.)","When it comes to Bitcoin, those valuables are your keys (strings of numbers and letters), held on a piece of software you can store on your phone, the web, or a computer. Or to be extra safe, you can write down your keys somewhere completely offline—aka \"cold storage.\"","In order to buy and sell Bitcoin, you need both a private and a public key.","Your public key is what you share with other people so they can send you Bitcoin. Think of it as your address: It\u0027s OK for others to know it.","Your private key shouldn\u0027t be shared. When you trade, you use your private key to authenticate that it\u0027s you who\u0027s requesting to send or receive Bitcoin.","Bitcoin mining uses a lot of electricity. So much so that one transaction consumes nearly 4,000 times the energy used when processing a credit card transaction.","We know that all Bitcoins will be mined sometime around 2140. In the meantime, the future of Bitcoin and its value is uncertain, and fluctuates. The larger debate over Bitcoin\u0027s best use case also rages on. Will it become an everyday currency, or just be a store of value? Or maybe both?"],"create_date":"2021-02-26T04:20:32","tag":"satoshi nakamoto,bitcoin,BTC","author":"Decrypt / Matt Hussey, Daniel Roberts"}
{"url":"https://decrypt.co/16035/ledger-nano-x-review-an-expensive-step-in-the-right-direction","web_url":"https://decrypt.co/","type":"article","description":"The Ledger Nano X hardware wallet features Bluetooth, an OLED screen and support for over 1k crypto assets. But is it a cut above the Nano S?","title":"Ledger Nano X Review (2021): An Expensive Step In The Right Direction - Decrypt","content":["","","Since cryptocurrencies were invented over a decade ago, there have been many attempts to build more advanced, secure and user-friendly walletsto store them.","As of 2021, the current gold standard for security is known as a hardware wallet—a physical device that stores your cryptocurrency private keys in a secure offline environment.","One of the most prominent companies involved in moving the needle forward is Ledger, the firm behind the popular, but flawed Ledger Nano S hardware wallet—and the Ledger Nano X, its flagship device.","With a bigger screen, Bluetooth connectivity and a built-in battery, the Nano X is certainly an upgrade—but does it live up to the hype? Let\u0027s find out.","At 72mm x 18.6mm x 11.75mm with a weight of 34g, the Ledger Nano X is almost twice as large and more than twice as heavy as the Ledger Nano S.","One reason for the Nano X\u0027s greater bulk is that it has a built-in 100mAH battery, meaning that you can use it on the move—unlike its predecessor, which had to be plugged into a PC using a USB cable to draw power. Also filling out its frame are increased memory and a larger OLED screen.","As we can see, although the Ledger Nano X is far smaller than the KeepKey wallet and the Ledger Blue, it is noticeably larger than the Nano S and Trezor Model One. Nonetheless, it is still an incredibly small device, and is roughly comparable in size to a common USB pen drive.","Overall, the Ledger Nano X has a modern aesthetic that is similar to the Ledger Nano S, albeit more streamlined, since the buttons are now built into the body of the device and sit flush with the casing.","The Ledger Nano X comes supplied in a small cellophane-wrapped box, measuring approximately 80mm x 131mm x 31mm. Interestingly, Ledger chooses not to use tamper-evident seals on its packaging, stating that they\u0027re \"easy to counterfeit and can therefore be misleading.\"","Inside the box, you\u0027ll find the Ledger Nano X device (obviously), in addition to a braided USB A to USB C cable and a keychain strap. Documentation includes a getting started leaflet, three recovery sheets (for recording recovery phrases) as well as several stickers featuring Ledger branding.","The Nano X may be heftier than the Nano S, but it\u0027s still a small device. As a result, navigating through the on-device menu isn\u0027t exactly the simplest process in the world—particularly when considering the fact that it only has two buttons. However, the larger screen and controls make for a significantly less fiddly user experience than that of the Ledger Nano S.","Navigating the device\u0027s menu involves scrolling left or right using the left and right button respectively, or selecting options by pressing both buttons simultaneously. Beyond this, most of the action actually occurs on the associated Ledger Live application, with the Ledger device itself being mostly used for verifying addresses and authorizing transactions.","The Ledger Nano X\u0027s larger screen resolves one of the most common gripes about the Nano S, since crypto addresses can now be displayed in their entirety instead of requiring you to scroll. One niggling issue is that the Nano X ships with a relatively short USB cable—just 50cm long, which can make it difficult to use if your computer isn\u0027t in a convenient location.","To begin using the device, you\u0027ll first need to download and install the Ledger Live client for your operating system. This is currently available for most desktop operating systems including Windows, Mac OS, Linux, as well as mobile operating systems like iOS and Android.","Once Ledger Live is up and running, you can power up the Ledger Nano X device by holding the left button, after which you\u0027ll be able to navigate through the startup screens to configure the device.","This will involve choosing a 4 to 8 digit PIN code, and backing up and verifying the randomly generated 24-word recovery phrase shown on the device. Overall, this process takes around 5 to 10 minutes, and only needs to be completed once.","By default, the device doesn\u0027t ship with any preinstalled wallet apps. Instead, these need to be manually downloaded by connecting the Ledger Nano X with Ledger Live. Thanks to its Bluetooth capabilities, the Ledger Nano X is able to pair with mobile devices running Ledger Live wirelessly; if you\u0027re using the device with a desktop PC, you\u0027ll have to use the supplied USB cable.","As a hardware wallet, the Ledger Nano X is primarily designed for the safe storage of cryptocurrencies and other crypto assets. Because of this, the Ledger Nano X is compatible with practically every major cryptoasset, while support for new assets is added regularly.","The Ledger Nano X also overcomes one of the major limitations of its Ledger Nano S, by bumping the available internal memory from 320kb up to 2048kb. This allows users to store up to 100 apps on their device at once—considerably more than the 3 to 7 simultaneous apps the Ledger Nano S could hold. This means the Ledger Nano X can currently hold the entire app library simultaneously—avoiding the need to manually remove and switch out apps due to memory constraints.","While the vast majority of these apps allow the wallet to hold additional cryptocurrencies and tokens, a handful impart additional functionality to the Nano X. For example, the FIDO U2F app turns the device into a two-factor authentication key, whereas the recovery check app can be used to ensure you have correctly saved your recovery phrase.","Moreover, the Ledger Nano X is the first cryptocurrency hardware wallet to include a built-in 100mAH battery, a necessary upgrade since the device now features Bluetooth connectivity out of the box. This allows the device to connect to mobile devices wirelessly, whereas the older Ledger Nano S could only connect to mobile devices using a Ledger OTG Kit.","With the addition of wireless connectivity, increased memory, and a much larger screen, Ledger has clearly paid attention to the shortcomings of its earlier products and is trying to make safely storing crypto assets a less challenging task.","The Ledger Nano X is compatible with well over 1,000 digital assets, including 23 coins and all ERC-20 tokens. Many of these can be managed through Ledger Live, whereas some require the Ledger Nano X to be used in conjunction with a compatible wallet. Supported crypto assets include;","The Ledger Nano X supports practically every crypto asset supported by the Ledger Nano S, but is able to hold more of the relevant wallet apps at any one time thanks to its expanded internal memory.","As such, the Ledger Nano X is ideal for securing diverse portfolios, though individuals looking to store newly released crypto assets may need to wait until Ledger adds support for them.","As a hardware wallet, the Ledger Nano X targets the minority of cryptocurrency users that value security above all else. As such, the team behind the product has clearly put a great deal of thought into the potential ways such a device could be attacked, and have incorporated a huge number of potential safeguards into its design.","Like all Ledger devices, the Nano X features state-of-the-art security and incorporates a physically isolated security element certified as CC EAL5+. These secure elements are similar to those used to secure credit and debit cards, and are the standard used by banks for the protection of financial information.","The device also features a dual-core MCU which runs a proprietary operating system known as BOLOS and controls communication between the connected device and the Ledger secure element.","Although the addition of Bluetooth theoretically increases the number of potential entry points hackers could use to compromise the device, the Ledger Nano X encrypts Bluetooth traffic between the mobile device and requires manual verification for all important device actions.","Beyond this, Ledger\u0027s Nano X and Nano S are the only hardware wallets to receive CSPN (First Level Security Certificate) certification, which means their security has been independently certified by ANSSI—the National Cybersecurity Agency of France.","These hardware-based security measures are also supplemented with several software-based ones, including a 4-8 digital security PIN, automatic inactivity lockouts and an optional Ledger Live password lock.","Overall, the Ledger Nano X is without question one of the most secure cold storage solutions on the market.","However, although its devices offer a high level of security, Ledger has experienced some security lapses as a company.","In June 2020, data from the company\u0027s e-commerce database was leaked, resulting in over a million customer records being posted to hacker forums. Some quarter of a million records included details such as physical addresses and phone numbers—exposing Ledger customers to the threat of phishing attacks and even threats.","Recently, we shared news of a data dump. On December 23, we were alerted by our e-commerce provider Shopify about an incident in April & June \u002720 where their rogue team members exported merchants\u0027 customer databases. Ledger was included. More details: https://t.co/NHU3IbDL0a pic.twitter.com/DHQQ9arxCu","— Ledger (@Ledger) January 13, 2021","","While Ledger has committed to changing how it handles customer data and identifying and prosecuting those responsible, it\u0027s an embarrassing lapse for a company whose business is the security of your crypto.","The Ledger Nano X is currently available for purchase from the official Ledger website for $119. With that said, it can often be found for cheaper at authorized third-party retailers as well as official resellers on Amazon. You should exercise caution when purchasing any hardware wallet, making sure to only purchase from authorized sources, and never using any hardware wallet that has already been configured.","At twice the price of the Ledger Nano S, the Nano X is one of the more expensive hardware wallets on the market. If portability and usability are your top concerns, it\u0027s probably worth the hit on your wallet—but if you\u0027re already happy with the Ledger Nano S, there\u0027s little reason to upgrade.","The addition of Bluetooth and massively expanded internal memory are steps in the right direction, whereas the huge range of supported cryptocurrencies means that even the most diverse cryptocurrency investors can secure their entire portfolio.","The Ledger Nano X is an excellent product marred only by its high price tag; those in the market for a less expensive alternative may want to take a look at the cheaper, but dated Ledger Nano S.","Rating: 4/5"],"create_date":"2021-02-26T18:15:27","tag":"ledger,hardware reviews,hardware wallet,hardware wallets,review,Reviews,bitcoin hardware wallet,best ethereum wallet,crypto hardware wallets","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/19326/best-cryptocurrency-hardware-wallets/","web_url":"https://decrypt.co/","type":"article","description":"Hardware wallets are the safest way to store your cryptocurrencies securely. But which is the best option? We review the leading devices.","title":"Best Crypto Wallet: The Top 8 Hardware Wallets - Decrypt","content":["When it comes to storing cryptocurrencies safely, hardware wallets are widely considered to be the gold standard.","Hardware wallets keep the private keys to your crypto stored in a secure offline environment—meaning that unlike software wallets, they\u0027re completely immune to online attacks. The best hardware wallets are also resistant to physical tampering.","Hardware wallets are ideal for anybody looking to safely store a substantial cryptocurrency portfolio, or carry their portfolio with them on the move. They are also an excellent choice for anybody looking to store their crypto assets long-term, with little need to access them regularly.","There are currently dozens of options on the market, each with their own pros and cons, and target userbase; we\u0027ve rounded up some of the leading contenders.","The most recent addition to Ledger\u0027s hardware wallet range, the Ledger Nano S Plus sits in-between the flagship Nano X and the base-level Nano S in the lineup.","It sports the same large screen seen on the Nano X, as well as greater storage capacity than the Nano S, and charges using a USB-C cable rather than the old micro-USB seen on the Nano S. The only area where it loses out against the Nano X is its lack of a Bluetooth connection and internal battery—leaving iOS users with no way to connect the wallet to their iPhone (Android users can use a cable to connect their Ledger to their mobile device).","With a beginner-friendly setup procedure and support for a wide range of cryptocurrencies, it\u0027s ideally suited to crypto newbies—and unless you desperately need to connect your hardware wallet to your iPhone, it\u0027s probably the best all-round wallet currently on the market.","Read our full review of the Ledger Nano S Plus","First released in 2019, the Ledger Nano X is the flagship model in Ledger\u0027s hardware wallet line-up. It\u0027s a marked step up from the older Ledger Nano S, with increased internal memory enabling you to store up to 100 apps, instead of the two or three that the Nano S can manage. It also has a revamped design with a larger display, an internal battery, and Bluetooth support—enabling you to use the device to sync wirelessly with the Ledger Live smartphone app.","Like its predecessor, the Nano X supports a huge variety of cryptocurrencies and is one of the most portable wallets available, making it ideal for those regularly on the move.","At launch Ledger Connect will be compatible with the Ledger Nano X and Safari on iOS (mobile). Learn more here: https://t.co/29HNTkVcT2","— Ledger (@Ledger) May 18, 2022","","A series of firmware updates since the Nano X\u0027s release have added features including streamlining the update process for the device, and full support for Ethereum 2.0. It\u0027s also the only model in Ledger\u0027s line-up that will be compatible with its forthcoming Ledger Connect browser extension at launch.","However, with the release of the Ledger Nano S Plus, the Nano X struggles to justify its premium price tag—unless the S Plus\u0027 lack of Bluetooth connectivity is a dealbreaker.","Read our full review of the Ledger Nano X","The Trezor Model T is SatoshiLabs\u0027 latest foray into the hardware market. The Model T is similar in design to the older Trezor Model One—albeit with a larger touchscreen interface, and support for a much wider range of cryptocurrencies.","Although pricey, the Trezor Model T is regarded as one of the best hardware wallets on the market, particularly for those concerned with the security implications of the Bluetooth connectivity that many recent flagship wallets come equipped with.","July 2021 saw the launch of Trezor Suite, a full desktop app that replaced the previous Trezor Wallet web app as the main interface for Trezor wallets. It makes for a more streamlined and secure user experience, with features including one-click Tor integration and the option to buy crypto and have it sent directly to your hardware wallet.","Read our full review of the Trezor Model T","Not long for this world, the Ledger Nano S is set to be discontinued in 2022, having been superseded by the Nano S Plus. But don\u0027t discount the old workhorse; the Nano S is an attractive, easy-to-use wallet that is suitable for those looking for robust security on a budget.","The Ledger Nano S features support for well over 5,000 cryptocurrencies, and packs a built-in bank-grade secure element. Its small screen does make interacting with the device a pain—you have to cycle through multiple screens for each crypto address—but that\u0027s a small compromise to make given its bargain-basement price.","Periodic updates have refreshed the user experience, even as the hardware becomes increasingly outdated; including the Nano X\u0027s Control Center feature, which enables you to adjust settings and delete apps on the device, without having to use the Ledger Live desktop software. A streamlined onboarding process keeps things newbie-friendly, too. An ideal wallet for users on a budget, or power users looking for a cheap backup device.","Read our full review of the Ledger Nano S","First released by SatoshiLabs in 2014, the Trezor Model One was one of the first hardware wallets to hit the market. Despite its age, the Trezor One still impresses with its security features, support for a huge range of cryptocurrencies and compatibility with dozens of external wallets.","As one of the older wallets on the market, the Trezor One is attractively priced, but still hangs with some of the best in terms of features.","Like its more expensive cousin, the Model T, the Model One also benefits from being able to employ the Trezor Suite app as a wallet interface.","Read our full review of the Trezor Model One","The CoolWallet S is a slimline hardware wallet that\u0027s designed to fit in your wallet alongside your debit and credit cards. The CoolWallet S features support for most major cryptocurrencies and is one of the few waterproof hardware wallets available.","The CoolWallet S also comes with Bluetooth connectivity, allowing you to manage your portfolio from almost any Bluetooth-capable device.","Read our full review of the CoolWallet S","The KeepKey is a simple hardware wallet with a premium design and feel. Designed to be easily accessible, the KeepKey allows users to store most popular cryptocurrencies in cold storage and exchange assets directly on the device thanks to its built-in ShapeShift functionality.","As one of the cheapest hardware wallets on this list, the KeepKey provides excellent bang for your buck, particularly for those that don\u0027t need top-end features.","Read our full review of the KeepKey","The Binance backed SafePal S1 is a lesser-known hardware wallet that looks to make cryptocurrency storage more secure through a completely self-contained device that lacks USB, Bluetooth, Wi-Fi and any other connection methods.","This relatively cheap device features a built-in camera and six physical buttons, which are all you need to store and access thousands of different cryptocurrencies by scanning QR codes on the associated mobile app.","Read our full review of the Safepal S1","As with most things, selecting the cryptocurrency hardware wallet that works best for you will likely come down to your individual needs and preferences. Every wallet on this list will provide better security than a standard software or mobile wallet, but not all offer the same ease of use, features, and range of supported cryptocurrencies.","Based on security alone, Ledger\u0027s line-up is arguably the most battle-tested of the bunch, benefiting from the insights garnered by the company\u0027s Donjon security team.","The KeepKey is one of the easiest wallets to use, making it a good choice for newcomers to the crypto space; the Ledger Nano S and X are also extremely accessible thanks to the intuitive Ledger Live application. On the flip side, the SafePal S1 is less accessible to inexperienced users.","As for asset support, the Ledger Nano X and S Plus simply mop the floor with everything else on the list—but that versatility comes with a relatively high price tag. For a good mix of value for money and asset support, the Ledger Nano S Plus should represent an acceptable middle ground for most users, and the Trezor Model One offers similar value for those with a diverse cryptocurrency portfolio.","Additional features like 2FA functionality can be found on several devices on the list, including the Trezor Model One and Ledger Nano X and S Plus, while the Trezor Model T, CoolWallet S, and Ledger Nano X offer Bluetooth support for increased flexibility.","Overall, we believe the Ledger Nano S Plus represents the best mix of security, asset support, and additional features, offering essentially the same spec as its Nano X sibling, minus the pricey addition of Bluetooth connectivity."],"create_date":"2022-06-09T13:20:47","tag":"KeepKey,ledger,Ledger Blue,Ledger Nano S,Ledger Nano X,Ethereum,safepal s1,bitcoin hardware wallet,bitcoin,CoolWallet S","author":"Decrypt / Daniel Phillips, Stephen Graves"}
{"url":"https://decrypt.co/83846/first-bitcoin-futures-etf-trades-nearly-1-billion-one-day","web_url":"https://decrypt.co/","type":"article","description":"The first-ever Bitcoin ETF has hit the market. And it nearly broke the trading record for any debuting ETF.","title":"First Bitcoin Futures ETF Trades Nearly $1 Billion in One Day - Decrypt","content":["The first U.S. Bitcoin futures ETF launched today, and eager investors traded $280 million-worth of shares in just the first 20 minutes. By the time the market closed on Tuesday, nearly $1 billion in shares changed hands.","ProShares’ Bitcoin Strategy ETF began trading today on the New York Stock Exchange under the ticker BITO after receiving approval from the U.S. Securities and Exchange Commission on Friday. Investors wanting exposure to the biggest cryptocurrency were able to buy shares tied to the future price of Bitcoin, which rose to $42.15 at one point—a 5.4% increase from the initial net asset value of $40. The shares ultimately closed at $41.94, an increase of 4.85%.","Analysts told Decrypt that the sheer volume traded nearly broke a record: although it didn’t hit the $1 billion mark, it was close—figures from Bloomberg show $994 million was traded. Only one ETF in the history of U.S. ETFs hit $1 billion on its first day, and that was BlackRock’s Carbon Transition Readiness in April.","Looks like the final tally is gonna be right around ~$990 million in trading for $BITO on its first day trading. https://t.co/KCoqOtRKV0","— James Seyffart (@JSeyff) October 19, 2021","","“It was not expected. We thought it was going to be a big hit, we thought it was going to be successful,” Bloomberg ETF research analyst James Seyfarrt said. “I thought if it traded $250 million in the first day, it would be a success. It did that in just 30 minutes.”","The ETF gives institutional and retail investors access to Bitcoin, without them having to buy and store Bitcoin themselves, which can be complicated for some investors. There’s a small catch, though. This particular ETF is a futures one, meaning that investors are buying and selling shares that represent contracts betting on the price of Bitcoin. A spot-based product is still desired: a long-list of high-profile companies are awaiting approval on a Bitcoin ETF that is pegged directly to the price of the crypto.","The SEC has been slow to approve a true Bitcoin ETF, citing concerns around market manipulation in crypto. SEC Chairman Gary Gensler, however, indicated in August that the SEC would be inclined to approve an ETF that tracked Bitcoin futures, presumably because the futures market is already regulated by the CFTC.","While Bitcoin ETFs that give investors exposure to the cryptocurrency spot market do not exist in the U.S., they have been hugely successful in Canada.","Physical Bitcoin or not—ProShares’ Bitcoin Strategy ETF has proven that Wall Street investors are hungry for Bitcoin.","Disclaimer","The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."],"create_date":"2021-10-19T20:43:03","tag":"investing,finance,ETF,money,Bitcoin ETF,bitcoin,Breaking Push,cryptocurrency,trading","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/230901/hedge-fund-gme-amc-shares-before-meme-stock-surge","web_url":"https://decrypt.co/","type":"article","description":"The Renaissance Technologies portfolio also included Bitcoin ETF shares, but the meme stocks saw eye-popping gains.","title":"Hedge Fund Nabbed Millions of GameStop, AMC Shares Before Meme Stocks Skyrocketed - Decrypt","content":["New York-based hedge fund Renaissance Technologies went in big on GameStop before this week\u0027s crazy rally, acquiring over 1 million shares in the game store franchise as of March 2024, according to documents filed with the U.S. Securities and Exchange Commission.","In the first quarter filing, Renaissance Technologies—an algorithm-based investment firm—said it held 1,004,958 shares of GameStop, valued at $12,582 at the time.","GameStop (GME) has risen sharply in the last 72 hours since the apparent return of fabled trader Keith Gill, aka “Roaring Kitty,” sent traders into a frenzy. On Tuesday, the price of GameStop’s stock surged 130% to $64.83 in premarket trading. This briefly boosted the value of Renaissance Technologies’ GME holdings to $65.2 million—an astronomical but momentary gain of over 5,000%.","The rally may be short-lived, however, as the stock crashed 30% to $34.12 on Wednesday.","The firm also disclosed holding 8,700,396 shares of AMC Entertainment Holdings (AMC), which was also swept up in this week’s meme stock frenzy.","When Renaissance filed, its 8,700,396 shares had a total value of $32,365. AMC stock began the week trading at $3.52. On Tuesday, AMC stock rose 235.8% to $11.82 bringing Renaissance Technologies’ holdings to $102.8 million—a potential gain of over 3,000%. But the AMC stock price dropped 52.71% today, currently trading at $5.59 per share—bringing Renaissance’s AMC holdings back to $48.6 million.","Renaissance Technologies also has its hands in the cryptocurrency space with investments in several Bitcoin ETFs, including 26,500 shares of Bitwise Bitcoin ETF, 94,900 shares of Grayscale Bitcoin Trust, 24,100 shares of Invesco Galaxy Bitcoin ETF, and 14,500 shares of Fidelity Wise Origin Bitcoin ETF.","Combined, Renaissance Technologies\u0027 total crypto investments add up to just over $63.6 million, a small portion of its over $100 billion in assets under management.","Founded in 1982, Renaissance Technology (also known as RenTech or RenTec) develops quantitative trading algorithms that guide investment strategies for its clients.","Quantitative trading, also known as algorithmic trading, is a method of making financial market trading decisions using computational algorithms, statistical analysis, mathematical models, and increasingly artificial intelligence.","Other notable investments in the SEC filing include 550,625 shares of Nvidia, 106,696 shares of Adobe, 676,432 shares of Amazon 1.76 million shares of Tesla, as well as stock holdings in pharmaceutical and biotech companies.","Renaissance Technologies did not respond to Decrypt’s request for comment.","Edited by Ryan Ozawa."],"create_date":"2024-05-15T20:22:02","tag":"GME,gamestop,Meme Stocks,algorithms,algorithmic trading,Tesla Stock,AMC Stock,GameStop Stock,stonks,Renaissance Technologies","author":"Decrypt / Jason Nelson"}
{"url":"https://decrypt.co/230566/who-is-roaring-kitty-keith-gill-deepfuckingvalue-back-on-twitter","web_url":"https://decrypt.co/","type":"article","description":"Keith Gill\u0027s Twitter account came back to life after more than two years, leading GameStop stock to more than double in value and a Solana-based tribute coin to spike 1,900%.","title":"Who Is Roaring Kitty, and What Does His Return Mean for Crypto? - Decrypt","content":["Financial analyst turned stock and meme influencer Roaring Kitty has roared back onto social media. His apparent return to Twitter on Sunday didn’t even directly mention GameStop—the stock whose rollercoaster ride sparked global headlines and a documentary film—but nonetheless prompted the price of GME to double briefly and preceded a 1,900% surge in a Solana-based tribute coin also named GME.","What’s the connection between Roaring Kitty—whose real name is Keith Gill—the failed video game retailer, and meme coins?","Gill is no fringe character. He was the subject of the 2023 film “Dumb Money,” which told the story of the 2021 GameStop short squeeze, after his stock analysis and campaign to promote GameStop stock largely started the fire that engulfed Wall Street in 2021—and led him to testify on Capitol Hill.","The @TheRoaringKitty Twitter account came back to life on Sunday with an image of a man sitting up in his seat, holding a video game controller with a look of keen interest on his face.","pic.twitter.com/YgjVqtgcNS","— Roaring Kitty (@TheRoaringKitty) May 13, 2024","","It was the first tweet in over 150 weeks. And it was enough to fuel another maelstrom in both crypto and traditional investing circles.","Before he took the financial sector by storm as Roaring Kitty (or DeepFuckingValue on Reddit), Gill dreamed of being a track and field star and even appeared in an edition of Sports Illustrated, according to the Wall Street Journal. Gill’s first foray into creating content on YouTube was posting a 4:33 mile run, where he lost a bet to beat 4:30.","While his dreams of racing stardom failed to pan out after an injury, Gill shifted his focus to the stock market. In 2019, Gill became a director of financial wellness at life insurance company MassMutual. That same year, he joined Reddit and began posting on the WallStreetsBets subreddit.","Gill gained widespread fame for his role in the GameStop short squeeze that occurred on January 27, 2021. Under his \"DeepFuckingValue\" account on Reddit, he earned a following for his investment in GameStop’s stock, his advocacy for the asset on social media, and his Roaring Kitty YouTube channel.","“FYI these positions are up in March,” Gill wrote in a Reddit post in 2020. “GME has been crushing the market on a relative basis.”","The stage was set.","At the time, the gaming retailer had been struggling financially, and many institutional investors and hedge funds believed its GME stock was overvalued, taking short positions on the GameStop stock. Short positions are an investment move where investors borrow shares and sell them, hoping to buy them back at a lower price and pocketing the difference.","At the time, a share of GME stock was worth about $5.16. Before the GameStop surge started, its share price was way down from its prior all-time high.","Users on the r/WallStreetBets subreddit, including Gill, noticed the rising number of short positions being placed on GME, sensing an opportunity to trigger a short squeeze. A “short squeeze” is when the price of an asset rises sharply, prompting traders who had bet on its price falling or “shorting” to liquidate or sell their positions.","While not single-handedly behind the GameStop short squeeze, Gill was a prominent figure in the conversation, having previously gone against the grain and deeming GameStop undervalued.","“People talk up the demise of GameStop, yet here they are about to generate over $2 billion in [revenue] in a single quarter at the tail end of a console cycle,” Gill, writing as DeepFuckingValue, wrote on Reddit. “The ‘shift to digital’ thesis is way overblown. This business model has legs, and the new consoles will be a major tailwind.”","As the price of GME rose, several firms that had bet against GameStop were forced to close their positions, including Melvin Capital, which lost nearly $3 billion for its GameStop shorting. SkyBridge Capital CEO Anthony Scaramucci compared the GameStop short squeeze to the French Revolution.","On January 28, the day after the GameStop short squeeze took place, Robinhood—the platform of choice for the legion of retail investors—was hit with two lawsuits after the trading platform blocked customers from purchasing more GameStop stock during its historic one-day run.","At the time Robinhood blocked the purchase of GameStop, the stock had already reached $492—but soon fell to $193.","On February 18, 2021, Gill was called to testify before the U.S. Congress House Committee on Financial Services. Joining him at the hearing were the CEOs of Robinhood and multinational hedge fund Citadel.","“It is true that my investment in that company multiplied in value many times. For that, I feel enormously fortunate.” Gill said during the virtual hearing. “I also believe the current price of the shares demonstrates that I\u0027ve been right about the company.”","Dispelling any notion that he was a cat, Gill also told the members of Congress that he is also not an institutional investor or a hedge fund.","“I do not have clients, and I do not provide personalized investment advice for fees or commissions,” he said. “I\u0027m just an individual whose investment in GameStop, and posts on social media are based upon my own research and analysis.”","Gill called the idea that he could use social media to promote GameStop stock and influence the market preposterous.","“My post did not cause the movement of billions of dollars into Gamestop shares,” Gill said. “It is tragic that some people lost money and my heart goes out to them. But what happened in January just demonstrates again that investing in public securities is extremely risky.”","Gill’s last Reddit post is dated April 16, 2021. He quietly left social media on June 18, 2021, after posting a video of sleeping cats on Twitter.","pic.twitter.com/lKvBItR8lE","— Roaring Kitty (@TheRoaringKitty) June 19, 2021","","It would be another 151 weeks before Roaring Kitty returned.","After the frenzy around the GameStop short squeeze fizzled out, the stock\u0027s price returned to earth. Currently, it is trading at $36.90.","GameStop did try to capitalize on the renewed interest in its business, even going so far as to make a push into cryptocurrency and NFTs. But the company’s crypto aspirations were short-lived as the firm shut down its NFT wallet in August 2023 citing regulatory uncertainty, and its NFT marketplace in January of this year.","The GameStop short squeeze and Roaring Kitty’s part in the chaos were the focus of both a documentary and a feature film. In September 2022, Netflix launched the streaming mini-series “Eat the Rich: The GameStop Saga,” which was followed in 2023 by the feature-length film “Dumb Money” starring Paul Dano as Roaring Kitty and Pete Davidson as Gill’s brother Kevin.","News of Roaring Kitty’s return inspired social media influencers like Andrew Tate dumping Bitcoin to invest their money in GameStop stock and meme coins. For his part, Tate said he would sell $500,000 in Bitcoin to invest in the latest GameStop short squeeze.","“I’m taking Wall Street down, watch me,” Tate said. \"Fuck ‘em. Fuck ‘em all.”","“Hey bro, what we buying?” Crypto Influencer Ansem asked in response to a Roaring Kitty tweet.","Even Barstool Sports founder David Portnoy was also ready to jump in.","“You wanna get nuts [Roaring Kitty] let\u0027s get nuts!” Portnoy wrote on Twitter. “Every time I think I\u0027m out they pull me back in!” he said, quoting a line from the Godfather Part III.","You wanna get nuts @TheRoaringKitty let\u0027s get nuts! Every time I think I\u0027m out they pull me back in! #GME #AMC #ddtg pic.twitter.com/5czVKpADmP","— Dave Portnoy (@stoolpresidente) May 13, 2024","","It\u0027s unclear why Gill chose Sunday to return to Twitter—or if he truly has. His Reddit and YouTube accounts are still fallow as of this writing, and since the Sunday post on Twitter, only a dozen video clips have followed until 8 p.m. ET on Monday. He did not respond to a request for comment from Decrypt.","But his apparent reemergence clearly riled up the GameStop gang, inspired a flood of meme coins on Solana, and stirred the broader meme coin market, which 5.4% for the day with several meme coins, including Dogecoin, Shibu Inu, and Pepe, up 5.7%, 5.0%, and 15.4%, respectively. That likely explained a nearly 8% intraday surge in the price of Solana, which rose from $138.16 to $149.99 on Monday.","If all this was sparked by a stream of video posts, markets may very well explode if Gill—or whoever currently controls the @TheRoaringKitty account on Twitter—starts tweeting explicitly about stocks or crypto.","Edited by Ryan Ozawa."],"create_date":"2024-05-14T01:38:12","tag":"keith gill,gamestop,Gaming,short squeeze,meme coins,wallstreetbets,Roaring Kitty,Dumb Money,GameStop stonks","author":"Decrypt / Jason Nelson"}
{"url":"https://decrypt.co/45150/the-best-bitcoin-wallets-hardware-software-and-mobile","web_url":"https://decrypt.co/","type":"article","description":"To become a Bitcoin holder, the first thing you’ll need is somewhere to hold it. Here’s what you need to get started on your Bitcoin journey.","title":"The Best Bitcoin Wallets: Hardware, Software and Mobile - Decrypt","content":["","","If you\u0027re reading these words, congratulations—you are, or about to be, the holder of some Bitcoin. To do so, however, you’ll need a Bitcoin wallet to store it in—which is why you’re probably here.","Working out which Bitcoin wallet is right for you can be a daunting undertaking; there are a lot of options out there, each with their own advantages and disadvantages. We\u0027ve rounded up some of the best options—but before that, let\u0027s kick off with the basics.","A Bitcoin wallet, like other cryptocurrency wallets, is a piece of software that allows you to store digital currencies (in this case, Bitcoin), as well as giving you the ability to view your balance, send, and receive more. In essence, it’s your private crypto bank account—but it’s completely under your control.","It works by storing your private and public keys—which in most cases, including Bitcoin, are 256-bit numbers, viewed to us as 64 hexadecimal characters in the ranges 0-9 or A-F.","Your private key is incredibly important, and should never be shared or haphazardly stored. If you lose or forget it, you’ll be locked out of your wallet with no way to access your funds, which is about as painful and as gut-wrenching an experience as you can imagine. Not your keys, not your wallet, as the saying goes.","Your public key, on the other hand, is what you share with senders or recipients, and allows people to send Bitcoin to your wallet address (a hashed version of your public key).","There are several different types of Bitcoin wallet, ranging from simple printed paper ones, to more advanced hardware wallets. Each has their advantages and disadvantages, from cost to security.","Ledger Nano X: Ledger made one of the first hardware wallets, and is a widely trusted brand. The Nano X comes complete with revamped innards, including improved memory, Bluetooth support, and a fresh new design with a larger display than its predecessor, the Ledger Nano S.","Read our full review of the Ledger Nano X","KeepKey: Offering excellent bang for your buck, the KeepKey is a great Bitcoin hardware wallet for first timers which manages to provide a premium look and feel despite its price tag. Easy to use, owners can access their assets directly on the device thanks to built-in ShapeShift functionality.","Read our full review of KeepKey","Trezor Model T: The Model T is one of Decrypt’s top-reviewed hardware wallets, and with good reason. This model steps things up from its predecessor, thanks to a larger touchscreen and support for a wider range of currencies (Bitcoin included). It might be pricey, but you get what you pay for—including a newly-launched desktop app, Trezor Suite.","Read our full review of the Trezor Model T","We are proud to introduce Trezor Suite public beta, an all-new desktop app for Trezor hardware wallets.","Expanding on each of our key pillars of security, usability, and privacy, the Suite ecosystem will be growing quickly.","Try it for yourself!https://t.co/EwVxDlS3NK","— Trezor (@Trezor) October 14, 2020","","Electrum: One of the original Bitcoin wallets, Electrum is an open source software wallet that’s compatible with Trezor and Ledger devices. While it shows its age with a rather bare-bones UI, it remains popular among power users thanks to its myriad of options, such as setting custom transaction fees.","SoFi: SoFi is a financial company that offers users the ability to buy, sell and hold Bitcoins and other cryptocurrency. Charging up to 1.25% of transactions as a markup, it has a beginner-friendly UI and is well-suited to buying and selling Bitcoin.","Exodus: A software wallet for your PC or smartphone, Exodus has one of the most polished interfaces around, and even has the ability to represent your portfolio with fancy graphs and charts. With no account setup you can get started right away, with your private key being stored directly on your PC.","BRD: Formerly known as BreadWallet, BRD is one of the best mobile wallets for beginners, thanks to its super simple interface, and no registration requirements. It might be basic for some power users, but it’s got everything you need to store, send, and receive Bitcoin, with zero hassle.","MyCelium: Users looking for more in-depth features will want to give MyCelium a go, thanks to its multitude of advanced privacy and security features. One of the safest wallets out there, though a bit intimidating for first-time users.","Coinbase Wallet: Coinbase is one of the first exchanges that Bitcoin neophytes come across, and with good reason; it’s one of the most accessible on-ramps to crypto out there. Its iOS and Android wallet is free to use, with the caveat that buying and selling crypto needs to go through the company’s own exchange."],"create_date":"2020-10-15T14:20:57","tag":"KeepKey,Ledger Nano S,Ledger Nano X,electrum,hardware wallet,hardware wallets,mycelium,mobile wallet,sofi,paper wallet","author":"Decrypt / Esat Dedezade"}
{"url":"https://decrypt.co/16035/ledger-nano-x-review-an-expensive-step-in-the-right-direction/","web_url":"https://decrypt.co/","type":"article","description":"The Ledger Nano X hardware wallet features Bluetooth, an OLED screen and support for over 1k crypto assets. But is it a cut above the Nano S?","title":"Ledger Nano X Review (2021): An Expensive Step In The Right Direction - Decrypt","content":["","","Since cryptocurrencies were invented over a decade ago, there have been many attempts to build more advanced, secure and user-friendly walletsto store them.","As of 2021, the current gold standard for security is known as a hardware wallet—a physical device that stores your cryptocurrency private keys in a secure offline environment.","One of the most prominent companies involved in moving the needle forward is Ledger, the firm behind the popular, but flawed Ledger Nano S hardware wallet—and the Ledger Nano X, its flagship device.","With a bigger screen, Bluetooth connectivity and a built-in battery, the Nano X is certainly an upgrade—but does it live up to the hype? Let\u0027s find out.","At 72mm x 18.6mm x 11.75mm with a weight of 34g, the Ledger Nano X is almost twice as large and more than twice as heavy as the Ledger Nano S.","One reason for the Nano X\u0027s greater bulk is that it has a built-in 100mAH battery, meaning that you can use it on the move—unlike its predecessor, which had to be plugged into a PC using a USB cable to draw power. Also filling out its frame are increased memory and a larger OLED screen.","As we can see, although the Ledger Nano X is far smaller than the KeepKey wallet and the Ledger Blue, it is noticeably larger than the Nano S and Trezor Model One. Nonetheless, it is still an incredibly small device, and is roughly comparable in size to a common USB pen drive.","Overall, the Ledger Nano X has a modern aesthetic that is similar to the Ledger Nano S, albeit more streamlined, since the buttons are now built into the body of the device and sit flush with the casing.","The Ledger Nano X comes supplied in a small cellophane-wrapped box, measuring approximately 80mm x 131mm x 31mm. Interestingly, Ledger chooses not to use tamper-evident seals on its packaging, stating that they\u0027re \"easy to counterfeit and can therefore be misleading.\"","Inside the box, you\u0027ll find the Ledger Nano X device (obviously), in addition to a braided USB A to USB C cable and a keychain strap. Documentation includes a getting started leaflet, three recovery sheets (for recording recovery phrases) as well as several stickers featuring Ledger branding.","The Nano X may be heftier than the Nano S, but it\u0027s still a small device. As a result, navigating through the on-device menu isn\u0027t exactly the simplest process in the world—particularly when considering the fact that it only has two buttons. However, the larger screen and controls make for a significantly less fiddly user experience than that of the Ledger Nano S.","Navigating the device\u0027s menu involves scrolling left or right using the left and right button respectively, or selecting options by pressing both buttons simultaneously. Beyond this, most of the action actually occurs on the associated Ledger Live application, with the Ledger device itself being mostly used for verifying addresses and authorizing transactions.","The Ledger Nano X\u0027s larger screen resolves one of the most common gripes about the Nano S, since crypto addresses can now be displayed in their entirety instead of requiring you to scroll. One niggling issue is that the Nano X ships with a relatively short USB cable—just 50cm long, which can make it difficult to use if your computer isn\u0027t in a convenient location.","To begin using the device, you\u0027ll first need to download and install the Ledger Live client for your operating system. This is currently available for most desktop operating systems including Windows, Mac OS, Linux, as well as mobile operating systems like iOS and Android.","Once Ledger Live is up and running, you can power up the Ledger Nano X device by holding the left button, after which you\u0027ll be able to navigate through the startup screens to configure the device.","This will involve choosing a 4 to 8 digit PIN code, and backing up and verifying the randomly generated 24-word recovery phrase shown on the device. Overall, this process takes around 5 to 10 minutes, and only needs to be completed once.","By default, the device doesn\u0027t ship with any preinstalled wallet apps. Instead, these need to be manually downloaded by connecting the Ledger Nano X with Ledger Live. Thanks to its Bluetooth capabilities, the Ledger Nano X is able to pair with mobile devices running Ledger Live wirelessly; if you\u0027re using the device with a desktop PC, you\u0027ll have to use the supplied USB cable.","As a hardware wallet, the Ledger Nano X is primarily designed for the safe storage of cryptocurrencies and other crypto assets. Because of this, the Ledger Nano X is compatible with practically every major cryptoasset, while support for new assets is added regularly.","The Ledger Nano X also overcomes one of the major limitations of its Ledger Nano S, by bumping the available internal memory from 320kb up to 2048kb. This allows users to store up to 100 apps on their device at once—considerably more than the 3 to 7 simultaneous apps the Ledger Nano S could hold. This means the Ledger Nano X can currently hold the entire app library simultaneously—avoiding the need to manually remove and switch out apps due to memory constraints.","While the vast majority of these apps allow the wallet to hold additional cryptocurrencies and tokens, a handful impart additional functionality to the Nano X. For example, the FIDO U2F app turns the device into a two-factor authentication key, whereas the recovery check app can be used to ensure you have correctly saved your recovery phrase.","Moreover, the Ledger Nano X is the first cryptocurrency hardware wallet to include a built-in 100mAH battery, a necessary upgrade since the device now features Bluetooth connectivity out of the box. This allows the device to connect to mobile devices wirelessly, whereas the older Ledger Nano S could only connect to mobile devices using a Ledger OTG Kit.","With the addition of wireless connectivity, increased memory, and a much larger screen, Ledger has clearly paid attention to the shortcomings of its earlier products and is trying to make safely storing crypto assets a less challenging task.","The Ledger Nano X is compatible with well over 1,000 digital assets, including 23 coins and all ERC-20 tokens. Many of these can be managed through Ledger Live, whereas some require the Ledger Nano X to be used in conjunction with a compatible wallet. Supported crypto assets include;","The Ledger Nano X supports practically every crypto asset supported by the Ledger Nano S, but is able to hold more of the relevant wallet apps at any one time thanks to its expanded internal memory.","As such, the Ledger Nano X is ideal for securing diverse portfolios, though individuals looking to store newly released crypto assets may need to wait until Ledger adds support for them.","As a hardware wallet, the Ledger Nano X targets the minority of cryptocurrency users that value security above all else. As such, the team behind the product has clearly put a great deal of thought into the potential ways such a device could be attacked, and have incorporated a huge number of potential safeguards into its design.","Like all Ledger devices, the Nano X features state-of-the-art security and incorporates a physically isolated security element certified as CC EAL5+. These secure elements are similar to those used to secure credit and debit cards, and are the standard used by banks for the protection of financial information.","The device also features a dual-core MCU which runs a proprietary operating system known as BOLOS and controls communication between the connected device and the Ledger secure element.","Although the addition of Bluetooth theoretically increases the number of potential entry points hackers could use to compromise the device, the Ledger Nano X encrypts Bluetooth traffic between the mobile device and requires manual verification for all important device actions.","Beyond this, Ledger\u0027s Nano X and Nano S are the only hardware wallets to receive CSPN (First Level Security Certificate) certification, which means their security has been independently certified by ANSSI—the National Cybersecurity Agency of France.","These hardware-based security measures are also supplemented with several software-based ones, including a 4-8 digital security PIN, automatic inactivity lockouts and an optional Ledger Live password lock.","Overall, the Ledger Nano X is without question one of the most secure cold storage solutions on the market.","However, although its devices offer a high level of security, Ledger has experienced some security lapses as a company.","In June 2020, data from the company\u0027s e-commerce database was leaked, resulting in over a million customer records being posted to hacker forums. Some quarter of a million records included details such as physical addresses and phone numbers—exposing Ledger customers to the threat of phishing attacks and even threats.","Recently, we shared news of a data dump. On December 23, we were alerted by our e-commerce provider Shopify about an incident in April & June \u002720 where their rogue team members exported merchants\u0027 customer databases. Ledger was included. More details: https://t.co/NHU3IbDL0a pic.twitter.com/DHQQ9arxCu","— Ledger (@Ledger) January 13, 2021","","While Ledger has committed to changing how it handles customer data and identifying and prosecuting those responsible, it\u0027s an embarrassing lapse for a company whose business is the security of your crypto.","The Ledger Nano X is currently available for purchase from the official Ledger website for $119. With that said, it can often be found for cheaper at authorized third-party retailers as well as official resellers on Amazon. You should exercise caution when purchasing any hardware wallet, making sure to only purchase from authorized sources, and never using any hardware wallet that has already been configured.","At twice the price of the Ledger Nano S, the Nano X is one of the more expensive hardware wallets on the market. If portability and usability are your top concerns, it\u0027s probably worth the hit on your wallet—but if you\u0027re already happy with the Ledger Nano S, there\u0027s little reason to upgrade.","The addition of Bluetooth and massively expanded internal memory are steps in the right direction, whereas the huge range of supported cryptocurrencies means that even the most diverse cryptocurrency investors can secure their entire portfolio.","The Ledger Nano X is an excellent product marred only by its high price tag; those in the market for a less expensive alternative may want to take a look at the cheaper, but dated Ledger Nano S.","Rating: 4/5"],"create_date":"2021-02-26T18:15:27","tag":"ledger,hardware reviews,hardware wallet,hardware wallets,review,Reviews,bitcoin hardware wallet,best ethereum wallet,crypto hardware wallets","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/230509/dogecoin-pumps-gamestop-rally-memes-frenzy","web_url":"https://decrypt.co/","type":"article","description":"Dogecoin and political meme coins are booking significant gains amid the GameStop stock resurgence, with some Donald Trump coins up 30% or more.","title":"Dogecoin Pumps as GameStop Rally Kickstarts Memes Frenzy - Decrypt","content":["With the frenzy around meme coins back following the rally of the GameStop stock, the original meme coin Dogecoin is up 8% over the last 24 hours, according to CoinGecko. DOGE started Monday priced around $0.13 before climbing above $0.15 as of this writing.","The broader meme coin market is up 10% on Monday, with the Ethereum-based Shibu Inu (SHIB) trading at $0.000024, up 7%, and Pepe (PEPE) at $0.00001, up 21%. Meanwhile, the Solana-based Dogwifhat (WIF) is sitting at $3.27, up 8%, with Floki (FLOKI) on Ethereum trading at $0.00019, up 11%.","Political meme coins (PolitiFi) are also up 20%, according to CoinGecko. Leading the charge are former U.S. President Donald Trump-themed meme coins, including the MAGA (TRUMP) token, currently trading at $8.41, up 31% for the day. Doland Tremp (TREMP) is sitting at $0.65, up 3%; and MAGA VP (MVP) is currently priced at $0.36, up 64%.","An Ethereum wallet tied to Donald Trump now holds nearly $5 million in MAGA (TRUMP) tokens. In total, the wallet belonging to the 2024 presidential candidate holds almost $7 million in crypto, according to blockchain analytics firm Arkham Intelligence. At its peak, the Trump-affiliated wallet held about $8.5 million worth of crypto assets.","While Trump meme coins are surging, the President Joe Biden-themed “Jeo Boden” (BODEN) meme coin is down 21% for the day at a current price of $0.27.","Last week, Trump gave a nod of approval to cryptocurrencies during an event with his NFT holders at the former president’s Mar-a-Lago resort in Florida.","Trump told the gathered collectors that he intends to stop the hostility toward crypto if elected to a second term this year, with the presumptive Republican candidate saying that if America is going to embrace the technology, then the industry has to be rooted in the country.","Analysts with British banking firm Standard Chartered recently suggested that a Trump victory in November would be good for Bitcoin and its future price projections.","“[Gary] Gensler is very much against it, the Democrats are very much against it,” Trump said. “But I’m good with it.”","Edited by Andrew Hayward","Disclaimer","The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."],"create_date":"2024-05-13T16:54:37","tag":"Donald Trump,Joe Biden,dogecoin,gamestop,solana,politics,meme coins,Breaking Push,Jeo Boden","author":"Decrypt / Jason Nelson"}
{"url":"https://decrypt.co/resources/what-are-privacy-coins-monero-zcash-and-dash-explained","web_url":"https://decrypt.co/","type":"article","description":"So-called privacy coins use advanced techniques to shield details from public view, but they’ve come under increased scrutiny from regulators.","title":"What Are Privacy Coins? Monero, Zcash, and Dash Explained - Decrypt","content":["The pseudonymous nature of Bitcoin addresses enables transactions without identifying personal information, but that doesn’t make it a completely anonymous cryptocurrency. Because the entire transaction history lives in public view on a blockchain, it can be possible for investigators and firms to piece together people\u0027s identities based on the movement of coins and details held within addresses.","That’s where so-called privacy coins come in. Cryptocurrencies like Monero (XMR), Zcash (ZEC), and Dash (DASH) use varying cryptographic techniques to obscure details around transactions and better shield users from prying eyes.","Advocates of privacy coins argue that they can be used for perfectly legal purposes by anyone eager to avoid potential oversight by external parties, enabling the user to control what information they choose to share with companies and organizations. Furthermore, privacy coins bring the level of transactional privacy already enjoyed by users of physical cash to the digital economy.","However, the flip side is that privacy coins have become popular for ransomware payments, criminal transactions on the dark web, and money laundering. As a result, they\u0027ve attracted significant attention from law enforcement and regulators. Here’s a look at how privacy coins work and the most popular coins today.","Varying privacy coins work in different ways, but the end goal is the same: they’re all designed to hide details like addresses and amounts transacted, so that it is extremely difficult if not impossible to piece together which parties participated in a transaction.","Some privacy coins create a new, single-use address for each transaction called a “stealth address,” so that there is no apparent way to link multiple transactions to a single source. Another technique called zk-SNARK (Zero-Knowledge Succinct Non-Interactive Argument of Knowledge) uses advanced cryptography to encrypt identifying information. You can read much more about zk-SNARKs here.","Ring signatures are used by some coins, including Monero. They link together multiple user addresses to anonymously sign transactions without revealing which address ultimately signed it. Meanwhile, Mimblewimble—which, yes, really is named after a Harry Potter spell—is a streamlined blockchain design approach that keeps a more compact history than traditional blockchains, and does not reveal identifying information to the public.","Some coins also use a process called “CoinJoin” that mixes together transactions from various senders and then disburses the funds across recipients. CoinJoin is also available as an optional mixing service for Bitcoin, which helps obfuscate transactions.","Litecoin, which is not currently a privacy coin, may implement MimbleWimble as an opt-in privacy feature. As of March 2021, the proposed upgrade was code-complete and ready for auditing.","Monero: Monero is the best-known privacy coin and has the largest market cap of the bunch, as of this writing. Forked from an earlier coin called Bytecoin in 2014, Monero anonymizes critical details such as both the sender and recipient, as well as the amount of the transaction, using techniques such as ring signatures and single-use addresses. Each coin is also fungible, unlike with Bitcoin, because they are indistinguishable and have no traceable history.","Monero is a favorite of hackers and is often used for ransomware demands, plus it thrives on the dark web: the popular White House market only accepts Monero, for example.","Zcash: Heavily influenced by Bitcoin (and featuring the same 21 million coin cap), Zcash implements zk-SNARKs to ensure that all needed conditions are met for a valid transaction without exposing any personal, confidential data. Zcash offers multiple transaction types ranging from fully public to fully private, so it’s potentially more regulatory-friendly than Monero, and fully shielded transactions can include private memos, as well. Zcash development is led by the for-profit Electric Coin Company.","The #zcash privacy set continues to grow. In general, the more shielded outputs in a given pool, the more difficult it is to link transactions that interact with that pool. https://t.co/J1OnIPjK66","— Electric Coin Company 🛡️ (@ElectricCoinCo) May 20, 2021","","Dash: Forked from Bitcoin with the aim of improving upon the original cryptocurrency, Dash can mix multiple transactions with CoinJoin (called PrivateSend) to obscure potentially identifying details. Dash similarly makes its privacy features optional, and also has an InstantSend option for rapid transactions that are confirmed within two seconds. Dash has found popularity in countries that have seen enormous inflation with their respective fiat currencies.","Dash was previously called Darkcoin. Given the name\u0027s association with dark web marketplaces and other nefarious purposes, it was unsurprisingly renamed to Dash in 2015.","Coins that enable anonymity, like the privacy coins mentioned in this article, have been banned in Japan and South Korea. They are currently legal in other jurisdictions where cryptocurrency is more broadly legal, but some exchanges are wary of potential battles with regulators ahead.","Dash is continually being used more and more... Q1 2021 growth:","Median economic transactions per day: +5.8% QoQ / +38.0% YoY Median transactions per day: +1.4% QoQ / +35.0% YoY","This was the 10th consecutive quarter of #DASH transaction growth.","— Ryan Taylor (@RTaylor05) April 5, 2021","","In June 2020, Coinbase founder CEO Brian Armstrong admitted that he personally wanted to list Monero, but that “behind-the-scenes conversations” with regulators convinced him that it wasn’t a battle worth waging right now. “We don’t know if this is a hill we want to die on, and we have to make a lot of tough calls like that,” he said. However, Armstrong believes that regulators will become more comfortable with privacy coins over time.","Fellow exchange ShapeShift delisted Monero and Dash in November 2020, while Bittrex delisted Monero, Zcash, and Dash in January 2021. The latter cited “evolving regulatory standards and other compliance issues” as part of its reasoning for delisting privacy coins. As of this writing, popular exchanges Binance and Kraken both list all three leading privacy coins.","Along with the perceived threat of additional regulation, government agencies and analytics firms are also stepping up their attempts to crack privacy coins. In September 2020, the United States Internal Revenue Service (IRS) confirmed that it had awarded a pair of contracts worth as much as $1.25 million in total to firms attempting to develop Monero tracing tools.","In November 2020, blockchain forensics firm CipherTrace—which works with the US Department of Homeland Security—filed patent applications for Monero tracing tools. And in May 2021, Norway’s National CyberCrime Center revealed that it was trying to crack both Monero and Dash in a missing persons case. Whether any of these efforts produce reliable tracing tools remains to be seen, but there’s a lot of government interest in finding ways to break open privacy coins.","All the while, these coins are gaining popularity. Monero’s price soared 30% in May 2021 after the U.S. government announced a proposal to make businesses report high-value crypto transactions. Many crypto traders seemingly want to keep their transactions truly private, even amidst seeming regulatory and compliance challenges ahead.","To learn more about the technologies underpinning privacy coins, and the coins themselves, check out:"],"create_date":"2021-05-31T11:09:52","tag":"monero,privacy,privacy coin,mimblewimble,Dash,Zcash,zero knowledge proofs,zk-SNARK","author":"Decrypt / Andrew Hayward"}
{"url":"https://decrypt.co/17576/keepkey-wallet-review-cheap-and-cheerful","web_url":"https://decrypt.co/","type":"article","description":"Although dated, the KeepKey wallet\u0027s combination of features and low price make it a worthwhile budget option.","title":"KeepKey Wallet review: Cheap and cheerful - Decrypt","content":["In the more than a decade since Bitcoin was released, the number and variety of cryptocurrencies available has increased dramatically, as has their value—leading to the emergence of cryptocurrency hardware wallets, secure devices that store many different types of crypto.","ShapeShift\u0027s KeepKey was one of the first hardware wallets to market, and remains a popular choice to this day. The KeepKey wallet was considered a premium option at launch, but now retails for $49 (or even less, if you go hunting for a discount code).","Can the KeepKey still keep up with today\u0027s competition? Let\u0027s find out.","The KeepKey features a robust design aesthetic that will appeal to those who prioritize form over function. The case exterior is composed of anodized aluminum, while the screen is surrounded by a polycarbonate casing. It\u0027s well-built, with a reassuring heft that you would expect from a device constructed with premium materials.","Around the back, the KeepKey sports a matte finish and a prominent KeepKey logo.","Compared to other hardware wallets, the KeepKey is certainly on the large side, measuring 38 mm x 93.5 mm x 12.2 mm, and weighing in at 54g. It\u0027s over twice the size of its major competitors, the Ledger Nano S and Trezor One, making it rather less portable. However, the KeepKey\u0027s bulk does mean it can accommodate a relatively large 3.12 inch OLED display.","Despite its size, the KeepKey is clearly designed with minimalism in mind, since the only other notable features besides its large screen are a single button and microUSB port. Like the majority of hardware wallets, the KeepKey lacks an IP rating, which means you\u0027d be wise to keep it well away from water or excess moisture.","The KeepKey wallet comes in a cellophane-wrapped box, sealed with a holographic security sticker that proves the contents haven\u0027t been tampered with. Inside the box, you\u0027ll find the KeepKey device, in addition to a 3 foot (1 meter) braided USB cable and a warranty booklet.","The KeepKey also comes with a single recovery card, used for recording the 12-word recovery phrase provided when initializing the device.","Like most hardware wallets, the KeepKey is designed to be simple to use. Indeed, beyond the initial setup process, you should rarely need to touch the KeepKey after connecting it to your computer.","Instead, the vast majority of interactions are handled on the Shapeshift beta website, or through the KeepKey client app. These are both intuitive to use and will be immediately familiar to anybody who has used Exodus wallet—since Shapeshift has a very similar layout.","Through the ShapeShift platform and Keepclient Chrome app, you can directly manage your assets, initiate transfers, trade cryptocurrencies and more. Anything that involves moving funds or changing security settings requires confirmation on the KeepKey device.","The KeepKey device itself has only a single button, which is used for confirming selections made on the connected computer. Overall, the KeepKey is one of the simplest wallets we have tested, making it suitable for those that want to skip the learning curve, but still benefit from the security that comes with cold storage.","Like most hardware wallets, the KeepKey has a relatively quick set-up process before you can get up and running.","To begin with, you\u0027ll need to connect the KeepKey to your computer using the supplied microUSB cable, and navigate to the ShapeShift website. Here, you will need to pair your device with the KeepKey website to begin the device initialization process.","During this process, you\u0027ll need to choose a label for your device, select a PIN and backup your recovery phrase. For anybody familiar with the Trezor wallet, the KeepKey uses a similar system for setting up the device PIN, by displaying a numerical grid on the KeepKey screen, along with a blank grid on the computer which you\u0027ll use to select your PIN sequence.","Once you\u0027ve confirmed your PIN, the KeepKey will display your 12 to 24 digit recovery phrase. This can be used to recover your wallet should you ever lose access to your KeepKey devices, and as such, should be kept completely confidential. Once you\u0027ve recorded your recovery phrase, it\u0027s just a matter of holding down the KeepKey button until it displays a check. When it\u0027s done, your device addresses will sync, and you\u0027ll be redirected to your dashboard on the ShapeShift website.","Note: Unlike most hardware wallets, the KeepKey doesn\u0027t require you to validate your recovery phrase during set-up. Because of this, it is important to be absolutely certain you have recorded the correct phrase before using the wallet.","One of the KeepKey\u0027s standout features, and potentially one of the main reasons anybody might consider buying one, is its integration with ShapeShift. It means that users can send and receive a decent variety of cryptocurrencies directly on their wallet, as well as directly exchange one cryptocurrency for another.","Although the hardware wallet can be used with the ShapeShift exchange to directly exchange assets on the device, users will need to sign up as a ShapeShift member to do so. This is free, and is only required for users that want to use the built-in exchange functionality.","The KeepKey wallet is compatible with most major operating systems, including Windows, MacOS, and Linux. It can also be used with OTG-compatible Android devices through an OTG cable, but this requires connecting the KeepKey to a compatible third-party wallet like Mycelium.","Since the KeepKey is one of the oldest hardware wallets still being sold, it lacks many of the features now considered standard in modern wallets, including a color screen, wireless functionality, and an internal battery. Unlike many other hardware wallets, including those made by Satoshi Labs and Trezor, the KeepKey lacks 2FA and U2F functionality, and hence cannot be used as a two-factor authentication device.","As such, the KeepKey wallet is largely restricted to its primary function as a cold storage device. Anybody looking for premium features will need to look elsewhere.","The KeepKey wallet natively supports eight different blockchains. As it stands, the following blockchains are supported by the KeepKey:","Although the KeepKey supports a good range of cryptocurrencies, there are some notable omissions from its roster, including XRP, Bitcoin SV (BSV), EOS, Monero (XMR) and Tron (TRX). ShapeShift sometimes adds support for other digital assets, but new additions appear to be few and far between nowadays.","The KeepKey wallet is also compatible with MyEtherWallet, enabling users to store all ERC20 tokens directly on their device. The full list of supported cryptocurrencies can be viewed here.","Like all other hardware wallets, the KeepKey is designed to keep your funds offline—a security method known as cold storage. This essentially keeps your funds secure, even if the device the KeepKey is connected to is infected with malware. To help achieve this, the device features a secure microcontroller which is used to isolate privacy keys from any online attacks.","To add an additional layer of security to the KeepKey wallet, you can also configure an optional passphrase for the device, which is essentially like a 13th word added to the 12-word recovery phrase provided during setup. Adding a passphrase is the equivalent of creating a new wallet on the device; nothing from the 12-word phrase will be carried over, but it will still be accessible by initializing the device and entering a blank passphrase.","Unlike most other hardware wallet manufacturers, Shapeshift is notably tight-lipped about the other security considerations present on the KeepKey hardware. Because of this, it is not possible to fully explore how well protected the device is. A recent security flaw identified by Kraken can allow an attacker to extract the encrypted 12-word seed, which could then be decrypted by brute-forcing the PIN.","Kraken Security Labs has found a way to extract seeds from a KeepKey cryptocurrency hardware wallet. Full story here:https://t.co/iPMKNhG2Jg","— Kraken Exchange (@krakenfx) December 10, 2019","","Although Shapeshift says the device only works with a PIN up to 9 digits long, we found that it could be configured with a longer PIN; during our setup, we were able to create a 12-digit PIN with no issues. This would make it far harder to brute-force the PIN.","Enabling a passphrase protects the device against the attack identified by Kraken, while the device remains secure against all known online attacks. In any case, it is wise to ensure that your device is stored securely, since the aforementioned Kraken exploit requires physical access to work.","Anybody that stores a significant amount of cryptocurrency should consider purchasing a hardware wallet. As it stands, they are simply the safest way to store cryptocurrencies. However, exactly which hardware wallet you choose depends on your specific needs.","Overall, the KeepKey is arguably one of the most basic hardware wallets on the market. It lacks premium features like a touchscreen interface and Bluetooth connectivity, but does include built-in exchange functionality thanks to its ShapeShift integration.","The KeepKey lacks support for more than a few prominent cryptocurrencies, which can make it unsuitable for those with a diverse portfolio—particularly one including privacy coins.","With that said, these faults are largely offset by its low price. With discount codes bringing the price down to just $24.50, the KeepKey is easily one of the cheapest hardware wallets on the market, and clearly isn\u0027t directly competing with more feature-packed, but also more expensive wallets like the Ledger Nano X or Trezor Model T.","Instead, the KeepKey is designed for those on a budget, or with a relatively small portfolio that doesn\u0027t warrant the $100+ some other wallets cost. With that in mind, the KeepKey is one of the better hardware wallets available in its price range, and is certainly worth a look while on discount."],"create_date":"2020-02-09T14:00:30","tag":"KeepKey,ledger,hardware wallet,Shapeshift,Trezor","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/95319/ledger-nano-s-plus-review-a-top-hardware-wallet-refreshed-for-2022","web_url":"https://decrypt.co/","type":"article","description":"Ledger\u0027s base-model hardware wallet gets a long-overdue update, adding a bigger screen and increased storage capacity.","title":"Ledger Nano S Plus Review: A Top Hardware Wallet Refreshed for 2022 - Decrypt","content":["","","Since the Ledger Nano S was first launched in 2016, a lot has happened in the cryptocurrency world.","Bitcoin\u0027s price has gone from $700 to an all-time-high of nearly $70,000. Ethereum, then less than a year old, is now a mainstay of the crypto space, underpinning ICOs, NFTs, DAOs and other three-letter acronyms that have come to define cryptocurrency for the mainstream.","And through it all, Ledger\u0027s trusty little workhorse has trudged on, with millions of users trusting the hardware wallet to secure their private keys, squinting at its tiny screen as they send crypto to and fro.","Now, Ledger\u0027s best-selling hardware wallet is getting a long-overdue refresh. So what\u0027s new—and can it compete in 2022?","The Ledger Nano S Plus is an updated version of the French company\u0027s entry-level Ledger Nano S hardware wallet, with a refreshed design incorporating a larger screen and revised internals. The base level Nano S will be retired later this year, leaving the S Plus as the entry-level option for the range.","Priced at $79, the Nano S Plus sits neatly in between the $59 Nano S and the top-of-the-line Ledger Nano X, at $119.","In case you missed the news - the Nano S Plus is now available! 🎉","To celebrate, we’re taking you on a journey inside our latest device, so you can learn why it\u0027s so special.","Today we stop by Lacroix, the plant where our circuit boards are programmed: https://t.co/uq5fWzjmEF pic.twitter.com/qKmcUiUAw4","— Ledger (@Ledger) April 11, 2022","","If you\u0027ve seen a Ledger Nano wallet before, then you\u0027ll know what to expect. The hardware wallet resembles a chunky USB flash drive, with an aluminum shield that rotates to reveal the main body of the device. Although it\u0027s currently available only in black, Ledger will be releasing the Nano S Plus in different colorways later in the year, with options including white, red, blue and a translucent case.","While it\u0027s no Jony Ive product design masterpiece, it\u0027s discreet, and it\u0027s a lot nicer looking than some of its rivals. Etched into the aluminum shield is Ledger\u0027s new logo, following a rebrand in late 2021; it\u0027s a bit slicker than the old logo, and more self-consciously \"crypto.\"","The Nano S Plus sports a more curved design with rounded-off buttons. It also features a USB-C port, as seen on the Nano X, in place of the old micro-USB found on the Nano S.","Most importantly, the Nano S Plus boasts a much bigger screen than the base model Nano S—the same 128 x 64 pixel screen found on the Nano X, in fact. At twice the height of the Nano S model\u0027s 128 x 32 pixel screen, that means no more scrolling through wallet addresses across multiple screens when trying to send crypto.","As Nano X users will know, it\u0027s also much clearer and sharper than the tiny, fiddly affair seen on the Nano S, with graphics and text rendered in crisp black and white, instead of blue and white.","Since Ledger\u0027s rebrand it\u0027s abandoned the faux-Apple packaging in favor of a sleek gray-and-black affair. Ledger doesn\u0027t use an anti-tamper seal, arguing that they can be easily counterfeited and are misleading; instead, the box is shrink-wrapped.","Crack the packaging open and you\u0027re greeted with a quick start guide (which basically tells you to download the company\u0027s Ledger Live app), an envelope containing cards to record your recovery phrase, a USB-C cable, a loop for attaching your Ledger to a keyring, and the ubiquitous brand stickers found in every tech product box.","Everything feels high-quality—the USB-C cable is braided, the packaging is well-designed and there are jazzy accent colors everywhere (you\u0027re not going to misplace that bright orange recovery phrase envelope, that\u0027s for sure, unless you accidentally throw it out).","To set up the Ledger Nano S Plus, you\u0027ll first need to navigate to Ledger\u0027s website on your computer and download the Ledger Live application, which will require you to set up a password.","Once you\u0027ve done that, you\u0027ll need to connect your Ledger to your computer.","While Ledger Live provides a handy walkthrough for beginners, the bulk of the setup steps are performed on the device itself. First, you\u0027ll need to choose whether you\u0027re setting it up as a new device, or restoring it from a recovery phrase. Then, you\u0027ll need to set up a PIN.","To navigate through the menus, you use the two buttons on top of the device; clicking both buttons simultaneously selects the current option.","If you\u0027re setting the Nano S Plus up as a new device, you\u0027ll be prompted to note down your 24-word recovery phrase, then verify each word in turn. This is a laborious, but necessary, process; technically speaking the 24-word phrase is your wallet; the Ledger device itself is just a means of accessing it.","As Ledger repeatedly tells you, that means if you lose your recovery phrase, you lose access to the funds in your wallet; Ledger has no way to help you.","For the same reason, you should never, ever share your recovery phrase with anyone, enter it into any apps or websites, take a photo of it, or save it to cloud storage. Anyone who has those 24 words has access to your wallet and all the funds in it.","Once your device is set up, you can connect to Ledger Live, where you\u0027ll be prompted to verify that it\u0027s a genuine Ledger device.","Your main point of interaction with the Ledger Nano S Plus will be the desktop Ledger Live software, which is a nicely-designed, streamlined affair.","Like the Nano S, the Nano S Plus doesn\u0027t have the Bluetooth connectivity and internal battery found in the Nano X, meaning you\u0027ll need to connect it to your computer using a USB-C cable. The one supplied in the box is a lot nicer than the flimsy micro-USB cable that came with the Nano S, but it\u0027s a bit short—clearly aimed with laptop users in mind rather than desktop owners.","You can also buy a Ledger OTG kit (or use an appropriate cable) to connect your device to an Android phone using the Ledger Live app; iOS users are out of luck, however.","To add apps to your newly-installed Ledger, you\u0027ll need to click on \"Manager\" in the left-hand sidebar of Ledger Live. You\u0027ll then be prompted to \"Allow Ledger Manager\" on the hardware wallet itself. From there, you can check that your device is running the latest firmware, update it if it isn\u0027t, and add or update apps.","Apps effectively represent cryptocurrencies, such as Bitcoin and Ethereum. Installing an app prompts you to add an account, which appears in the \"portfolio\" section of Ledger Live.","With your apps installed, you can buy crypto directly through the Ledger Live app\u0027s \"buy/sell\" option using their supported providers, or send and receive crypto. This entails navigating to the \"accounts\" section of Ledger Live and clicking on the relevant account, or using the \"send\" and \"receive\" buttons in the sidebar.","You\u0027ll also need to open the app for the crypto in question on your Nano S Plus.","Sending or receiving crypto prompts you to confirm the sending or receiving address on your Nano S Plus device. Even with the bigger screen, it can be a fiddly affair, though at least you no longer have to click through multiple screens to see the whole address.","As well as Ledger Live, you can also use the Nano S Plus with over 50 web wallets such as MetaMask, MyEtherWallet and MyCrypto.","The Nano S Plus supports the same 5,500+ coins and tokens as the Ledger Nano S and X models, via Ledger Live.","These include, among others:","The original Nano S could only store up to three apps on the device at any given time—which was fair enough in 2016, when the number of cryptocurrencies was limited. Nowadays, with thousands of assets available, that\u0027s not sustainable; happily, the Nano S Plus sports a much healthier 1.5MB storage capacity, allowing for multiple apps to be stored on the device simultaneously (though only about 1.28MB is actually available for apps).","The Nano S Plus sports the same security credentials as its Ledger stablemates; that is to say, a physically isolated secure element that\u0027s CC EAL 5+ certified. That means they\u0027ve been independently certified by a third party to the same standard as the secure elements used in credit cards, passports and SIM cards; EAL 5+ is considered the highest level of security against penetration tests.","The Nano S Plus and its stablemates are also the only hardware wallets to receive CSPN (First Level Security Certificate) certification, from ANSSI—the National Cybersecurity Agency of France.","Ledger devices use a proprietary operating system, BOLOS, that requires users to verify transactions on the hardware wallet itself, while displaying the transaction details on-device. This ensures that should your computer be compromised, the Ledger will still show the correct transaction details.","The company runs bounty programs to identify vulnerabilities in its products, and maintains an in-house \"attack lab,\" the Ledger Donjon.","For the extremely security-conscious user, the Nano S Plus also requires a physical connection to a computer or mobile device, unlike the premium Nano X model. While Ledger maintains that the Nano X\u0027s Bluetooth connection is only used to transport public data, and that wallet private keys and the seed remain in the device\u0027s secure element, for some users Bluetooth connectivity represents a potential vulnerability too far.","For these users, the Nano S Plus offers a neat compromise between the hardware upgrades of the Nano X while maintaining the physical-only connection of the Nano S.","While Ledger\u0027s on-device security is extremely tight, the company has suffered some security lapses, notably in June 2020 when over a million customer records were leaked from an e-commerce database. Ledger subsequently committed to changing its procedures for handling customer data, but it remains an embarrassing blot on the company\u0027s record.","Ledger\u0027s base-model hardware wallet was long overdue for a refresh. With the Nano S Plus, it\u0027s achieved a balance between overhauling outdated components without resorting to the (some would say, unnecessary) bells and whistles of the premium Nano X model.","Unless you desperately want the convenience of Bluetooth connectivity, or the ability to use your Ledger with iOS devices, the Nano S Plus is the only device you\u0027ll need. And with its enlarged screen and increased storage capacity, it\u0027s leagues ahead of its predecessor the Nano S.","For most users, the Nano S Plus is an ideal storage solution for your digital asset portfolio, and comfortably ranks among the best hardware wallets in the market."],"create_date":"2022-06-09T15:00:32","tag":"ledger,Ledger Live,Ledger Nano S,Ledger Nano X,hardware wallet,hardware wallets,Ledger Nano S Plus","author":"Decrypt / Stephen Graves"}
{"url":"https://decrypt.co/26749/the-best-crypto-metal-wallets-you-can-buy-now","web_url":"https://decrypt.co/","type":"article","description":"Your cryptocurrency is only as secure as your seed phrase. We review some of the most popular metal wallets designed to keep it safe.","title":"The best crypto metal wallets you can buy now (UPDATED) - Decrypt","content":["When it comes to safely storing cryptocurrencies, hardware crypto wallets are generally considered to be the gold standard for secure storage and accessibility.","Although cold storage devices like the Ledger Nano X and Cobo Vault are certainly a secure way to store digital assets, ultimately they\u0027re only as secure as the seed phrase they use to access and manage these assets. This seed phrase is usually a 12 to 24-word phrase that can be used to generate all of the addresses and private keys associated with a wallet when recovered. Most hardware wallets ship with a card that can be used to record this seed phrase, but this can be damaged or lost, making it impossible to recover the wallet.","That\u0027s where metal wallets and other more robust seed storage kits come in. They\u0027re used to protect seed phrases, private keys, and other sensitive information against damage, ensuring it remains intact even under extreme conditions. Like hardware wallets, there are now a huge variety of different seed storage solutions on the market, each of which promises to keep your seed phrase protected against myriad threats, such as natural disasters and fires.","We\u0027ve rounded up some of the best seed storage options on the market for our review.","If there is one name that\u0027s practically synonymous with the term \"metal wallet,\" it\u0027s CryptoSteel. Billed as the \"mother of all backups\", the CryptoSteel Capsule is an incredibly secure offline storage solution for cryptocurrency private keys, mnemonic phrases, passwords and practically anything else that can be expressed with uppercase and lowercase letters, as well as symbols and spaces.","The CryptoSteel Capsule is rated fireproof up to 1400°C/2500°F, completely waterproof, and can resist extreme crushing and shocks. The unit measures in at 102 mm in length and 16 mm in diameter, making it both portable and inconspicuous.","The capsule comprises a hollow shell with an internal core—or rail—which is used to hold individual tiles, each of which is engraved with a single letter or symbol. These tiles are placed onto the rail in the correct sequence and are secured with a fastener—this simply prevents the tiles from falling off the core, ensuring they stay in their correct order. The CryptoSteel Capsule can store up to 123 characters of information, sufficient to hold an entire 12-word recovery seed or an abbreviated 24-word one.","As its name suggests, the CryptoSteel Capsule is a capsule-like metal wallet that is constructed out of two types of stainless steel. The outer shell is made from 303-grade stainless steel, which offers extreme strength and defense against water, fire and pressure, and doesn\u0027t deform with time, whereas the core is made 304-grade stainless steel, which also offers excellent strength, as well as corrosion and heat resistance. The tiles, fasteners, and separators are made from the same 304-grade stainless steel. The CryptoSteel capsule is available from the official store for €89, but sets of two or more capsules can be purchased for a discount.","Our Verdict: 4.5/5","If you have the budget for it, the CryptoSteel capsule is easily one of the most versatile and secure offline secret storage solutions available.","cryptosteel.com","The Crypto Key Stack is a popular mnemonic seed storage solution that\u0027s designed to resist a range of physical threats without compromising data.","Like many metal wallets, the Crypto Key Stack takes the form of a set of metal plates—black anodized stainless steel, in this case—stacked together and held in place with a screw. These plates come in two types: the first is engraved with the numbers 1 to 24, with a space for etching a mnemonic word next to it; whereas the second type is blank, used for covering the engraving plates or inscribing generic data.","The Crypto Key Stack plates are designed to be engraved—a process Crypto Key Stack claims will take around five minutes. Once engraved with a suitable tool such as a Dremel, the plates can be screwed together and stored in a safe place, and shouldn\u0027t need to be touched until the mnemonic seed is needed again. The engraving process is relatively simple, but we recommend practicing on a disposable metal surface first to get the hang of it.","According to Crypto Key Stack, the product has survived the likes of a butane torch, acid bath, and a 20-ton hydraulic press and remained legible, making it one of the most battle-tested metal wallets around. The Crypto Key Stack is available from the official store in a variety of bundles. The cheapest costs $44.99 and includes a single engraving plate, two blank cover plates, and a battery-powered engraver. The most popular setup—the Key Stack Stealth Explorer bundle—comes in at $69.99 for three engraving plates, two blank plates, and an engraver.","Our Verdict: 4/5","In terms of value for money, you can\u0027t go wrong with the Crypto Key Stack.","cryptokeystack.com","The Cobo Tablet is a sleek mnemonic storage device that can be used to keep 12, 18, and 24-word BIP39 recovery seeds safe from a variety of threats. Like many metal wallets, the Cobo Tablet is designed to store the first four characters of each BIP39 seed word.","Measuring a slimline 60 mm x 105 mm x 6.5 mm, the Cobo Tablet is one of the more aesthetically pleasing storage options available. It\u0027s constructed entirely out of 304-grade stainless steel, rated as fireproof up to 1455°C or 2651°F, resistant to most types of corrosion, and completely waterproof.","Unlike some of its rivals, the Cobo Tablet doesn\u0027t require any specialized tools to set up. Instead, owners simply need to press out the letters from the supplied metal sheet and insert them into the unit, after which they\u0027re secured in place with a screw-on cover. The Tablet can then be rotated shut to keep its contents hidden from view. The package also includes tamper-proof stickers, which can be used to reveal if the Cobo Tablet has been opened after sealing. The latest version also includes a padlock hole, which can be used to further secure the wallet.","At $39, the Cobo Tablet is by far the cheapest option on this list, making it suitable for those on a budget. However, for those looking to splurge, the Cobo Tablet can also be purchased in combination with the Cobo Vault hardware wallet—setting you back a rather more substantial $479.","Our Verdict: 3.5/5","The Cobo Tablet is an excellent budget option for those looking to securely store their Bitcoin recovery seed.","cobo.com","Many metal wallets require an intricate, fiddly setup process. Not so the Blockplate, which is just about as simple as they come.","It takes the form of a square, metal slab with the numbers 1 to 12 engraved on one axis, and A to Z engraved on the other to form a grid. Each unit is constructed out of thick 12-gauge 304-grade stainless steel and can store a total of 12 recovery words. Two plates can store an entire 24-word BIP39 recovery phrase, whereas a single plate is sufficient for a 12-word BIP39 seed.","Unlike some other metal wallets, the Blockplate is only designed to secure recovery words; it\u0027s not suitable for storing other kinds of confidential information such as private keys, passwords, or encryption keys since it cannot record symbols, numbers or different letter cases.","The Blockplate works by storing the first four letters of each recovery word—all that\u0027s actually required to successfully recover a wallet, since no two BIP39 words share the same first four letters. These letters are first marked on the Blockplate with a marker and can then be stamped permanently using an automatic center punch, which will leave a permanent dent in each box. The Blockplate doesn\u0027t come with an automatic center punch, but these can be purchased for an additional $10 on the Blockplate store—or for a few bucks at your local hardware store.","Each plate measures in at 84 mm x 78 mm x 2.8 mm and is heat resistant up to 2100°F, as well as being both water and corrosion-resistant. However, the Blockplate is not tamper-resistant like some other metal wallets, and does not come with a cover or case used to obscure the inscribed information. At $69 for a double pack, the Blockplate is one of the cheaper metal wallet solutions on the market—but this does come at the cost of reduced versatility.","Our Verdict: 3.5/5","The Blockplate represents a solid low budget option, but is only suitable for those looking to store a BIP39 seed phrase and nothing else.","blockplate.com","The Hodlinox is a simple metal storage plate that is used to store Bitcoin (BTC) and other 12 to 24-word recovery phrases securely. It\u0027s available in a variety of designs, all of which are constructed out of thick, stainless steel and engraved with easy to read guidelines for seed words.","Unlike some other recovery phrase storage devices, the Hodlinox requires owners to manually engrave or stamp their seed phrase onto their plate, physically marking it onto the metal. \u0027Martin\u0027, the founder of the project, believes that this solution is more secure than assembling letters into a series, since there\u0027s no chance of the letters falling out of the storage medium.","Depending on your needs, the Hodlinox is available in a range of formats, ranging from the cheapest option, a single plate without a case at €29, to a double plate at €49, to the most expensive option—a pack of 10 double plates for €395. The website only accepts payment in Bitcoin.","The single plate option is double-sided with recovery words 1-12 written on one side, and 13-24 on the other side. The double plate option instead comes with two single-sided plates that are attached together with a screw, which would need to be unscrewed to view the recovery phrase. The Hodlinox also ships with a tamper-proof seal which will be damaged if the Hodlinox is forced open—either metal or plastic, depending on whether you\u0027re using a single or double Hodlinox setup.","Since the Hodlinox is constructed out of stainless steel, it\u0027s inherently water and fire-resistant.","Rating: 4/5","Costing just €29 for the single plate model, the Hodlinox represents great value for money. However, it is more secure when you use an engraver rather than a marker pen, so consider factoring that in as a cost.","hodlinox.com","The CypherWheel is a robust metal wallet machined out of 5/16\" thick stainless steel. Coming in at 191mm x 11.4mm x 7.6mm and weighing around 300 grams, the CypherWheel certainly looks and feels like a heavy-duty piece of equipment.","Although many seed storage tools are designed to feature as few moving parts as possible, the CypherWheel is different from most. Users of the CypherWheel need to slide the individual tiles for each letter of their private information into the wheel through individual ramps machined into its body. This is a rather fiddly process, but the CypherWheel is supplied with a pair of tweezers to make things easier.","There are 24 different segments in total, and the CypherWheel is compatible with both BIP39 and SLIP39 seed phrases, and can store up to 96 characters of confidential information. Once the tiles have been inserted, a supplied punch tool is used to lock the letters into place, preventing them from accidentally falling out.","Unlike most other metal wallets, the Cypherwheel can be used to store just about any sensitive information, which can include Bitcoin private keys, seed phrases, passwords, or anything else that can be formed from the letters A to Z. However, it is primarily designed for seed phrases, since each segment of the wheel is numbered from 1 to 24, just like a BIP39 recovery mnemonic.","Each word of the seed can be revealed by rotating an internal disc, and the entire unit can be locked using either the supplied security seal—which will break if the device is unlocked—or a standard padlock through the hole in the unit.","The CypherWheel is extremely solid, and waterproof, dustproof, and fireproof up to 2,000 degrees. However, all this security comes at a steep cost—200 on the official CypherSafe web shop. Nonetheless, if security is your top priority, then you will struggle to find a more versatile and robust metal seed storage solution.","Rating: 3.5/5","The CypherWheel is by far the most robust and most expensive option on this list. But if cost is no object, this is the one we\u0027d pick.","cyphersafe.io","As its name suggests, the Ellipal Mnemonic Metal is a metal cryptocurrency backup solution that allows owners to safely store their 12 or 24-word recovery phrase. It comes in an 86mm x 60mm x 8mm clam-shell form factor and is constructed primarily from aluminum.","According to its product description, the Ellipal Mnemonic Metal is designed to be fireproof, waterproof, and insect-proof, helping to keep the recovery phrase protected against most potential physical threats. However, although the Ellipal Mnemonic Metal has a durable build, it\u0027s not listed as crush-proof—though we were unable to manually bend the item while reviewing it.","The Ellipal Mnemonic Metal is designed to store the first four letters of up to a 24-word BIP39 recovery phrase. Since the first four letters are unique to each word in the BIP39 word list, it is not necessary to store the complete word to safely back up your mnemonic phrase. Many wallets will actually fill in the rest of the word automatically after typing in the first four letters during the wallet recovery process.","It comes supplied with a variety of letter stamps in addition to a screwdriver. Each letter is popped from its sheet and can be inserted into the case after unscrewing a numbered front-panel with the included screwdriver. Once all the letters are in place, the front panel can be screwed back on, and the entire wallet can be locked shut with a padlock (not included).","The Ellipal Mnemonic Metal currently retails for $49, but can be had for just $29 when purchased alongside the Ellipal Titan hardware wallet. As such, it\u0027s one of the cheapest metal wallet solutions on the market currently.","Rating: 3/5","The Ellipal Mnemonic Metal is a robust, relatively inexpensive solution for storing 12-24 word seed phrases.","ellipal.com","Unlike the other options on this list, the D\u0027CENT Card Wallet is designed specifically for Ethereum (ETH) and differs in the way that it keeps your funds safe. The Card Wallet comes in a credit card-like form factor with an Ethereum address and its associated QR code printed on the front, in addition to a PIN hidden beneath a scratch off panel.","Rather than requiring you to set up a hardware wallet or back up a recovery phrase using a metal storage solution, the D’CENT Card Wallet instead acts as a private key storage and authorization card. The device ships with a single Ethereum address and the private key associated with it, which can be used to store Ethereum offline. This private key is protected by an EAL5+ certified secure chip, which is able to communicate with a mobile device via a built-in RF antenna.","The D\u0027CENT Card Wallet represents an interesting compromise between security and functionality. Alone, the card simply stores Ethereum securely offline, but can be combined with a dedicated mobile application used for managing payments. As such, the D\u0027CENT Card Wallet makes it possible to store Ethereum offline, while also providing an easy access route to funds.","However, this does come with a significant compromise—D\u0027CENT generates both the address and the private key of each D\u0027CENT Card Wallet sold, and information on how it keeps this information secure is scanty. Nonetheless, at just $12.99 from the official D\u0027CENT store for $12.99, the D\u0027CENT Card Wallet could be a convenient option for storing and using small amounts of ETH.","Rating: 2/5","At just $12.99 the D\u0027CENT Card Wallet is extremely cheap, but the pre-generated private key is a no-go for us.","decentwallet.com"],"create_date":"2020-05-21T15:50:39","tag":"Hodlinox,Ellipal Mnemonic Metal,hardware wallet,Seed,Private Key,Cobo Tablet,Blockplate,Crypto Key Stack,CryptoSteel Capsule,CypherWheel","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/36608/coinbase-ceo-reflects-on-neutrino-acquisition-we-messed-up","web_url":"https://decrypt.co/","type":"article","description":"Brian Armstrong discussed the hiring of a team that had sold spyware to authoritarian governments—and acknowledged that Coinbase should’ve done more diligence.","title":"Coinbase CEO reflects on Neutrino acquisition: \u0027We messed up\u0027 - Decrypt","content":["Coinbase CEO Brian Armstrong today admitted that the acquisition of Neutrino, a company run by an infamous team of hackers, in March 2019, was a mistake. Speaking with Peter McCormack on the What Bitcoin Did podcast, he said Coinbase had no excuse.","“We definitely made a mistake,” said Armstrong, adding that “Most of our diligence was around the technology itself. What we failed to do was due diligence more around our values and our culture.”","Armstrong explained that Coinbase needed new analytics software and the choice was between developing it in-house, acquiring someone or investing. In the end, the company decided to buy blockchain analytics platform Neutrino.","“This is an instance where we messed up. We should’ve done more diligence. Since that happened, we revamped our diligence process to include these kinds of reputational checks in the process. There’s really no excuse I can give you,” Armstrong acknowledged.","As Decrypt reported, after Coinbase’s acquisition, commentators were quick to point out that key members of Neutrino were linked to an Italian organization called Hacking Team, known for selling spyware to authoritarian regimes in Saudi Arabia, Sudan and Venezuela. As McCormack put it, “some of their work led to journalists being arrested and deaths of people.”","Armstrong said that after realizing that Coinbase could’ve hired some “black hats,” he insisted on first speaking to Neutrino staff to find out how much of this was true. After assessing the situation, he sacked some of the ex-Hacking Team members but did not specify who.","All of the key people who had “some kind of question mark or reputational or values issue” were let go from the company, he said. While some lower-level engineers who “were not the decision-makers and weren’t as culpable” remained with the company.","Since then, Coinbase has continued to develop its blockchain analytics software, offering it up as a service to the DEA and IRS. On this, Armstrong recognized that it’s not a popular move but that such measures are needed to connect the fiat and crypto worlds.","“One of those unfortunate realities of the world, like we didn’t create it, is that the AML kind of regulations are increasing,” he noted, adding that, “Blockchain analytics companies, Chainalysis and others, are essentially selling data that is publicly available. So that’s what Coinbase analytics is doing too.”","At the same time, the exchange is paying a lot of money in taxes to the IRS, so providing agencies with some paid analytics service could be a way to get some of it back, he explained.","“They can go and buy this kind of blockchain analytics software anywhere they want, so I think we should get some money back for it if we have to do it as a cost of doing business,” said Armstrong.","On the other hand, he also acknowledged that the amount of revenue is “pretty negligible” and Coinbase even considered providing this service for free but “apparently the government doesn’t let you do that.”"],"create_date":"2020-07-24T14:28:00","tag":"hacking group,neutrino,bitcoin,Breaking Push,Brian Armstrong,coinbase","author":"Decrypt / Liam Frost"}
{"url":"https://decrypt.co/212570/bitcoin-etf-4-billion-day-one-trading","web_url":"https://decrypt.co/","type":"article","description":"BlackRock stole the show, but Grayscale may have been the biggest winner. The crypto-native fund enjoyed its best day of trading ever.","title":"Bitcoin ETFs Start With a Bang: $4.5 Billion on Day One of Trading - Decrypt","content":["Day one for the newly minted spot Bitcoin ETFs is in the books—and it did not disappoint.","The freshman BTC funds managed to clear $4.5 billion worth of volume and hit a few standout milestones.","If that sounds like a big number, it’s because it is. Despite all the hullabaloo, market observers did not expect such a big debut across the board. “Even attaining $500 million in day-one inflows is a noteworthy challenge,” Adam Guren, co-founder of crypto hedge fund Hunting Hill Digital, told Decrypt in October.","It seems like the appetite for Bitcoin from Wall Street investors, who can now gain exposure to BTC without storing or holding the asset directly—and who have been denied the option by the SEC for over a decade, was indeed there all along.","BlackRock’s iShares Bitcoin Trust, which trades on the Nasdaq under the IBIT ticker, almost cleared $1 billion worth of volume by itself. It accounted for 22% of the total volume across all 10 spot Bitcoin ETFs on Thursday. (Yes, that’s 10, not 11—more on this later.)","Despite a strong showing in the morning, BlackRock’s IBIT closed the day trading at $26.62—down 4.6% from its open. The fund saw a frenzied start, with 3 million shares moving before markets opened, but lost some steam as the day went on.","It’s worth pointing out that BlackRock, whose catalog of ETFs trade under the iShares brand, has often enjoyed big debuts for its exchange-traded funds.","The list of newly trading spot BTC funds changed during the day, losing one of its entrants. In its announcement about the Bitcoin ETF approvals yesterday, the Securities and Exchange Commission included the Hashdex Bitcoin ETF in its list. But Hashdex put out its own announcement this afternoon to clear up some confusion.","Hashdex received permission from the SEC for its Hashdex Bitcoin Futures ETF, which trades on the NYSE under the DEFI ticker, to be converted to a spot BTC fund. A rule change that’s similar to the one that allowed GBTC to trade as a spot Bitcoin ETF. But Hashdex hasn’t followed through on the change yet.","“The fund, which is currently a futures product, presently does not hold spot Bitcoin in its portfolio,” the company said in a press release. “At a later date, the fund will change its name and change its investment strategy to permit spot bitcoin in its portfolio.”","The firm added that the registration statement that will make the change final is still under review by the SEC. When that\u0027s finalized, it will once again bring the total list of Bitcoin ETFs trading in the U.S. back up to 11.","And while most of the attention today was centered on BlackRock, crypto-native digital asset manger Grayscale notched an impressive milestone of its own. The company\u0027s Grayscale Bitcoin Trust saw an all-time high daily volume of 56 million shares on Thursday. It’s the odd fund out in the Bitcoin ETF lineup because it already has a 10-year history, having originated as a Bitcoin investment product for accredited investors.","Today’s GBTC volume beats the next highest day, 40 million shares on May 25, 2017, by a very wide margin.","Disclaimer","The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."],"create_date":"2024-01-11T22:19:56","tag":"investing,money,Bitcoin ETF,bitcoin,Breaking Push,cryptocurrency,trading","author":"Decrypt / Stacy Elliott"}
{"url":"https://decrypt.co/227946/bitcoin-price-prediction-150000-in-2024-standard-chartered","web_url":"https://decrypt.co/","type":"article","description":"The leading UK-based bank says it is still bullish on Bitcoin, holding firm on its bold price prediction.","title":"Bitcoin ETF Hype Cooling, But BTC Will Still Hit $150,000: Standard Chartered - Decrypt","content":["A “perfect storm” of recent negative headwinds won’t hold Bitcoin back, and the price of the top digital asset will still reach $150,000 per coin this year, according to Standard Chartered.","A report from the British multinational bank said Tuesday that despite war in the Middle East, higher Treasury yields, and a slowdown of cash entering recently approved Bitcoin exchange-traded funds (ETFs), the asset still has room to climb.","Bitcoin hit a new all-time high of nearly $74,000 last month but has since plunged. The price of BTC now stands at $64,840, CoinGecko data shows. But Geoff Kendrick, digital assets researcher and lead author of the report, said that the biggest coin would continue to climb.","“ETF flows have likely stalled for a number of macro reasons, including higher Treasury yields and a more challenging backdrop for risk assets due to geopolitical developments in the Middle East,” he wrote.","“In addition, the initial wave of ETF buying may be mostly complete, and the next wave will have to wait for the inclusion of ETFs in broader macro funds (leading to a small allocation within diversified funds),” the report continued. “This may take time; for now, this strongly positive driver has stalled.”","Kendrick added: “We reiterate our end-2024 target levels of $150,000 for Bitcoin and $8,000 for Ethereum.”","Standard Chartered first predicted last month that Bitcoin would hit $150,000 per coin this calendar year—and asserted that Ethereum would rocket, too.","A massive sell-off started before the cryptocurrency’s halving and just as Iran launched an unprecedented attack on Israel. Even before those developments, though, less cash has been entering the hugely popular Bitcoin ETFs, which were approved by the Securities and Exchange Commission in January.","Though Bitcoin has made a comeback since trading for less than $17,000 in January 2023. The approval of several Bitcoin ETFs—which allow ordinary investors to get exposure to the asset via a brokerage account—has only helped push its price up this year.","Edited by Ryan Ozawa."],"create_date":"2024-04-24T19:01:02","tag":"Ethereum,bitcoin,Standard Chartered,Bitcoin ETFs","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/199751/ethereum-future-etfs-start-trading-us-first-time","web_url":"https://decrypt.co/","type":"article","description":"Nine Ethereum futures ETFs started trading today, but demand has been lower so far than at the ProShares Bitcoin Strategy ETF launch in 2021.","title":"Ethereum Future ETFs Start Trading in US for First Time - Decrypt","content":["Several Ethereum futures exchange-traded funds (ETFs) have started trading in the United States for the first time.","Investment firms ProShares, VanEck, Bitwise, Valkyrie, Kelly, and Volshares collectively debuted a total of nine ETFs on the Chicago Board Options Exchange (CBOE) Monday morning.","Proshares launched three funds: the Ether Strategy Fund (EETH), the Bitcoin and Ether Strategy ETF (BETH), and the Bitcoin and Ether Equal Strategy ETF (BETE).","Meanwhile, Bitwise debuted its Bitwise Ethereum Strategy ETF (AETH) and Bitwise Bitcoin and Ether Equal Weight Strategy ETF (BTOP).","VanEck\u0027s Ethereum Strategy ETF (EFUT) kicked off trading Monday, along with Valkyrie\u0027s Bitcoin and Ether Strategy ETF (BTF), and Volshares debuted its Ether Strategy ETF (ETHU). Brazilian fund manager Hashdex also rolled out its Ether Strategy ETF (EX).","But the nine funds got off to a slow start. As of 11:25am ET, they had traded little under $2 million in total, according to Bloomberg Intelligence analyst Eric Bulchunas, who described the volume as \"meh\" on Twitter.","Valkyrie\u0027s BTF was leading the race with around $787,000 worth of shares trading hands by that time.","Pretty meh volume for the Ether Futures ETFs as a group, a little under $2m, about normal for a new ETF but vs $BITO (which did $200m in first 15min) it is low. Tight race bt VanEck and ProShares in the single eth lane. pic.twitter.com/F9AHtrVcVf","— Eric Balchunas (@EricBalchunas) October 2, 2023","","The funds have a long way to go since the first Bitcoin futures ETF started trading on the New York Stock Exchange back in 2021: the ProShares Bitcoin Strategy ETF traded nearly $1 billion in shares in one day on its debut, almost breaking records in the process.","Back then, at the height of the bull market, Bitcoin was trading for over $66,000 per coin—nearly 60% higher than it is now.","Today\u0027s crypto funds, which track the future price of Ethereum rather than the asset itself, come as investors await a spot crypto ETF. A spot ETF lets investors gain exposure to the cryptocurrency in question—without holding the actual asset—at the current price of the coin, while investing in a futures ETF is effectively a bet on a later price of the asset.","America\u0027s top regulator, the U.S. Securities and Exchange Commission (SEC), has a long list of applications from high-profile Wall Street players—including BlackRock—to make a decision on.","Until then, investors wanting exposure to cryptocurrencies will have to trade futures contracts—or buy the digital asset directly.","CoinGecko showed that the price of Ethereum at the time of writing stood at $1,690, a 24-hour rise of just 0.5%. The asset is also up almost 7% in the past seven days."],"create_date":"2023-10-02T16:22:08","tag":"futures,ETF,ETH,Ethereum,Ethereum ETF,market","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/36731/heres-why-coinbase-still-hasnt-listed-monero","web_url":"https://decrypt.co/","type":"article","description":"Behind-the-scenes chats with regulators have the exchange cautious about privacy coins, even if the CEO himself wants to list it.","title":"Here’s why Coinbase still hasn’t listed Monero - Decrypt","content":["Monero (XMR) is currently the 16th-largest cryptocurrency, according to CoinMarketCap, with a total market capitalization of nearly $1.27 billion, and exchanges such as Binance and Kraken list it. Why not Coinbase, then?","According to CEO Brian Armstrong, it’s not simply a matter of preference. Appearing on the What Bitcoin Did podcast this week (via U.Today), Armstrong made that very clear to host Peter McCormack: “I would personally like to list it,” he affirmed.","However, Armstrong suggested that US regulators are uncomfortable with privacy-centric coins. While the government hasn’t made any sort of proclamations as to coming enforcement or issues with Monero or other coins, Armstrong said that a mix of conversations with regulators and internal risk assessments has kept them away—for now, at least.","“A lot of it is behind-the-scenes conversations where [regulators] are kind of saying: ‘We very much don’t think you should do this,’” Armstrong recalled. “And then we have the conversation: ‘Well, are you telling us that you don’t like it, or are you telling us that you are going to sue us if we do it?’”","According to Armstrong, legal disputes with regulators are part and parcel with being a financial services business, and it’s something they’re willing to engage in at times. However, it can be costly, and they’re not looking to pick every pricey fight that comes their way.","“It’s kind of just part of doing business, but it’s expensive. And it harms the relationship, right? So you need to kind of pick your battles,” he said. Sometimes, the internal calculus suggests that it’s better off not engaging. “We don’t know if this is a hill we want to die on, and we have to make a lot of tough calls like that,” Armstrong added.","Armstrong believes that regulators will become more comfortable with privacy coins over time, much as they did with Bitcoin—which he now said is “like GE stock or something: it’s the most tried and true thing.” But while other exchanges might be willing to list Monero and similar coins, he said Coinbase is being a little more careful and keeping its eye on the future.","“Compared to some of the other exchanges out there that are probably being a bit more aggressive, we have a little bit more of a conservative approach,” he said. “I want us to be a company that stands the test of time and doesn’t get taken out by some kind of enforcement action, or a cascade of events. I’m playing for the long term here.”","Armstrong covered many topics over the course of the nearly two-hour conversation with McCormick, including admitting that Coinbase’s acquisition of blockchain analytics platform Neutrino was “a mistake” and one they didn’t do enough cultural diligence on."],"create_date":"2020-07-25T13:26:50","tag":"monero,Listing,Blockchain,coinbase,crypto","author":"Decrypt / Andrew Hayward"}
{"url":"https://decrypt.co/62912/high-profile-bitcoin-etf-applications/","web_url":"https://decrypt.co/","type":"article","description":"Spot Bitcoin ETFs are finally trading in the United States following SEC approval. Here are all the Bitcoin ETFs you can invest in today.","title":"These Are All the Bitcoin ETFs That Are Now Trading in the US - Decrypt","content":["By Stephen Graves and Andrew Hayward","Jan 11, 2024Mar 27, 2024","9 min read","Since the first application for a U.S. Bitcoin exchange-traded fund was filed in 2013, a spot Bitcoin ETF has become something of a holy grail for the crypto community. And now it’s finally here.","An ETF is a publicly traded investment vehicle that tracks the value of an underlying asset; in the case of a Bitcoin ETF, that asset is Bitcoin. Advocates for a Bitcoin ETF argue that the complexities of exchanges, crypto wallets, and private keys still present a daunting barrier to entry into the crypto space for newcomers. A Bitcoin ETF would enable these investors to gain exposure to Bitcoin without actually having to hold their own cryptocurrency.","The United States Securities and Exchange Commission (SEC) approved the first batch of 10 spot Bitcoin ETFs on January 10, and they all began trading on January 11. Here’s a rundown of all of the spot Bitcoin ETFs currently trading in the States, along with a look at futures ETFs and how they vary.","In June 2023, the world’s largest asset manager, BlackRock—with over $9 trillion in assets under management as of Q1 2023—shocked the TradFi world when it filed an application for a Bitcoin spot ETF. Now live on NASDAQ, the iShares Bitcoin Trust (IBIT) is one of the highest-profile Bitcoin ETFs on the market, and has a 0.25% standard fee.","However, BlackRock is cutting the fee to 0.12% for the first $5 billion in assets or 12 months, whichever comes first. BlackRock is using Coinbase as its crypto custodian and spot market data provider, with BNY Mellon as the cash custodian. The firm also named JP Morgan Securities, Jane Street Capital, Macquarie Capital, and Virtu Americas as authorized participants.","Crypto investment fund manager Grayscale\u0027s GBTC Bitcoin trust managed well over 600,000 BTC (worth nearly $28 billion at today\u0027s prices), and it made no secret of its desire to convert the trust into a full-fledged Bitcoin spot ETF. In fact, it was Grayscale’s legal push that helped turn the tide at the SEC, as Chair Gary Gensler begrudgingly admitted.","As a proper ETF listed on NYSE Arca, GBTC has the highest fee of any of the U.S. spot Bitcoin ETFs at 1.5%, which is actually down slightly from the 2% GBTC fee before the conversion. Analysts suggest the high fee may be a measure to keep GBTC owners from dumping shares to switch to another ETF, due to the potential for a significant tax hit.","Grayscale may also be betting that its lengthy track record and immense BTC holdings will keep investors from looking elsewhere, despite the high fee. Coinbase serves as the crypto custodian and index provider, with BNY Mellon as administrator. Jane Street, Virtu Americas, Macquarie Capital, and ABN AMRO Clearing are authorized participants.","March 2021 saw a rush of applications for Bitcoin ETFs, among them Fidelity\u0027s Wise Origin Bitcoin Trust—perhaps unsurprisingly, given that mere weeks earlier its Director of Global Macro, Jurrien Timmer, said that Bitcoin has a \"unique advantage\" over gold.","Uniquely, Fidelity has opted to self-custody the Bitcoin underlying the ETF, rather than using Coinbase or Gemini. The Fidelity Wise Origin Bitcoin Trust trades on Cboe’s BZX and has a standard fee of 0.25%, but Fidelity is waiving it until August 1, 2024. Authorized participants include Jane Street, JP Morgan Securities, Macquaries, and Virtu Americas.","Bitwise first filed for its spot Bitcoin ETF filing back in October 2019, but was, like many other applications, rejected by the SEC. But Bitwise persevered, and was the first hopeful to launch an ad campaign relating to a Bitcoin ETF, enlisting actor Jonathan Goldsmith—well known for portraying “The Most Interesting Man in the World” for beer company Dos Equis—to deliver its “Bitwise is Interesting” message.","Now live on NYSE Arca, the Bitwise Bitcoin ETF has the lowest fee of any current spot offering at 0.20%—but Bitwise is waiving its fee entirely for the first $1 billion worth of assets or a six-month period, whichever comes first. Coinbase is the crypto custodian, while BNY Mellon is both the administrator and the trust custodian. Jane Street, Macquarie, and Virtu Americas are all authorized participants.","New York-based asset manager WisdomTree already has experience running a Bitcoin ETF; it launched one on Switzerland\u0027s SIX stock exchange back in 2019. It joined the ranks of U.S. Bitcoin ETF hopefuls in March 2021, filing an S-1 with the SEC that proposed listing shares in the WisdomTree Bitcoin Trust on the Cboe BZX Exchange under the ticker BTCW.","Now listed on Cboe under the BTCW ticker, the WisdomTree Bitcoin Fund has a 0.3% standard fee, although like Bitwise, the firm is waiving that entirely for the first six months or until $1 billion worth of assets are traded (whichever is sooner). Coinbase is once more the crypto custodian here, while State Street Bank and Trust is the administrator and cash custodian. Jane Street, Virtu Americas, and Macquarie Capital have signed on as authorized participants.","Galaxy Digital and Invesco filed for a joint Bitcoin ETF in September 2021, called the Invesco Galaxy Bitcoin ETF. According to that filing, its ETF would also be “physically backed” by Bitcoin rather than via derivatives like futures. Invesco is the fourth-largest ETF provider in the United States, so it has a lengthy track record ahead of the Bitcoin rollout.","The Invesco Galaxy Bitcoin ETF (BTCO) is now trading on Cboe BZX with a standard fee of 0.39%, though like others on this list, the companies are covering all sponsor fees for the first six months of operation up to $5 billion worth of assets. BNY Mellon is the transfer agent and cash custodian, while Coinbase will handle crypto custody. JP Morgan Securities, Jane Street, Virtu Americas, and Marex Capital Markets are authorized participants.","A relatively recent entrant to the race, asset manager Valkyrie filed its first application for a Bitcoin ETF in January 2021. Now the Valkyrie Bitcoin Fund is live using the ticker BRRR—an amusing allusion to the “money printer goes brrr” meme that refers to the Federal Reserve pumping the economy full of cash. It’s sure to please some Bitcoin die-hards.","Trading on the NASDAQ, the ETF has a standard fee of 0.25% but Valkyrie is fully waiving its sponsor fee for three months. The Valkyrie Bitcoin Fund uses Coinbase as prime broker and Bitcoin custodian, while U.S. Bank is the cash custodian. Jane Street and Cantor Fitzgerald & Co. have signed on as authorized participants.","Ark Invest, the investment firm led by Cathie Wood, filed its application for the Ark 21Shares ETF in June 2021. Ark Invest has partnered with Swiss-based ETF provider 21Shares AG to offer the Ark 21Shares Bitcoin ETF; it trades on Cboe\u0027s BZX Exchange under the ticker symbol ARKB.","The ARKB ETF nearly matches Bitwise’s low fee at 0.21%, and like others, the companies are waiving the sponsor fee entirely for six months or until it hits $1 billion in assets, whichever comes first. Coinbase is the crypto custodian, while Jane Street, Macquarie, and Virtu Americas are authorized participants.","VanEck is one of the earliest Bitcoin ETF applicants. Its first stab at a Bitcoin ETF—the VanEck SolidX Bitcoin Trust, in partnership with SolidX—came all the way back in 2018. The “HODL” ticker refers to common Bitcoin lingo; it dates back to a panicked misspelling of the word “hold” in a 2013 BitcoinTalk forum post. VanEck is also donating 5% of fund profits to Bitcoin core developers.","Where the majority of other applicants have named Coinbase as the custodian of the Bitcoin underpinning their ETFs, VanEck has instead opted for rival exchange Gemini to custody its Bitcoin. The VanEck Bitcoin Trust trades on Cboe and has a 0.25% fee, with Jane Street, Virtu Americas, and ABN AMRO Clearing signed as authorized participants.","Franklin Templeton, one of the world’s largest asset managers with around $1.4 trillion in assets under management, joined the race for a spot Bitcoin ETF in September 2023. The ETF’s shares are listed on the Cboe BZX exchange—and, like the majority of applicants, crypto exchange Coinbase is the fund’s custodian.","Using the ticker EZBC, the Franklin Bitcoin ETF is available now with a fee of 0.29%, putting it near the middle of the pack for the current crop of spot ETFs. There’s no apparent discount for early investors. Jane Street and Virtu Americas are listed as authorized participants.","The largest crypto asset management firm in Latin America, Hashdex, entered the fray in August 2023, with a proposal to convert its existing Bitcoin futures ETF to a spot ETF. Despite claiming that it would begin trading as a spot ETF right away, Hashdex announced in January 2024 that its Hashdex Bitcoin Futures ETF (DEFI) transition will happen at a later date. Hashdex announced that it was moving forward with DEFI in March 2024.","Hashdex employs an unusual strategy that sets it apart from other spot Bitcoin ETF operators, obtaining spot Bitcoin from within the regulated CME (Chicago Mercantile Exchange). DeFi refers to decentralized finance, a catch-all term that includes cryptocurrencies and related protocols.","The spot Hashdex Bitcoin ETF will trade on NYSE Arca and feature the second-largest fee at 0.94%, behind GBTC, the other converted ETF. Jane Street, Macquarie, and Virtu Americas are authorized participants.","Spot Bitcoin ETFs are newly approved in the United States, but the SEC approved Bitcoin futures ETFs back in 2021 and those have been trading since. Bitcoin futures ETFs let investors speculate on the future price of the asset, rather than investing into a fund that actually holds the asset and ebbs and flows based on its price.","Current Bitcoin futures ETFs in the United States include the ProShares Bitcoin Strategy ETF (BITO) and the Bitwise Crypto Industry Innovators ETF (BITQ), both listed on NYSE Arca.","Edited by Guillermo Jimenez","Editor\u0027s note: This article was originally published in October 2021 to track the status of Bitcoin ETF applications and last updated on March 27, 2024 to highlight the active spot Bitcoin ETFs following SEC approval."],"create_date":"2024-01-11T23:44:12","tag":"investing,fidelity,money,Bitcoin ETF,bitcoin,BlackRock,Breaking Push,cryptocurrency,vaneck,trading","author":"Decrypt / Stephen Graves, Andrew Hayward"}
{"url":"https://decrypt.co/resources/gbtc-everything-you-need-to-know-about-the-grayscale-bitcoin-trust","web_url":"https://decrypt.co/","type":"article","description":"The Grayscale Bitcoin Trust has been grabbing headlines in recent months. Here’s how it works, and what it means for the crypto space.","title":"GBTC: Everything You Need To Know About The Grayscale Bitcoin Trust - Decrypt","content":["Grayscale\u0027s two-year battle to launch a Bitcoin spot exchange-traded fund (ETF) may finally be turning a corner. On August 29, 2023, the United States Court of Appeals for the DC Circuit sided with Grayscale over the U.S. Securities and Exchange Commission (SEC) in the crypto firm\u0027s quest to launch a Bitcoin ETF. The price of Bitcoin rose significantly following the news.","The Grayscale Bitcoin Trust (GBTC), which was launched in 2013, enables investors to trade shares in trusts that hold large pools of Bitcoin, with each share priced at near-enough the price of Bitcoin. As of August 2023, it has over $16 billion assets under management.","Back in 2021, it had announced plans to to turn the GBTC into a Bitcoin ETF, which could be traded \"like a stock on a national securities exchange, such as NYSE Arca or Nasdaq,\" in the words of Craig Salm, Grayscale’s Chief Legal Officer.","In June 2022, the Securities and Exchange Commission (SEC) rejected Grayscale\u0027s ETF application, citing similar reasons given for other rejections for Bitcoin ETFs: that the product failed to protect the public\u0027s interest.","🚨 BREAKING: Grayscale has just won their appeal against the SEC & Bitcoin is on the way up 📈📈 pic.twitter.com/PHd5M9c3tf","— Decrypt (@decryptmedia) August 29, 2023","","As of August 29, 2023, GBTC trades at $20.40.","Grayscale was founded by Barry Silbert, who also runs the Digital Currency Group, a crypto venture capital firm that’s invested in Coinbase, Coindesk and Ripple.","The Grayscale Bitcoin Trust is similar in structure to a closed-end fund. Large institutional investors wire Grayscale some money (or some Bitcoin), then Grayscale invests that money into Bitcoin and sells shares in the trust on the stock market. It’s one of the only ways that US investors can gain exposure to Bitcoin through the stock market.","Shares in the fund can trade at either a premium or a discount to the actual price of Bitcoin. Historically, they’ve almost always traded at a premium. This is good news to Grayscale and its investors, who earn money from that premium, but bad news for investors.","So, why would investors buy shares in GBTC instead of just buying Bitcoin outright? There are a couple of reasons:","First, investing in a Bitcoin Trust allows people to gain exposure to Bitcoin without having to worry about how to store it, complying with the law or filing separate taxes.","If you’re buying Bitcoin, you have to manage a laundry list of concerns: How do you store it? Do you need to pay someone to hold custody over your Bitcoin? What happens if you lose the key or your Bitcoin wallet is hacked? As a publicly-traded trust, which reports to the US Securities and Exchange Commission (SEC), the Grayscale Bitcoin Trust makes this easy to forget about.","Second, publicly-traded Bitcoin trusts come with various tax advantages. Certain IRA, Roth IRA and other brokerages and investor accounts that won’t give tax breaks on investments of Bitcoin, will give them for investments of publicly traded trusts. Grayscale’s Trust provides those investors with exposure to Bitcoin in a tax-friendly way.","Third, crypto trading is very insular. You can’t trade Bitcoin against stocks in Tesla and Apple (without using crypto stock-derivatives platforms). That cuts off the crypto economy from the traditional one. However, as soon as you list Bitcoin on the stock exchange—albeit in a very expensive, limited way—traditional investors can invest in the crypto economy.","Grayscale also offers several other exchange-traded products—although its Bitcoin product is by far the largest. It also has an Ethereum Trust, with nearly $5 billion assets under management; other funds include Decentraland, Chainlink, and Foilcoin.","While US investors wait for a Bitcoin ETF, Bitcoin trusts might be an alternative.","This is an update of an article originally published on April 9, 2021.","Disclaimer","The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."],"create_date":"2023-08-29T15:44:52","tag":"Grayscale,Grayscale Bitcoin Trust,grayscale investments,Bitcoin ETF,bitcoin","author":"Decrypt / Tim Copeland, Robert Stevens"}
{"url":"https://decrypt.co/22646/cobo-vault-wallet-review-impressive-security-comes-at-a-cost/","web_url":"https://decrypt.co/","type":"article","description":"Offering protection against both hacks and physical damage, the Cobo Vault strays from the status quo.","title":"Cobo Vault Wallet review: Impressive security comes at a cost - Decrypt","content":["In the more than six years that cryptocurrency hardware wallets have been around, the vast majority have iterated on the same formula.","They almost all feature a compact, minimalist design with two buttons for navigation, and include support for as many cryptocurrencies as possible. Most are designed to be relatively inexpensive and are constructed mostly from plastic.","But not the Cobo Vault.","This high-end cryptocurrency hardware wallet comes with a premium price tag to boot. At $479, the Cobo Vault is one of the most expensive hardware wallets on the market, but it does offer a no-compromises approach to not only security but also protection against physical damage to the device and its recovery phrase. Does its security warrant its price tag? Let\u0027s find out.","The Cobo Vault has arguably the best build quality out of any hardware wallet we have tested so far. The device is made from an aerospace-grade aluminum alloy and appears to have been constructed out of a single piece of metal, giving it a sturdy feel that indicates the device is robust enough to withstand the rigors of everyday use.","","","At 111.8mm x 64mm x 14.6mm, the Cobo Vault is one of the largest hardware wallets on the market, about the size of a small smartphone and weighing in at a somewhat hefty 190g. It\u0027s clear that Cobo isn\u0027t trying to compete with other devices in terms of portability, though the Vault is still small enough to carry around without too much hassle.","Around the front, the Cobo Vault sports a 4-inch, 640 x 1136px LCD display, while the rear face features a built-in camera and can be removed to reveal a swappable 1,540mah battery. With only a single button used to power the device on and off, the Cobo Vault has a distinctly minimal and industrial aesthetic.","The Cobo Vault\u0027s packaging is as bulky as the device itself, with a reassuring heft to it and a tamperproof sticker sealing the contents. Inside, the Cobo Vault unit and its battery are packed separately in rigid foam compartments, with assorted other parts and tools tucked away beneath.","Unlike the paper recovery sheets that come with most hardware wallets, the Cobo Vault ships with a Cobo Tablet metal wallet to store your 12-24 word recovery phrases, as well as letter blocks for each letter of the alphabet. You also get a protective case and charging dock, as well as a 1 meter Cobo-branded USB to USB-C cable.","Lastly, the box also contains a quick guide, warranty card, and mnemonic tablet instruction card, along with a small hexagon key, screwdriver, and replacement screws.","Getting started with the Cobo Vault is a relatively simple process.","First up, you need to create a new vault on the hardware wallet by generating and confirming a new 24-word mnemonic phrase. Once confirmed, the Cobo Vault will take around 15 seconds to generate the vault.","Then it\u0027s simply a matter of selecting which cryptocurrencies you want to use with the device, after which you need to choose a 10-30 character password including upper and lowercase characters, digits and symbols. Finally, you have the option of adding an unlock pattern for additional security.","The next step is to scan your unique QR code in the Cobo Vault mobile app, which syncs the Cobo Vault wallet with the Cobo Vault app.","Despite being one of the heftier hardware wallets on the market, the Cobo Vault is also one of the most usable. Thanks to its large color touchscreen, interacting with the device is a simple process, not unlike using an Android mobile device.","Unlike most other popular hardware wallets, the Cobo Vault does not need to be connected to any other device in order to send payments. Instead, wallet users use the device camera to scan QR codes displayed on the associated Cobo Vault app to sign transactions. This is a slightly more involved process than with most other wallets, but it does increase the device\u0027s security.","Further boosting its security, the Cobo Vault has no input ports or wireless connectivity; instead, it\u0027s updated using a TransFlash (TF) card.","The Cobo Vault has an extremely simple setup process, but it can be a challenge to scan the QR code with the associated mobile app. However, once the device has been initialized, managing cryptocurrencies on the Cobo Vault using the hardware wallet and mobile app is a simple task.","The only downside is the Cobo Vault\u0027s relatively slow cold boot time of around 30-40 seconds, after which the device is pretty responsive.","Unlike many cryptocurrency hardware wallets, the Cobo Vault doesn\u0027t offer a multitude of additional features. Instead, it keeps things basic and does one thing extremely well—keeping your cryptocurrencies secure.","Because of this, you won\u0027t find much additional functionality on the Cobo Vault. There\u0027s no Bluetooth, no FIDO U2F support and no USB connectivity—all things that competitors like the Ledger Nano X offer.","However, the Cobo Vault does ship with a range of extras that make using the device simpler, safer and more convenient. For one, the device includes a stainless steel recovery phrase storage card known as the Cobo Tablet. This can be used to store the 24-word recovery phrase provided during setup, ensuring it remains safe should it ever be needed in the future. In addition, the Cobo Vault also ships with a protective case which Cobo claims is strong enough to withstand a tank driving over it.","The device is also IP68 rated, which means it can survive submersion in up to 1.5m of water for at least 30 minutes. The Cobo Vault is also one of the few hardware wallets to support multi-signature for Bitcoin and Ethereum.","The Cobo Vault lags behind many other hardware wallets in terms of the number of crypto assets it supports. In total, customers can store 11 different cryptocurrencies on the device—including eight of the top 10 cryptocurrencies by market capitalization.","The Cobo Vault currently supported the following cryptocurrencies;","Customers can also store Ethereum, Tron and EOS tokens on their device.","Although the Cobo Vault currently supports less than a dozen cryptocurrencies, Cobo does release firmware updates several times per year—each of which generally adds support for one or more cryptocurrencies.","The Cobo Vault\u0027s USP is security, and Cobo really hasn\u0027t skimped in that regard. It\u0027s designed to keep the user\u0027s private keys safe from practically any conceivable threat. To help achieve this, Cobo has reduced potential attack surfaces down to an absolute minimum by forgoing Bluetooth and USB connectivity, protecting the Vault against man-in-the-middle and side-channel attacks.","Like many other hardware wallets, including the Ledger Nano X and D\u0027CENT Biometric Wallet, the foundation of the Cobo Vault\u0027s security is a secure element. Unlike other hardware wallets, the Cobo Vault\u0027s secure element is open source and has been graded FIPS 140-2 for security.","Access to the Cobo Vault is restricted by an up to 30 character long password and optional pattern code. Cobo Vault prevents the password from being brute-forced by adding an incrementally increasing lockout period, which delays subsequent password attempts.","Beyond this, the Cobo Vault also includes a so-called \"self destruct\" function, which will automatically wipe the secure element if an attacker attempts to open the body of the device. Owners can also create additional hidden vaults on their devices by creating a unique passcode for each.","The Cobo Vault doesn\u0027t just provide security against attacks, it is also arguably the most physically durable cryptocurrency hardware wallet on the market today. The wallet is MIL-STD-810G certified for temperature and vibration resistance (among other things). It is also rated IK9 impact resistant, which means it can sustain survive an impact of 10 joules of impact force.","The Cobo Vault is among the safest hardware wallets available, thanks to its built-in secure element, tamper-proof design, and extreme damage resistance. It\u0027s also intuitive to use, despite its security protocols adding additional steps to the transaction signing process.","However, this level of security comes at a steep cost—$479—and the Vault only supports a limited range of cryptocurrencies. As such, the device is suited to those who place a premium on security and are prepared to limit themselves to predominantly mainstream cryptocurrencies.","If you\u0027re prepared to pay the price for peace of mind, the Cobo Vault is an undeniably secure and simple way to store cryptocurrencies."],"create_date":"2020-03-22T14:00:46","tag":"hardware wallet,Secure element,bitcoin,Cobo,Cobo Vault","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/16743/trezor-one-review-can-compete-in-2020","web_url":"https://decrypt.co/","type":"article","description":"Despite being almost six years old, the Trezor One is still worth a look for those seeking hardware wallet security on a budget.","title":"Trezor One Review: Can it still compete in 2020? - Decrypt","content":["The Trezor Model One (or simply Trezor One), was the first cryptocurrency hardware wallet released by SatoshiLabs, and the first widely available commercial hardware wallet in general.","Released in January 2014, the Trezor Model One gives users a way to securely store a wide variety of cryptocurrencieson a single device.","Costing just $59 direct from Trezor, or slightly cheaper from official Amazon stockists, the Trezor Model One is a direct competitor to the popular Ledger Nano S.","However, since its launch, the cryptocurrency hardware wallet market has become increasingly crowded, and SatoshiLabs now faces stiff competition from the likes of Ledger, KeepKey, CoolWallet and more.","Can the world\u0027s first cryptocurrency hardware wallet still compete in 2020? Let\u0027s find out.","Hint—just barely!","At just 60mm x 30mm x 6mm, the Trezor One is certainly small. So small, in fact, that it can fit into most wallets without much of a struggle. It also weighs just 12g, and can be attached to a keyring or pocket thanks to the included lanyard, making it extremely portable.","Satoshi Labs took a different design route from its rival Ledger—forgoing the thumb drive-like form factor of the Nano S and later Nano X in favor of something that looks more like a fancy car key.","The Trezor One is made primarily of plastic and features a 128 x 64 pixel OLED display, a micro-USB port and two buttons as its main design features.","Although its construction is solid, the Trezor One\u0027s light weight and lack of premium materials do give it a slightly cheap feel, particularly when compared to the aluminum-clad Ledger Nano S and X.","The Trezor One comes packed in a small, 100mm x 100x box that\u0027s sealed at both ends with a tamper-proof holographic seal.","Inside, you will find a cellophane-wrapped Trezor One device, an incredibly short micro-USB cable, a lanyard and a user manual.","The device is also supplied with two booklets that can be used to backup your 24-word recovery seed, as well as a selection of Trezor stickers.","The Trezor One is designed to be as small as possible, which does pose a challenge as far as usability is concerned. After all, the device only features two buttons and a small screen with which to navigate its menus. Although the screen\u0027s dinky, it can display a good amount of information without requiring you to scroll left and right—a common gripe with the Ledger Nano S.","Fortunately, except when you\u0027re first setting up the Trezor One, you won\u0027t usually need to interact directly with the device; the associated Trezor Bridge software is used to handle most tasks, such as initiating payments and verifying messages.","As such, you\u0027ll only tend to use the left and right buttons to confirm payment addresses, verify security changes and authorize logins.","Unlike its main competitors, the Ledger Nano S and Nano X, you don\u0027t need to download individual apps to the device in order to store multiple different cryptocurrencies. Instead, the wallet setup process automatically creates accounts for multiple different crypto assets, making for a simpler user experience.","However, we can\u0027t help but feel that the included micro-USB cable could have been at least slightly longer. At just 200mm long, the cable can make connecting to a computer and using the device more challenging than it needs to be—particularly if your computer isn\u0027t in an accessible location.","Overall, though, the Trezor One is simple to use, and should pose few challenges for even the least experienced cryptocurrency investors.","Getting the Trezor One up and running is a relatively painless process that should take around five to ten minutes.","To begin, connect the device to your computer using the included micro-USB cable, and download and install the Trezor Bridge application for your device. Once installed, navigate to trezor.io/start and connect your Trezor device.","You will then be prompted to create a wallet, after which you\u0027ll be prompted to back up your 24-word recovery phrase. Follow the on-screen prompts and store your recovery phrase in a safe place, as you will need this to recover your wallet should anything happen to your Trezor device.","Lastly, you will probably want to create a PIN code that will be used to load up the Trezor and confirm payment information. To set this up, click the \u0027Enable PIN\u0027 option in the Basic device settings menu, and use the grid displayed in Trezor Bridge to select a PIN.","That\u0027s it! Once this has been completed you\u0027ll be able to access your wallets via the Trezor Bridge web app.","When looking at the functionality offered by the Trezor Model One and comparing it to that offered by modern wallets such as the Ledger Nano X and CoolWallet S, it\u0027s clear how much things have progressed since the Trezor wallet was first released almost six years ago.","The Trezor One requires a wired connection, which makes it less portable than modern Bluetooth-enabled hardware wallets like the Nano X, and leaves it feeling dated. Likewise, a lack of multi-signature support outside of the third-party Electrum wallet can make the Trezor less suitable for those wielding large portfolios.","On the plus side, the Trezor Bridge client does feature built-in exchange functionality as well as a simple fiat on-ramp—allowing users to purchase and trade cryptocurrencies with hardware wallet-grade security.","In terms of compatibility, the Trezor One works with all major operating systems, including Windows, MacOS and Linux, and can also connect to Android devices using an OTG cable (sold separately). Unfortunately, iPhone users will need to look to alternatives, since Trezor Bridge isn\u0027t currently available on iOS.","The Trezor wallet can also be used as a two-factor authentication U2F security key for services like Google, GitHub and Dropbox, as well as a huge variety of other platforms. Once configured with a service, you\u0027ll need to have the Trezor to hand in order to log into that service in future.","Overall, the Trezor Model One offers a robust feature set, which, although limited, is still worthy of consideration thanks to its low price point.","When it comes to cryptocurrency support, SatoshiLabs has left little to the imagination; the vast majority of cryptocurrencies with any value can be securely stored on the Trezor One.","In total, the device supports well over 1,000 different crypto assets, including just over half of the top 20 cryptocurrencies by market capitalization, such as;","As such, it might be more informative to provide a brief list of cryptocurrencies the Trezor One doesn\u0027t support. As of writing, the Trezor Model One doesn\u0027t support;","However, many of the crypto assets not supported by the Trezor One, are supported by its similarly-priced main competitor, the Ledger Nano S.","With that said, it appears SatoshiLabs has reserved much of its development firepower for the more expensive Trezor Model T, since the newer device is compatible with a much wider range of crypto assets. As a result, the number of new coins added to the Trezor One has stagnated as of late.","As you might expect from a hardware wallet, one of the main selling points of the Trezor One is its security. Compared to the security offered by most standard wallet solutions, including mobile and exchange wallets, the Trezor One can be considered a giant leap forward.","One reason the Trezor One is so secure is that the device stores all crypto asset private keys in an offline environment, while ensuring they are never exposed to connected devices. Because of this, the Trezor One provides owners with immunity to most known methods used to steal crypto assets—which typically revolve around using fake wallets or compromised web services to exfiltrate user funds.","Access to the Trezor One itself can also be protected by an optional PIN. If used, this PIN will need to be entered before the device loads up, and is practically impossible to brute-force, since the firmware enforces an increasingly long delay between each attempt. This delay (in seconds) is equal to 1.8 to the power of the number of failed attempts. As such, 10 failed attempts would lead to a delay of almost 6 minutes (1.8⌃10 seconds), whereas the device is wiped after 16 attempts.","Fortunately, even if the device is wiped, the 24-word recovery seed provided during setup can be used to restore your wallet. This can also be extended with an optional 25th word, which can further boost security if stored separately from the original 24-word recovery phrase.","SatoshiLabs has also taken steps to ensure the Trezor One itself cannot be easily modified or compromised, by sealing the enclosure with ultrasound. This makes it difficult to pry the device open in order to install something like a wireless transmitter without suspicion, since it would be nearly impossible to conceal the entry point. It is also possible to set a custom home screen on the device, which should make it difficult for somebody to simply replace the device with a fake designed to capture your pin.","The Trezor One also features a write-protected bootloader with a disabled JTAG to prevent firmware modification, and will only run if the firmware is properly signed by SatoshiLabs—making firmware modification attempts futile.","At around $69, the Trezor Model One features top-notch security and support for a good range of crypto assets. However, the wallet falls short when measured against modern solutions like the Ledger Nano X and Trezor Model T.","When compared to wallets in its own price range, the Trezor One does fare slightly better—being roughly comparable to a Ledger Nano S in terms of features, while exceeding the feature set of the cheaper KeepKey wallet.","Moreover, though the Trezor One does support a good array of crypto assets, it isn\u0027t compatible with several highly popular digital assets, including several in the top 10 by market cap. As such, those with a diverse cryptocurrency portfolio could find it to be overly restrictive—particularly considering that several other wallets on the market that do offer support for these.","Overall, the Trezor One is certainly past its heyday, but it could be worth a look when it\u0027s available on discount."],"create_date":"2020-01-19T14:00:16","tag":"KeepKey,Ledger Nano S,Ledger Nano X,SatoshiLabs,CoolWallet S,Trezor Bridge,Trezor Model One,trezor model t,Trezor One","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/37502/monero-tari-to-release-guide-to-help-exchanges-list-privacy-coins","web_url":"https://decrypt.co/","type":"article","description":"The regulatory whitepaper is designed to help crypto exchanges list privacy coins, such as Monero.","title":"Monero, Tari to release guide to help exchanges list privacy coins - Decrypt","content":["The developers of privacy coin Monero (XMR) and privacy protocol Tari Labs are preparing to publish a guide—in the form of a whitepaper—to let exchanges know how they can list Monero while complying with regulations.","Monero is a cryptocurrency that has a layer of privacy stopping anyone from observing transactions on its blockchain. But while this is good for those who use it, it makes it harder for exchanges to track what’s going on—a legal requirement.","Last week, Coinbase CEO Brian Armstrong said he would like to list Monero but added that the exchange is too concerned with regulators to do so. And with other exchanges in the same boat, the adoption of privacy coins has slowed right down. But, if this whitepaper is successful, it could start to turn things around.","Of course it can satisfy traceability requirements. It is fully compliant with legislation through functionality like viewkeys and tx keys. And that’s not just my opinion, that’s the opinion of a large, well-known law firm who is putting out a guide for exchanges that add Monero.","— Riccardo Spagni (@fluffypony) September 14, 2019","","“We believe the whitepaper to be the most comprehensive and authoritative analysis of privacy tokens and related AML concerns to date and are very proud of our involvement in this great effort,” said Louis Willacy, regulatory compliance general counsel at Tari Labs.","The whitepaper is called “The Fundamentals and Regulation of Privacy-Enabling Cryptocurrencies” and will be published by law firm Perkins Coie.","According to Tari, the whitepaper will acknowledge that there are greater risks involved with privacy coins but that these risks can be met with enhanced compliance tools.","Willacy added, “While the authors support their findings with exhaustive research and detailed analysis, the whitepaper’s core conclusion is deceptively simple: Regulated financial institutions can comply with AML obligations when supporting privacy tokens. Period.”","So far, Monero has been delisted from five crypto exchanges, including Bithumb and Huobi Korea. But will this whitepaper be enough to bring it back?"],"create_date":"2020-08-03T15:36:53","tag":"monero,privacy coin,regulations,compliance,xmr","author":"Decrypt / Liam Frost"}
{"url":"https://decrypt.co/34481/how-to-keep-your-bitcoin-safe-and-secure","web_url":"https://decrypt.co/","type":"article","description":"With billions in Bitcoin stolen to date, it\u0027s vital to keep yours secure. There are a wealth of wallet options, depending on your requirements.","title":"How To Keep Your Bitcoin Safe And Secure - Decrypt","content":["Keeping your Bitcoin safe might seem like a simple task, but as a myriad of thefts, phishing attacks, and exchange hacks prove—it\u0027s easier said than done.","The majority of Bitcoin holders use one of four main types of cryptocurrency wallet: hardware, software, metal, and exchange wallets. Some are better than others for keeping your Bitcoin safe, but there are many ways to maximize your security regardless of which option you choose.","When it comes to keeping your Bitcoin private keys secure, hardware wallets are widely considered to be the safest option. Hardware wallets are physical security vaults that are designed to protect your Bitcoin (and other cryptocurrencies) from a range of possible attacks, while also ensuring you can access and spend your cryptocurrencies with relative ease.","Hardware wallets vary considerably in form, function, and price. They range from the $49 KeepKey wallet, to the $119 Bluetooth multi-asset Ledger Nano X, and $120 Bitcoin-centric Coldcard Mk3 and beyond.","Like most cryptocurrency wallets, hardware wallets use a mnemonic phrase that can be used to recover your wallet; this can be used in the event that the device itself is lost. It\u0027s also one of the biggest vulnerabilities for hardware wallets, since anybody who gets their hands on the recovery phrase will have unfettered access to the funds it contains.","This has led to some ingenious workarounds to protect and secure the recovery phrase from prying eyes, including writing it in UV-sensitive ink under a dummy phrase, and even dividing the recovery phrase up between several safety deposit boxes.","Software wallets are one of the most popular ways to store Bitcoin among mobile users, since many can be used to manage a wide variety of cryptocurrencies from most mobile devices. There are also desktop versions of many software wallets, allowing users to manage their own private keys on Linux, macOS, and Windows.","Some of the most popular Bitcoin wallets are software wallets, including Electrum, Jaxx Liberty, and Exodus—all of which are available for both desktop and mobile operating systems. However, even the most secure options lack some of the security features of hardware wallets.","In order to maximize your security with a software wallet, we recommend picking one that features two-factor authentication (2FA). It\u0027s also important to ensure you\u0027re protected against viruses, keyloggers, and other malware, since these can exfiltrate your private keys and seed phrases if not blocked.","As the name suggests, mobile Bitcoin wallets are downloadable apps that can be used to store, send, and receive cryptocurrencies on a smartphone.","These can generally be downloaded from the Apple App Store or Google Play Store, but sometimes need to be manually installed as an APK (on Android) or through sideloading (on iOS)—particularly for newer wallets that haven’t yet been approved for app stores.","Mobile wallets can vary considerably in the features they offer, but they generally take advantage of the unique capabilities of smartphones—such as fingerprint sensors, cameras, GPS, etc., to add an additional layer of security.","Many of these wallets feature support for multiple cryptocurrencies, while others support just one. In most cases, mobile wallets are considered ‘non-custodial’, which means you maintain control of your private keys.","Some of the most popular multi-asset mobile wallets and their main features include:","It’s important to note that while some software wallets are also mobile wallets, not all mobile wallets are software wallets—since software wallets are usually available across a range of operating systems, often including mobile ones like iOS and Android.","Metal wallets are physical metal plates or devices that can be used to securely store recovery phrases, private keys, and potentially other sensitive information offline. Since they\u0027re constructed out of metal, they are inherently fireproof and corrosion-resistant, while some, like the Cryptosteel and Cypherwheel, are also crush-resistant.","Unlike the other options on this list, metal wallets are not designed for actually using Bitcoin or other cryptocurrencies. They simply act as a means to store secret information in a more robust way than an insecure paper wallet. They\u0027re more resilient than even the most robust hardware wallets, and several feature built-in anti-tamper mechanisms. They\u0027re most useful for long-term storage in a secure location, since they won\u0027t afford you instant access to your funds.","A wide range of metal wallets are available, ranging from between $20 to over $200—or you can go the DIY route to make one yourself.","Cryptocurrency exchanges have much to recommend them, including instant access to funds, plus the ability to quickly trade your Bitcoin for other cryptoassets. However, compared to other methods of storing your Bitcoin, they are generally considered to be a less secure option. Between 2011 and 2020, $11 billion was stolen in crypto hacking incidents, with a \"significant amount\" lost in hacks of crypto exchanges, according to research by Inside Bitcoins.","Exchanges are also custodial, which means they hold custody of any fund stored in their accounts, leaving users without access to their private keys. \"Not your keys, not your Bitcoin\" is a common refrain among those cryptocurrency advocates who reject the idea of storing their crypto on an exchange. Of course, it\u0027s worth noting that many exchanges, including the major ones such as Gemini, Coinbase and Bittrex, are insured—protecting users against a range of threats including insider theft and cyberattacks.","Despite their limitations, exchanges remain an extremely popular way to store cryptocurrencies, due to the simple fact that they\u0027re typically convenient and easy to use.","They also differ in their security stack, including their use of cold storage and account-side security features. We\u0027d recommend sticking to exchanges that use multi-signature cold storage and offer two-factor authentication for accounts. Some exchanges, such as Binance, also let you use a hardware key for 2FA, adding an additional layer of security."],"create_date":"2021-01-18T16:00:27","tag":"ledger,gemini,exchange,paper wallet,bitcoin exchange,bitcoin hardware wallet,metal wallet,coinbase","author":"Decrypt / Daniel Phillips"}
{"url":"https://decrypt.co/71948/monero-dash-center-missing-persons-case-norway","web_url":"https://decrypt.co/","type":"article","description":"In the midst of a missing person case, Norwegian law enforcement is trying to break open anonymous cryptocurrencies Monero and Dash.","title":"Monero and Dash at Center of Missing Person’s Case in Norway","content":["Norway’s National CyberCrime Center is trying to pry open Monero and Dash—two cryptocurrencies known for their privacy-protection capabilities—amidst the search for missing person Anne-Elisabeth Hagen.","Police believe that the privacy coins were used in connection with a ransom attempt and that tracing these transactions could help lead them to Hagen’s whereabouts.","“I do not want to comment specifically on what we have done or are doing in the context of Dash and Monero, or what we have achieved,” police attorney Richard Beck Pedersen told Norwegian outlet VG. “But I can say that we have a hope that this track will lead to a result that is important for the investigation.\"","Pedersen added that at the moment, the privacy coins are causing investigators \"the biggest challenges,\" noting that criminals are using cryptocurrencies such as Dash and Monero to throw police off their tracks. \"It does not take a lot of expertise to make things very difficult,\" he said.","The wife of one of Norway\u0027s richest men, property tycoon Tom Hagen, Anne-Elisabeth Hagen has been missing since October 2018 in what was suspected to be a kidnapping for ransom, according to The Guardian.","It is alleged that she had been kidnapped, as a ransom request was made shortly after her disappearance in October; roughly 90 million Norwegian Krone ($10.8 million) was demanded for Hagen\u0027s return, according to VG.","Norwegian authorities have traced records that indicate the suspected kidnappers had been planning the abduction well in advance.","According to VG, on June 28, the suspected kidnappers created a password-protected document containing two addresses for the cryptocurrencies Bitcoin and Monero.","The Bitcoin address was created purely for communication purposes, while the Monero address existed for the ransom payment.","In July, an email address created with a stolen identity was used to create accounts at Binance and KuCoin, two popular crypto exchanges. Then another account was created on crypto exchange Huobi, two days later, again according to VG.","A sum of privacy coin Dash was sent to the Huobi account, which was then exchanged for Bitcoin on July 10.","Months later, on October 31, Anne-Elisabeth Hagen was taken from her home in Norway and reported as kidnapped by her husband, Tom Hagen, who found the ransom letter on the same day Anne-Elisabeth disappeared.","The Guardian reported that police arrested Tom Hagen in April 2020 on suspicion of murder; Anne-Elisabeth remains missing.","Law enforcement organizations around the world have devoted considerable effort to tracking cryptocurrency transactions, including privacy coins.","In July 2020, a leaked FBI intelligence report revealed how the FBI had tracked dark web criminals laundering dirty Bitcoin by converting it into Monero. Later that year, crypto intelligence firm CipherTrace announced that it had developed a toolset for tracing Monero transactions, although CEO Dave Jevans conceded that \"You can’t be as deterministic as Bitcoin […] In tracing Monero, it’s really more of a probabilistic game.\"","In January 2020, Europol\u0027s European Cybercrime Centre noted that one suspect had used a combination of Monero and the privacy browser Tor to render their transactions untraceable.","While the cat-and-mouse game between cybercriminals and law enforcement continues, regulators have turned their attention to exchanges. As a result of \"behind-the-scenes conversations\" with regulators, crypto exchange Coinbase has held back on listing Monero; last year, Monero developers and privacy protocol Tari Labs released a whitepaper to let exchanges know how they can list the cryptocurrency while retaining regulatory compliance."],"create_date":"2021-05-26T10:02:58","tag":"monero,Norway,Breaking Push,crime,Dash,xmr","author":"Decrypt / Scott Chipolina"}
{"url":"https://decrypt.co/62912/high-profile-bitcoin-etf-applications","web_url":"https://decrypt.co/","type":"article","description":"Spot Bitcoin ETFs are finally trading in the United States following SEC approval. Here are all the Bitcoin ETFs you can invest in today.","title":"These Are All the Bitcoin ETFs That Are Now Trading in the US - Decrypt","content":["By Stephen Graves and Andrew Hayward","Jan 11, 2024Mar 27, 2024","9 min read","Since the first application for a U.S. Bitcoin exchange-traded fund was filed in 2013, a spot Bitcoin ETF has become something of a holy grail for the crypto community. And now it’s finally here.","An ETF is a publicly traded investment vehicle that tracks the value of an underlying asset; in the case of a Bitcoin ETF, that asset is Bitcoin. Advocates for a Bitcoin ETF argue that the complexities of exchanges, crypto wallets, and private keys still present a daunting barrier to entry into the crypto space for newcomers. A Bitcoin ETF would enable these investors to gain exposure to Bitcoin without actually having to hold their own cryptocurrency.","The United States Securities and Exchange Commission (SEC) approved the first batch of 10 spot Bitcoin ETFs on January 10, and they all began trading on January 11. Here’s a rundown of all of the spot Bitcoin ETFs currently trading in the States, along with a look at futures ETFs and how they vary.","In June 2023, the world’s largest asset manager, BlackRock—with over $9 trillion in assets under management as of Q1 2023—shocked the TradFi world when it filed an application for a Bitcoin spot ETF. Now live on NASDAQ, the iShares Bitcoin Trust (IBIT) is one of the highest-profile Bitcoin ETFs on the market, and has a 0.25% standard fee.","However, BlackRock is cutting the fee to 0.12% for the first $5 billion in assets or 12 months, whichever comes first. BlackRock is using Coinbase as its crypto custodian and spot market data provider, with BNY Mellon as the cash custodian. The firm also named JP Morgan Securities, Jane Street Capital, Macquarie Capital, and Virtu Americas as authorized participants.","Crypto investment fund manager Grayscale\u0027s GBTC Bitcoin trust managed well over 600,000 BTC (worth nearly $28 billion at today\u0027s prices), and it made no secret of its desire to convert the trust into a full-fledged Bitcoin spot ETF. In fact, it was Grayscale’s legal push that helped turn the tide at the SEC, as Chair Gary Gensler begrudgingly admitted.","As a proper ETF listed on NYSE Arca, GBTC has the highest fee of any of the U.S. spot Bitcoin ETFs at 1.5%, which is actually down slightly from the 2% GBTC fee before the conversion. Analysts suggest the high fee may be a measure to keep GBTC owners from dumping shares to switch to another ETF, due to the potential for a significant tax hit.","Grayscale may also be betting that its lengthy track record and immense BTC holdings will keep investors from looking elsewhere, despite the high fee. Coinbase serves as the crypto custodian and index provider, with BNY Mellon as administrator. Jane Street, Virtu Americas, Macquarie Capital, and ABN AMRO Clearing are authorized participants.","March 2021 saw a rush of applications for Bitcoin ETFs, among them Fidelity\u0027s Wise Origin Bitcoin Trust—perhaps unsurprisingly, given that mere weeks earlier its Director of Global Macro, Jurrien Timmer, said that Bitcoin has a \"unique advantage\" over gold.","Uniquely, Fidelity has opted to self-custody the Bitcoin underlying the ETF, rather than using Coinbase or Gemini. The Fidelity Wise Origin Bitcoin Trust trades on Cboe’s BZX and has a standard fee of 0.25%, but Fidelity is waiving it until August 1, 2024. Authorized participants include Jane Street, JP Morgan Securities, Macquaries, and Virtu Americas.","Bitwise first filed for its spot Bitcoin ETF filing back in October 2019, but was, like many other applications, rejected by the SEC. But Bitwise persevered, and was the first hopeful to launch an ad campaign relating to a Bitcoin ETF, enlisting actor Jonathan Goldsmith—well known for portraying “The Most Interesting Man in the World” for beer company Dos Equis—to deliver its “Bitwise is Interesting” message.","Now live on NYSE Arca, the Bitwise Bitcoin ETF has the lowest fee of any current spot offering at 0.20%—but Bitwise is waiving its fee entirely for the first $1 billion worth of assets or a six-month period, whichever comes first. Coinbase is the crypto custodian, while BNY Mellon is both the administrator and the trust custodian. Jane Street, Macquarie, and Virtu Americas are all authorized participants.","New York-based asset manager WisdomTree already has experience running a Bitcoin ETF; it launched one on Switzerland\u0027s SIX stock exchange back in 2019. It joined the ranks of U.S. Bitcoin ETF hopefuls in March 2021, filing an S-1 with the SEC that proposed listing shares in the WisdomTree Bitcoin Trust on the Cboe BZX Exchange under the ticker BTCW.","Now listed on Cboe under the BTCW ticker, the WisdomTree Bitcoin Fund has a 0.3% standard fee, although like Bitwise, the firm is waiving that entirely for the first six months or until $1 billion worth of assets are traded (whichever is sooner). Coinbase is once more the crypto custodian here, while State Street Bank and Trust is the administrator and cash custodian. Jane Street, Virtu Americas, and Macquarie Capital have signed on as authorized participants.","Galaxy Digital and Invesco filed for a joint Bitcoin ETF in September 2021, called the Invesco Galaxy Bitcoin ETF. According to that filing, its ETF would also be “physically backed” by Bitcoin rather than via derivatives like futures. Invesco is the fourth-largest ETF provider in the United States, so it has a lengthy track record ahead of the Bitcoin rollout.","The Invesco Galaxy Bitcoin ETF (BTCO) is now trading on Cboe BZX with a standard fee of 0.39%, though like others on this list, the companies are covering all sponsor fees for the first six months of operation up to $5 billion worth of assets. BNY Mellon is the transfer agent and cash custodian, while Coinbase will handle crypto custody. JP Morgan Securities, Jane Street, Virtu Americas, and Marex Capital Markets are authorized participants.","A relatively recent entrant to the race, asset manager Valkyrie filed its first application for a Bitcoin ETF in January 2021. Now the Valkyrie Bitcoin Fund is live using the ticker BRRR—an amusing allusion to the “money printer goes brrr” meme that refers to the Federal Reserve pumping the economy full of cash. It’s sure to please some Bitcoin die-hards.","Trading on the NASDAQ, the ETF has a standard fee of 0.25% but Valkyrie is fully waiving its sponsor fee for three months. The Valkyrie Bitcoin Fund uses Coinbase as prime broker and Bitcoin custodian, while U.S. Bank is the cash custodian. Jane Street and Cantor Fitzgerald & Co. have signed on as authorized participants.","Ark Invest, the investment firm led by Cathie Wood, filed its application for the Ark 21Shares ETF in June 2021. Ark Invest has partnered with Swiss-based ETF provider 21Shares AG to offer the Ark 21Shares Bitcoin ETF; it trades on Cboe\u0027s BZX Exchange under the ticker symbol ARKB.","The ARKB ETF nearly matches Bitwise’s low fee at 0.21%, and like others, the companies are waiving the sponsor fee entirely for six months or until it hits $1 billion in assets, whichever comes first. Coinbase is the crypto custodian, while Jane Street, Macquarie, and Virtu Americas are authorized participants.","VanEck is one of the earliest Bitcoin ETF applicants. Its first stab at a Bitcoin ETF—the VanEck SolidX Bitcoin Trust, in partnership with SolidX—came all the way back in 2018. The “HODL” ticker refers to common Bitcoin lingo; it dates back to a panicked misspelling of the word “hold” in a 2013 BitcoinTalk forum post. VanEck is also donating 5% of fund profits to Bitcoin core developers.","Where the majority of other applicants have named Coinbase as the custodian of the Bitcoin underpinning their ETFs, VanEck has instead opted for rival exchange Gemini to custody its Bitcoin. The VanEck Bitcoin Trust trades on Cboe and has a 0.25% fee, with Jane Street, Virtu Americas, and ABN AMRO Clearing signed as authorized participants.","Franklin Templeton, one of the world’s largest asset managers with around $1.4 trillion in assets under management, joined the race for a spot Bitcoin ETF in September 2023. The ETF’s shares are listed on the Cboe BZX exchange—and, like the majority of applicants, crypto exchange Coinbase is the fund’s custodian.","Using the ticker EZBC, the Franklin Bitcoin ETF is available now with a fee of 0.29%, putting it near the middle of the pack for the current crop of spot ETFs. There’s no apparent discount for early investors. Jane Street and Virtu Americas are listed as authorized participants.","The largest crypto asset management firm in Latin America, Hashdex, entered the fray in August 2023, with a proposal to convert its existing Bitcoin futures ETF to a spot ETF. Despite claiming that it would begin trading as a spot ETF right away, Hashdex announced in January 2024 that its Hashdex Bitcoin Futures ETF (DEFI) transition will happen at a later date. Hashdex announced that it was moving forward with DEFI in March 2024.","Hashdex employs an unusual strategy that sets it apart from other spot Bitcoin ETF operators, obtaining spot Bitcoin from within the regulated CME (Chicago Mercantile Exchange). DeFi refers to decentralized finance, a catch-all term that includes cryptocurrencies and related protocols.","The spot Hashdex Bitcoin ETF will trade on NYSE Arca and feature the second-largest fee at 0.94%, behind GBTC, the other converted ETF. Jane Street, Macquarie, and Virtu Americas are authorized participants.","Spot Bitcoin ETFs are newly approved in the United States, but the SEC approved Bitcoin futures ETFs back in 2021 and those have been trading since. Bitcoin futures ETFs let investors speculate on the future price of the asset, rather than investing into a fund that actually holds the asset and ebbs and flows based on its price.","Current Bitcoin futures ETFs in the United States include the ProShares Bitcoin Strategy ETF (BITO) and the Bitwise Crypto Industry Innovators ETF (BITQ), both listed on NYSE Arca.","Edited by Guillermo Jimenez","Editor\u0027s note: This article was originally published in October 2021 to track the status of Bitcoin ETF applications and last updated on March 27, 2024 to highlight the active spot Bitcoin ETFs following SEC approval."],"create_date":"2024-01-11T23:44:12","tag":"investing,fidelity,money,Bitcoin ETF,bitcoin,BlackRock,Breaking Push,cryptocurrency,vaneck,trading","author":"Decrypt / Stephen Graves, Andrew Hayward"}
{"url":"https://decrypt.co/resources/what-is-bitcoin-etf-explained-guide-learn-easy","web_url":"https://decrypt.co/","type":"article","description":"A spot Bitcoin ETF creates a simple, legally compliant way to trade the price of Bitcoin, accessible on markets that investors are already familiar with.","title":"Bitcoin ETF: Everything You Need To Know","content":["Want to earn a free on-chain certificate showcasing your Bitcoin knowledge? Take our free course, Bitcoin Halving 101: What it Means for Miners and Investors.","Many of the crypto-curious still view buying Bitcoin from a crypto exchange as an intimidating and opaque process.","The technical aspects of holding Bitcoin—such as crypto wallets, Bitcoin addresses and private keys—are confusing to newcomers, and scare some investors away.","All of this has intensified the appeal of a spot Bitcoin ETF, or exchange-traded fund, which enables investors to gain exposure to Bitcoin without the hassle of owning it themselves.","Following years of delays and rejections, the U.S. Securities and Exchange Commission (SEC) approved applications for multiple spot Bitcoin ETFs in January 2024. The list of those operating spot Bitcoin ETFs in the U.S. is a roll-call of major financial institutions, including asset managers like BlackRock and Fidelity.","Other countries were quicker off the mark, with Bitcoin ETFs launching in Canada, Brazil and Europe ahead of the U.S.","The first ETF launched in 1993, and they became popular as a way for retail investors to invest in a basket of assets at once. If you wanted to invest in 500 of the largest companies in America at once, you could buy shares in a S&P 500 ETF.","A Bitcoin ETF works in much the same way as any other ETF. Investors buy shares in the ETF through whatever brokerage they buy stocks, and can trade them the same way they\u0027d trade shares in Apple or Tesla.","Bitcoin ETFs track the current price of Bitcoin, and should act in lockstep with Bitcoin\u0027s price swings.","So, why wouldn’t investors just buy Bitcoin?","For most regular retail investors, Bitcoin and cryptocurrencies in general still look risky.","Besides having unclear regulations around them, owning Bitcoin requires keeping a Bitcoin wallet and trusting crypto exchanges, which are still uncharted territory for people unfamiliar with the space and require a certain level of self-education.","Holding Bitcoin places the burden of security squarely on you, making you responsible for keeping your own private keys safe (unless you want to entrust them to the exchange). This may mean buying a hardware wallet to protect purchased Bitcoin, or storing private keys in a secure manner. You’d also have to work out how to file taxes for sales of Bitcoin that resulted in capital gains.","With a Bitcoin ETF, investors need not worry about private keys, storage, or security. They own shares in the ETF just like their shares of stock, and can gain exposure to the cryptocurrency market without having to go through the hoops of purchasing and holding crypto.","And to put it plainly, that is an extremely appealing proposition for many regular folks—as well as sophisticated institutional investors.","A Bitcoin ETF is managed by a firm that buys and holds the actual Bitcoin; the price is pegged to the Bitcoin held in the fund. The firm lists the ETF on a traditional stock exchange, and you, the investor, trade the ETF just as you would any other stock. Bitcoin ETFs also offer new types of trading opportunities, including short-selling, where investors can bet against Bitcoin.","But there are also some key differences between a Bitcoin ETF and other ETFs.","First, some ETFs, like those that track the S&P 500, represent equity shares, so you get a cut of the dividends that any company in the ETF pay to their shareholders. When Tesla pays a dividend and you have shares in an ETF that includes Tesla, you get a (smaller) dividend. Bitcoin is decentralized, so that won\u0027t happen with a Bitcoin ETF.","Second, just like with other ETFs, you have to pay fees to the company offering the ETF. But with a Bitcoin ETF, some portion of your fees would go to paying the custody and management fees for the purchase and storage of the Bitcoin that underlies the ETF.","Many hedge funds and other investment firms have filed applications with the U.S. SEC for Bitcoin ETFs over the years, but it took over a decade for one to be approved.","Gemini founders Cameron and Tyler Winklevoss were first out of the gate with an application for the Winklevoss Bitcoin Trust in 2013. In 2018, the U.S. Patent and Trademark Office awarded the Winklevoss brothers a patent for “exchange-traded products.\"","For the next decade following the Winklevoss’ application, the SEC rejected multiple applications for a spot Bitcoin ETF, citing the cryptocurrency’s volatility and vulnerability to price manipulation.","The tides began to shift in 2023, when the world’s largest asset manager, BlackRock, shocked the financial world with its filing to run a Bitcoin ETF.","In October 2023, the SEC was formally ordered by a court to review Grayscale’s application to convert its flagship Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF, with the court finding that the regulator had failed to adequately explain its reasoning for disapproving its application.","In January 2024, the SEC finally approved multiple spot Bitcoin ETFs, with SEC chair Gary Gensler conceding that “circumstances, however, have changed” following the court’s decision.","Cannabis ETFs have become popular for many of the same reasons that Bitcoin ETFs have. Just like crypto, the marijuana industry is viewed as risky and uncertain by traditional investors who still want the opportunity to profit from it.","A Bitcoin ETF in the U.S. is expected to bring a new level of mainstream trustworthiness and acceptance to Bitcoin investing. In 2020 and 2021, big publicly traded companies including Square and Tesla bought Bitcoin as an investment for their balance sheets, which spurred new adoption—but the cryptocurrency is still seen by many conservative investors as a risky bet or even a gimmick.","The approval of a spot Bitcoin ETF by the SEC effectively brings Bitcoin to Wall Street, with the Bitcoin ETF traded through the same places as Tesla stock, bonds, gold, oil, or any other traditional assets. It also means that institutional investors can more easily speculate on the price of Bitcoin, without the need to hold the cryptocurrency themselves.","Just a day after the launch of the Bitcoin ETFs, trading volumes hit $1.9 billion, with inflows of over a billion dollars in the first week. But it wasn’t all good news. The price of Bitcoin dropped as investors who’d held Grayscale Bitcoin Trust (GBTC) shares took the opportunity to cash out, causing selling pressure.","Inflows continued to break records in the months following the launch of the Bitcoin ETFs, with BlackRock\u0027s iShares Bitcoin Trust (IBIT) hitting $10 billion in assets under management (AUM) just seven weeks after its launch, becoming the fastest ETF ever to reach this milestone. The first gold-backed ETF, by contrast, took over two years to achieve this figure.","Almost 4% of the entire supply of Bitcoin was held by Bitcoin ETFs by early March, with spot Bitcoin ETFs hitting $50 billion in AUM—more than half the value of AUM held by gold-backed ETFs.","“We thought that maybe Bitcoin was a competitor to gold, but it has actually run up the leaderboard, and now it’s starting to nip at the heels of the S&P 500 Index ETFs,” MicroStrategy CEO Michael Saylor said at the time.","In early March 2024, BlackRock filed a prospectus with the SEC to add Bitcoin ETFs to a strategic portfolio dubbed the Strategic Income Opportunities Fund.","Following the approval of spot Bitcoin ETFs, attention quickly turned to the possibility of spot ETFs for other cryptocurrencies such as Ethereum. As of January 2024, multiple asset managers have filed applications for spot Ethereum ETFs, including many of those who have already launched Bitcoin ETFs, such as BlackRock and Grayscale."],"create_date":"2024-03-08T14:30:56","tag":"guide,learn,ETF,ETFs,SEC,SEC regulations,Bitcoin ETF,bitcoin","author":"Decrypt / Ki Chong Tran, Robert Stevens, Daniel Roberts, Stephen Graves"}
{"url":"https://decrypt.co/77794/bitcoin-etf-hopefuls-shaken-sec-gary-gensler","web_url":"https://decrypt.co/","type":"article","description":"SEC Chair Gary Gensler hinted that he’d be more open to an ETF backed by Bitcoin futures, and not physical BTC. ETF hopefuls aren’t pleased.","title":"Bitcoin ETF Hopefuls Were Rattled by SEC Chair Comments. Here’s Why - Decrypt","content":["Bitcoin ETF applicants in the U.S. have been shaken by SEC Chair Gary Gensler\u0027s latest comments about the cryptocurrency market.","Many of the firms that have recently petitioned the SEC for its approval to launch a Bitcoin ETF, including Anthony Scaramucci’s Skybridge Capital, were bullish that Gensler—who had previously expressed an interest in crypto as a “catalyst for change”—would at last greenlight the investment product that has eluded the crypto market for years.","But in comments made Tuesday at the Aspen Security Forum, Gensler signaled that he would only be open to approving a Bitcoin ETF under strict rules and not necessarily one that provides direct Bitcoin exposure, as first reported by Bloomberg. Gensler said that he “particularly looked forward to” the SEC’s review of “ETFs limited to these CME-traded Bitcoin futures.”","And a Bitcoin futures ETF is not what the market wants, according to experts and those involved in the ETF space who spoke to Decrypt. “People don\u0027t want Bitcoin futures exposure, they want physical Bitcoin exposure,” Bloomberg ETF research analyst James Seyffart said.","Gabor Gurbacs, director of digital asset strategies at VanEck, an investment firm that has filed an application to the SEC for a Bitcoin ETF, said that a “physical exposure Bitcoin ETF is more efficient than futures-based fund structures.” He claimed that futures contracts are expensive to roll out for the issuer, more costly for investors, and that, in general, the futures market is less liquid than the spot market, where traders buy and sell Bitcoin directly.","“The SEC should allow market participants to pick products and not hold up structures that better protect investors,” he said.","An ETF, or exchange-traded fund, is a popular investment tool that allows people to buy shares that represent an asset, like real estate, gold, or foreign currencies.","A Bitcoin and other crypto ETFs allow investors to invest in the digital asset without having to worry about actually buying and securely storing it (which can be tricky for some). CME, as name-checked by Gensler, is the Chicago Mercantile Exchange, a derivatives market which trades Bitcoin futures: contracts that bet on the price of the biggest cryptocurrency.","A Bitcoin ETF doesn’t yet exist in the U.S. but those approved in Canada have been extremely popular. The SEC has been reluctant to approve a Bitcoin ETF for U.S. investors due to market manipulation concerns. But there is evidently demand for a Bitcoin ETF in the U.S. market: several high-profile companies have applied to the SEC to get one approved, and the list seemingly grows larger with each passing month.","But Gensler’s openness for a Bitcoin ETF that tracks futures would only expose investors to contracts that bet on the price of Bitcoin going up and down. It appears that Gensler prefers this as the futures market is regulated by the Commodity Futures Trading Commission—whereas the Bitcoin spot market, the buying and selling of physical Bitcoin, isn’t regulated by either the CFTC or SEC.","“At the end of the day, Bitcoin ETFs are working around the world in Europe, Canada, and elsewhere,” Seyffart added. “The U.S.-based traditional financial tools that people are using to get exposure to Bitcoin are inefficient and costly. Whether that be Grayscale\u0027s GBTC or using MicroStrategy as a proxy. But the SEC doesn\u0027t seem to be taking any of that into account—which is an error in my opinion.”","Grayscale’s GBTC is an investment product which enables investors to trade shares in trusts holding large pools of Bitcoin. It isn’t an ETF because it’s a trust that holds Bitcoin. GBTC’s share prices have historically differed wildly from the price of Bitcoin, the underlying asset.","It once sold at a premium, meaning investors would pay well above the price of Bitcoin per share for the privilege of buying into the trust. But as demand in the product has faded, those shares now sell at a discount. “This isn\u0027t Grayscale\u0027s fault—it\u0027s just a side effect of the structure,” added Seyffart.","Seyffart also said that if Bitcoin is truly manipulated, market manipulation would still be a problem for a futures ETF because it would “feed through the futures market.” This is because they\u0027re “inter-related,” according to the analyst.","Over the border in Canada, regulators can’t seem to approve Bitcoin and Ethereum ETFs fast enough—and investors love them. Christopher Matta, president of 3iQ Digital Assets, one such fund, told Decrypt that a futures ETF would be a “small step” for U.S. investors.","“This dance has been going on for years, and I expect it to continue for several more as the regulatory landscape becomes clearer,” he said. “In the meantime, the asset management space in crypto will continue to innovate. In the near future I would expect asset managers to pivot to more flexible vehicle types, such as separately managed accounts (SMAs), which could be as attractive as ETFs over the long run.”","Disclaimer","The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."],"create_date":"2021-08-05T18:39:44","tag":"investing,ETF,SEC,gary gensler,Bitcoin ETF,bitcoin,cryptocurrency,trading","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/37063/bitcoin-wallet-ledgers-database-hacked-for-1-million-emails","web_url":"https://decrypt.co/","type":"article","description":"Hardware wallet maker Ledger suffered a breach of 1 million customer emails and e-commerce documents in June. No user funds were affected.","title":"Bitcoin wallet Ledger’s database hacked for 1 million emails","content":["Bitcoin hardware wallet maker Ledger revealed today that its e-commerce database was hacked last month, leaking 1 million emails and some personal documents. No user funds were affected by the breach.","Ledger said the attack targeted only its marketing and e-commerce database, meaning the hackers were unable to access users\u0027 recovery phrases or private keys. All financial information—such as payment information, passwords, and funds—was similarly unaffected. The breach was unrelated to Ledger\u0027s hardware wallets or its Ledger Live security product, the company added.","\"Solely contact and order details were involved. This is mostly the email address of approximately [1 million] of our customers. Further to the investigation, we have also been able to establish that a subset of them was also exposed: first and last name, postal address phone number, and product(s) ordered,” said Ledger in its announcement.","The firm specified that more detailed personal information was leaked in 9,500 cases, including phone numbers, postal addresses and what product they purchased. The announcement added that, \"More detailed personal information could have been exposed.\"","A researcher participating in Ledger’s bug bounty program flagged the issue initially on July 14. The firm patched the problem at the time, but later discovered the breach had occurred weeks earlier on June 25. The cause: A third-party tool that accessed the marketing and e-commerce database using a (now-disabled) API key.","","In a note to clients, Ledger CEO Pascal Gauthier said the firm was \"extremely regretful\" about the incident. He further cautioned users to be wary of phishing attempts: “We take privacy very seriously, we discovered this vulnerability thanks to our own bug bounty program, we fixed it immediately.”","“But regardless of all that we did to avoid and fix this situation, we sincerely apologize for the inconvenience that this matter may cause you,” added Gauthier.","Meanwhile, Ledger said France’s Data Protection Authority, the CNIL, was notified about the breach on July 16. The firm is also working with the Orange Cyberdefense (OCD) to find any evidence of the stolen data being sold online.","All affected users were notified about the breach today and the investigation is ongoing.","Update: This article has been updated with more details from Ledger.","Before you leave, follow us on Twitter to be the first to major stories when they break."],"create_date":"2020-07-29T08:05:59","tag":"ledger,hack,bitcoin,Breaking Push,crypto,wallet","author":"Decrypt / Shaurya Malwa"}
{"url":"https://decrypt.co/198032/grayscale-etf-ethereum-futures-sec-application","web_url":"https://decrypt.co/","type":"article","description":"The fund, if approved by the Securities and Exchange Commission, would be separate from the firm’s proposed Bitcoin ETF.","title":"Grayscale Investments Applies to Offer Ethereum Futures ETF - Decrypt","content":["Grayscale Investments has applied to the U.S. Securities and Exchange Commission for a new crypto exchange-traded fund (ETF). Unlike the flurry of Bitcoin spot ETFs still sitting with the regulator, however, this one would be an Ethereum futures ETF.","Paperwork filed by the firm on Tuesday showed that the fund would \"not transact in Ether and will not be required to retain an Ether custodian\" and instead would deal strictly in futures.","Grayscale\u0027s filing comes after the asset manager last month scored a victory Wall Street\u0027s biggest regulator when a federal judge decided to overturn the SEC\u0027s decision to block Grayscale from converting its Bitcoin trust into a spot ETF.","Now, as Grayscale awaits approval for its Bitcoin ETF, it is hoping an Ethereum futures ETF will get the green light from the SEC.","The SEC first approved a Bitcoin futures ETF—which allows investors to bet on the future price of digital assets— in 2021. Such investment vehicles track the price of cryptocurrencies but do not store crypto.","Investors are really hungry for spot crypto ETFs, and the SEC is currently reviewing a number of such applications—including one from the world\u0027s top asset manager, BlackRock.","A crypto ETF would give traditional investors exposure to the asset in a safer way: ETFs are investment vehicles that allow people to buy shares that track the price of an underlying asset, and a Bitcoin ETF would allow investors to invest in the asset without having to worry about storing and protecting their cryptocurrency holdings."],"create_date":"2023-09-20T20:57:02","tag":"Grayscale,Ethereum,SEC,Bitcoin ETF,Grayscale Bitcoin Fund,Ethereum Futures ETF","author":"Decrypt / Mat Di Salvo"}
{"url":"https://decrypt.co/52118/hacked-ledger-database-dumped-on-raidforums","web_url":"https://decrypt.co/","type":"article","description":"The database of over a million email addresses was dumped on Raidforums, a site dedicated to sharing hacked databases.","title":"Hacked Ledger Database Dumped On Raidforums - Decrypt","content":["More than a million customer emails that were apparently stolen from hardware wallet manufacturer Ledger were made publicly available on a hacker site today. Ledger said it was still confirming the details of the incident but admitted that the data “indeed could be the contents of our e-commerce database from June, 2020.”","The leaked data, which was published on Raidforums, also includes names, physical addresses and phone numbers of Ledger customers, and appears to originate from a hack of Ledger\u0027s e-commerce database in June.","The full leak amounts to over a million email addresses and over 270,000 physical addresses and phone numbers.","Leak is legit. Over 1,000,000 email addresses Over 250,000 physical addresses and phone numbershttps://t.co/hLoXv3BATk","— Jameson Lopp (@lopp) December 20, 2020","","According to cybersecurity site haveibeenpwned.com, it had already listed 69% of the addresses in the dumped database as having been compromised, from the time of the original hack.","New breach: Ledger had over 1M email addresses breached in June, sold, then dumped publicly today. Data also included names, physical addresses and phone numbers. 69% were already in @haveibeenpwned. Read more: https://t.co/F44bBWzioQ","— Have I Been Pwned (@haveibeenpwned) December 20, 2020","","In a series of tweets, Ledger noted that it has been alerted to the database dump, and is \"still confirming\" whether the leaked information is genuine. \"Early signs tell us that this indeed could be the contents of our e-commerce database from June, 2020,\" the company stated, adding that, \"It is a massive understatement to say we sincerely regret this situation.\"","The original hack targeted Ledger\u0027s marketing and e-commerce database, meaning that only contact and order details were involved; no financial information, recovery phrases, or keys were exposed in the attack. In 9,500 cases, phone numbers, postal addresses and details of product purchases were exposed in the hack.","The attackers were able to access the e-commerce database using a (since disabled) API key.","Speaking to the Decrypt Daily podcast earlier this year, Ledger VP of Marketing Benoit Pellevoizin warned that the leaked information could be used in phishing attacks in an attempt to hoodwink Ledger customers into handing over their private keys. “Basically, with emails, they can target our clients to impersonate Ledger to ask them for their seed phrase to gain access to coins… we never ask that,” Pellevoizin said.","In a tweet today, Ledger reiterated that users should never share their 24-word recovery phrase with anyone, \"even if they are pretending to be a representative of Ledger.\" The company has also set up a webpage where users can report the details of phishing attacks.","MOST IMPORTANTLY: Never share the 24 words of your recovery phrase with anyone, even if they are pretending to be a representative of Ledger. Ledger will never ask you for them. Ledger will never contact you via text messages or phone call.","— Ledger (@Ledger) December 20, 2020","","In a statement at the time of the original hack, Ledger said that France’s Data Protection Authority, the CNIL, was notified about the breach on July 16."],"create_date":"2020-12-20T22:44:10","tag":"ledger,ledger hack,hack,hacked,Hacker,hackers,hardware wallet,hardware wallets,bitcoin hardware wallet,Breaking Push","author":"Decrypt / Stephen Graves"}
{"url":"https://decrypt.co/32492/there-are-now-8000-bitcoin-atms-globally/","web_url":"https://decrypt.co/","type":"article","description":"Global installations have jumped by 150% in two years, with the US leading the pack. But regulation is coming.","title":"There are now 8,000 Bitcoin ATMs globally - Decrypt","content":["The number of Bitcoin ATMs worldwide has surged by 150% in the past two years, according to data from Norwegian financial services company AksjeBloggen.","Since the introduction of the first Bitcoin ATM in 2013, more than 8,000 machines have now been installed in over 75 countries—a sure fire indication of healthy growth in the cryptocurrency industry.","In just the first six months of this year, more than 1,713 ATMs were installed. The vast majority of them are in North America.","To begin with, the number of installations saw sluggish growth, data from Coin ATM Radar reveals. But, by January 2017, around 1,000 Bitcoin ATMs were springing up every year. By the start of 2020, there were 6,352 ATMs in operation.","Healthy growth in the ATM sector comes at a price. ATMs look set to become a target for regulation, as governments around the world seek to put the screws on money laundering, according to blockchain forensics firm Ciphertrace.","The startup released a report, earlier this month, suggesting that 88% of funds from US-based Bitcoin ATMs sent to exchanges in 2019 ended up offshore.","According to Ciphertrace, the amount of money wired to high-risk, overseas exchanges—which are more likely to be used for money laundering—has doubled every year since 2017. Authorities are concerned that ATMs present the simplest method of currency conversion, and are boon for money laundering, as they allow for transactions between two fiat currencies, underpinned by Bitcoin.","In Canada, regulators are already cracking down on Bitcoin ATM transfers, and recently passed a law mandating operators to report all transactions above $10,000 Canadian dollars (about $7,400).","Notices alerting customers to scam transactions, have also appeared on machines in Canada.","As fraud becomes more common, police are finding new ways to warn the public. Read how @RCMPAlberta started posting fraud alerts at Bitcoin ATMs across the province. https://t.co/CMbDvfORic pic.twitter.com/c6cfZDB6Sr","— RCMP (@rcmpgrcpolice) June 9, 2020","","Germany, Spain and the US also have Bitcoin ATMs in their sights, as conduits for tax evasion and money laundering.","In 2019, US citizen Kunal Kalra laundered $25 million through his own DIY Bitcoin ATM. Such high profile cases, combined with the surge in funds sent to high-risk exchanges, put ATMs firmly on the regulatory hit list."],"create_date":"2020-06-16T15:02:35","tag":"money laundering,bitcoin atm,business","author":"Decrypt / Adriana Hamacher"}
