{"url":"https://blog.coinspectator.com/2020/12/21/typerium-the-app-that-aims-to-revolutionise-content-creation/","web_url":"https://blog.coinspectator.com/","type":"article","description":"UK-based blockchain start-up Typerium has revealed an app that it says will change the way content creation is done for everyone. The app, available on the Apple App Store, is designed to enable users to create fantastic visual content that can be shared instantly on every digital platform. Typerium will expand its offering in the … Continue reading Typerium: the app that aims to revolutionise content creation","title":"Typerium: the app that aims to revolutionise content creation - CoinSpectator Blog","content":["","The app, available on the Apple App Store, is designed to enable users to create fantastic visual content that can be shared instantly on every digital platform.","Typerium will expand its offering in the future, but even v1 of the app offers the opportunity for creators to access sophisticated suites of photo and text editing options, more than 400 premium fonts from some of the best type foundries around and free access to more than half a million stock images.","There are also more than 40,000 professional-quality designed assets already available on the Typerium app, with more added every day.","Simplicity is also key to the Typerium platform: with it, you can share the assets you’ve created to every social media network with just one click.","Crucially, though, all this work is protected by Typerium using blockchain technology.","The app took more than two years of work to reach the point of a successful launch, but Alex Haigh, the founder of Typerium, feels the app could change the game completely for content creators.","“It’s been an extremely challenging 2 years,” he says, “however, I believe we now have a solid foundation to build on to compete with companies like Canva, who have concerned the market for too long.”","Ultimately, Typerium intends to facilitate the work of content creators with a whole blockchain-protected ecosystem where they can work and run their business. This means a social media network and marketplace as well as a distributed platform for content creation.","Alex Haigh again: “What we are ultimately setting out to build has never been done before. In these current times, it’s more important than ever to provide people with an opportunity to become self-sufficient without the need for reliance on huge corporations or marketplaces for their livelihood. This is the first crucial step towards creating a decentralised platform that has the potential to empower content-creators.”","With top-quality designs available, a look and feel that’s smooth and sophisticated, and an easy versatility and simplicity in its operation, the first iteration of the Typerium app looks to be off to a good start."],"create_date":"2020-12-21T17:30:39+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/07/survey-reveals-that-one-in-four-millennials-would-rather-invest-in-bitcoin-than-stocks/","web_url":"https://blog.coinspectator.com/","type":"article","description":"If you weren’t already aware of Bitcoin’s cultural impact amongst millennials, then this latest survey from Blockchain Capital should wake you up to how this generation view the cryptocurrency. According to the survey, one-in-four millennials would rather invest in Bitcoin than stocks and shares. The study is a clear indicator that the younger generation view … Continue reading Survey reveals that one-in-four millennials would rather invest in Bitcoin than stocks","title":"Survey reveals that one-in-four millennials would rather invest in Bitcoin than stocks - CoinSpectator Blog","content":["If you weren’t already aware of Bitcoin’s cultural impact amongst millennials, then this latest survey from Blockchain Capital should wake you up to how this generation view the cryptocurrency.","According to the survey, one-in-four millennials would rather invest in Bitcoin than stocks and shares. The study is a clear indicator that the younger generation view cryptocurrencies as genuine investment opportunities.","To explain these figures, we have to look at the details of the survey Blockchain Capital undertook. The venture capital firm’s research found that a good percentage of those aged between the ages of 18-34 reckon Bitcoin has a bright future.","To be exact, the survey found that 27 percent of respondents would rather take $1,000 worth of Bitcoin, rather than $1,000 of traditional stocks. Meanwhile, 22 percent would take the same amount of the cryptocurrency over real estate and 30 percent would take Bitcoin over government bonds.","Other results from the survey showed that 30 percent of Americans are at least somewhat familiar with the currency. An understandably higher percentage of younger people knew about Bitcoin, than their older counterparts (42 percent of millennials opposed to 15 percent of those over 65).","Considering that only two percent of Americans have owned or own Bitcoin, it appears that there is a genuine opportunity for expansion, as there is already a huge level of recognition for the currency in society. This was shown in the fact that 19 percent of Americans indicated that they’d buy Bitcoin in the next five years.","Millennials have certainly abandoned any skepticism associated with it, with over half (52 percent) citing Bitcoin as a positive financial innovation.","This survey was taken last year and had over 2,000 American adults taking part."],"create_date":"2018-04-07T07:00:49+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/03/04/floki-dao-initiates-24-million-token-burn-for-enhanced-security/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Floki DAO Initiates $24 Million Token Burn for Enhanced Security In a strategic move to bolster its security measures, Floki, a decentralized autonomous organization (DAO), has announced the greenlighting of a token burn worth $24 million. The decision, approved by the Floki community through a democratic voting process, will see over 190 billion Floki tokens … Continue reading Floki DAO Initiates $24 Million Token Burn for Enhanced Security","title":"Floki DAO Initiates $24 Million Token Burn for Enhanced Security - CoinSpectator Blog","content":["Floki DAO Initiates $24 Million Token Burn for Enhanced Security","In a strategic move to bolster its security measures, Floki, a decentralized autonomous organization (DAO), has announced the greenlighting of a token burn worth $24 million. The decision, approved by the Floki community through a democratic voting process, will see over 190 billion Floki tokens destroyed, constituting two percent of the total circulating supply.","Scheduled to take place within the next seven days, the token burn aims to achieve two primary objectives:","Enhanced Security","By eliminating a significant portion of its tokens, Floki seeks to reinforce its long-term security posture. This proactive measure also serves to mitigate potential risks associated with security breaches or market volatility resulting from external integrations.","Circulation Control","The burn will ensure that the tokens are permanently removed from circulation, thereby exerting greater control over the supply dynamics.","The Multichain Saga","The tokens earmarked for burning were originally intended for utilization in collaboration with Multichain, a cross-chain bridge service. However, following careful deliberation, Floki opted to withdraw the tokens to a secure, multisignature wallet managed internally.","The subsequent collapse of Multichain validated Floki’s preemptive decision to safeguard its assets. By securely storing the tokens in an internal wallet, the team believes that initiating the burn is the most prudent course of action to prevent any potential misuse in the future."],"create_date":"2024-03-04T13:15:54+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/06/17/shiba-inu-soars-as-it-gets-ready-for-coinbase-pro-listing/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Is 2021 the year of the meme coin? Of course, it is not the year that this type of crypto was first created, but many believe it is the year when these coins hit their stride. For instance, dogecoin has hit the trading headlines more than once over the past 12 months and that’s not … Continue reading SHIBA Inu Soars As It Gets Ready For Coinbase Pro Listing","title":"SHIBA Inu Soars As It Gets Ready For Coinbase Pro Listing - CoinSpectator Blog","content":["Is 2021 the year of the meme coin?","Of course, it is not the year that this type of crypto was first created, but many believe it is the year when these coins hit their stride. For instance, dogecoin has hit the trading headlines more than once over the past 12 months and that’s not just because Elon Musk happened to mention it on a very popular weekly comedy sketch show.","Now, shiba inu (SHIB) seems to be having its moment, with prices of the crypto jumping around 30 percent after Coinbase Pro announced that the crypto will be listed on its platform in just a matter of days.","According to Coinbase Pro, trading will begin on or after 9am Pacific Time (PT) Thursday June 17, if liquidity conditions are met. At the time of writing, it is listed at a price of around $0.0000092 and its market cap is $3.6 billion.","Coinbase Pro also announced that it will be adding both chiliz (CHZ) and the keep network (KEEP). Both CHZ and KEEP saw significant increases in the 24 hours after the announcement. Both CHZ and SHIB will not be available to New York residents.","This announcement comes in the same month that DOGE was listed on the platform. Coinbase Pro recently also added trading support for a number of tokens, including polkadot (DOT), gitcoin (GTC), enzyme token (MLN), amp (AMP), and internet computer (ICP)."],"create_date":"2021-06-17T12:09:21+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/12/mayor-of-bogota-announces-workshop-for-teachers-interested-in-blockchain-tech/","web_url":"https://blog.coinspectator.com/","type":"article","description":"The Mayor of Bogotá has announced a workshop for teachers interested in Blockchain technology in partnership with the High District ICT Counseling who will be hosting the workshop on Thursday 12th April called: ‘Technology blockchain: an experiment for the schools of the District’. The workshop is aimed at teachers of public institutions who are interested in … Continue reading Mayor of Bogotá announces workshop for teachers interested in Blockchain tech","title":"Mayor of Bogotá announces workshop for teachers interested in Blockchain tech - CoinSpectator Blog","content":["The Mayor of Bogotá has announced a workshop for teachers interested in Blockchain technology in partnership with the High District ICT Counseling who will be hosting the workshop on Thursday 12th April called: ‘Technology blockchain: an experiment for the schools of the District’.","The workshop is aimed at teachers of public institutions who are interested in learning more about the uses and applications of blockchain technology that serves to authenticate and verify data and transactions.","The results of a blockchain prototype and its impact on the application of student representatives of the Rafael Bernal Jiménez and El Rodeo schools will be announced, as well as reflection on democracy held at Colegio Unión Colombia .","Attendees will also learn about financial, medicine and notary uses of the Blockchain and will be asked to input ideas on how this exciting technology can be applied in the education sector.","Sergio Martínez, High ICT Adviser, said “The Mayor of Bogotá wants to demonstrate to teachers that the application and use of blockchain technology for pedagogical processes is feasible. “We take as an example the elections of the student representatives that took place in the schools, since it is the first step towards exercising the right to vote and a healthy democracy through state-of-the-art technologies,” he said."],"create_date":"2018-04-12T06:51:15+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/02/new-formula-of-success-eee-bnt-your-benefits/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Elementh is now expanding frontiers of its usability, empowering users to employ the offered tokens in numerous applications. Elementh has joined the Bancor Network, making operations with its tokens more flexible and expedient. At the same time, the tokens themselves become more convertible and can bring more advantages for their holders. Integration into the Bancor … Continue reading New Formula of Success: EEE + BNT \u003d Your Benefits","title":"New Formula of Success: EEE + BNT \u003d Your Benefits - CoinSpectator Blog","content":["Elementh is now expanding frontiers of its usability, empowering users to employ the offered tokens in numerous applications. Elementh has joined the Bancor Network, making operations with its tokens more flexible and expedient. At the same time, the tokens themselves become more convertible and can bring more advantages for their holders.","Integration into the Bancor Network will provide continuous liquidity for the Elementh tokens, giving TGE participants an option to easily convert their EEE to ETH, BNT, or other tokens, following the TGE.","Bancor’s conversion scheme is based on an innovative connector method, allowing tokens to be interconnected through automatically calculated prices. Generally speaking, Bancor is a decentralized liquidity network where users can easily convert any integrated token at an automatically calculated price, without the need to match buyers and sellers, using the Bancor Wallet or any Web3 wallet wallet.","EEE will join the the Bancor Network immediately after the end of the Elementh TGE.","About Bancor","The Bancor Protocol is a standard for the creation of Smart TokensTM, cryptocurrencies with built-in convertibility directly through their smart contracts. Bancor utilizes an innovative token “connector” method to enable formulaic price calculation and continuous liquidity for all integrated tokens, without needing to match two parties in an exchange.","Smart Tokens interconnect to form token liquidity networks, allowing user-generated cryptocurrencies to thrive. To convert tokens instantly, visit the Bancor Web App or join the Bancor Telegram group for more information."],"create_date":"2018-04-02T10:45:10+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/10/coss-io-launches-trade-of-mark-space-platforms-mrk-token/","web_url":"https://blog.coinspectator.com/","type":"article","description":"APRIL 11, 2018 – COSS.IO, a Singapore-based cryptocurrency trading platform today announced that it has included the MARK (MRK) coin into its list of digital currencies. The listing is symbolically confined to the date April 12th, which is celebrated internationally as the Day of Human Space Flight. Since 1962, April 12 has been celebrated in … Continue reading COSS.IO LAUNCHES TRADE OF MARK.SPACE PLATFORM’S MRK-TOKEN","title":"COSS.IO LAUNCHES TRADE OF MARK.SPACE PLATFORM\u0027S MRK-TOKEN - CoinSpectator Blog","content":["APRIL 11, 2018 – COSS.IO, a Singapore-based cryptocurrency trading platform today announced that it has included the MARK (MRK) coin into its list of digital currencies. The listing is symbolically confined to the date April 12th, which is celebrated internationally as the Day of Human Space Flight.","Since 1962, April 12 has been celebrated in Russia (formerly the Soviet Union) as Cosmonautics Day and since 2011 internationally as the International Day of Human Space Flight (or Yuri’s Night). The event is held to increase public interest in space exploration and to inspire a new generation of pioneers. Driven by space-inspired artistic expression and culminating in a worldwide network of annual celebrations and educational events, Yuri’s Night creates a global community of young people committed to shaping the future of space exploration while developing responsible leaders and innovators with a global perspective. These global events are a showcase for elements of culture that embrace space including music, dance, fashion, and art.","To commemorate and celebrate this great historical event, COSS.IO has chosen April 12 as the day to launch the MRK, which is the internal digital currency of MARK.SPACE, world’s first open-source, platform-agnostic social VR and AR-compatible ecosystem. MARK.SPACE, as the name suggests, symbolizes a framework of different possibilities, that not only allow for creation of so-called “spaces”, but also give the opportunity to virtually go into space and beyond. The latter is the reason for choice of date.","MARK.SPACE is an open-source platform for creation of 3D, VR and AR-compatible websites, available on any browser, on any device, and without pre-installation or pre-registration. Users don’t need to know even the basics of programming to create VR-compatible web-spaces and headgear is optional. HTML5 frontend development allows to connect any top-level domain to any space in the virtual universe of MARK.SPACE. Website: http://mark.space","COSS stands for Crypto One-Stop Solution and represents a cryptocurrency exchange platform, which encompasses all features of a digital economic system based on crypto. The COSS platform serves as a one-stop shop for multiple cryptocurrency-related services bringing cryptocurrencies to the masses. COSS is happy to partner the Next Generation FinTech Solution with MARK.SPACE, which, in turn, is the Next Generation of Internet. Website: http://coss.io","Contact: Vladislav Utushkin, CMO MARK.SPACE","Website: http://mark.space/","Email: [email protected]"],"create_date":"2018-04-10T18:24:31+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/20/fake-news-binance-will-not-introduce-dollar-trading/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Binance has quashed rumours that it intends to introduce fiat-to-crypto trading pairs. A spokesperson told Bloomberg, the reports are “fake news”. Binance only handles trading between cryptocurrencies, not fiat. Several crypto publications covered the news including the Daily Express, all based of rumours circulating across social media. In the last 24 hours Binance has handled … Continue reading Fake news: Binance will not introduce dollar trading","title":"Fake news: Binance will not introduce dollar trading - CoinSpectator Blog","content":["Binance has quashed rumours that it intends to introduce fiat-to-crypto trading pairs.","A spokesperson told Bloomberg, the reports are “fake news”.","Binance only handles trading between cryptocurrencies, not fiat.","Several crypto publications covered the news including the Daily Express, all based of rumours circulating across social media.","In the last 24 hours Binance has handled $2,152,690,811 billion in trading.","Source: Bloomberg"],"create_date":"2018-04-20T09:57:01+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/11/30/do-you-have-to-understand-blockchain-to-play-in-bitcoin-casino/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Blockchain technology is considered to be the revolution in the world of IT and with each passing day that assumption solidifies itself as a hard fact. Although, in the beginning, when the first blockchain based cryptocurrency; Bitcoin started its journey, few could predict such heavy impact. Back then, the first trailblazers to fully adopt crypto … Continue reading Do you have to understand blockchain to play in Bitcoin Casino","title":"Do you have to understand blockchain to play in Bitcoin Casino - CoinSpectator Blog","content":["Blockchain technology is considered to be the revolution in the world of IT and with each passing day that assumption solidifies itself as a hard fact. Although, in the beginning, when the first blockchain based cryptocurrency; Bitcoin started its journey, few could predict such heavy impact. Back then, the first trailblazers to fully adopt crypto and blockchain technology were the pioneering BTC Casinos such as FortuneJack. They predicted this astronomical rise and are to this day, providing best Bitcoin Casino entertainment to their communities of players. So, what is the Blockchain technology and why has it become synonymous with the Bitcoin Casinos all around the world?","How does the Blockchain System work?","First and foremost, Blockchain is the decentralized system that doesn’t have any central entity that controls or regulates it’s working process. Here, the users have control over everything and there is a collective infrastructure that creates this unique ecosystem that contains everything connected to cryptocurrencies. All transactions and operations are transparent, but nobody can ever decipher the users and their personal information. The first thing that blockchain associates to is the total freedom and maximum levels of speed and efficiency for the business. Any user of Blockchain technology is entitled to some heavy benefits, that are unprecedented for the rest of the financial world. So, how does Blockchain technology intertwine with the Bitcoin Casino industry?","Benefits of Blockchain technology for the Bitcoin Casino","There are several major issues that classic online casinos are suffering from, due to the usage of FIAT currencies and banks. This is where the BTC Casinos shine, because they eliminate all these problems, turning them into the advantages. First thing is speed. Where classic online gambling sites take days to complete the transactions, Bitcoin Casinos perform both deposits and withdrawals in the matter of minutes. Security is never the issue with BTC Casinos because of the fact that the Blockchain system is decentralized and almost impossible to hack. Aside from all this, there is another massive advantage that is unprecedented in the gambling industry.","Factor of Anonymity in BTC Casino and all things Blockchain.","As mentioned before, all operations on blockchain keep the actors completely anonymous and nobody will ever be able to decipher the personal information of the user. The same happens for the BTC Casino players. Thanks to the blockchain technology-based payment systems, Bitcoin Gamblers remain completely hidden to any unwanted attention. No bank, government or other financial institution will ever be able to track your operations or your ID, because that’s simply the way blockchain technology is designed. It is the ultimate tool of freedom."],"create_date":"2020-11-30T10:44:21+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/10/26/huobi-launches-usdt-margined-swaps-at-the-end-of-october/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Huobi Futures has announced its latest offering that looks to take advantage of the ever-growing and popularizing stablecoin market with USDT-Margined Swaps on Oct. 26. Ten popular currencies including BTC, ETH, BCH, BSV, LINK, DOT, UNI, FIL, YFI, and BNB are listed in its first batch. Based on Huobi’s announcement, currently only Web and API … Continue reading Huobi Launches USDT-Margined Swaps at the End of October","title":"Huobi Launches USDT-Margined Swaps at the End of October - CoinSpectator Blog","content":["Huobi Futures has announced its latest offering that looks to take advantage of the ever-growing and popularizing stablecoin market with USDT-Margined Swaps on Oct. 26. Ten popular currencies including BTC, ETH, BCH, BSV, LINK, DOT, UNI, FIL, YFI, and BNB are listed in its first batch. Based on Huobi’s announcement, currently only Web and API are available; trading on APP will be supported around one week later.","The total market capitalization of stablecoins has grown from $2.6 billion at the start of 2019 to $20 billion by late September of 2020. Tether (USDT), at $16 billion, leads the way. The data indicates a clear desire and hunger to use stablecoins for the transfer of value across the cryptocurrency space, and offering a stablecoin-margined swap at this time can provide new benefits to traders. In Huobi USDT-margined swaps trading, users can trade various perpetual swaps with only USDT.","Huobi USDT-margined swaps are quoted in USDT and use USDT to calculate profit and loss. USDT-margined swaps have a linear payoff and have no delivery date; therefore users could hold positions no matter how long they want as long as no liquidation occurs. USDT-margined swaps are settled every 8 hours and are executed at 00:00, 8:00 and 16:00(GMT+8). In addition to gaining profits in a rising or falling market by opening a long or a short position, users could also use it for hedging. The following part analyzes the main features and advantages of Huobi USDT-margined swaps.","Low-par value and up to 125x leverage","Compared with coin-margined swaps, the contract face value of USDT-margined swaps is relatively low. For example, the face value of each BTC/USDT swaps contract is 0.001 BTC, the converted value of which is around 12 USDT; while for coin-margined swaps, the face value of each BTC/USD swaps contract is 100 USD. Besides, the platform provides 1x to125x leverage to lower the threshold for traders, users could adjust the leverage based on their actual needs.","Preferential fee rate","The fee rate structure on Huobi Futures is transparent. The platform only charges transaction fees for opening and closing positions. During the promotion period, the lowest transaction fee rate for Maker is -0.025% and for Taker is 0.026%. Huobi will continue to execute its VIP sharing program for USDT-margined swaps.","A good news is that, for users who are a VIP client or a market maker of both Huobi futures and coin-margined swaps, the platform will take the higher one as their VIP level of Huobi USDT-margined swaps during the promotionn period. Assume a user’s level on Huobi futures is VIP 3 while on Huobi coin-margined swaps is VIP5, the system will take VIP 5 as his level on Huobi USDT-margined swaps.","Diversified functions","In terms of trading functions, Huobi USDT-margined Swaps supports multiple order types including Limit Order, Trigger Order, IOC and FOK. There are also many functions like Flash Close, Follow a Maker \u0026 Taker available.","It’s worth mentioning that Huobi is a pioneer in the industry that uses a locked margin optimization function. With this function, users who hold both long and short positions for the same asset could enjoy a position margin reduction and therefore lower liquidation risks than that in other derivatives platforms.","Moreover, Huobi USDT-margined Swaps offers “Take profit \u0026 Stop loss” functions. Users could set in advance not only based on price, but also on profit rate.","Excellent Liquidity and Zero Clawback Record","The USDT-margined Swaps is designed by the original team of Huobi Futures whose core members were all from top investment banks. Huobi Futures has rich experience in derivative product modeling and system construction, at which users could enjoy the best liquidity and the highest trading volume.","The platform has various methods to protect users’ assets, such as cold and hot wallets separation, multi-signatures, anti-DDOS protection systems, and 20,000 BTC security funds preparation, which makes the company holding a record of zero clawbacks since the launch in December of 2018.","User-friendly liquidation mechanism","Huobi Futures is the first digital asset derivatives exchange in the industry that supports a three-phase liquidation protection mechanism; no transaction fees will be charged in partial liquidation. The platform uses Exponential Moving Average (EMA) as a second reference for forced liquidation and the clawback mechanism will not be triggered as long as the insurance fund is positive.","USDT-margined swaps are the latest product offered by Huobi, following on from the extremely successful launch of Coin-margined Swaps in March this year, and Options a few months later. Huobi’s Futures team has ingrained itself as one of the leaders in the space as the team leans on previous experience at investment banks.","“We are well aware of the growth in the stablecoin market and the amount of money that has been added to the ecosystem and want people to be able to make use of that. In countering the risk of USDT price fluctuations, we also offer USDT/USD swaps with leverage up to 1000x. In this one-stop digital asset derivatives platform, we provide USDT-margined swaps, coin-margined swaps, coin-margined futures and USDT-quoted options to satisfy the diverse needs of individual and institutional traders.” said Ciara Sun, Head of Global Business and Markets and Vice President Huobi.","Source (pressat)"],"create_date":"2020-10-26T15:50:24+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/10/29/bitcoin-latinum-backers-get-boost/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Bitcoin Latinum (LTNM) backers had their support further rectified this week, as the cryptocurrency was successfully launched on DigiFinex. Launching on DigiFinex, a platform that has a global following and over four million daily users, LTNM saw an opening of over 200 percent in its first hour. Not only that, but its developers also announced … Continue reading Bitcoin Latinum Backers Get Boost","title":"Bitcoin Latinum Backers Get Boost - CoinSpectator Blog","content":["Bitcoin Latinum (LTNM) backers had their support further rectified this week, as the cryptocurrency was successfully launched on DigiFinex.","Launching on DigiFinex, a platform that has a global following and over four million daily users, LTNM saw an opening of over 200 percent in its first hour.","Not only that, but its developers also announced that it will be available on six other exchanges by the end of the year. These exchanges are as follows: HitCTC, FMFW, Changelly, Changelly Pro, Bitmart and XT.com.","Monsoon Blockchain Corporation, who developed the cryptocurrency on behalf of the Bitcoin Latinum Foundation, also discussed the challenge of making this crypto more environmentally friendly than its alternatives.","According to a statement, this is a challenge that has already been conquered: “LTNM is one of the greenest cryptocurrencies in existence, and recently joined the Crypto Climate Accord.”","The reasoning put forward for this was as follows: “Utilizing (an) advanced Proof of Stake (PoS) mechanism, LTNM holders… earn rewards for holding their coins as collateral to stake on the Bitcoin Latinum network. This leads to less electricity consumption. LTNM reduces the energy consumption to only 0.00015 kWh per transaction.”","This asset-backed cryptocurrency is gaining new fans every day."],"create_date":"2021-10-29T12:23:33+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/08/26/the-upfiring-dapp-full-scale-project-launch-upfiring-1-2-2-dapp-release-upcoming-events-for-2020/","web_url":"https://blog.coinspectator.com/","type":"article","description":"With Upfiring 1.2.2, seamless decentralized P2P file-sharing is now possible on the Ethereum blockchain. With our product ready for user adoption, the project’s focus will be shifting towards towards community growth and marketing for the second half of 2020. Upfiring 1.2.2 Release — August 24th, 2020 Upfiring 1.2.2 has been deployed and is available for download … Continue reading The Upfiring Dapp: Full-Scale Project Launch, Upfiring 1.2.2 Dapp Release \u0026 Upcoming Events for 2020","title":"The Upfiring Dapp: Full-Scale Project Launch, Upfiring 1.2.2 Dapp Release \u0026 Upcoming Events for 2020 - CoinSpectator Blog","content":["","With Upfiring 1.2.2, seamless decentralized P2P file-sharing is now possible on the Ethereum blockchain. With our product ready for user adoption, the project’s focus will be shifting towards towards community growth and marketing for the second half of 2020.","Upfiring 1.2.2 has been deployed and is available for download on upfiring.com. This update fixes an important connection issue that will improve the dapp’s ability to discover and connect to other peers/seeders on the network. Upfiring 1.2.2’s release will ensure the dapp is ready for a growing userbase of downloaders and seeders in the coming weeks. Existing Upfiring dapp users will be prompted on application launch to update their application, or they can navigate to the “Settings” tab and click “Check for updates”, as seen below.","","The Upfiring Stress tests will evaluate Upfiring’s ability to support files with large numbers of seeders and properly distribute UFR between all active seeders on a file. It will also test out the networks capability to have many files decrypted in a short period of time. There will be 3 major stress tests in the coming months. Note: The amount of UFR offered during these events is subject to change if the UFR price fluctuates significantly. In addition, pending the results of each of these stress tests, the dates are subject to change as well.","In an effort to expand the size of our community and introduce new users to Upfiring, we have been working with closely with several Telegram groups, Youtubers, Discord groups, and influencers to plan several major events for this project. The following groups will have AMAs for Upfiring in the coming weeks. Any TBD dates will be announced via our social media when they are set:","In addition, we plan to appear on several Influencer’s Channels in September and October including:","SEO is one of the primary ways people discover new and growing projects. Upfiring will begin an SEO campaign that will focus on increasing the overall quantity of content released on our website and improving upon the quality/scope of that content. This will help to create an influx of new members in our community.","The Upfiring Blog, to be located as a subset of the upfiring.com website, will be a major contributor to the growth and promotion of Upfiring. We will be publishing content dealing with issues surrounding file-sharing, file storage, decentralization, and various other relevant topics to our project.","In addition, the dapp’s documentation will be improved to include more important information for new users, such as several potential use cases for Upfiring and how to maximize usage and earnings as a content creator.","Because the Upfiring application does not allow the direct sharing of files within the dapp, external file-sharing websites are absolutely critical to the success of this project. There are several Upfiring file-sharing websites in existence right now. In order to help these sites grow, we will be working with the developers to provide key information from our source code that will allow new and existing websites to easily analyze the metadata of .ufr files, number of seeders on a file, and other key information as well.","We will also be spending time over the next few weeks reaching out to existing file-sharing websites to help them integrate .ufr files into their sites.","Upfiring needs the help of the community in order to reach its full potential. We have one of the most decentralized Ethereum projects in the space — with our team owning an extremely small portion of the token supply relative to other projects, and having little to no control over the Upfiring smart contracts/dapp activity now that they are deployed. Our team does not profit off of the application. As such, it is imperative that the community step in and help this project grow. There are already several community-run Upfiring marketing groups floating around on Discord, Telegram, and elsewhere, and these groups have already helped immensely with the start of our marketiing campaign. If you believe in our cause and want to see the widespread decentralization of content distribution, we encourage community members to take action wherever they can. If you are interested in helping with marketing activities, you can post in our Telegram group or PM @tylerfallon on Telegram for more information.","The dapp’s development will be discussed in further detail in future posts, but several important features are in the planning stages right now:","","Funding your Upfiring wallet, obtaining UFR to use within the dapp, or converting your UFR earnings to Ethereum/other tokens is going to become a smooth experience that users will be able to do using their Upfiring wallet in the dapp. In another effort to further decentralize the dapp and remove the power that centralized exchanges have over this project, Uniswap (a decentralized exchange) will be integrated directly into the dapp. This is another huge step towards the immutability of the Upfiring network — if the Uniswap.org website goes down for any reason, you will still be able to use the smart contracts within the Upfiring dapp to convert to and from UFR with 100% uptime.","The pre-development phase of the Upfiring blockchain has begun. Currently, we are discussing the feasibility of creating a dual-network link within the dapp that will allow for payment to be made in UFR from the new Upfiring blockchain OR on the Ethereum network via ERC20 token (as it is now). A bridge will be created that will allow users to swap between the ERC20 token and mainnet coin at with a 1:1 ratio, ensuring a fixed supply of tokens and a consistent price between the two. This will also allow us to maintain our exchange listings on important, high-volume exchanges like Uniswap.org and IDEX while creating a customizable mainnet that is not limited by issues that we’ve seen on the Ethereum network, such as high fees and congestion.","Another huge development we are currently working on that will make Upfiring more widely available to users in the space is a direct integration into Google Chrome so that Upfiring and it’s functionality may be accessed directly via website, and file download/decryption can be performed with tools like Metamask.","This is an exciting time for this project. We have a ton of events planned in the coming months and would love to have you, the reader, join our communities and be a part of our project’s growth. You can get UFR on Uniswap here. Check out our social media pages: Telegram, Upfiring Forums, Reddit, Twitter, Bitcointalk, and Discord as we continue our mission to change the future of P2P file-sharing."],"create_date":"2020-08-26T11:56:12+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2023/02/08/bitstamp-secures-license-with-the-financial-markets-authority-in-france/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Bitstamp registers in France as a crypto exchange One of the most sophisticated EU regimes has recognized Binance, Bitpanda, and Société Générale. According to the regulator’s website, Bitstamp has officially registered with the Financial Markets Authority in France. It joins Binance, Bitpanda, and Société Générale’s Forge unit in registering under the EU’s most sophisticated crypto … Continue reading Bitstamp secures license with the Financial Markets Authority in France","title":"Bitstamp secures license with the Financial Markets Authority in France - CoinSpectator Blog","content":["One of the most sophisticated EU regimes has recognized Binance, Bitpanda, and Société Générale.","According to the regulator’s website, Bitstamp has officially registered with the Financial Markets Authority in France.","It joins Binance, Bitpanda, and Société Générale’s Forge unit in registering under the EU’s most sophisticated crypto regime.","","During registration, the company’s management must be competent and reputable, and money laundering regulations must be met.","The Luxembourg-based, London-based, and New York-based Bitstamp has already registered in Spain and Italy. The European crypto sector is currently awaiting the arrival of the EU’s Markets in Crypto Assets regulation, MiCA, which imposes strict reserve and investor information requirements on crypto services, such as wallets and exchanges.","To bridge the transition to MiCA, French lawmakers are proposing to separate client assets and manage conflicts of interest for unregistered companies serving the French market in the wake of the FTX collapse."],"create_date":"2023-02-08T14:43:22+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/07/the-spanish-taxman-wants-your-crypto-trading-data/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Spain’s tax regulator, commonly known as Agencia Tributaria or the Agency for Tax Administration (AEAT), has issued 60 formal requests to cryptocurrency entities seeking private customer data, such as identification documents, account ownership, trades and other information. Cryptocurrency cash machine operators, exchanges and payment gateways were some of the companies that received the request earlier … Continue reading The Spanish taxman wants your crypto trading data","title":"The Spanish taxman wants your crypto trading data - CoinSpectator Blog","content":["Spain’s tax regulator, commonly known as Agencia Tributaria or the Agency for Tax Administration (AEAT), has issued 60 formal requests to cryptocurrency entities seeking private customer data, such as identification documents, account ownership, trades and other information.","Cryptocurrency cash machine operators, exchanges and payment gateways were some of the companies that received the request earlier this week.","The information is apparently being used as part of an investigation across the crypto industry to decide whether new control procedures are required.","Furthermore, AEAT obtained data from the National Fraud Investigation Office (ONIF) on the whereabouts of offshore bank accounts held by 16 cryptocurrency exchanges registered in Spain.","It is not yet known if AEAT is seeking this information to clamp down on people not declaring capital gains from the buying and selling of cryptocurrencies. According to Tom Lee, the head of research at Fundstrat Global Advisor, US taxpayers accrued $92 billion in taxable gains from cryptocurrencies in 2017."],"create_date":"2018-04-07T09:15:21+01:00","tag":"http://www.agenciatributaria.es/","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/02/bank-negara-malaysia-issues-warning-against-fake-cryptocurrency-certificate/","web_url":"https://blog.coinspectator.com/","type":"article","description":"The Central Bank of Malaysia has issued a warning to the public after a bogus university certificate sporting official stamps was found to be in circulation. The certificate, which “certifies” that the holder has been awarded a degree as a “Certified Crypto Asset Consultant”, is stamped with both the Central Bank of Malaysia and University … Continue reading Bank Negara Malaysia issues warning against fake cryptocurrency certificate","title":"Bank Negara Malaysia issues warning against fake cryptocurrency certificate - CoinSpectator Blog","content":["The Central Bank of Malaysia has issued a warning to the public after a bogus university certificate sporting official stamps was found to be in circulation.","The certificate, which “certifies” that the holder has been awarded a degree as a “Certified Crypto Asset Consultant”, is stamped with both the Central Bank of Malaysia and University of Malaya logos, in what appears to be an attempt at fooling interested businesses or employers seeking an expert in such services.","","“BNM does not recognise these certificate holders who use such documentation in offering consultation services. Members of the public are advised to verify the validity of any certification programme before registering” said the Central Bank of Malaysia earlier in the week.","The bank has insisted that members of the public who have been presented with such certificates should verify the authenticity before entering into a relationship."],"create_date":"2018-04-02T08:09:28+01:00","tag":"Malaysia","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/01/05/legal-the-future-of-cryptocurrency-and-the-law/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Cryptocurrency is a relatively recent invention, especially when we compare it to a traditional currency, which has been around as long as humans have lived in organized societies. But with any new development, there is a natural hesitancy in acceptance of change, especially from those who are in control of the old ways. But does … Continue reading Legal? The Future of Cryptocurrency and the Law","title":"Legal? The Future of Cryptocurrency and the Law - CoinSpectator Blog","content":["Cryptocurrency is a relatively recent invention, especially when we compare it to a traditional currency, which has been around as long as humans have lived in organized societies. But with any new development, there is a natural hesitancy in acceptance of change, especially from those who are in control of the old ways. But does this hesitancy translate into cryptocurrency being illegal? Let’s take a closer look at the legality or otherwise of cryptocurrency today.","Property or Currency?","Since cryptocurrency is an alternative to national currencies, and they don’t comply with the same regulations that a central bank would enforce on official currencies, governments are hesitant to acknowledge them as real currencies. In many places, the legal establishment has deemed cryptocurrency to be property rather than currency. But why does this matter? It makes any legal complaint concerning being treated unfairly as a different procedure. Any sale is deemed to be an exchange of goods rather than a financial transaction.","Criminal Activity","The link to criminality tarnishes the view of the cryptocurrency in the eyes of the general public. But we need to consider that in most places, it is not the use of the cryptocurrency that is the illegal activity, rather what the currency is used for. There are a far higher number of criminal transactions using regular money than using crypto. Why is this is not used as an argument to ban all use of money? We cannot ignore that there is a reason for criminals to use cryptocurrency, and that is how difficult it is to trace transactions.","Purchase Protection","As we mentioned earlier, with crypto coins often not recognized as real money, you don’t receive the same payment protection as with other payment methods. A good example is the chargeback procedure when buying large-value items with a credit card. You can get around this by opting to buy USDT with a credit card rather than a bank transfer.","Trading \u0026 Profits","How do you track profit and loss when trading in cryptocurrency? It is tempting to leave these transactions off your tax return, and given the nature of tracing these payments, you would almost certainly get away with it. But that’s not to say you should try and get away with it. If you are to do things by the book, you only really profit when you transfer your coins to regular currency. Before this moment, you should consider them Capital Assets and lodge them in your accounts as such.","Banned","Although we have talked of cryptocurrency not being illegal, this is only true in most places. Some countries have made it illegal to purchase cryptocurrency, such as Namibia. It is essential to be mindful of these laws when traveling internationally or trading internationally to avoid criminal charges or freezing of your funds.","","This article has been contributed on behalf of Paxful. However, the information provided herein is not and is not intended to be, investment, financial, or other advice."],"create_date":"2021-01-05T11:01:54+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/03/02/where-governmental-regulation-and-bitcoin-prices-collide-how-crypto-correlates-with-politics/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Despite the fact that governments have been kept out of Bitcoin since its inception– they can still influence prices. For many investors, Bitcoin and similar cryptocurrencies signify a highly speculative asset that can not only provide exceptional ROI, but also allow the opportunity for investors of any level to hone their skills at trading. Trading … Continue reading Where Governmental Regulation and Bitcoin Prices Collide: How Crypto Correlates with Politics","title":"Where Governmental Regulation and Bitcoin Prices Collide: How Crypto Correlates with Politics - CoinSpectator Blog","content":["Despite the fact that governments have been kept out of Bitcoin since its inception– they can still influence prices.","For many investors, Bitcoin and similar cryptocurrencies signify a highly speculative asset that can not only provide exceptional ROI, but also allow the opportunity for investors of any level to hone their skills at trading. Trading opportunities continue to grow, as DeFi continues to pave the way for institutional interest, while retail and new investor friendly exchanges like Bitvavo.com allow space for nascent parties","For any investor, with any level of expertise and with any amount of investment will need to keep a keen eye on market happenings, as the value of Bitcoin and other cryptocurrencies is known for wild swings in either direction, with one of the biggest influencers being that of governments. Despite the fact they have little control over how the coin is priced or distributed.","Despite cryptocurrencies like Bitcoin being built in such a way that they defy political and regulatory manipulation, prices still tend to correlate with certain political moves. Bitcoin price is based on the economic principle of “artificial scarcity”, which means that the supply of Bitcoin is strictly regulated. There are 21 million Bitcoins in existence and more can never be made. The release of the coins is also regulated by the mining process– as transactions are validated, Bitcoins are released as a reward for adding transactions to the public ledger, the blockchain.","Because of this tight control of supply and release, it is impossible for political interference to directly affect the price of the asset. This was in-built into the original design of the coin by its creator, Satoshi Nakamoto. In the original whitepaper, Nakamoto alludes to the fact that centralized currencies are subject to nefarious manipulation by issuing agencies. Something that Nakamoto aimed to avoid by using cryptocurrencies as a more democratized option for financial engagement.","The decentralized nature of Bitcoin and other crypto currencies assures that no one hub of power would ever function as a gatekeeper for the networks. The decentralized network remains as such due to the validation method described above. Decentralization means that not only can there be no political influence on the coin, but that no one can interfere with the distribution or function of the coin. However, there are still many social and political occurrences that do influence the price of cryptocurrencies.","Despite the fact that government agencies have no direct control over the functionality of bitcoin, certain political actions and climates can still severely affect its price. If given its head, governments can discourage investment through three main regulatory actions:","When governments tightly regulate the price of other assets, such as fiat or bonds, through moving value amongst international markets, this can diminish the exchange value of cryptocurrencies. When other assets increase in value, it can dilute the price of associated markets.","By putting an increase of restrictions on crypto-associated business, or adding excessive licensure or accreditation requirements, the price of doing business can soar, making it a less lucrative opportunity for investors, which can dampen the resolve of startups and entrepreneurs.","By adding import restrictions or high rates of taxation can also dissuade users from engaging with a particular asset. That’s because it becomes cost prohibitive, particularly for retail investors, to invest.","Despite these classic legislative tactics on controlling the price of unregulated assets working well in other markets, bitcoin and cryptocurrencies are less likely to fall prey to these practices. Because of the decentralized nature of bitcoin mining and validating, it also becomes a borderless and extra-national asset. Which means that it would require a huge coordinated effort on behalf of multiple large governing agencies in order to make an impact on the thriving adoption of cryptocurrencies that is being seen.","Moreover, governments can also unwittingly improve prices and encourage enthusiasm for cryptocurrencies by engaging in other types of political action that can decrease trust in fiat currencies and other national securities.","As seen in countries like Venezuela, governments that have engaged in legislation that results in uncontrolled hyperinflation, citizens have chosen to turn towards cryptocurrencies in order to protect existing assets against loss of value.","As seen with the impact the novel coronavirus wrought on economies throughout the world, causing cash and coin shortages and propelling the globe closer to a cashless society left many with renewed skepticism about many national fiat systems, resulting in a greater adoption and acceptance of cryptos.","In many places, where political instability means that fewer people have access to stable financial processes, finding a better way to both move and protect personal wealth becomes even more important for many. In these areas, cryptocurrencies have presented a viable option for the un- and underbanked."],"create_date":"2021-03-02T09:19:59+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/20/crypto-highlights-20042018/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Consortium of banks test first transactions on Blockchain IBM in partnership with the CaixaBank, Bank of Montreal, Commerzbank, Erste Group and UBS have passed the first live pilot transactions on the IBM built Batavia blockchain platform. The trading of cars from German to Spain and textiles between Austria and Spain were carried out on the … Continue reading Crypto Highlights 20/04/2018","title":"Crypto Highlights 20/04/2018 - CoinSpectator Blog","content":["IBM in partnership with the CaixaBank, Bank of Montreal, Commerzbank, Erste Group and UBS have passed the first live pilot transactions on the IBM built Batavia blockchain platform. The trading of cars from German to Spain and textiles between Austria and Spain were carried out on the network. Do you think this challenges Stellar and Ripples blockchain tech?","Read more at FinExtra.","According to Morgan Stanley Equity Analyst Charlie Chan, the price of Bitcoin must reach $8,600 for mining to be profitable based on (US$0.03 kW/h) energy price.","Read more at CNBC.","The world’s largest semiconductor foundry company, TSMC which has become a major player in the Bitcoin mining industry is allegedly cutting its revenue forecast for the year blaming the uncertainty behind the cryptocurrency mining demand.","Read more at CNBC.","Tezos co-founder Arthur Breitman has been slapped with a $20,000 fine and a two year trading ban by the Financial Industry Regulatory Authority (FINRA). This seems like pocket change for an ICO that raised $232 million.","Read more at Reuters.","Three of China’s biggest tech firms Alibaba, Baidu and Tencent are battling for Blockchain stardom while steering well clear of the crypto trading crackdown, cool move eh… by investing and developing Blockchain companies, they skirt round the ban.","Baidu recently launched Totem a blockchain-based image right management platform similar to KODAKOne. They also launched a pet rearing game called Laici Gou.","Alibaba has the most Blockchain patents in the world, they recently launched a system for luxury goods sold on its flagship shopping site Tmall.","Tencent founder Pony Ma is optimistic about identity \u0026 document verification. Tencent partnered with a Chinese city to test tracking prescriptions on the Blockchain.","Read more at Quartz.","MP Matt Hancock delivered a speech at the Blockchain Conference regarding the momental impact he thinks Blockchain technology will have on people’s lives in the future. He mentioned the World Food Programme Ethereum Blockchain aid initiative, which has transferred vouchers based on cryptocurrencies to 10,000 refugees in Syria, enabling them to buy food without “the need for cash, credit cards or paper.”","The United Nations World Food Programme has received $2.4 million dollars from Belgium to support a blockchain-based payment system for refugees. Funds will also be used to expand the UAV project to collect data and analysis to cope with natural disasters.","Read more at CoinDesk.","Enterprise blockchain platform SophiaTX has been named company of the year in this months CIOApplications magazine.","Mark Karpelès, the CEO of bankrupt Bitcoin exchange Mt. Gox has found a new job as the chief technology officer of the world’s largest VPN service, London Trust Media based in Denver. His new boss is more than happy with his past role, stating he skills unarguably continue to exist. Although the CEO of London Trust Media was one of the co-founders of Mt. Gox, friends with benefits? We think so.","Read more at Fortune.","According to research by VeneBloc, cryptocurrency trading in Venezuela has reached a new record surpassing $1 million dollars of Bolivar currency to Bitcoin in April.","Read more at CNN.","Buy orders now make up for 90% of the cryptocurrency market for the first time since March 2017.","Read more at TurtleBTC.","Watch the CEO if Binance burn $1.5 million in just 3 seconds.","","Blockchain firm Enigma announced their membership in the Enterprise Ethereum Alliance as well as the Decentralized Identity Foundation.","Read more at Eligma.","After Poland’s finance ministry introduced a a %1 tax on all crypto trades, angry enthusiasts are demonstrated outside the tax ministory on Friday 19th.","Read more at WYKOP.","IOTA have announced the world’s first smart charging station where users can pay with IOTA to charge their vehicle.","Read more AMBcrypto."],"create_date":"2018-04-20T08:09:25+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/20/airchain-network-introduces-mobile-application-to-make-the-air-freight-sector-transparent-safe-and-flexible-like-never-before/","web_url":"https://blog.coinspectator.com/","type":"article","description":"AirChain Network , a blockchain powered ecosystem designed especially for the air freight sector, is all set to revolutionize the industry by addressing long standing  problems such as transparency, safety, and flexibility. The platform’s mobile applications are currently available for download via the App Store and Google Play. Warsaw, Poland April 16, 2018 AirChain Network … Continue reading AirChain Network Introduces Mobile Application to Make Air Freight Sector Transparent, Safe and Flexible Like Never Before","title":"AirChain Network Introduces Mobile Application to Make Air Freight Sector Transparent, Safe and Flexible Like Never Before - CoinSpectator Blog","content":["AirChain Network , a blockchain powered ecosystem designed especially for the air freight sector, is all set to revolutionize the industry by addressing long standing problems such as transparency, safety, and flexibility. The platform’s mobile applications are currently available for download via the App Store and Google Play.","Warsaw, Poland April 16, 2018","AirChain Network is pleased to announce the official launch of their mobile application via the App Store and Google Play. The company reveals that the beta version of AirChain Network has also gone live recently. This blockchain powered ecosystem has been built by a team of experienced developers and blockchain experts with the intention of making the air freight sector more efficient by bringing transparency, safety, and flexibility.","The global air transportation industry is a huge sector that plays an important role in people’s lives as well as industries all over the world. However, the constant increase in fuel price in the recent years has led to a situation where the air cargo is often beyond the financial capacity of an average individual, business or enterprise. At present, many companies are also reconsidering the use of air freights because of the rapidly rising security issues. Making things worse, this industry has always lagged behind in terms of transparency and the adoption of innovative technologies.","AirChain Network has built a simple yet comprehensive ecosystem that provides access to the sophisticated tools and techniques of the freight industry without the stress and price. They are creating business opportunities for the investors by providing them free and direct access to a huge range of offers that were previously available only to the institutional investors. The goal of the network is to help the business and logistic companies deliver goods and services efficiently, while the use of blockchain technology removes duplication, ensures distribution and enforces transparency. The investors and businesses using AirChain Network are able to exchange goods and services for fiat or cryptocurrency in a transparent, tamper proof and immutable distributed ledger.","“Let us assume that Tom is flying from Berlin to Seoul and has 5kg of portable luggage available. Maria, living and working in Berlin, wants to send her friend in Seoul a 5kg gift parcel. If Maria sends her parcel by conventional means of transport, the cost will be quite high and the waiting time will be long. AirChain ecosystem allows Maria and Tom to meet and exchange their needs,” explains a senior spokesperson from AirChain Network. “Maria’s package arrives at his friend’s place for the best cost, safely and quickly. Tom, on the other hand, earns an income without any effort due to the sale of his empty baggage.”","The use of the just launched mobile application from AirChain Network involves the following simple steps.","Using this mobile application, it is possible to track the parcels, goods and services sent over the network. The users will also be able to add friends, family and others and easily send and receive coins from people on the friend list. The app’s encrypted chat function allows the users to chat with their contacts. There is also a 100% secure wallet to wallet chat function. The review history of all users can be seen, helping them build credibility on the ecosystem.","The ANK token is the proprietary utility token of AirChain Network that allows the community members to send parcels on the ecosystem and make more income. Using the ANK token, it is possible to pay for parcels fee and exchange parcels and income on a peer to peer level without intermediary or regulatory fees. Before a contract, the sender and receiver are required to go through a KYC/AML process conducted by a reputable third party. Once the order is accepted, smart contact for both sides is executed by the ANK application and committed by the ANK token. The senders receive the ANK tokens in their wallet after the recipients receive their package and confirm the same. To find out more about AirChain Network, please visit https://airchain.network/","About AirChain Network: AirChain Network is a designed especially for the air freight sector. Its blockchain powered ecosystem addresses the most critical problems of the industry such as transparency, safety, and flexibility. AirChain Network has recently introduced their mobile application in two different versions for the Android and iOS versions.","Contact:","Marcin Tn [email protected]","Website: https://airchain.network/"],"create_date":"2018-04-20T12:37:20+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/10/21/eth-usd-technical-analysis-what-can-we-expect-next/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Ethereum, which was launched in 2015, is the second largest cryptocurrency after Bitcoin in terms of market capitalization. It was trading sideways for two years, at around $ 10, until 2017. That was the year of the “Gold Rush” for cryptocurrencies, and the ETH price started to increase in March. The ETH/USD had jumped to … Continue reading ETH/USD Technical Analysis: What can we Expect Next?","title":"ETH/USD Technical Analysis: What can we Expect Next? - CoinSpectator Blog","content":["Ethereum, which was launched in 2015, is the second largest cryptocurrency after Bitcoin in terms of market capitalization. It was trading sideways for two years, at around $ 10, until 2017. That was the year of the “Gold Rush” for cryptocurrencies, and the ETH price started to increase in March. The ETH/USD had jumped to $ 50 by the end of that month, which meant a 500% increase. That was a sign that the market was changing, and a wave of buying was coming. We saw a retrace in July and September, but that year turned out to be extraordinary for digital currencies overall.","","The double top pattern points to $ 650 for Ethereum","Ethereum surged to $ 1,425 by January 2018 and closed at $ 1,120. 2018 turned out to be the opposite of the previous year, as the Gold Rush ended and the crypto market started reversing back down. Although, that wasn’t a big surprise, given the extraordinary and sudden surge in 2017. The decline in 2018 was also quite straightforward, with 8 bearish monthly candlesticks. In the first half of 2019 and in January this year, buyers have tried to reverse the price higher, but they were short-lived both times, showing that the pressure remained to the downside for Ethereum, as highs were getting lower. We saw another attempt to the downside in March, when the coronavirus broke out in Europe, turning traders to the USD. But the support below $ 100 held once again, and since April, Ethereum has been increasing, getting pretty close to $ 500 in September.","With the two attempts at $ 80 to $ 90, and the consecutive failures to break below that level, we can see that a double bottom pattern has formed in the ETH/USD. The high in June last year came at $ 370, so the target from the top should be as big as the distance between the bottom and the top. That means that Ethereum should increase another $ 280 above $ 370, to $ 650, if the double bottom pattern is to work out. The price has moved above June’s high now, which was the high point of this pattern. That validates the pattern, so $ 650 is really the target now, and our Ethereum price prediction from the monthly chart analysis points to this level.","On the weekly chart, the price was finding solid support at the 20 SMA (gray) during the uptrend in 2017. Ethereum formed a resistance zone around $ 400, and buyers were finding it hard to push above that level. But the 20 SMA kept pushing the price higher, and eventually the resistance at 400 was broken. This level was quite important for Ethereum, since it turned into the ultimate support and resistance zone, as we will see further below in this Ethereum price prediction.","","The next bullish leg should start soon","As we know, the ETH/USD surged to $ 425, where it remained until December that year, but then the reversal came and the price crashed lower. The 20 SMA held in the first attempt in the second week of February, despite being pierced, but it was eventually broken. However, the previous resistance zone at around $ 400 turned into support this time, and after a small doji candlestick above that level, we saw a retrace higher to $ 840. The price pushed above the 20 SMA briefly, but then reversed down and fell below all moving averages, until it reached $ 80 at the end of 2018. As we mentioned above, the ETH price increased during H1 of 2019, but the area around $ 400 turned into resistance again, with a bit of help from the 100 SMA (green). The price formed a doji here, which is a bearish reversing signal after the retrace higher, at which point the price turned lower.","The second upward retrace took place during Q4 of 2019, as the sentiment for cryptocurrencies improved, but the retrace ended after a doji candlestick at the top once again, just below $ 300. This time, the 200 SMA (purple) provided resistance. Both times, the stochastic indicator was oversold, also indicating a reversal down. This time though, the bullish move since the middle of March doesn’t look like a retrace. The price has moved above the $ 400 level and moving averages are now turning into support, suggesting that the pressure has turned to the upside for Ethereum. In the last few weeks, we have seen a consolidation at around $ 400, but the stochastic indicator is approaching the oversold area, and the moving averages are getting closer, so the Ethereum analysis tells us that the next bullish leg is expected in Ethereum soon, although it will also depend on the sentiment in the crypto market.","There’s a lot more noise on the daily time-frame chart and the volatility looks much higher in lower time-frame charts, although they still show the market behavior, and we can spot the trends. During 2019, the ETH price was trading in a range, which showed consolidation, although the bias was bearish, as highs were getting lower, but at least we were not seeing any new lows. Moving averages lost significance, as they were broken many times, but they helped indicate buying or selling opportunities, as the price was moving up or down in this consolidation period.","","Ethereum is trying to break the 20 and 50 SMAs now","But now, it seems like the consolidation period has ended and buyers have come back onto the scene. The crash from the initial coronavirus panic ended pretty quickly and the price reversed higher, surging more than $ 150 until June, then a consolidation period followed. The bullish momentum retumed, lasting until September 1, taking the ETH price to $ 485, while now, according to the Elliott Wave Pattern, we are in another pullback/consolidation period, before the next bullish leg starts.","During the bullish move of the last few months, the 50 SMA (yellow) did a good job as support, pushing the price higher, and the 20 SMA also helped occasionally on the daily chart. The involvement of smaller moving averages, as support indicators, shows that the pace of the bullish trend was quite strong. So, the third bullish leg should start soon, and it might have already started, but the 20 and 50 SMAs are standing on top now, and they rejected the price initially. However, the price turned back to them pretty quickly, indicating buying pressure, so it will only be a matter of time before these moving averages break. Therefore, the price action in this time-frame also points up and the Ethereum analysis from this time-frame is $ 650 for several months ahead."],"create_date":"2020-10-21T10:18:47+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/03/zeroedge-bet-a-revolutionary-approach-to-gambling-with-0-house-edge-games-single-cryptocurrency/","web_url":"https://blog.coinspectator.com/","type":"article","description":"ZeroEdge Casino is a gambling platform which offers players an equal odds of winning against the house, i.e. 0% house edge casino games such as Blackjack, Video Poker, Roulette, and many more. The casino will also have a sportsbook that will act as an exchange with 0% commission bets. The project was first presented at … Continue reading ZeroEdge.Bet – a revolutionary approach to gambling with 0% house edge games \u0026 single cryptocurrency","title":"ZeroEdge.Bet - a revolutionary approach to gambling with 0% house edge games \u0026 single cryptocurrency - CoinSpectator Blog","content":["ZeroEdge Casino is a gambling platform which offers players an equal odds of winning against the house, i.e. 0% house edge casino games such as Blackjack, Video Poker, Roulette, and many more. The casino will also have a sportsbook that will act as an exchange with 0% commission bets.","The project was first presented at Blockchain Summit in Kyiv on November 25th. The team of professionals from multiple industries got together to build the first online casino which doesn’t rely on player’s losses as a primary source of revenue, but instead is based on casino’s cryptocurrency value growth. Simply put, Zero Edge Casino offers the best odds in the market with all games having a 0% house edge, including sportsbook, poker tables. The business model is based on casino’s cryptocurrency which is required in order to play these games. This naturally creates a demand for the token and with a limited supply, the value of the token increases as more people seek for it in order to play. As a result, players can earn by playing at the casino with the best odds AND by holding the token as its value increases due to rising demand and wider adoption (similarly as Bitcoin).","“While we expect our 0% house edge casino games to attract a wide range of customers, what we truly want to put in the forefront is our 0% commission sports betting which has never been seen on the market before” – said Adrian Casey Zero Edge founder and CEO. “The traditional online gambling market is rife with issues that even Bitcoin wasn’t able to solve. Players should have just as much chance of winning as the house, however currently this is not the case. This is exactly what Zero Edge is trying to solve by providing a truly fair \u0026 transparent gambling, which has a potential to disrupt the whole online gambling industry.","Pre-ICO is open – 79% discount \u0026 low hard cap!","The Pre-ICO is set to start on the 28th of February 2018, closing out on the 15th of March 2018. Pre-ICO bonus are 79% discount with a low hard cap – 1500 eth. https://tokensale.zeroedge.bet"],"create_date":"2018-04-03T21:21:39+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/02/19/win-a-tesla-roadster-with-bitcoin-latinum/","web_url":"https://blog.coinspectator.com/","type":"article","description":"How would you like to get your hands on a custom built Tesla Roadster? Bitcoin Latinum, a digital asset associated with award winning movie studios and globally renowned insurance brokers, is offering you that chance. The digital asset, which has been described as the “next generation of Bitcoin fork” for its ability to “break barriers… that … Continue reading Win a Tesla Roadster With Bitcoin Latinum","title":"Win a Tesla Roadster With Bitcoin Latinum - CoinSpectator Blog","content":["How would you like to get your hands on a custom built Tesla Roadster?","Bitcoin Latinum, a digital asset associated with award winning movie studios and globally renowned insurance brokers, is offering you that chance.","The digital asset, which has been described as the “next generation of Bitcoin fork” for its ability to “break barriers… that have prevented some virtual currencies from achieving… real-time use”, sold out of its initial public presale in November 2020.","To celebrate it coming to the market again later this year, Bitcoin Latinum is giving away eight custom Tesla Roadsters and you’re not even required to buy anything to be in with a chance of winning.","You can enter the draw over on shop.bitcoinlatinum.com.","You can enter until the end of April and the draw will be made later this year when the Bitcoin Latinum hard fork is launched.","This highly anticipated Bitcoin Latinum has been in the news already over the last few months, being slated as the “world’s largest insured digital asset”. Globally renowned brokers Marsh and McLennan’s Asia division has been appointed for it.","Its association with movie studio, Cross Creek Media, also hit the headlines. The studio, who made Oscar winner Black Swan, has adapted the asset.","Its CEO, Timmy Thomspon discussed this move, stating: “Cross Creek’s portfolio of new media technology investments perfectly positions us to take advantage of the digital asset sector in media and gaming.”"],"create_date":"2021-02-19T19:43:39+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/08/13/pumapay-is-paving-the-way-for-mass-crypto-adoption/","web_url":"https://blog.coinspectator.com/","type":"article","description":"PumaPay CEO, Yoav Dror, said: “By providing innovative and much-needed developments ready to be utilized in the emerging crypto space, we bring the co PumaPay is one of the most innovative providers of a fully decentralized blockchain-based payment system. Since their establishment, the company has maintained that its vision is to be one of the frontrunners … Continue reading PumaPay is paving the way for mass crypto adoption","title":"PumaPay is paving the way for mass crypto adoption - CoinSpectator Blog","content":["PumaPay CEO, Yoav Dror, said: “By providing innovative and much-needed developments ready to be utilized in the emerging crypto space, we bring the co","PumaPay is one of the most innovative providers of a fully decentralized blockchain-based payment system. Since their establishment, the company has maintained that its vision is to be one of the frontrunners in supporting mass crypto adoption. To date, PumaPay continues to refine their technology, adding new features that are slowly helping their vision come to fruition. The latest developments are no different.","With their new hybrid solution, PumaPay differentiates itself from other payment service providers. Combining crypto with traditional finance, their service now enables payments to be made and received in any currency, with the PMA token acting as a means of value transfer, by virtually anyone from merchants of all varieties to end-users. With measures in place to ensure zero exposure to volatility for all parties and easy onboarding and offboarding to crypto the PumaPay solution offers maximum utility to all.","PumaPay CEO, Yoav Dror, said: “By providing innovative and much-needed developments ready to be utilized in the emerging crypto space, we bring the community one step closer to mass crypto adoption. As of today, we have managed to close the loop and offer a fully comprehensive, blockchain-based payment solution that mitigates widespread concerns regarding accessibility, regulation, volatility and usability.”","With that in mind, let’s review some of PumaPay’s groundbreaking contributions:","· The heart of their PullPayment Protocol; a variety of customizable billing models, such as their innovative Recurring and Auto-Up Schemes. Utilizing smart contract architecture, these billing models were designed to offer maximum utility to businesses in their daily transactions.","· A fully decentralized, native app: the PumaPay Cryptocurrency mobile wallet. Available for Android and iOS devices, the app enables the sending, receiving, and storing of main cryptocurrencies, such as: Bitcoin (BTC), Ethereum (ETH), Bitcoin Cash (BCH), Litecoin (LTC), as well as all other ERC-20 tokens.","· Streamlined, in-app cryptocurrency exchange services that allow for easy conversion from other cryptocurrencies to PMA.","· Encouraged merchant-customer trust via easily accessible, in-app refund requests.","· Fully compliant user onboarding that adheres to the 5th Anti-Money Laundering Directive and the KYC verification process. PumaPay has also gone as far as to ensure that their solution is compliant with current AML laws but is also future proof for future developments in the field.","· A comprehensive payment gateway, the PumaPay Business console. This platform empowers merchants with the ability to accept crypto, set up customized billings models, as well as manage and optimize their payment flow.","· Zero exposure to crypto volatility and guaranteed full liquidity with the PumaPay Fiat Settlement Layer. With this service, the currency rate is “locked,” thereby eliminating volatility risks and enabling offboarding from crypto to fiat. Further, merchants also have a straightforward means to withdraw funds and directly transfer into their bank account.","· In-app banner placement that provides clear, uninterrupted communication channels between merchants and their respective customers.","· A comprehensive PSP API solution that supports seamless integration for PSPs and their merchants/businesses looking to accept crypto as a means of payment. These advanced tools also aid in easing the onboarding process for clients whilst also providing PSPs with access to all features of the PumaPay PullPayment Protocol.","· Full certification by the Payment Card Industry (PCI) and Data Security Standards (DSS). This has and continues to ensure that PumaPay adheres to the highest safety standards and application of anti-fraud prevention measures. In complying with global data security standards, they keep their users’ data safe and secure.","· Easy integration with a fully documented API.","· An open-source developer hub space completed with all necessary documentation, product library and guides available at Wiki PumaPay.","· Finally, PumaPay’s most recent development, the “Buy Crypto” service, enables PumaPay wallet users to purchase cryptocurrencies within the app with a credit/debit card. Combined with the ability to exchange crypto to PMA from within the wallet, and the Fiat Settlement Layer, PumaPay is ‘closing the loop’ and creating a complete payment system that is connected to the traditional financial system at its endpoints, allowing easy onboarding and offboarding. In the coming weeks, they will improve the process even further, allowing direct purchase of PMA tokens with credit card from within the wallet.","Going forward, PumaPay has already started to provide some insight into their blueprint for mass crypto adoption. A snapshot of some of the projects they are currently looking into includes:","· The introduction of their very own Side Chain which will provide users with an improved, more competitive service, by expediting transaction settlement times and lowering GAS fees.","· US token– a new project that will hopefully allow PumaPay to offer l tokens to US-based clients, whilst fully complying with US Government regulation.","· Decentralized Finance (DeFi) – a staking mechanism that will offer PMA token holders with the ability to earn money for their holdings.","In paving the way towards mass crypto adoption, PumaPay is maintaining their momentum by consistently providing their users with cost-effective, simple, and efficient means to manage and process their payments. From their billing models to the PumaPay crypto wallet, their services are designed for maximum utility by anyone; whether you be a user wanting to purchase services with crypto or a merchant looking to engage customers and maximize your revenue!","SOURCE: PRESSAT"],"create_date":"2020-08-13T13:11:06+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/19/crypto-highlights-19042018/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Kraken CEO we will not answer NYC AG’s enquiry Jesse Powell, the CEO of cryptocurrency exchange Kraken, has made it clear the firm does not plan to answer the New York Attorney General’s inquiry into cryptocurrency exchanges. Powell added “Why don’t you try extracting this information from those businesses actually operating in your state?” Read … Continue reading Crypto Highlights 19/04/2018","title":"Crypto Highlights 19/04/2018 - CoinSpectator Blog","content":["Jesse Powell, the CEO of cryptocurrency exchange Kraken, has made it clear the firm does not plan to answer the New York Attorney General’s inquiry into cryptocurrency exchanges.","Powell added “Why don’t you try extracting this information from those businesses actually operating in your state?”","Read more on CoinDesk.","An investigation by the Public Security Bureau Economic Investigation Detachment in China’s Xi’an district cracked a cryptocurrency pyramid scheme wide open, the team behind Da Tang Coin (DTC) allegedly defrauded investors of $13 million dollars selling he useless coin for $0.50. They made wild claims of guaranteed profits and hired a western chairman to appear more like a “high-tech multinational corporation” said police.","Read more on HSW.","Bitcoin’s booming in Brazil according to local media, the countries biggest investment firm XP Investimentos is planning to open an over-the counter (OTC) cryptocurrency exchange.","Read more at Finder.","Earlier this week Riot Blockchain received a subpoena from the SEC seeking “certain information from the company”. This comes as no surprise as Riot have long raised many red flags with worried investors citing canceled board meetings at the last minute, with insiders dumping right after the firm changed their name from Bioptix.","Read more at CNBC.","Research has revealed 60% of British people surveyed would not support a Bank of England-backed cryptocurrency linked to the pound.","Read more at the Daily Express.","A report carried out by security firm Proofpoint has found that human error is the biggest factor in crypto attacks being successful from fake domains to dodgy plugins they all rely on the user making a mistake.","Read more at Cryptovest.","Singapore-based crypto exchange Huobi has announced plans to set up shop in London as it seeks to continue its expansion outside of Asia.","Read more at NEWSBTC.","India’s central bank has started a crack down on the trading and purchase of cryptocurrencies in India, announced at there bi-monthly monetary policy press conference. The order gives institutions currently working with cryptocurrencies three months, this has not gone unchallenged by many exchanges and businesses operating in india who are starting joint legal proceedings.","Read more at Forbes.","Amazon might build crypto snooping tool","Amazon has filed and won a patent described as a “streaming data marketplace” which will allow authorities such as the police and government agencies to match cryptocurrency addresses to actual users based on multiple data points from 3rd party sources. This data could come from an exchange for example where a user would supply their identity documents, ip address, bank account information which could tie you to addresses used to fund and withdraw assets. Spooky, eh!","Read more at Motherboard Vice.","Dow jones Media Group partners with Brave Browser","Through partnering with web browser Brave, Dow Jones Media Group will test ways to distribute content and advertising as part of a promotion that offers readers free subscription-based content. The firm owns MarketWatch, Barron’s and Financial News. Brave Browser used BAT tokens which incentivises users to engage with the ads by paying them the currency.","Read more at Tech Crunch."],"create_date":"2018-04-19T09:19:27+01:00","tag":"Litecoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/06/02/introducing-the-kava-safu-fund-security-of-assets-fund-for-users/","web_url":"https://blog.coinspectator.com/","type":"article","description":"What is it? Kava SAFU Fund is an on-chain community pool that will increase the overall safety of the Kava platform by protecting against unforeseeable black swan events while giving users assurity that their funds are safe. The Kava SAFU community pool’s main function is to make users whole after events like unforeseen bugs, exploits, … Continue reading Introducing the Kava SAFU Fund — Security of Assets Fund for Users.","title":"Introducing the Kava SAFU Fund — Security of Assets Fund for Users. - CoinSpectator Blog","content":["Kava SAFU Fund is an on-chain community pool that will increase the overall safety of the Kava platform by protecting against unforeseeable black swan events while giving users assurity that their funds are safe. The Kava SAFU community pool’s main function is to make users whole after events like unforeseen bugs, exploits, hacks, liquidation failures or other technical issues that result in lost user funds.","These types of events haven’t happened on the Kava platform because of Kava’s architecture, robust testing, audits, and market monitor infrastructure. Now Kava is introducing the latest component in its security and reliability infrastructure; the Kava SAFU Fund. Designed to counter the unique threat of black swan events.","The Kava SAFU Fund will be created through a one-off inflationary event where 10% of Kava’s current token supply will be minted and held within the Kava SAFU Fund.","“Over the long run, the creation of the Kava SAFU fund is a net positive for the overall DeFi ecosystem. By giving assurance on compensation in the case of a black swan event helps instill further confidence for Kava’s DeFi platform.” — Michael Ng, Co-founder of StakeWith.Us","Now that the Kava platform has grown to hundreds of thousands of users and has hundreds of millions of dollars in collateral deposits, Kava Labs as a centralized entity cannot and should not take responsibility for unforeseen events for following reasons:","Inspiration for the Kava SAFU Fund comes from traditional finance where margin trading platforms have a rainy day fund to cover losses. In crypto, we have several notable examples with Bitmex’s Insurance Fund that ensures liquidations of margin positions go smoothly and Binance’s all purpose SAFU Fund which has been used to make users whole after serious hacks and exploits have occurred.","More recently, the Cosmos Hub has adopted a community pool which has several purposes, including that of being a SAFU fund for users. Similarly other Cosmos-SDK based blockchains like Akash and Terra have adopted different forms of community pools.","Many events can impact user funds. Events like upgrade errors, defaults, and critical bugs that result in lost funds will qualify to be reimbursed by the Kava SAFU Fund subject to governance approval. Below is a example non-exhaustive list for illustrative purposes of the type of events which may impact users funds and may be covered by the Kava SAFU fund, however it is critical to note that any and all actions taken on behalf of the Kava SAFU fund is made by the Kava governance community alone.","There are many ways to fund the pool, including a one-off inflationary event or a continuous inflation schedule which adds to the pool overtime.","For the purposes of providing an adequate SAFU Fund for the current levels of collateral and debt managed by the Kava platform, 10% of total Kava supply should be created in a one-off inflationary event and put towards the Kava SAFU Fund initially. This will be more than adequate for the foreseeable future.","Should the platform grow orders of magnitude larger or if Kava SAFU Funds are disbursed after an event, it will be up to the Kava governance community to decide how to ensure the Kava SAFU Fund is appropriately re-capitalized from that point forward. This can occur from a redirecting of various platform fees, another one-time inflationary event, or a continuous inflation contribution to the Kava SAFU Fund going forward.","It’s great that we’re implementing an insurance pool. Binance SAFU fund has helped Binance users immensely in the past and also served as a safeguard for PR damages.","The initial one-off inflationary event seems reasonable given that we’d need significant time for the SAFU fund to be filled should we allocate a proportion of the network inflation to the pool instead. — David Park, CMO of Cosmostation","It will ultimately be up to the Kava token holder group to vote on each SAFU-spend proposal/request and determine if the case qualifies for distribution.","If a SAFU-spend proposal passes successfully, the number of KAVA encoded in the proposal will be transferred from the Kava SAFU Fund to the address encoded in the proposal, and this will happen immediately after the voting period ends.","“In a world overrun by hacks, exploits, and rug pulls, Kava by contrast is quickly becoming the most trusted platform by exchanges, institutions, and crypto applications around the world thanks to its robust security and safety practices. The Kava SAFU Fund will further position Kava’s DeFi platform as the most trustworthy solution in the emerging DeFi space as it gives further assurance that user’s assets are safe even in unforeseen black swan type events.” — Brian Kerr, CEO of Kava Labs","Source: https://medium.com/kava-labs/introducing-the-kava-safu-fund-security-of-assets-fund-for-users-bd8a7005a28f"],"create_date":"2021-06-02T14:53:04+01:00","tag":"KAVA","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/16/chilean-banks-shut-down-crypto-exchange-accounts/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Three Chilean-based cryptocurrency exchanges – CryptoMarket, Buda and Orionx –are seeking new banking partners after having their accounts shut down. With little to no explanation, Banco del Estado de Chile, Itau Corpbanca and Bank of Nova Scotia have ceased providing their banking services for the exchanges, with some pointing the finger at the government secretly … Continue reading Chilean banks shut down crypto exchange accounts","title":"Chilean banks shut down crypto exchange accounts - CoinSpectator Blog","content":["Three Chilean-based cryptocurrency exchanges – CryptoMarket, Buda and Orionx –are seeking new banking partners after having their accounts shut down.","With little to no explanation, Banco del Estado de Chile, Itau Corpbanca and Bank of Nova Scotia have ceased providing their banking services for the exchanges, with some pointing the finger at the government secretly forcing the banks to do so. But as yet this is unclear.","South Americans are concerned that the ban is mimicking the cryptocurrency bans of other countries, such as China and the UK, whose banks have notoriously formed a cartel to block any cryptocurrency businesses gaining access to a bank account.","Speaking to Bloomberg, Guillermo Torrealba, Buda’s co-founder and chief executive officer, said: “They’re killing an entire industry. It won’t be possible to buy and sell crypto in a safe business in Chile. We’ll have to go back five years and trade in person. It seems very arbitrary.”","Chile’s cryptocurrency market is small but burgeoning. Entrepreneurs created digital coins Chaucha and Luka, whose names play off local slang used for money, while locally-based exchanges like Buda and CryptoMarket operate across Latin America. Buda traded about $1 million per day before losing its bank account, compared with about $2 billion for the world’s biggest exchanges.","Chile’s cryptocurrency industry is still small but rapidly growing with the Buda exchange trading around $1 million per day in digital assets.","The shutdown exchanges have said they follow stringent know-your-customer and anti-money-laundering practices by running checks with authorities and agencies.","Thousands of Chileans and crypto supporters around the world have taken to social media to support the exchanges with the tag #ChileQuiereCryptos.","The exchanges have formed a joint case at the appeals court, which has already agreed to hear their case; but the bank accounts remain shut until further notice."],"create_date":"2018-04-16T11:36:41+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/12/coinzilla-the-crypto-advertising-network-of-the-moment/","web_url":"https://blog.coinspectator.com/","type":"article","description":"If you own a crypto-related website, you probably have looked into various methods to promote your work. However, if you want high-quality traffic on your platforms, you need to pay for such services. As everyone knows by now, qualitative traffic is vital for the reputation and exposure of a website. You can easily earn enough … Continue reading Coinzilla – The Crypto Advertising Network of the moment?","title":"Coinzilla - The Crypto Advertising Network of the moment? - CoinSpectator Blog","content":["If you own a crypto-related website, you probably have looked into various methods to promote your work. However, if you want high-quality traffic on your platforms, you need to pay for such services. As everyone knows by now, qualitative traffic is vital for the reputation and exposure of a website. You can easily earn enough money to live off from your website if it has high-quality traffic, but, usually such thing is pretty hard to find. A majority of the ad networks available out there offer junk or sponsored advertising.","Many webmasters spent over the time a large amount of money trying to find a network that provides much-needed quality traffic services. If you’ve invested a lot of time and money analyzing and testing a long list of existing ad networks, but have yet to find one that provides the desired services, then you should try Coinzilla.","Founded in 2016, the Coinzilla Ad Network became one of the top 3 crypto advertising networks in a short amount of time. So far, the company only has favorable reviews on the Internet, which might make some people suspicious. No bad reputation or shady operations are associated with this network, and with good reason.","The network offers high-quality floating and standard IAB banners that have been designed in a way to instantly attract the attention of visitors, guaranteeing a high CTR. The banners have strategic placement on the websites, which have been proven by statistics and user behavior.","The platform is very user-friendly and intuitive, so any new user can create an account and understand the use all its functions. The team behind Coinzilla is fast and ready to help its clients with anything they might need.","Coinzilla employs a S.M.A.R.T. bidding system, which was created by studying customers’ behavior, with the purpose of supplying qualitative marketing services at the lowest prices. Behind this simple interface are complex algorithms that basically do all the hard work for you, showing you the results in detailed statistic charts.","The traffic you will receive will come from top referrers websites like coinmarketcap.com, themerkle.com, 99bitcoins.com, coinranking.com and other relevant crypto-related sites. This quality traffic will make your site more visible to Google, and increase your rank daily until your website is at the top!","Coinzilla’s employees are very fast, have great technical expertise, and a unique account manager is assigned to all users.","To sum up, if you own a crypto-related business or an ICO, Coinzilla is the best advertising provider for you. Their quality services and professionalism will ensure that you will be a faithful and satisfied customer, and you’ll never need to go through the hassle of finding a different ad network ever again!","","","","· Highly competitive rates","· Personal account managers","· 99% Fill rate","· Top referrers (coinmarketcap.com, coinranking.com, 99bitcoins.com)","· Because this is a bitcoin advertising network, they accept payments made through Bitcoin, Ethereum, and Euro bank transfers","· Highly converting HTML banners designed by them","","· Your website must look professional (it’s a problem if you are inexperienced)","· Your website should be live for at least a couple of months","· Your website must not be an adult content website","You can contact Coinzilla’s staff anytime on:","Useful links:","Follow us on Twitter: https://twitter.com/adsbycoinzilla/"],"create_date":"2018-04-12T14:23:25+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/08/13/crypto-partners-with-hospitality-group/","web_url":"https://blog.coinspectator.com/","type":"article","description":"You are now able to pay for drinks, food and much more, with cryptocurrency. This is thanks to a new partnership between Bitcoin Latinum and global hospitality players, The h.wood Group. According to a statement announcing the deal, this partnership includes “cross-promotional marketing initiatives, event sponsorships, endorsements, and the acceptance of Bitcoin Latinum for services, … Continue reading Crypto Partners with Hospitality Group","title":"Crypto Partners with Hospitality Group - CoinSpectator Blog","content":["You are now able to pay for drinks, food and much more, with cryptocurrency.","This is thanks to a new partnership between Bitcoin Latinum and global hospitality players, The h.wood Group.","According to a statement announcing the deal, this partnership includes “cross-promotional marketing initiatives, event sponsorships, endorsements, and the acceptance of Bitcoin Latinum for services, products, and amenities across The h.wood Group’s diversified portfolio of upscale nightlife and restaurant venues.”","The h.wood Group is known for their worldwide portfolio of hotels and upscale nightlife and restaurant venues. Set up by entrepreneurs, John Terzian and Brian Toll, this partnership is viewed as a progressive step by the brand.","Mr Terzian discussed this, stating: “As entrepreneurs, Brian and I have always looked into the future rather than get stuck in old ways. We are constantly watching, learning and adapting. Crypto and blockchain are the future in many ways and we want The h.wood Group to be ahead of the curve. We are excited for this endeavor with Bitcoin Latinum.”","As an enhanced Bitcoin fork, Bitcoin Latinum has already garnered support from companies within the media, entertainment, gaming, and telecommunications industries. It is designed to reduce the cost of a crypto transaction.","The h.wood Group is also accepting Bitcoin and Ethereum tokens for specified services and goods across their group’s portfolio."],"create_date":"2021-08-13T11:49:30+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/05/hybrid-crypto-exchange-ico-announces-5m-partnership-deal/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Andromeda Group provide huge cash injection to new exchange ICO Serial crypto investors Andromeda Group have recently announced a huge deal with promising new ICO Qurrex, paving the way for a next generation of cryptocurrency exchanges.   Qurrex, which features aspects of both centralized and decentralized exchanges, are thought to have cashed in more than … Continue reading ‘Hybrid’ Crypto Exchange ICO Announces $5m Partnership Deal","title":"‘Hybrid’ Crypto Exchange ICO Announces $5m Partnership Deal - CoinSpectator Blog","content":["Andromeda Group provide huge cash injection to new exchange ICO","Serial crypto investors Andromeda Group have recently announced a huge deal with promising new ICO Qurrex, paving the way for a next generation of cryptocurrency exchanges.","Qurrex, which features aspects of both centralized and decentralized exchanges, are thought to have cashed in more than $5m USD as a result of the new partnership, which will also see Andromeda experts work on the Qurrex token sale.","Pavel Kornilov, Co-Founder of Andromeda Group, said in a statement: “We see Qurrex as a potentially strong player in the market and glad to develop our relationship. We also believe that the quality of QRX token buyers will be one of the key factors of the future success of the project.”","This deal pushes Qurrex even closer to its $55m max cap target, with the public given a last chance opportunity to get involved in the May main sale.","Thanks to its part-centralized and part-decentralized exchange solution, Qurrex could be on track to deliver the first truly next-generation exchange, offering more tokens and coins, and subsequently, effective liquidity between them.","Now, thanks to a bumper token sale, the business is on track to hit its max cap of $55m before the end of the crowd sale.","Qurrex’s next-generation platform integrates the industrial-grade centralized infrastructure of traditional stock exchanges (CEX), like NASDAQ, NYSE and LSE, with a decentralized blockchain-based network (DEX).","Andromeda, which has previously partnered with prominent crypto companies, such as IOTA, Bancor and eTorro.","This new partnership is not only a financial boost to Qurrex, but one that will also bring about guidance and cooperation across the board.","Qurrex has been designed to create a suitable gateway for professional traders in traditional financial markets to the crypto economy and to meet the challenges of the exponential growth of cryptocurrency trading.","The new platform will integrate the centralized exchange based on enterprise technology of traditional stock exchanges with decentralized network consisting of thousands of nodes of liquidity with partial exchange functions for miners, brokers, liquidity provider and other institutional players.","The Qurrex ICO continues in May, with expectations of hitting the max cap high. Interested parties can take part by visiting www.qurrex.com.","Learn more at http://qurrex.com/ or via other channels:","Telegram channel","Telegram chat","Facebook"],"create_date":"2018-04-05T20:58:53+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/03/28/how-zerocoin-is-set-to-solve-the-house-always-wins-problem/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Online gambling is as popular as ever, with hundreds of new online casinos opening their virtual doors every day on the web. However, despite their seemingly inexhaustible popularity, there is one massive drawback to online casino gaming, and it is inherently linked to the way online casinos operate. We’ve all heard the old saying “The … Continue reading How Zerocoin is Set to Solve the “House Always Wins” Problem?","title":"How Zerocoin is Set to Solve the “House Always Wins” Problem? - CoinSpectator Blog","content":["Online gambling is as popular as ever, with hundreds of new online casinos opening their virtual doors every day on the web. However, despite their seemingly inexhaustible popularity, there is one massive drawback to online casino gaming, and it is inherently linked to the way online casinos operate.","We’ve all heard the old saying “The house always wins” and it is a saying that goes all the way back to the first brick and mortar casinos in Europe and Asia. The saying remains popular because, in its essence, it is absolutely true. “All casino games, whether they are found in traditional brick and mortar establishments or online, have one thing in common – the odds are always stacked against the player. Players might be winning for a short period of time and think that they cracked the code, but in reality they are just “running hot” and sooner or later the variance will do its job to favour the house” explained Adrian Casey CEO at ZeroEdge.Bet. He also added: “Most of the players are unaware of the mathematical principles that make beating the casino virtually impossible. Therefore, our goal at ZeroEdge.Bet will be to educate players about gambling and prevent them from falling victims to its traps.","The new Zeroedge Casino, which uses its own form of cryptocurrency called Zerocoin, aims to solve the age-old problem of the house always winning by completely doing away with the dreaded “house edge” altogether. This essentially means that, for the first time in the history of gambling, players will have a real, true and fair shot at actually winning their games at Zeroedge Casino.","How the revolutionary model works?","Zeroedge Casino is currently making massive waves throughout the online gambling industry by being the first online casino and gambling destination to launch a true 0% house edge (the advantage the casino has over the player). So how does this new revolutionary model actually work.","Unlike traditional online casinos, where they make their profit directly off the losses of their players, Zeroedge Casino actually avoids this practice altogether. Instead, Zeroedge makes its profit off the rising Zerocoin value. Zeroedge is creating a network made up of thousands of unique game providers, all using Zerocoin as their single currency. Entities will be able to design and build their unique games directly on the ZeroEdge platform. All tools and infrastructure will be provided to make this process user-friendly and increase the adoption of Zerocoin, while maximizing brand exposure. Add to that a guaranteed 0% house edge and you have a completely revolutionary concept that is guaranteed to turn the online casino industry on its head and change the way you think of online gambling forever.","How will Zerocoin price increase?","The fact that Zeroedge Casino network offers gamblers a true 0% house advantage on all of their games is the spark that will blow the online gambling industry wide open. Of course, no online gambler worth their salt would rather choose traditional online casino games (where the house has anywhere from 1%-10% advantage over the player), over Zeroedge Casino games with a provable 0% house edge.","However, in order to play at Zeroedge Casino, players will need to first buy Zerocoins. Now, as more and more players learn about the incredible 0% house edge, they will want to get their slice of the pie. This will then increase the value and the demand for Zerocoin exponentially.","Pre-ICO is open – 79% discount \u0026 low hard cap!","The Pre-ICO is set to start on the 28th of February 2018, closing out on the 15th of March 2018. Pre-ICO bonus are 79% discount with a low hard cap – 1500 eth. https://tokensale.zeroedge.bet"],"create_date":"2018-03-28T21:20:31+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/11/cryptocurrencies-try-to-draw-islamic-investors/","web_url":"https://blog.coinspectator.com/","type":"article","description":"When people think of gold, they think of a reliable and valuable commodity. In the future, that might be the way people think about certain cryptocurrencies. A company called OneGram are trying to combine both crypto and gold, by creating a currency which is backed by the chemical element. There is method to their ambitious … Continue reading Cryptocurrencies try to draw Islamic investors","title":"Cryptocurrencies try to draw Islamic investors - CoinSpectator Blog","content":["When people think of gold, they think of a reliable and valuable commodity. In the future, that might be the way people think about certain cryptocurrencies.","A company called OneGram are trying to combine both crypto and gold, by creating a currency which is backed by the chemical element.","There is method to their ambitious project; it is thought that by involving such a traditionally valuable commodity, that more investors from Islamic investors will be drawn to get involved.","Traditionally, this sort of investment didn’t sit well with Islam. That is in part due to Sharia principles, which don’t allow interest payments and don’t encourage monetary speculation. It is a hot debate amongst scholars, whether or not cryptocurrencies are allowed by the religion.","Hence, companies like OneGram, who are trying to launch currencies that have their base in physical assets. Each one of OneGram’s currency is backed by at least a gram of the valuable element, thus speculation decreases automatically.","Ibrahim Mohammed, the co-founder of OneGram, told Reuters: “Gold was among the first forms of money in Islamic societies so this is appropriate. We are trying to prove rules and regulations from sharia are fully compatible with digital blockchain technology.”","There have already been millions of dollars’ worth of this currency distributed and there are further plans to distributed what is the remaining 60 percent. In what was an important coup, OneGram obtained a ruling that this currency conforms with Islamic principles from a Dubai-based consulting firm OneGram isn’t the only cryptocurrency to receive this sort of approval. HelloGold, which originated in Malaysia, and is also based on Gold, received a separate approval stating their cryptocurrency is also conforming with Islamic principles.","Considering that 20 to 30 percent of banking in the Gulf and Southeast Asia follow these principles, it is important for any currency that wants to break into this market to also apply them.","National sharia authorities have warned their populations about the pitfalls of trading in cryptocurrencies, but they have not imposed outright bans.","Thus, it is down to the people themselves to use their values when deciding whether or not to invest in blockchain technology."],"create_date":"2018-04-11T13:47:27+01:00","tag":"Gold","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/01/20/huobi-global-releases-details-of-crypto-buying-campaign-and-rub-withdrawals-deposits/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Recent news from global cryptocurrency exchange Huobi has seen the platform announce user support for the Russian Ruble (RUB). This latest development will mean that Huobi users can now withdraw and deposit in Russian Rubles. This is, of course, great news for the long-term success of the exchange itself and also users there who have … Continue reading Huobi Global releases details of crypto buying campaign and RUB withdrawals/deposits","title":"Huobi Global releases details of crypto buying campaign and RUB withdrawals/deposits - CoinSpectator Blog","content":["Recent news from global cryptocurrency exchange Huobi has seen the platform announce user support for the Russian Ruble (RUB). This latest development will mean that Huobi users can now withdraw and deposit in Russian Rubles. This is, of course, great news for the long-term success of the exchange itself and also users there who have been waiting for RUB support on the platform.","This is not the only new announcement made by the company though. They have also released details of users now being eligible to buy top digital currencies, such as BTC, LTC, ETH, BCH and DASH with Rubles. These new innovations will work in conjunction with AdvCash, which is one of the most respected payment solutions around in the crypto world.","Huobi Global has confirmed that both crypto buying and RUB deposits/withdrawals will be conducted through AdvCash wallets moving forward. This will come with a minimum deposit/withdrawal limit of 200 RUB for users. There has also been a maximum limit introduced for deposits of 100,000 RUB and 50,000 RUB for withdrawals.","It seems that the process of making transactions in RUB via AdvCash wallets on Huobi will be pretty simple. Users will be asked to provide identification details first, which will then be verified by AdvCash. People will then simply log into their Huobi Global Account and find the ‘Deposit-Exchange’ option under ‘Balances’. Once there, you would just find ‘RUB’ on the list of eligible currencies to fund your account with them.","At this point in the process, users will also have to complete and submit their KYC for verification, if not done already. When this is all sorted, you can then choose ‘AdvCash Balance’ as your method of payment and choose how much you want to deposit. You then choose ‘Pay’ and get sent to the AdvCash platform where you set up an account or log in to continue.","After this, the whole payment procedure can be finished by using any of the options in your wallet. Once the payment is completed, you will be sent back to the ‘Deposit’ page and be able to carry on using Huobi Global as usual. Security is assured as all transactions made to and from your Huobi account are recorded.","Those who decide to use RUB in the current promotion period can save 0.99% on deposit fees and 2.49% on fees for withdrawals. It is also expected that Huobi Global’s decision to bring RUB into their platform will pave the way for other FIAT currencies to follow.","Source: Pressat"],"create_date":"2021-01-20T14:52:45+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/12/14/huobi-futures-celebrates-2-6-trillion-in-trading-volume/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Huobi Futures has just celebrated over $2.6 trillion in cumulative trading volumes since its launch just over two years ago. Its launch date was December 10, 2018 and ever since then, the trading platform has gone from strength to strength, now being considered one of the go-to places for derivitace product options. A constant look … Continue reading Huobi Futures Celebrates $2.6 Trillion in Trading Volume","title":"Huobi Futures Celebrates $2.6 Trillion in Trading Volume - CoinSpectator Blog","content":["Huobi Futures has just celebrated over $2.6 trillion in cumulative trading volumes since its launch just over two years ago.","Its launch date was December 10, 2018 and ever since then, the trading platform has gone from strength to strength, now being considered one of the go-to places for derivitace product options.","A constant look towards the future and a aim to expand its product options have helped its growth. For instance, USDT-margined Swaps, Coin-margined swaps and futures are among the services that are central to Huobi’s offering currently.","This is demonstrated by USDT-margined Swaps accounting for almost 23 percent of the trading volume of all units as of December 3rd. Huobi’s coin-margined futures trading, which includes 13 major crypto assets, also has had a unilateral turnover of $1,907bn since its launch.","Not only that, but Huobi’s coin-margined swaps is the no.1 coin-margined swaps market globally.","Its trading volume of USDT margined perpetual swaps is also growing, with a cumulative total of over $60.5 billion as of December 4th, 2020. Earlier this year, Huobi further demonstrated their ability to offer an excellent service, by launching USDT-quoted options whereby users could trade without worrying about the risk of liquidation.","A statement from Huobi aimed to explain their success, citing the following: “The fact that Huobi Futures has achieved this success in just two years is largely due to its continuous efforts to launch innovative products that continuously enhance the user experience while ensuring that users can trade securely, consistently, and at a low cost.","This has a profound impact on two aspects for users. Since Huobi Futures started the operation in 2018, it has been able to provide users with a safe, stable and low-cost trading experience.”"],"create_date":"2020-12-14T16:09:08+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/11/23/bitcoin-ltnm-partners-with-banking-leader/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Bitcoin Latinum (LTNM) has announced yet another new partnership. It has linked up with Vast Bank as a custodial currency. The cryptocurrency’s lead developer, Monsoon Blockchain Corporation, has described the ethos of this new deal as being based on both “deal flow” and “integration”. Vast Bank, which has been serving customers since the early 80s, has … Continue reading Bitcoin LTNM Partners With Banking Leader","title":"Bitcoin LTNM Partners With Banking Leader - CoinSpectator Blog","content":["Bitcoin Latinum (LTNM) has announced yet another new partnership. It has linked up with Vast Bank as a custodial currency.","The cryptocurrency’s lead developer, Monsoon Blockchain Corporation, has described the ethos of this new deal as being based on both “deal flow” and “integration”.","Vast Bank, which has been serving customers since the early 80s, has come to the forefront of the crypto revolution in recent times. Just last year, it became the first nationally chartered bank in the USA to allow customers to buy and sell cryptocurrencies alongside a traditional checking account.","Its customers are also able to buy and sell cryptocurrencies from any location within the U.S. using the Vast Bank Crypto Banking mobile app.","Monsoon Blockchain Corporation CEO, Dr. Donald Basile, pointed towards Vast Bank’s commitment to blockchain in a statement detailing the deal.","He said: “We are very excited to announce our latest groundbreaking partnership with the industry leading Vast Bank. Their efforts to bring the promise of blockchain technologies to the banking system will allow consumers access to a greener, faster, and more secure version (cryptocurrency).”","His enthusiasm was echoed by Brad Scrivner, the CEO of Vast Bank., who added: “When our customers asked us why they could not securely buy… cryptocurrencies using their bank accounts, we were driven to develop an end-to-end solution.”","This announcement comes just weeks after it was revealed that the crypto will be listed on ten top-tier public exchanges by the end of the year."],"create_date":"2021-11-23T14:59:02+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/09/15/bitcoin-could-change-the-global-financial-system-right-when-we-need-it-the-most/","web_url":"https://blog.coinspectator.com/","type":"article","description":"In the face of necessary change, bitcoin and blockchain could reasonably supply the much-needed compromise between what is, and what could be. In the wake of current events, the majority of the global population has been given a choice. A chance to reset many of the systems that have been irrefutably shown to fail. While … Continue reading Bitcoin Could Change the Global Financial System, Right When We Need It the Most","title":"Bitcoin Could Change the Global Financial System, Right When We Need It the Most - CoinSpectator Blog","content":["In the face of necessary change, bitcoin and blockchain could reasonably supply the much-needed compromise between what is, and what could be.","In the wake of current events, the majority of the global population has been given a choice. A chance to reset many of the systems that have been irrefutably shown to fail. While it’s not necessary to fully condemn present systems of governance, finance, and social constructs- it is important to accept their failings and ask for something better.","Given the unprecedented glimpse into the more intimate and intricate shortcomings of existing systems, we have also been shown an idea of best practice moving forward. As countries and their individual populations have banded together in both macro and micro scales of economy and society, we have been shown that working together seamlessly can produce favorable results. While it may sound trite- we’ve been shown that teamwork does indeed make the dream work.","In light of the novel coronavirus, we’ve been shown that those countries that have worked closely with their own citizens and the citizens of the world at large have fared best- while others that have shut themselves off to both the failings and triumphs of others have seen near total devastation. Particularly in the latter, we’ve seen a surge of new users and renewed interest in cryptocurrencies. As new users flock to exchange platforms like Bitvavo, hoping for a helping hand in understanding an alternative for the economies that are failing them. While seasoned investors continue to proselytize the brilliance of decentralized finance.","Perhaps the biggest problem with the legacy financial system is how prone it is to manipulation. From lending bias to inflationary practices, our current financial system is clearly broken. Much of this manipulative practice comes from the idea of centralization. They will always be a human element behind any decisions made in our current financial system, and humans are… well, human. They’re prone to error, greed, and emotional bias.","Building a system of finance based on an individual human ethos is bound to spell disaster to someone. Discriminatory practices based on income, race, religion, or any number of other factors happen every day, even if we don’t actually intend them to. As each person has inherent bias, it’s nearly impossible for us to be purely objective. This is where cryptocurrencies like bitcoin step in. These digital tokens, coupled with DeFi systems can realistically create a beneficial parallel to the system we currently have. Mimicking many of the processes that fit nicely, but completely removing the human element, opting for something far more objective.","Coupling computer technology with existing structures could be a way to efficiently transition into a decentralized, digital, cashless society. While the term may raise hairs for some, cashless is coming- whether we want it to or not. Largely, those in opposition to the idea, are really opposed to centralized power structures; and in our opinion, rightly so.","The idea of a centralized cashless society does indeed come with a fierce amount of overarching governmental control, with many left behind. Among those being the unbanked, underfunded, and largely forgotten members of our respective societies that already feel the alienating pressure of our monetary systems. Centralized cashless would only serve to bolster those positions.","Despite a decentralized financial network seeming like the optimum compromise between what we have now, and what we need for the future- it may not be so simple to implement. There is still concern that decentralized networks can shift towards more centralized paradigms should key players interact irresponsibly. Think of the whales of bitcoin, and the influence they’ve been said to have. Or consider the bitcoin mining process, in which the majority of mining practitioners could realistically be held by one or two large conglomerates, essentially dissolving a decentralized structure.","While both bitcoin and other cryptocurrency networks, and the DeFi systems that are currently being built are doing everything within their ability to create systems that are free from centralized influence, it’s still a difficult balance to maintain. Should one or two large stake holders decide to irresponsibly weird power, the decentralized infrastructure could topple. In order to endure a truly decentralized system, it has to be something built with ubiquitous adoption and support.","This total support starts with an appreciation and support for decentralized networks. Something that is a common and base goal among all investors, operators, and service providers. Just as investors of all creeds and income brackets will require equal opportunity to buy in, network operators will have to ensure that there are a wide range of open source participatory and regulatory systems. Meaning that every investor holds the same amount of sway over how the network itself operates.","These systems are in existence today, and are continuing to be built and refined. Security and participation tactics are something that are constantly being scrutinized and cultivated to provide a better working system for all. Service providers must also help ensure this purely democratic infrastructure, either by integrating more AI and cryptographic technologies, or opening up their own network structures to the user supported functionality. DApps and Smart Contracts are excellent adjuncts to centralized power structures.","In reality, many of the necessary technologies needed to support a democratically decentralized financial network already exist. Ensure their longevity, accessibility, and security are aspects that are constantly being considered. With a continued curiosity and support for a decentralized global network of finance, we can build ourselves a better future- one that is controlled not by the few, but by all."],"create_date":"2020-09-15T14:43:06+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/10/three-korean-banks-will-face-inspection-over-cryptocurrency-exchange-relationships/","web_url":"https://blog.coinspectator.com/","type":"article","description":"According to a statement released on Monday by South Korea’s Financial Supervisory Service (FSS), three local banks will face a compliance inspection this month to check whether they are following new regulations put in place for dealing with cryptocurrency exchanges. The Financial Intelligence Unit (FIU) in conjunction with the FSS will carry out on-site inspections … Continue reading Three Korean banks will face inspection over cryptocurrency exchange compliance","title":"Three Korean banks will face inspection over cryptocurrency exchange compliance - CoinSpectator Blog","content":["According to a statement released on Monday by South Korea’s Financial Supervisory Service (FSS), three local banks will face a compliance inspection this month to check whether they are following new regulations put in place for dealing with cryptocurrency exchanges.","The Financial Intelligence Unit (FIU) in conjunction with the FSS will carry out on-site inspections of Nonghyup Bank, Kookmin Bank and Hana Bank between 19 and 25 April.","Investigators will check whether the banks are following recently introduced anti-money-laundering (AML) and know-your-customer (KYC) rules, which were recently introduced to prevent anonymous accounts being set up virtually.","Some banks have taken the initiative to introduce internal compliance checks, notably Nonghyup Bank, which has been providing automatic verification checks for two of the largest Korean exchanges, Coinone and Bithumb. Other financial providers have been urged to carry out their own checks to comply with the new rules.","South Korea’s banking institutions have welcomed cryptocurrency exchanges and related businesses with open arms, unlike most of the banks located in the UK, which have formed what has been likened to a cartel to block any crypto-related business accessing traditional banking services. Only this year, Barclays was the first to provide its banking services to CoinBase, allowing customers to deposit and withdraw fiat under the Faster Payments Service (FPS), which is more or less real-time.","Many cryptocurrency exchanges are working with Polish-based banks, which have so far been more open to working with such firms."],"create_date":"2018-04-10T07:05:59+01:00","tag":"South Korea","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/12/okex-is-moving-to-malta/","web_url":"https://blog.coinspectator.com/","type":"article","description":"In a statement issued today, cryptocurrency exchange OKEX has confirmed that it has started expanding operations to blockchain friendly Malta. After meeting with the Maltese regulatory and government leaders to discuss their legislative plans, OKEX confirmed that they will “make Malta a foundation for further OKEX growth”. This comes as no surprise given Malta’s position … Continue reading OKEX is expanding to Malta","title":"OKEX is expanding to Malta - CoinSpectator Blog","content":["In a statement issued today, cryptocurrency exchange OKEX has confirmed that it has started expanding operations to blockchain friendly Malta.","After meeting with the Maltese regulatory and government leaders to discuss their legislative plans, OKEX confirmed that they will “make Malta a foundation for further OKEX growth”.","This comes as no surprise given Malta’s position not only on blockchain technologies but also other sectors that are otherwise heavily scrutinised and regulated in much of the rest of the world. For example Malta has long been supportive of gambling and finance firms seeking better tax incentives and more flexible legislation.","The news follows in the footsteps of Binance who also recently migrated to the country for the same reasons.","OKEX carries a daily trade volume of over $1 billion dollars with millions of customers globally.","“This is just the start. Other companies will soon establish their operations in Malta”, said Silvio Schembri.","This is just the beginning. OKEX and Binance are currently among a growing number of crypto companies that are being forced to expand operations in Malta due to harsh regulatory conditions that are being set in their home countries – a trend, which if unaddressed will stifle innovation and growth in much of the developed and western world."],"create_date":"2018-04-12T13:50:38+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/13/discover-the-easiest-cheapest-and-safest-way-to-file-taxes-on-your-cryptocurrency-gains/","web_url":"https://blog.coinspectator.com/","type":"article","description":"No matter what you may think, the IRS knows about your trading and expects you to pay tax on earnings or face hefty penalties. In previous years, cryptocurrency traders managed to stay under the radar with fewer than 900 people reporting capital gains on Bitcoin to the IRS from 2013 to 2015.  It is likely … Continue reading Discover the Easiest, Cheapest, and Safest way to File Taxes on your Cryptocurrency Gains","title":"Discover the Easiest, Cheapest, and Safest way to File Taxes on your Cryptocurrency Gains - CoinSpectator Blog","content":["In previous years, cryptocurrency traders managed to stay under the radar with fewer than 900 people reporting capital gains on Bitcoin to the IRS from 2013 to 2015. It is likely that many believed they could avoid paying taxes because of the perception that their trades would not be traceable. For example, AlphaBay, the successor to the illicit online market “Silk Road,” was still recommending using Bitcoin as a privacy coin in 2016.","But the assumption that Bitcoin is anonymous or untraceable is unfounded. The FBI was able to trace $13.4 million in Bitcoin from the Silk Road to its apparently anonymous founder, Ross Ulbricht, by tracing public transactions on the blockchain – and that was back in 2014. The next year, the IRS partnered with Chainanalysis to identify suspicious activity among owners of digital wallets. The Daily Beast published a copy of their contract that explicitly states it intends to “trace the movement of money through the bitcoin economy” in order to “identify and obtain evidence of individuals using bitcoin … [to] conceal income as part of tax fraud”.","It is easy to imagine how anxious the IRS is to receive the unreported earnings, especially given the huge growth in cryptocurrency investments last year. For example, only 804 Americans declared taxes on Bitcoin gains in 2015—despite an estimated 500,000 to 1.2 million people owning Bitcoin that year. In 2017, the crypto market grew 30 fold from $18 billion in January to $573 billion by year end. And in November 2017, a federal judge ordered the exchange Coinbase to release data on 14,355 account holders who had traded in over $20,000 USD.","Many don’t even realize that they need to declare their cryptocurrency earnings. Most exchanges do not send users a 1099 form like stock trading websites do (Coinbase does only if the user has traded over $20,000). And tax filing websites like TurboTax and H\u0026R Block don’t ask if you sold cryptocurrency in the previous year. It is up to individuals to stay proactive and inform themselves of new tax laws.","If the IRS catches you not paying taxes, common fees include a “substantial understatement” penalty and “negligence or disregard of the rules” penalty, which are an additional 20 percent of the net understatement of tax. And if the IRS thinks you knowingly and intentionally did not pay your tax, it will charge you an additional 75 percent for committing fraud.","In the US, cryptocurrencies are treated by the IRS as property, similar to stocks. This means that you must pay capital gains on your investments that you have sold and basic income tax if mining or earning cryptocurrency for work.","Most people will have income from buying Bitcoin or an altcoin and selling it at a higher price; these sales need to be reported on Schedule D, an attachment to Form 1040. If the period between the purchase and sale is less than a year, it is taxed as ordinary income. If it is longer than a year, it is taxed as a long-term capital gain between 0 to 20 percent. If you are in the top three highest income brackets, you must also pay 3.8 percent tax on net investment income. Mining and sales receipts in cryptocurrency is also taxed as ordinary income between 10 to 39.6 percent depending on your tax brackets. The coins are valued at the historical price on the date the action occurred, so you must look up the spot price on a site like CoinMarketCap.com.","If you have made more than a handful of trades, and especially if you have used multiple exchanges, it can be a nightmare trying to calculate the capital gains, even for an experienced accountant. Fortunately there are a handful of websites that can import your trade data, look up the historical prices, and calculate the gains on each trade.","Our recommendation is to use GetCryptoTax.com because it is cheap, user-friendly, and almost anonymous.","This app has one of the slickest user interfaces out there and provides a hand-holding, informative tutorial to help you extract your trade data from exchanges. It uses spreadsheet imports instead of API connections because, if you set up your API access incorrectly, the app could potentially trade with your money! They don’t have a large list of exchanges yet, but they are adding new ones almost every day; you can email them with recommendations.","GetCryptoTax.com just launched in April 2018, so if you sign up early enough, you can download your reports for free while they are beta testing – they only ask that you give feedback on any bugs you may find or features you would like to see. They plan to eventually price it around $10.","","Bitcoin.tax has been in operation since 2013, so they have worked out the kinks by now and have a lot of options.","You can connect all of your exchanges to it via their API keys and it will import your trades and calculate the data for you to give to your accountant. You can even choose which cost basis you want to use and they will recommend which is cheapest; we don’t recommend using anything other than FIFO, though, as the other methods may raise red flags with the IRS. If you do not want to give them access to your exchanges via API, you can still upload spreadsheets like GetCryptoTax, but it only accepts one spreadsheet format and each exchange has its own unique format so we found this feature to be quite impractical to actually use.","Bitcoin.tax starts at $29.95 per year for 10,000 transactions and goes up to around $100 for higher volume traders.","","Cointracking.info has also been around since April 2013 and has built a lot of features by now. Although we do not recommend it to the average user due to its overwhelming complexity, it can be a real boon to hardcore traders or accountants who are willing to invest the time to learn their way around it.","The cheapest option for tax preparation costs 0.012 BTC ($84 with Bitcoin currently at $7,000 USD) for up to 3,500 transactions. You can get unlimited transactions for 1 year for 0.019 BTC ($133) or unlimited lifetime for 0.289 BTC ($2,000 USD). This could be a great option for serious traders, although as more competitors enter the market and develop new features, we expect prices to come down.","","Cointracker.io is another relatively new site that launched in August 2017. Like Get Crypto Tax, it has a pretty nice user interface. It does not seem to offer spreadsheet uploads but it can do API access like the other sites and even has a feature to read trades from your public wallet addresses.","Cointracker.io starts at $49 for 100 transactions, $149 for 1,000 and $999 for 15,000.","","Disclaimer: This is not intended to be tax or legal advice. Please consult your own professionals."],"create_date":"2018-04-13T16:03:57+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/04/29/tokenfi-targets-10-million-viewers-with-prime-time-tv-campaign-in-turkey/#respond","web_url":"https://blog.coinspectator.com/","type":"article","description":"TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey Digital Asset Platform TokenFi Unveils Major Advertising Push on Turkey’s Leading Television Channels TokenFi, a key player in the asset tokenization market, is rolling out a large-scale advertising campaign aimed at capturing the attention of 10 million viewers across Turkey. The campaign, set … Continue reading TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey","title":"TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey - CoinSpectator Blog","content":["TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey","Digital Asset Platform TokenFi Unveils Major Advertising Push on Turkey’s Leading Television Channels","TokenFi, a key player in the asset tokenization market, is rolling out a large-scale advertising campaign aimed at capturing the attention of 10 million viewers across Turkey. The campaign, set to launch on May 1st, 2024, will feature prime time slots on the nation’s most popular television channels.","In a strategic move to tap into Turkey’s robust television audience, TokenFi’s advertisements will be aired from 8 p.m. to 11 p.m. This timing coincides with peak viewing hours when families are most likely gathered to watch television. The chosen channels for this campaign include prominent networks such as Kanal D, ATV, Show TV, Star TV, NOW (formerly known as Fox), and TV8, ensuring widespread visibility.","The advertisement is specifically designed to appeal to a younger demographic with disposable income, leveraging popular programs such as “Tas Kagit Makas,” “Kurulus Osman,” and the Turkish version of “Survivor.” By featuring the ads during these highly rated shows, TokenFi plans to broadcast their message two to three times daily during these prime slots, maximizing exposure.","TokenFi’s initiative to position itself in the Turkish market comes at a time when television remains a dominant source of news and entertainment in the country. This campaign is part of TokenFi’s broader strategy to enhance brand recognition and engagement among potential users in a region known for its growing interest in digital financial solutions.","About TokenFi: TokenFi is pioneering the way in cryptocurrency and asset tokenization, offering a platform that simplifies the process of launching or tokenizing assets. With a focus on accessibility, TokenFi provides a user-friendly interface that does not require coding skills, aiming to transform the trillion-dollar tokenization industry."],"create_date":"2024-04-29T14:09:37+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/24/bitcoin-ethereum-and-blockchain-super-conference-ii-offers-rare-opportunity-to-network-with-cryptocurrency-and-blockchain-leaders/","web_url":"https://blog.coinspectator.com/","type":"article","description":"DALLAS, TX – Richard, organizer of the original Bitcoin, Ethereum and Blockchain Super Conference, held in February, is hosting a follow-up conference in September. Like the first conference, the second offers attendees a rare opportunity to network with many of the most respected players in the cryptocurrency and blockchain space – including developers, entrepreneurs, venture … Continue reading Bitcoin, Ethereum and Blockchain Super Conference II Offers Rare Opportunity to Network with Cryptocurrency and Blockchain Leaders","title":"Bitcoin, Ethereum and Blockchain Super Conference II Offers Rare Opportunity to Network with Cryptocurrency and Blockchain Leaders - CoinSpectator Blog","content":["DALLAS, TX – Richard, organizer of the original Bitcoin, Ethereum and Blockchain Super Conference, held in February, is hosting a follow-up conference in September. Like the first conference, the second offers attendees a rare opportunity to network with many of the most respected players in the cryptocurrency and blockchain space – including developers, entrepreneurs, venture capitalists, and “smart money” hedge fund managers who are now piling their capital into blockchain assets.","Headline speakers include major industry leaders like Tim Draper (the billionaire venture capitalist who famously bet on Skype before it got bit), Mark Yusko (founder of Morgan Creek Capital Management, who manages $4.5 billion), Nick Spanos (founder and CEO of Blockchain Technologies Corp.), and Lyn Ulbricht (CEO at Ross Ulbricht Defense).","When asked why he decided to organize a second conference, Mr. Jacobs responded: “So much has changed in the crypto space since February. There are a lot of new threats and new opportunities that nobody seems to be talking about. So, we decided to bring together dozens of the most respected players again, and some who couldn’t make it last time, so they can fill in investors on the latest developments.”","Mr. Jacobs continued: “What people really loved about the last conference was the networking. We had a ton of exhibitors outside, so it partly felt like being at the Consumer Electronics Show, but for crypto and blockchain. We had a lot of great speakers too! Folks said they learned a lot. But what they loved most was the chance to spend three days with a bunch of other smart people, making valuable connections, talking shop, exchanging blockchain investment ideas, and even creating joint ventures.”","The second Bitcoin, Ethereum, and Blockchain Super Conference is expected to have over 1,000 attendees, 70 top-notch speakers and 100+ exhibitors from the world of cryptocurrency, blockchain, and, in a few cases, other future techs – as well as talks from ICOs and blockchain start-ups.","Tickets are now available here:","https://www.thefuturetechexpo.com/register/","###","Press contact:","Richard Jacobs","[email protected]","(888) 448-4590","","About the Bitcoin, Ethereum, and Blockchain Super Conference II:","","This three-day conference will be held at Kay Bailey Hutchison Convention Center at Dallas from Friday September 14th to Sunday September 16th, 2018. We are expecting more than 1,000 attendees, at least 50 headline speakers, and upward of 50 exhibitors – with talks from founders, developers, and early-stage investors of cryptocurrencies and blockchain startups, including many that are planning ICOs throughout last 2018 and 2019.","","More information is available at:","https://www.thefuturetechexpo.com/register/"],"create_date":"2018-04-24T08:21:38+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/17/crypto-highlights-170418/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Indian police extorted builder for Bitcoin Nine Indian police officers felt the full force of the law after being arrested for extorting nearly $50,000 in cash and 200 Bitcoins from Surat-based builder, Shailesh Bhatt, who claims he was kidnapped in a local hotel by the crime branch cops last February. Read more here from NDTV. Cardano scores with … Continue reading Crypto Highlights 17/04/18","title":"Crypto Highlights 17/04/18 - CoinSpectator Blog","content":["Nine Indian police officers felt the full force of the law after being arrested for extorting nearly $50,000 in cash and 200 Bitcoins from Surat-based builder, Shailesh Bhatt, who claims he was kidnapped in a local hotel by the crime branch cops last February.","Read more here from NDTV.","Yesterday Huobi Pro announced that Cardano (ADA) will start trading on the 17th April at 14:00 GMT +8. Huobi is one of China’s largest cryptocurrency exchanges with a daily trading volume exceeding a billion dollars. The listing of the coin has already pushed the price up by 9.30% in the last 24 hours and is expected to significantly increase as more trading starts.","Launch of Cardano (ADA) on Huobi Pro ?? Deposits will be available from 14:30, April 16 (GMT+8). Trading will be available from 14:00, April 17, 2018 (GMT+8).","For more details, visit https://t.co/wVV4itj2ro#Cardano #huobi #blockchain #ecosystem #fintech #mining #exchange pic.twitter.com/oXpq72r5yk","— Huobi Pro (@Huobi_Pro) April 17, 2018","","Coinbase has acquired Earn.com for a cool $100 million. The firm was one of the most funded startups attracting $116 million over several rounds. CEO \u0026 Co-founder of Earn, Balaji Srinivasan, will become Coinbase’s first chief technology officer.","Read more here from Recode.","Tax-selling has undoubtedly been a huge contributor to recent price dips but this could quickly reverse with the US tax deadline on the 17th of April predicted to be a day that cryptos increase.","Read more here from CNBC.","The head of the International Monetary Fund (IMF) – Christine Lagarde, believes digital currencies and blockchain technology could make the global finance system safer by increasing the speed, cost and safety of transactions.","That level of diversity could build a “financial ecosystem that is more efficient and potentially more robust in resisting threats”, she said.","Read more here from the Guardian.","Crypto enthusiasts across reddit are competing with each other in a challenge to prove which country is the most Bitcoin friendly. Users have posted Bitcoin signs spotted in stores across Romania, Saigon, Bali, Toronto and many more locations.","Read more here at The Next Web.","An increasing numbers of ICO’s are promising all kinds of weird and wacky things from Bananas on the Blockchain (so ap-peel-ing) to AI that can predict the future. This week we seen the launch of Honest Coin “The Most Honest Cryptocurrency Ever Invented”. The project aims to be completely honest with their goals from day one.","Find out more here","No… we are not talking about psychedelics or bull markets however you can still ride yourself to the moon with CryptoRider, a mobile game developed to virtually ride those price charts. Now you can experience the highs and the lows again and again and again. Sounds like fun right? Download here.","A Los Angeles-bases cryptocurrency/ genetic firm has performed the worlds finda DNA sequence transfer on the Ethereum Blockchain. The Enterobacteria phage phiX174 sensu lato virus was transferred.","World’s first DNA sequence stored on the Blockchain","","Forget the Cayman Islands, Monero could be the next big tax shelter. With 8 months left of 2018 its time to become “tax efficient” by simply getting your boss to pay you in the pro privacy currency says hacked.com.","Indian-based cryptocurrency exchange Coinsecure has offered a 10% bounty ($356,000) for information leading to the recovery of the $3(+) million funds stolen last week.","Read more here from India Times.","Crypto personality John Mcafee believes that the Bitcoin price prediction of $20,000 in 2018 for Bitcoin is “absurdly low”. Agree or disagree we don’t recommend putting any body parts on the line.","Bitcoin at $20,000 by years end? I believe that\u0027s absurdly low.https://t.co/uZs1yYTIMx","— John McAfee (@officialmcafee) April 16, 2018","","In a bid to help domestic funding fro ICO’s and Cryptocurrency businesses in Thailand, enthusiasts have petitioned the Finance Ministry hoping the Revenue Department will reconsider its tax policy.","Read more here, the Bangkok Post.","ShipChain is launching a pilot program this summer with CaseStack solving supply chain, tracking and tracing issues in the shipping industry. CaseStack works with Amazon, Target, Duracell and many other Fortune 50 companies in the world.","Read more here from Influencive.","Mastercard will tackle fraud with Blockchain technology","A patent has been filed by Mastercard that will use Blockchain technology to verify and store identity data to combat fraud.","Read the patent here filed at the United States Patent and Trademark Office.","The The University of Akron’s (UA) and NASA will work together to help spacecraft avoid floating debris, the assistant professor Dr. Jin Wei Kocsis has received $330,000 in the form of a grant from NASA.","Read more here from The University of Akron College of Engineering.","The Foundation for Defense of Democracies released a report which found less then 1% of Bitcoin is used for illegal purposes.","Read more here from NewsBTC.","Marsh, ACORD Corporation and ISN Software Corp are working with IBM to develop insurance verification on the open-source hyperledger fabric technology and IBM blockchain platform. With the soft launch expected later this year. It will be used to speed up hiring contractors, transferring risk and coverage certainty.","Read more here from Seeking Alpha.","","That all folks, until next time."],"create_date":"2018-04-17T10:41:43+01:00","tag":"Bangkok","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/11/30/how-bitcoin-gamblers-can-benefit-from-current-bitcoin-price-rise/","web_url":"https://blog.coinspectator.com/","type":"article","description":"It all started in the December of 2017, when the whole world acknowledged Bitcoin to be the viable tool for investment. All this was due to the price of BTC hitting a +$17K tag. Since then there has been much criticism, attempts of derailment and various regulations to slow crypto revolution down. Although today, these … Continue reading How Bitcoin Gamblers can benefit from current Bitcoin price rise","title":"How Bitcoin Gamblers can benefit from current Bitcoin price rise - CoinSpectator Blog","content":["It all started in the December of 2017, when the whole world acknowledged Bitcoin to be the viable tool for investment. All this was due to the price of BTC hitting a +$17K tag. Since then there has been much criticism, attempts of derailment and various regulations to slow crypto revolution down. Although today, these attempts proved to be futile, because at this point, Bitcoin is yet again around the same price tag, and it’s universally considered to go even higher. Whether you’d like to invest in crypto or you’re considering Bitcoin Gambling, the indisputable fact is that everyone is primed to make massive profits by dealing with cryptocurrencies.","Bitcoin Investment","Around half a year ago, the price of a single Bitcoin was around 6,000 USD. Anyone who invested in BTC during that time is experiencing an insane +300% gain on their investment, because the price right now is almost $18K. Investment is an easy process, one just needs to seize the opportunity when it’s right in front of the eyes. All you have to do is visit the trusted crypto exchange website of your choice and convert FIAT into cryptocurrencies and wait for the right moment. It’s important to stay informed about the current events in the crypto industry to get the edge over everyone else.","BTC Gambling","Although it’s a controversial assumption, Bitcoin Gambling can really be a form of investment when it comes to cryptocurrencies. Just as with the stock exchange, you have to have a certain skill and a bit of luck to succeed, but it’s definitely highly possible to profit from BTC Gambling. At the end of the day, stock exchange and crypto trading is a form of gambling as well, although not as adrenaline driven and fun. Probably the best feeling in the world is making money while having fun, and that is exactly what the Bitcoin Gambling websites provide to their users. And the best part here is that your money accumulates in value while just sitting on your casino account, because as mentioned before, in 6 months the price of a single bitcoin rose by more than 300%.","What are the best Bitcoin Gambling sites?","Just as with the investment, it’s crucial to find the website that can be 100% trusted. The issue of trust is not exclusive to the internet, but it’s extremely important when dealing with large sums of money. It’s relatively easy to find the right BTC Gambling site for yourself if you consider checking out review websites like BitcoinGamblers, where you can get all the in-depth, detailed analyses of all pros and cons and various offers of different top dogs of the crypto gambling industry."],"create_date":"2020-11-30T10:48:48+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/03/26/gibraltar-leads-on-ico-regulation/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Gibraltar has been in the spotlight in recent months following the jurisdiction’s milestone DLT regulations. The DLT regulations, which came into force on 1st January 2018, received a warm reception by many in the FinTech space. Other jurisdictions are now keen to address the blockchain technology that is disrupting traditional industries and businesses. They, too, … Continue reading Gibraltar leads on ICO regulation","title":"Gibraltar leads on ICO regulation - CoinSpectator Blog","content":["Gibraltar has been in the spotlight in recent months following the jurisdiction’s milestone DLT regulations. The DLT regulations, which came into force on 1st January 2018, received a warm reception by many in the FinTech space. Other jurisdictions are now keen to address the blockchain technology that is disrupting traditional industries and businesses. They, too, see they need for regulation, and are looking to Gibraltar for inspiration.","In a speech on Friday 2nd March 2018, The Bank of England’s Governor, Mark Carney, stated it was time to “regulate elements of the crypto-asset ecosystem to combat illicit activities”. Gibraltar’s proactive approach has clearly placed the jurisdiction in a unique position as one of only a few jurisdictions to have some form of regulation for this growing industry.","It looks as though Gibraltar will continue to remain in the spotlight as the jurisdiction looks to address concerns surrounding the increasing number of Initial Coin Offerings (ICOs) that are funding blockchain based startups. It has been widely reported in recent weeks that Her Majesty’s Government of Gibraltar and the Gibraltar Financial Services Commission (GFSC) are preparing to release a draft of the world’s first token regulations.","During a presentation at the Gibraltar International FinTech Forum 2018, otherwise known as the Gibfin conference, which took place between 28th February and 1st May 2018, the GFSC provided attendees with more information about the activities that the forthcoming token regulations aim to regulate. The token regulations will regulate the following activities conducted in or from Gibraltar:","Tokens that are not considered securities, such as utility and access tokens, will be caught by the new token regulations but gifts, donations, virtual currencies (i.e. Bitcoin) and central-bank digital currencies will not.","The FSC clarified that they will not expand the interpretation of what is considered a security in Gibraltar and also have no intention of defining token categories, or the functionality of tokens, either pre or post ICOs. The intention is to ensure that token sale participants’ are presented, in advance, with all relevant information to enable them to make an informed decision.","To be captured by these regulations, the activities will need to be carried out in or from Gibraltar and will include activities:","are conducted by overseas agents and proxies acting on behalf of Gibraltar-registered legal persons, or on behalf of natural persons ordinarily resident in Gibraltar (in such cases, the Gibraltar person will be liable).","It is anticipated that Gibraltar-based token issuing companies will be required to comply with some form of disclosure rules that are yet to be announced. It is expected that the proposed regulations will require adequate, accurate and balanced disclosure of the relevant information to enable potential token sale participants to make an informed decision.","Additionally, token issuing companies will be obliged to collect know-your-customer (KYC) information on their token sale participants in order to comply with financial crime provisions in Gibraltar.","Additionally, entities that wish to conduct an ICO from Gibraltar will need to be sponsored by firms that the GFSC has authorised to perform such a function. Authorised sponsors will possess the appropriate knowledge and experience and will be responsible for ensuring compliance with the part of the regulations. Authorised sponsors will be regulated by the GFSC.","In order to encourage best practice for token sales conducted in or from Gibraltar, authorised sponsors will be required to have codes of practice in place that token sale entities will be required to comply with. Codes of practice may set out such matters as the method for storing, applying and distributing sale proceeds. Codes of practice will require approval from the GFSC and the regulator will establish and maintain a public register of authorised sponsors and their respective past and present codes of practice.","The GFSC will not however regulate:","Secondary market platforms, operated in or from Gibraltar, dealing in tokenised assets (including virtual currencies) and their derivatives will be caught by the token regulations. The GFSC aims to:","The proposed regulations will set out requirements for:","This second area of focus will be modelled, so far as is appropriate, proportionate and relevant, on market platform provisions under the Markets in Financial Instruments Directive II and Markets in Financial Instruments and Amending Regulation, otherwise known as MiFID II and MiFIR, which came into effect in January 2018.","It is proposed that the GFSC will authorise and supervise secondary token market operators, and establish and maintain a public register of such operators.","The provision of advice on investments in tokens, virtual currencies and central bank-issued digital currencies will be covered by the token regulations, including:","generic advice (setting out fairly and in a neutral manner the facts relating to token investments and services); product-related advice (setting out in a selective and judgmental manner the advantages and disadvantages of a particular token investment and service); and personal recommendation (based on the particular needs and circumstances of the individual investor).","The regulations will seek to ensure that such advice is fair, transparent and professional. This third area of focus will be similar to the investment advice provisions in MiFID II.","It is proposed that GFSC will authorise and supervise token investment service providers, and establish and maintain a public register of such providers","We are expecting to receive a draft of the much anticipated token regulations in the coming weeks. However, we understand that the draft will only likely include the first area of focus concerning the promotion, sale and distribution of digital tokens with the remaining two elements of the token regulations to follow later this year.","While we are eagerly anticipating the release of the draft regulations, which will mark another significant milestone for Gibraltar, the jurisdiction is not resting on its laurels. Her Majesty’s Government of Gibraltar has presented a progressive bill before its parliament to amend the scope of the Proceeds of Crime Act 2015, the jurisdiction’s main legislative instrument concerning anti-money laundering and counter-terrorist financing provisions. The intention is to bring:","“undertakings that receive, whether on their own account or on behalf of another person, proceeds in any form from the sale of tokenised digital assets involving the use of distributed ledger technology or a similar means of recording a digital representation of an asset.”","within the scope of anti-money lauding and counter-terrorist financing provisions.","These developments are further evidence of Gibraltar’s continued effort to make the jurisdiction crypto friendly and provide safe environment for both business and consumers.","",""],"create_date":"2018-03-26T15:54:41+01:00","tag":"Gibraltar","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/03/27/you-can-now-pay-with-crypto-in-over-6000-south-korean-shops/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Two South Korean firms, Bithumb and Pay’s have announced a partnership that will enable 6,000 stores throughout the country to open up goods purchases with cryptocurrency. Customers who hold their digital currencies on the Bithumb exchange will be able to quickly and easily pay for a coffee in stores such as Starbucks, Outback etc. Bithumb … Continue reading You can now pay with crypto in over 6,000 South Korean Shops","title":"You can now pay with crypto in over 6,000 South Korean Shops - CoinSpectator Blog","content":["Two South Korean firms, Bithumb and Pay’s have announced a partnership that will enable 6,000 stores throughout the country to open up goods purchases with cryptocurrency.","Customers who hold their digital currencies on the Bithumb exchange will be able to quickly and easily pay for a coffee in stores such as Starbucks, Outback etc.","Bithumb will integrate with Pay’s already established payment terminals which process payments for gift certificates in 6,000 stores, these include 400 domestic and 200 franchise partners among others.","Customers will use barcodes generated within their mobile app to make payments at their desired shop, adoption will increase to 8,000 by the end of 2018.","Bithumb, often unknown to cryptoethusiasts in the west is one of South Korea’s largest exchanges, in-fact it ranks second for trading volume amassing nearly half a billion dollars each day.","The news follows Bithumb’s recent collaboration with Innovation Corp which seen 50,000 accommodation options allowing customers to rent with cryptocurrencies.","Many companies are integrating with cryptocurrencies to bridge the gap between traditional payments thus opening the space up for more user friendly and transparent alternatives that no longer rely on slow and cumbersome fiat methods."],"create_date":"2018-03-27T18:05:07+01:00","tag":"Bithumb","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/03/07/dwf-labs-invests-10-million-in-tokenfi-tokens-aiming-for-dominance-in-tokenization-industry/","web_url":"https://blog.coinspectator.com/","type":"article","description":"DWF Labs Invests $10 Million in TokenFi Tokens, Aiming for Dominance in Tokenization Industry DWF Labs, a pioneering digital asset market maker and Web3 investor, has revealed its intention to inject $10 million into TokenFi tokens, signaling a robust show of support for TokenFi’s aspirations of emerging as a frontrunner in the swiftly expanding tokenization … Continue reading DWF Labs Invests $10 Million in TokenFi Tokens, Aiming for Dominance in Tokenization Industry","title":"DWF Labs Invests $10 Million in TokenFi Tokens, Aiming for Dominance in Tokenization Industry - CoinSpectator Blog","content":["DWF Labs Invests $10 Million in TokenFi Tokens, Aiming for Dominance in Tokenization Industry","DWF Labs, a pioneering digital asset market maker and Web3 investor, has revealed its intention to inject $10 million into TokenFi tokens, signaling a robust show of support for TokenFi’s aspirations of emerging as a frontrunner in the swiftly expanding tokenization sector.","Projections suggest that the tokenization industry is poised to burgeon to an estimated worth of $16 trillion by 2030.","DWF Labs’ procurement of tokens from the TokenFi treasury mirrors a calculated two-year blueprint devised to bolster TokenFi’s foothold in an arena marked by escalating competition.","At the crux of their strategy lies the integration of cutting-edge technologies such as Artificial Intelligence into TokenFi’s suite of offerings.","Among the forthcoming ventures are endeavors like the TokenFi Generative AI for Non-Fungible Tokens (NFTs) and the TokenFi AI Smart Contract Auditor. These innovative undertakings are anticipated to furnish TokenFi with a competitive edge as the convergence of tokenization and AI technology gains traction, potentially heralding a momentous surge in the cryptocurrency market.","The alliance between TokenFi and DWF Labs was initially forged in 2023 when DWF Labs clinched the pivotal role of being the primary market maker for TokenFi. This recent substantial acquisition of tokens by DWF Labs serves to solidify this partnership, empowering TokenFi to vie for a preeminent position in the dynamic and evolving realm of tokenization."],"create_date":"2024-03-07T18:45:45+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/21/crypto-highlights-21042018/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Coinbase bans WikiLeaks Shop CoinBase has kicked WikiLeaks Shop from utilising its payment processing service without any real explanation citing that they’ve engaged in prohibited use in violation of its Terms of Service. It seems like PayPal all over again. ANNOUNCE: Coinbase has blocked the official @WikiLeaks shop from its platform without notice or explanation. … Continue reading Crypto Highlights 21/04/2018","title":"Crypto Highlights 21/04/2018 - CoinSpectator Blog","content":["CoinBase has kicked WikiLeaks Shop from utilising its payment processing service without any real explanation citing that they’ve engaged in prohibited use in violation of its Terms of Service. It seems like PayPal all over again.","ANNOUNCE: Coinbase has blocked the official @WikiLeaks shop from its platform without notice or explanation. You can continue to donate #Bitcoin to WikiLeaks at https://t.co/lvhoyhlqUa. #Coinbase #DefendWL #Cryptocurrency #Ethereum #BitcoinCash #ReconnectJulian pic.twitter.com/4BSS023OOk","— WikiLeaks Shop (@WikiLeaksShop) April 21, 2018","","Community based video distribution platform Flixxo has confirmed in a blog post that more than 10,000 hours of content in 15 languages for was committed in June. Most of this content has never been published on YouTube or any online platform.","Read more on Flixxo’s Medium Blog here.","Back in 2016 the Vyborgsky District Court of St. Petersburg blocked Bitcoininfo.ru stating the information present on the website undermines Russia’s legal currency. The Supreme Court of Russia has now ordered the court to review the decision, it has already declined to review previously.","Read more at Bitcoin.com.","Zero-commission cryptocurrency exchange RobinHood expands services to Colorado.","Read more on CCN.","An alliance of lawyers, venture capitalists, and entrepreneurs have recently met with the US SEC to petition for the creation of cryptocurrency “safe harbors” for specific cryptocurrencies and tokens, including Ethereum.","Read more at CryptoSlate.","According to Taiwan’s Central News Agency the Taiwanese Minister of Justice, Chiu Tai-san, has said the country will roll out regulations for cryptocurrencies to prevent them being used for money laundering, these upcoming changes are rumoured to be targeted at exchanges.","Read more at CoinTelegraph.","Members of the European Parliament decided to vote in favour of tighter crypto AML regulations. These anti-money laundering reforms will include closer regulation for cryptocurrencies. 574 members voted in favour of this, with only 13 votes against and 60 abstentions, according to an EUP press release.","Read more at Russia Today.","In a report by the South China Morning Post, the Monetary Authority of Macau has issued a warning to the public regarding fraudulent activities based around the use of cryptocurrencies.","Read more at South China Morning Post.","Amazon cloud platform service has recently introduced its Blockchain framework for Ethereum (ETH) and Hyperledger Fabric allowing users to build and manage their own Blockchain-powered decentralized applications (DApps).","Emirates NBD, Dubai’s biggest bank, has become the first to successfully go live at scale with “Cheque Chain”, a blockchain technology project that aims to cut cheque-related fraud.","Read more at Arabian Business.","Texas police have released CCTV footage of two males who robbed a Bitcoin ATM using capsaicin bear spray to disable the store clerk.","Watch the robbery on Youtube.","Deloitte has verified Iconomis solvency consisting of $133.6M of liabilities and $210.2M of reserves, distributed across 80 digital assets.","Read Iconomi’s Medium Blog here."],"create_date":"2018-04-21T11:34:07+01:00","tag":"Litecoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2023/10/27/floki-ventures-into-the-16-trillion-tokenization-industry-with-token/#respond","web_url":"https://blog.coinspectator.com/","type":"article","description":"In a bid to seize the emerging tokenization trend, Floki, the popular cryptocurrency and meme coin, is set to launch TokenFi, aptly tickered as “TOKEN.” The tokenization industry is making waves, projected to balloon into a staggering $16 trillion sector by 2030. This radical transformation has garnered acclaim even from financial giant BlackRock, which manages … Continue reading Floki Ventures into the $16 Trillion Tokenization Industry with “TOKEN”","title":"Floki Ventures into the $16 Trillion Tokenization Industry with \"TOKEN\" - CoinSpectator Blog","content":["In a bid to seize the emerging tokenization trend, Floki, the popular cryptocurrency and meme coin, is set to launch TokenFi, aptly tickered as “TOKEN.”","The tokenization industry is making waves, projected to balloon into a staggering $16 trillion sector by 2030. This radical transformation has garnered acclaim even from financial giant BlackRock, which manages a colossal $10 trillion in assets, labeling it “the next evolution in markets.”","With crypto exchanges, institutional investors, and industry leaders predicting tokenization as the catalyst for mainstream crypto adoption, anticipation is soaring, especially as 2024 approaches. Leading exchanges like Binance and KuCoin have already published research reports, recognizing the immense potential.","While the tokenization realm remains relatively untapped by cryptocurrencies, the well-versed Floki team is gearing up to change that. They’ve introduced this groundbreaking venture in their Play-to-earn Gaming metaverse, creating a world-first announcement, reminiscent of their historic $100 million token burn event earlier this year.","The Floki team, known for their meteoric rise in the crypto sphere, managed the popular Floki cryptocurrency, which reached an all-time high market cap of $3.5 billion in 2021, showcasing a remarkable 875x growth.","TokenFi represents Floki’s first endeavor into launching a new cryptocurrency, and given their industry connections and past successes, their latest project is poised for triumph.","The launch date for TokenFi is set for October 27, 2023.","Here’s what sets Floki’s new token apart and why it’s garnering considerable attention:","1. Capitalizing on a $16 Trillion Industry: TokenFi is a crypto and asset tokenization platform geared towards a projected $16 trillion industry by 2030.","2. Real-World Integration: The token aims to bridge real-world assets with blockchain technology.","3. Astonishing Market Cap: At launch, the token boasts a meager circulating market cap of $50,000 and a fully diluted market cap of $500,000.","4. Proven Team: The Floki team’s extensive experience and impressive track record are instrumental to TokenFi’s success.","5. Institutional Backing: DWF Labs, a prominent crypto market maker and institutional investor, is among the notable institutions partnering with Floki, further enhancing the token’s legitimacy.","6. Prominent Exchange Listings: Several leading exchanges have committed to listing TokenFi post-launch.","With over 460,000 holders, Floki boasts one of the most engaged and active crypto communities. These fervent supporters are poised to drive the success of the new token.","This marks the first time the Floki team is launching a cryptocurrency post-Floki’s successful journey, and it’s their way of rewarding existing FLOKI holders.","Unlike most crypto projects, which allocate up to 25% of the token supply to their team with minimal vesting, Floki’s team has allocated a mere 2%, with a four-year vesting schedule. This underscores their confidence in the project’s long-term sustainability.","Floki has also secured a partnership with World Table Tennis, a renowned sports brand, which is set to introduce TokenFi to a vast audience of 120 million people worldwide. This is just one of many planned partnerships for the project.","For a glimpse of Floki’s marketing prowess, consider their past partnerships:","– Collaboration with nine of the world’s largest football clubs, collectively reaching over 3 billion people. – Partnership with Alfa Romeo Formula 1, boasting an audience of 1.55 billion people. – Team-up with Indian cricket team India Maharajas, introducing the brand to more than 700 million people. – Partnership with WTT Table Tennis, reaching 700 million people. – Extensive advertising campaigns featuring Floki on over 300 London buses and across the London Underground. – Billboard, airport, TV station, bus, and tram advertisements in over a dozen countries worldwide.","Combined, these partnerships introduced Floki to over 3 billion people, contributing to its status as one of the most popular cryptocurrencies globally, with an all-time high market cap of $3.5 billion during the previous bull market.","Floki seems poised to repeat this feat with TokenFi, driven by the colossal potential of the tokenization industry.","– Website: (https://tokenfi.com) – Twitter: https://twitter.com/tokenfi)","With the launch date nearing, the crypto world awaits the potential disruption and innovation TokenFi may bring to the ever-expanding tokenization landscape."],"create_date":"2023-10-27T12:47:19+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/20/is-the-tide-turning-for-bitcoin-author-of-amazon-best-selling-blockchain-book-reveals-new-intel-that-btc-is-poised-to-moon-again/","web_url":"https://blog.coinspectator.com/","type":"article","description":"DALLAS, TX – Richard Jacobs is the best-selling author of Bitcoin, Ethereum, and Blockchain, and organizer of the Future Tech Expo, which takes place in September 2018. As a sneak preview of what is to come at this conference, he has just published a free podcast that reveals brand-new intelligence which strongly suggests that Bitcoin … Continue reading Is the Tide TURNING for Bitcoin? Author of Amazon Best-Selling Blockchain Book Reveals New Intel that BTC Is Poised to “Moon” Again","title":"Is the Tide TURNING for Bitcoin? Author of Amazon Best-Selling Blockchain Book Reveals New Intel that BTC Is Poised to “Moon” Again - CoinSpectator Blog","content":["DALLAS, TX – Richard Jacobs is the best-selling author of Bitcoin, Ethereum, and Blockchain, and organizer of the Future Tech Expo, which takes place in September 2018. As a sneak preview of what is to come at this conference, he has just published a free podcast that reveals brand-new intelligence which strongly suggests that Bitcoin could be returning to $10-15k+ territory by summer.","“Almost all the ‘smart-money’ blockchain investors I know agree that Bitcoin is undervalued, and are loading up right now while its price is relatively low”, said Mr. Jacobs. He adds: “Why are they so confident? It’s because there are three specific developments in the pipeline – game-changers that are going to fundamentally alter the economics of Bitcoin and generate a lot of positive news flow.”","Since Monday, Mr. Jacobs has been sending out daily “Future Tech Gold Rush” podcasts – i.e. insider briefs on seven technologies, including Bitcoin and blockchain, that are set to provide early investors with the chance to get behind the next major tech disruption – and he is sending them to everyone who is registered on the email notification list for his Future Tech Expo in September.","If you sign up now (it’s 100% complimentary), you can still listen to and download every episode, including the Bitcoin episode that reveals the three game-changer developments that are set to send Bitcoin soaring by summer. (You’ll get the download links in an email as soon as you sign up.)","NOTE: This special podcast series is only available until April 30th, when all seven of the “Future Tech Gold Rush” intelligence briefs will be deleted from the internet and no longer available.","Do you want to get these crypto and future tech intelligence briefs too – before they are taken down?","If so, follow the link below and sign up to the Future Tech Expo notification list. Not only will you receive all seven of these “Future Tech Gold Rush” briefs, you’ll also benefit from a special discount on tickets to the conference itself – which takes place in September at Dallas.","Subscribe to the “Future Tech Gold Rush” free podcast series:","https://www.thefuturetechexpo.com/notification-list/","###","Press contact:","Richard Jacobs","[email protected]","(888) 448-4590","About the Future Tech Expo:","The Future Tech Expo is the only conference in North America that’s bringing all the top players from the domains of blockchain tech, artificial intelligence, 3D printing, virtual/augmented reality, drone technology, and even quantum computing – so you can get informed, get connected, and get exclusive access to investment opportunities that are “off-limits” to normal folks.","This three-day conference will be held at the Dallas Convention Center, close to Dallas/Fort Worth International Airport, in September. We are expecting more than 2,000 attendees, 100 headline speakers, and 150 exhibitors – with talks from developers, entrepreneurs, venture capitalists, and other “smart money” investors who are out to find the next Bitcoin and get behind it early.","More information is available at:","https://www.thefuturetechexpo.com/register/"],"create_date":"2018-04-20T06:30:23+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/10/tech-giants-face-class-action-lawsuit-over-targeted-crypto-ad-ban/","web_url":"https://blog.coinspectator.com/","type":"article","description":"More Blockchain and cryptocurrency organisations have joined the anti-crypto advertising ban enforced by tech giants such as Google, Facebook and Twitter. According to Russia’s RNS, three more countries that now include Kazakhstan, Armenia and Switzerland have joined Russia, South Korea and China in a joint class action lawsuit that will be filed in New York … Continue reading Tech giants face class action lawsuit over targeted crypto ad ban","title":"Tech giants face class action lawsuit over targeted crypto ad ban - CoinSpectator Blog","content":["More Blockchain and cryptocurrency organisations have joined the anti-crypto advertising ban enforced by tech giants such as Google, Facebook and Twitter.","According to Russia’s RNS, three more countries that now include Kazakhstan, Armenia and Switzerland have joined Russia, South Korea and China in a joint class action lawsuit that will be filed in New York this May. Legal costs will be crowd-sourced from donations made to a fund registered in Luxembourg.","Facebook, Google and Twitter as said to be displaying cartel-like behaviour when enforcing a restrictive ban on cryptocurrency ads, which appears to be aimed at curbing enthusiasm and hindering the adoption of new and possibly game-changing technologies. This blanket ban is penalising legitimate companies who wish to utilize advertising platforms to gain investors and users and spread the word about their projects, which subsequently affects the amount of funds raised.","The Chinese Association of Cryptocurrency Investors (LBTC), Russian Cryptocurrency and Blockchain Association (RACIB) and the Korea Venture Business Association (KOVA) came to an agreement to take the matter to court, and have been joined by many more organisations since.","Facebook banned crypto ads on the social network back in January citing complaints about advertisements from its user base.","Google restricted cryptocurrency ads and related content last month – this included ICO promotions, wallets and crypto exchanges, although a quick Google search for “ICO” returns multiple advertisements.","Russian search engines Yandex and Runet have also joined in and have started banning crypto ads.","The joint lawsuit is set to be filed in May 2018."],"create_date":"2018-04-10T04:36:08+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/04/23/revolut-expands-crypto-offerings-with-inclusion-of-floki-token/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Europe’s Leading Fintech Platform Allows 40 Million Users Access to Emerging Cryptocurrency In a significant expansion of its cryptocurrency portfolio, Revolut, a frontrunner in Europe’s neobank sector, has added the FLOKI token to its platform. This move opens up avenues for over 40 million users across more than 150 countries to engage with the FLOKI … Continue reading Revolut Expands Crypto Offerings with Inclusion of FLOKI Token","title":"Revolut Expands Crypto Offerings with Inclusion of FLOKI Token - CoinSpectator Blog","content":["Europe’s Leading Fintech Platform Allows 40 Million Users Access to Emerging Cryptocurrency","In a significant expansion of its cryptocurrency portfolio, Revolut, a frontrunner in Europe’s neobank sector, has added the FLOKI token to its platform. This move opens up avenues for over 40 million users across more than 150 countries to engage with the FLOKI cryptocurrency using major fiat currencies like the British Pound, Euro, and US Dollar.","The integration of FLOKI into Revolut’s trading platform is part of the token’s broader strategy to increase its global footprint. This listing is expected to enhance the accessibility of FLOKI, potentially increasing its adoption among Revolut’s substantial user base.","FLOKI has been making headlines recently, not only for its new listing but also for trending on the social media platform X, where it has captured significant attention. The cryptocurrency’s visibility was further boosted earlier this year when it was named the official cryptocurrency partner for the World Table Tennis Championship in South Korea.","In addition to these promotional endeavors, FLOKI has been focused on expanding its usability and integration into everyday commerce. It recently announced integration with Binance Pay, which allows merchants to accept FLOKI as payment, further cementing its utility in real-world transactions.","Moreover, FLOKI secured a partnership last month with Carbon Browser, a burgeoning Web3 browser with over seven million downloads. This collaboration is aimed at leveraging Carbon Browser’s daily active user base of about 62,500 to increase exposure and usage of the FLOKI token.","About FLOKI: Dubbed the “people’s cryptocurrency,” FLOKI is not only a utility token but also a key component of the Floki Ecosystem. With a vision to be the most recognized and most used cryptocurrency worldwide, FLOKI focuses on utility, community engagement, philanthropy, and robust marketing initiatives. Currently, the token boasts over 460,000 holders and has achieved global brand recognition through various strategic partnerships."],"create_date":"2024-04-23T18:22:01+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2023/10/27/floki-ventures-into-the-16-trillion-tokenization-industry-with-token/","web_url":"https://blog.coinspectator.com/","type":"article","description":"In a bid to seize the emerging tokenization trend, Floki, the popular cryptocurrency and meme coin, is set to launch TokenFi, aptly tickered as “TOKEN.” The tokenization industry is making waves, projected to balloon into a staggering $16 trillion sector by 2030. This radical transformation has garnered acclaim even from financial giant BlackRock, which manages … Continue reading Floki Ventures into the $16 Trillion Tokenization Industry with “TOKEN”","title":"Floki Ventures into the $16 Trillion Tokenization Industry with \"TOKEN\" - CoinSpectator Blog","content":["In a bid to seize the emerging tokenization trend, Floki, the popular cryptocurrency and meme coin, is set to launch TokenFi, aptly tickered as “TOKEN.”","The tokenization industry is making waves, projected to balloon into a staggering $16 trillion sector by 2030. This radical transformation has garnered acclaim even from financial giant BlackRock, which manages a colossal $10 trillion in assets, labeling it “the next evolution in markets.”","With crypto exchanges, institutional investors, and industry leaders predicting tokenization as the catalyst for mainstream crypto adoption, anticipation is soaring, especially as 2024 approaches. Leading exchanges like Binance and KuCoin have already published research reports, recognizing the immense potential.","While the tokenization realm remains relatively untapped by cryptocurrencies, the well-versed Floki team is gearing up to change that. They’ve introduced this groundbreaking venture in their Play-to-earn Gaming metaverse, creating a world-first announcement, reminiscent of their historic $100 million token burn event earlier this year.","The Floki team, known for their meteoric rise in the crypto sphere, managed the popular Floki cryptocurrency, which reached an all-time high market cap of $3.5 billion in 2021, showcasing a remarkable 875x growth.","TokenFi represents Floki’s first endeavor into launching a new cryptocurrency, and given their industry connections and past successes, their latest project is poised for triumph.","The launch date for TokenFi is set for October 27, 2023.","Here’s what sets Floki’s new token apart and why it’s garnering considerable attention:","1. Capitalizing on a $16 Trillion Industry: TokenFi is a crypto and asset tokenization platform geared towards a projected $16 trillion industry by 2030.","2. Real-World Integration: The token aims to bridge real-world assets with blockchain technology.","3. Astonishing Market Cap: At launch, the token boasts a meager circulating market cap of $50,000 and a fully diluted market cap of $500,000.","4. Proven Team: The Floki team’s extensive experience and impressive track record are instrumental to TokenFi’s success.","5. Institutional Backing: DWF Labs, a prominent crypto market maker and institutional investor, is among the notable institutions partnering with Floki, further enhancing the token’s legitimacy.","6. Prominent Exchange Listings: Several leading exchanges have committed to listing TokenFi post-launch.","With over 460,000 holders, Floki boasts one of the most engaged and active crypto communities. These fervent supporters are poised to drive the success of the new token.","This marks the first time the Floki team is launching a cryptocurrency post-Floki’s successful journey, and it’s their way of rewarding existing FLOKI holders.","Unlike most crypto projects, which allocate up to 25% of the token supply to their team with minimal vesting, Floki’s team has allocated a mere 2%, with a four-year vesting schedule. This underscores their confidence in the project’s long-term sustainability.","Floki has also secured a partnership with World Table Tennis, a renowned sports brand, which is set to introduce TokenFi to a vast audience of 120 million people worldwide. This is just one of many planned partnerships for the project.","For a glimpse of Floki’s marketing prowess, consider their past partnerships:","– Collaboration with nine of the world’s largest football clubs, collectively reaching over 3 billion people. – Partnership with Alfa Romeo Formula 1, boasting an audience of 1.55 billion people. – Team-up with Indian cricket team India Maharajas, introducing the brand to more than 700 million people. – Partnership with WTT Table Tennis, reaching 700 million people. – Extensive advertising campaigns featuring Floki on over 300 London buses and across the London Underground. – Billboard, airport, TV station, bus, and tram advertisements in over a dozen countries worldwide.","Combined, these partnerships introduced Floki to over 3 billion people, contributing to its status as one of the most popular cryptocurrencies globally, with an all-time high market cap of $3.5 billion during the previous bull market.","Floki seems poised to repeat this feat with TokenFi, driven by the colossal potential of the tokenization industry.","– Website: (https://tokenfi.com) – Twitter: https://twitter.com/tokenfi)","With the launch date nearing, the crypto world awaits the potential disruption and innovation TokenFi may bring to the ever-expanding tokenization landscape."],"create_date":"2023-10-27T12:47:19+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/16/worlds-first-dna-sequence-stored-on-the-blockchain/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Los Angeles-based DNAtix, also known as the ‘genetic blockchain company’ has successfully performed the world’s first DNA sequence transfer on the Ethereum Blockchain. The complete genome sequence of the Enterobacteria phage phiX174 sensu lato virus was transferred in a proof of concept test on the Ethereum blockchain and is believed to be the world’s first … Continue reading World’s first DNA sequence stored on the Blockchain","title":"World’s first DNA sequence stored on the Blockchain - CoinSpectator Blog","content":["Los Angeles-based DNAtix, also known as the ‘genetic blockchain company’ has successfully performed the world’s first DNA sequence transfer on the Ethereum Blockchain.","The complete genome sequence of the Enterobacteria phage phiX174 sensu lato virus was transferred in a proof of concept test on the Ethereum blockchain and is believed to be the world’s first single-stranded DNA (ssDNA) virus to ever be stored in this manner.","The human genome contains 3 billion base pairs which is approximately 100 gigabytes in raw data. This amount of data is too large to be supported by any current blockchain technologies however the team at DNAtix have developed specialised compression algorithms which reduce the size by 75%, resulting in an impressive 700 megabytes. The team is also confident that this can be improved even further with a total 99% size reduction in the future.","“For the purpose of the POC we uploaded the virus sequence which is ~5400 ‘letters’ that equals about 1348 bytes,” explains Ofer Lidsky, DNAtix’s CEO and co-founder.","This transfer of DNA on the blockchain opens up many doors for medical services and applications like DNAtix who wish to develop autonomous, distributed and redundant global ecosystems.","The firm also hopes that by placing DNA on the blockchain it will open up data access and research for 3rd parties to push forward developments, advancements in treatments and preventative medicine for the benefit of humankind."],"create_date":"2018-04-16T14:30:33+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/19/barclays-plc-considering-crypto-trading-desk/","web_url":"https://blog.coinspectator.com/","type":"article","description":"If you don’t believe that cryptocurrencies are having an effect on mainstream society, then you should really check out the latest information coming from Barclays Plc. One would think a bank like Barclays would be as traditional as they come, but that is no longer the case. It has been reported that they are now … Continue reading Barclays Plc considering crypto trading desk","title":"Barclays Plc considering crypto trading desk - CoinSpectator Blog","content":["If you don’t believe that cryptocurrencies are having an effect on mainstream society, then you should really check out the latest information coming from Barclays Plc.","One would think a bank like Barclays would be as traditional as they come, but that is no longer the case. It has been reported that they are now gauging interest on a potential cryptocurrency trading desk.","Bloomberg has reported that Barclays are well into the preliminary assessment of the trading desk. Although no concrete plans are yet in place, this would represent a massive step into the future for the British bank.","If they were going to go down this road, they would become the only big European investment bank to do so. The likes of investment chief Tim Throsby and CEO Jess Staley may need to give it the go-ahead, as this isn’t in line with what other continental banks are doing.","Staley and Throsby are no strangers to showing innovation in leadership; for instance, Throsby authorised the transfer of huge sums of capital to high-risk trading from safer corporate lending already.","There is an existing demand for the services, with the likes of bitcoin hedge funds eager to find banks that can look after their transactions. Crypto hasn’t found its home within the banking sector just yet, but once it does, it could be a lucrative partnership for all involved.","This is especially true if you consider that the amount of hedge funds focusing on crypto grew significantly from in the year ranging from February 2017 to February 2018.","Goldman Sachs haven’t been shy in expressing their ambition around digital currencies. The American organisation has set up a trading desk, which it hopes will begin trading this summer."],"create_date":"2018-04-19T09:05:58+01:00","tag":"News","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/03/27/floki-and-tokenfi-target-mena-region-for-crypto-market-expansion/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Floki and TokenFi Target MENA Region for Crypto Market Expansion Floki, renowned as one of the world’s most successful cryptocurrency projects, is expanding its reach beyond borders, setting its sights on the Middle East and North Africa (MENA) region in a bid to extend its influence alongside its sister project, TokenFi. In a recent Arabic … Continue reading Floki and TokenFi Target MENA Region for Crypto Market Expansion","title":"Floki and TokenFi Target MENA Region for Crypto Market Expansion - CoinSpectator Blog","content":["Floki and TokenFi Target MENA Region for Crypto Market Expansion","Floki, renowned as one of the world’s most successful cryptocurrency projects, is expanding its reach beyond borders, setting its sights on the Middle East and North Africa (MENA) region in a bid to extend its influence alongside its sister project, TokenFi.","In a recent Arabic video promo shared on social media platform X, TokenFi provided a sneak peek into its upcoming offerings tailored for the MENA market. The video showcased the simplicity of tokenizing projects, even for individuals without coding knowledge.","انضم إلى عالم #TokenFi واجعل أحلامك تتحقق!","سيجعل #TokenFi أحلامك حقيقةً، حيث يقدم لك أدوات وحلولًا لتحقيق أهدافك في عالم العملات الرقمية بسهولة وأمان.","اكتشف المزيد وانضم إلينا اليوم!https://t.co/HVyg2W78Wi pic.twitter.com/xkyq1TIOWc","— TokenFi (@tokenfi) March 26, 2024","","The video’s protagonist, representing the aspirations of the everyday person, reflects on the desire for financial prosperity. TokenFi aims to democratize access to cryptocurrency, empowering individuals to achieve their goals and improve their lives, irrespective of their background or connections.","The decision to focus on MENA is strategic, with the region emerging as the world’s sixth-largest crypto economy. According to research by Chainalysis, MENA accounted for approximately $389.8 billion in crypto transactions from July 2022 to June 2023, representing 7.2% of global volume during that period. Notably, countries such as Turkey, Morocco, and Iran rank among the top 30 for crypto activity.","Within MENA, the United Arab Emirates (UAE) stands out for its emphasis on decentralized finance (DeFi). The UAE’s progressive regulatory environment has positioned it as an attractive destination for crypto entrepreneurs, leading to its emergence as a burgeoning crypto hub.","The push into MENA reflects the growing significance of the region in financial and technological innovation. The UAE’s proactive embrace of blockchain technology underscores its forward-looking approach and commitment to embracing new trends in technology.","At the forefront of Floki’s MENA agenda is TokenFi, a platform designed for the seamless creation and management of digital tokens. With its user-friendly interface, TokenFi allows users to tokenize assets without the need for coding expertise, utilizing a What You See Is What You Get (WYSIWYG) approach.","TokenFi’s expansion comes amidst projections that the tokenization sector could reach a value of $16 trillion by 2030. Recognizing this potential, BlackRock, a leading investment firm, has hailed tokenization as “the next evolution in markets.”","Led by the same core team behind the successful Floki token, TokenFi offers a range of products connected by the $TOKEN utility token. These include the Token Launcher, QuickLaunch Bot, Launchpad, Generative AI, AI-powered Smart Contract Auditor, Connect, and the Real World Assets Tokenization Module.","About Floki","Floki is a cryptocurrency and utility token within the Floki Ecosystem. With a focus on utility, philanthropy, community, and marketing, Floki aims to become the world’s most recognized and utilized cryptocurrency. Boasting over 460,000 holders and a strong brand presence, Floki has garnered recognition from billions of people worldwide through strategic marketing partnerships.","Website: https://floki.com","Twitter: https://twitter.com/RealFlokiInu","About TokenFi","TokenFi is an innovative platform for crypto and asset tokenization, offering users a seamless experience in launching or tokenizing assets without coding expertise. Committed to revolutionizing the tokenization industry, TokenFi provides a user-friendly interface to democratize access to tokenization opportunities.","Website: https://tokenfi.com","Twitter: https://twitter.com/tokenfi","",""],"create_date":"2024-03-27T07:30:31+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/07/financial-conduct-authority-issues-crypto-derivatives-warning/","web_url":"https://blog.coinspectator.com/","type":"article","description":"The UK’s financial regulatory body issued a statement on Friday aimed at businesses providing “derivatives” and similar services to the public. The FCA said that it does not consider cryptocurrencies to be a commodity or traditional currency from a regulatory standpoint as currently no legal framework exists, but they believe some derivatives may be considered … Continue reading Financial Conduct Authority Issues Crypto Derivatives warning","title":"Financial Conduct Authority Issues Crypto Derivatives warning - CoinSpectator Blog","content":["The UK’s financial regulatory body issued a statement on Friday aimed at businesses providing “derivatives” and similar services to the public.","The FCA said that it does not consider cryptocurrencies to be a commodity or traditional currency from a regulatory standpoint as currently no legal framework exists, but they believe some derivatives may be considered to be financial instruments under the current legislation more specifically the Markets in Financial Instruments Directive II (MIFID II) and therefore businesses must seek authorisation or clarification from them as soon as possible.","Any operation, dealing, arranging or advising of derivatives that reference either cryptocurrencies or tokens issued through an initial coin offering (ICO) will require authorisation by the FCA, this also includes options and CFDs.","“It is firms’ responsibility to ensure that they have the appropriate authorisation and permission to carry on regulated activity. If your firm is not authorised by the FCA and is offering products or services requiring authorisation it is a criminal offence. Authorised firms offering these products without the appropriate permission may be subject to enforcement action.” said the FCA","The FCA is carefully monitoring the crypto industry as it grows, they released a statement last December warning that CFDs were extremely high risk and speculative products and that consumers should be fully aware of the price volatility, leverage ratios, higher charges in comparison, funding costs and transparency."],"create_date":"2018-04-07T08:01:59+01:00","tag":"Derivatives","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/12/monero-xmr-ledger-support-coming-soon/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Monero 0.12.1 will support Ledger hardware wallets Monero (XMR) code lead Riccardo Spagni has confirmed that the privacy-focused coin will soon receive official Ledger support. Currently, various options exist for secure storage of XMR cryptocurrency, from mobile wallets to the official desktop wallet, but so far no hardware wallet is available for public use. The … Continue reading Monero (XMR) Ledger Support Coming Soon!","title":"Monero (XMR) Ledger Support Coming Soon! - CoinSpectator Blog","content":["Monero 0.12.1 will support Ledger hardware wallets","Monero (XMR) code lead Riccardo Spagni has confirmed that the privacy-focused coin will soon receive official Ledger support.","Currently, various options exist for secure storage of XMR cryptocurrency, from mobile wallets to the official desktop wallet, but so far no hardware wallet is available for public use.","The Ledger integration news broke when Riccardo confirmed during an interview on an episode of the Doug Polk podcast that integration had ‘already’ occurred for users who have the ‘dev kit’, but the public release will probably be available alongside the Monero 0.12.1 release.","It’s happening (if you’re running the dev kit) pic.twitter.com/DuXDoleu27","— Riccardo Spagni (@fluffypony) March 30, 2018","","Hardware support for cryptocurrencies is no longer deemed overprotective. It has become the de facto way of ensuring your assets are secured most effectively.","You can find the Github here for the Monero wallet application.","Monero was trading at roughly $172 before the Ledger news broke, increasing to $178 before dipping back to $164. This has now stabilised at $170 at the time of writing."],"create_date":"2018-04-12T06:34:39+01:00","tag":"Ledger Hardware Wallet","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/09/23/the-biggest-crypto-trends-that-shaped-2020/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Crypto started off with a bang, but later in March, just like many other sectors, it started to fluctuate because of the COVID-19 crisis. Many skeptics expected Bitcoin to drop and for the pandemic to mark the beginning of the end for crypto, but things didn’t go that way. In fact. The drop of cryptocurrency … Continue reading The biggest crypto trends that shaped 2020","title":"The biggest crypto trends that shaped 2020 - CoinSpectator Blog","content":["Crypto started off with a bang, but later in March, just like many other sectors, it started to fluctuate because of the COVID-19 crisis. Many skeptics expected Bitcoin to drop and for the pandemic to mark the beginning of the end for crypto, but things didn’t go that way. In fact. The drop of cryptocurrency and the drop of the stock market were only correlated for a short while, and Bitcoin’s drop was mainly a liquidity issue because, like gold, it was oversold. In reality, crypto made a quick recovery and even consolidated its role in the “new normal.” Experts estimate that COVID-19 will only normalize crypto payments and that, though unfortunate, it will accelerate the digital revolution. So far, 2020 was a good year for cryptocurrency, and we saw the advent of some exciting trends that will shape the market going forward.","Widespread adoption by institutional investors is by far the most notable one – banks are beginning to accept digital currencies and running pilots on wholesale payment systems. This year, six major central banks (England, Canada, Sweden, Japan, the European Central Bank, and the Bank of International Settlements) have joined a joint initiative to research the potential of cryptocurrencies. Apart from this major movement, other trends that stand out in 2020 include:","The world was bound to become cashless eventually, but digital crypto payments could become the norm sooner than we think. To limit the spread of the novel Coronavirus, the World Health Organization recommended people to make contactless payments instead of cash payments, and concerns about hygiene were a pretty persuasive driver, even for skeptics. If we look at the official stats, we’ll see that the number of Blockchain wallets has been growing consistently, reaching over 50 million users at the end of June 2020, compared to 47% at the end of March. What was quite rare before the pandemic now becomes more acceptable among mainstream users, and the fact that institutions now encourage cryptocurrency made it obvious that this is not just another passing trend.","The cashless transition was also sped up by the fact that now more stores accept bitcoin as a valid payment method. During the pandemic, online retail experienced a massive boom, especially in categories such as groceries, electronics, and personal hygiene. At the same time, games and streaming services grew in popularity, and, as a result, crypto payments increased on their websites too. Even after the pandemic is over, most users who got used to crypto payments will likely continue to use them, and this will push more retailers to consider implementation.","For many years now, the worlds of traditional and alternative trading were separate. Either you traded Forex, or you traded crypto. The differences in mentality were also quite different: people who traded traditional currencies tended to be more conservative and risk-averse, while the ones who traded crypto were younger and more likely to invest in innovative technologies. Now, however, with crypto becoming a bigger part of the world of finance, Forex and crypto trading are no longer that far apart.","Many Forex brokers now allow account funding with Bitcoin and major cryptocurrencies such as Ethereum, Tether, Litecoin, Dashcoin usually in combination with fiat currencies. So, instead of training in pairs like EUR/USD or GBP/USD, you can now trade pairs like BTC/USD or LTC/USD. This has added a new dimension to currency trading, and more and more people are beginning to use their digital currencies on the Forex market. Among the biggest benefits of trading Forex with Bitcoin is that digital currencies are decentralized, so they aren’t influenced by inflation and interest rates. In addition, Forex brokers usually offer high leverage to crypto traders, which is a big plus for veterans. Other reasons why more people have started to trade pairs like BTC/USD include:","Of course, like regular trading, crypto Forex trading involves a certain degree of risk too, especially for beginners, but the fact that so many people have decided to try it goes to show that cryptocurrencies have had a major impact on the trading world.","In its early days, cryptocurrency was a niche investment for a certain “geeky” market. The people who had bought Bitcoins were the people who mined them themselves, knew someone who did, or liked investing in anything new, tech-related, that showed promise.","Over the years, crypto has slowly transitioned from being a niche investment to a less obscure one, and, in 2020, it has almost become mainstream. If they don’t own crypto themselves, people know someone who does, and how digital currencies work in general. To appeal to this growing mass of mainstream users, crypto services have made interfaces more appealing and easier to use, so that you don’t need to mine Bitcoin or be a crypto expert to get around them.","Although cryptocurrencies are thought to be the highlight, decentralized finance (DeFi) has been picking up steam since the end of 2019, and in 2020 it reached new heights. In the past month alone, the total value locked in DeFi surpassed $4 billion. Generally based on Ethereum, decentralized finance consists of a wide range of financial services (lending apps, dex platforms, derivatives, stablecoins, etc.) that do not rely on a central authority.","DeFi applications have a flexible user experience and, in general, they aim to be simpler alternatives to traditional financial services, because there are no gatekeepers. For example, loans can be negotiated directly between two parties from different parts of the world, without a bank having to intervene. Other applications of DeFi apps include exchanging assets and implementing advanced trading strategies."],"create_date":"2020-09-23T12:26:53+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2022/10/10/liechtensteins-leading-blockchain-company-has-relaunched-its-crypto-currency-exchange/","web_url":"https://blog.coinspectator.com/","type":"article","description":"LCX, Liechtenstein’s leading blockchain company, has relaunched its crypto currency exchange – the regulated cryptocurrency trading experience to buy, sell and store a variety of digital assets. Originally launched in 2018, the LCX Exchange Revamp is another milestones in LCX’s growth roadmap establishing the foundational framework including its new backbone infrastructure, scalable account wallets and … Continue reading Liechtenstein’s leading blockchain company has relaunched its crypto currency exchange","title":"Liechtenstein’s leading blockchain company has relaunched its crypto currency exchange - CoinSpectator Blog","content":["LCX, Liechtenstein’s leading blockchain company, has relaunched its crypto currency exchange – the regulated cryptocurrency trading experience to buy, sell and store a variety of digital assets. Originally launched in 2018, the LCX Exchange Revamp is another milestones in LCX’s growth roadmap establishing the foundational framework including its new backbone infrastructure, scalable account wallets and updated user interface.","With the relaunch of LCX Exchange all users now benefit from a fast, reliable and advanced trading experience. The new version of LCX Exchange is built on a scalable infrastructure with a high-performance trading engine. The login and registration process has been simplified to enable faster on-boarding and user growth. Wallets and account security has been improved and comes with faster and automated withdrawals.","","And probably the most visible change is the new design. LCX Exchange now includes a fresh new user interface design with additional menu options for easy navigation, a new crypto market page, education content and crypto tutorials.","LCX was established in 2018 and gained eight regulatory registrations by the Financial Market Authority based on the innovative Blockchain Laws Liechtenstein. LCX’s token sale launchpad has become the leading platform to facilitate initially coin offerings – the legal way. LCX is registered as Token Issuer and handles all tech and legal aspect for the initial coin offering. As such LCX became the new hotbed for new crypto gems as these tokens are exclusively listed at LCX Exchange.","LCX grew in popularity in Europe as a secure, trustworthy and regulated crypto exchange. LCX Token is a utility token is listed at Coinbase, Kraken, etc and works as a long-term sustainable incentive mechanism to motivate various stakeholders to participate in the ecosystem. To sign up at LCX Exchange visit exchange.LCX.com",""],"create_date":"2022-10-10T16:24:22+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/06/crypto-currencies-aiming-to-revolutionize-a-gambling-industry/","web_url":"https://blog.coinspectator.com/","type":"article","description":"2017 was a memorable year for crypto world. Bitcoin and other cryptocurrencies seen a significant growth and wider adoption while numerous projects raised millions of dollars in capital via Initial Coin Offerings (ICO). Some call it the future of money, others say it’s a bubble. Whichever it turns out to be in the end, the … Continue reading Crypto currencies aiming to revolutionize a gambling industry.","title":"Crypto currencies aiming to revolutionize a gambling industry. - CoinSpectator Blog","content":["2017 was a memorable year for crypto world. Bitcoin and other cryptocurrencies seen a significant growth and wider adoption while numerous projects raised millions of dollars in capital via Initial Coin Offerings (ICO). Some call it the future of money, others say it’s a bubble. Whichever it turns out to be in the end, the recent upsurge in Bitcoin’s price and the whole crypto market suggests that it isn’t going anywhere soon…","There is no doubt that we are in times of a present-day Gold Rush and nobody wants to miss out on the extraordinary returns if products hit critical mass and investors get in early. So the question is, which sectors are likely to winners in 2018? Answer: you can ‘t go wrong with gambling. In 2013 just over 50% of all bitcoin transactions were related to gambling. Moreover, since 2014, roughly 3.7 million BTC has been wagered equating to $37 billion USD at the time of writing. The crypto gambling market size is constantly increasing but is only a tip of the iceberg compared to the global online gambling industry. One upcoming ICO is seeking to disrupt the industry by taking a new approach to gambling and offering new opportunities.","ZeroEdge.Bet is a new type of blockchain based online casino whose business model revolves around its cryptocurrency’s value growth rather than the cash flow from casino games like in traditional model. As a result, all casino games at ZeroEdge.Bet are with 0% house edge, meaning players have just as much chance of winning as the house. Casino will also offer a first ever 0% commission sports betting exchange where players can choose to bet on a multitude of different leagues and sports.","The simple feature that makes Zero Edge model work is that all betting on the platform is performed using Zero Edge Casino’s cryptocurrency named ZERO. The supply of ZERO tokens is fixed, so as demand and adoption of ZERO token grows, so does its value (Based on Metcalfe’s Law). Therefore, ZERO token does not only perform certain functions on the platform, but it also presents itself as a viable long-term investment due to its design.","On November 25th, ZeroEdge.Bet had its first official introduction during Blockchain Summit Kyiv 2017. Team was in attendance to shed a light on the current online gambling market and how blockchain and smart contracts can be utilized to create a more sociably responsible, sustainable and efficient gambling environment for both the players and gambling providers.","Zerocoin Pre-ICO is open – 79% discount \u0026 low hard cap!","The Pre-ICO is set to start on the 28th of February 2018, closing out on the 15th of March 2018. Pre-ICO bonus are 79% discount with a low hard cap – 1500 eth. https://tokensale.zeroedge.bet"],"create_date":"2018-04-06T21:22:25+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/08/20/3-skyrocketing-cryptocurrencies-to-buy-in-2020/","web_url":"https://blog.coinspectator.com/","type":"article","description":"This year is proving to be quite fruitful for cryptocurrency HODLers. The king of crypto, Bitcoin, rose 3x from around $4,000 to just over $12,000 recently. Many of the altcoins have followed.  The current question on many cryptocurrency enthusiasts mind’s is…which coin to invest in now? 2020 is proving to be a remarkable year for … Continue reading 3 Skyrocketing Cryptocurrencies to Buy in 2020","title":"3 Skyrocketing Cryptocurrencies to Buy in 2020 - CoinSpectator Blog","content":["This year is proving to be quite fruitful for cryptocurrency HODLers. The king of crypto, Bitcoin, rose 3x from around $4,000 to just over $12,000 recently. Many of the altcoins have followed.","The current question on many cryptocurrency enthusiasts mind’s is…which coin to invest in now?","2020 is proving to be a remarkable year for assets. Gold hit all time highs, so did the NASDAQ, and even Bitcoin looks poised to make a run for its all time high of $20,000.","What are the criteria to look for when choosing the three best cryptocurrency to buy now in 2020 that could skyrocket?","Knowledge is always the first and best tool when it comes to spotting the next rocket ship in the crypto game.","Find a solid crypto news source and stick to it daily, even multiple times daily, if you have the time.","If you can catch crypto news on small sites before it hits bigger sites — then you’ll be able to stay a step ahead and board the rocket ship before it launches.","The projects which earn the most money are the ones which provide the most value to their customers.","The wild days of the ICO — when companies could make incredible money simply by making big, bold promises — are over. These days users in the cryptocurrency space are much more savvy and knowledgeable. They want to see working products, traction, and happy user reviews.","You can be sure that a company which delivers quality products will be one with a bright future.","The best way to spot that is to try to be a customer yourself.","The cryptocurrency Beam springs to mind. Since their launch they’ve focused on rolling out updates to their blockchain, software, and wallets. All this to help their users regain their financial privacy and keep control over their keys and funds.","A project and coin doesn’t need to only give products and value to their direct customers. They can also be delivering value for the community as a whole.","Enjin is a company that has been developing video games since before bitcoin even existed. When they discovered Ethereum and the capabilities of the blockchain, they incorporated those abilities into their work.","They’re the ones pioneering and championing the ERC-1155 smart contract — which is a contract with the ability to provide better smart contract functions for collectible items. An article explains it like this:","“While ERC-20 and ERC-721 tokens required a new smart contract deployed for each new “class” of token, the core concept behind ERC-1155 is that a single smart contract can govern an infinite number of tokens.","Think of this like a vending machine that holds a wide variety of soda, juices, and even snacks. A customer interacts with the machine using a single secure interface (inserting a coin, pressing a button), and the machine dispenses the goodies they have selected. In the same way, an ERC-1155 contract made for a game could contain a wide variety of items, from weapons and armor to health potions, magic scrolls, and more.","Each of these items could be “fungible,” having more than one copy available. Fungible tokens are used for divisible currencies (most ERC-20 tokens), and they’re also very useful for stackable items that don’t need to be differentiated, like a bundle of arrows for a bow.“","These types of innovations help the whole ecosystem. This type of help drives up the price of the cryptocurrency native to the company as well as the prices of the coins which are also part of the ecosystem.","In the end, if you want to buy a cryptocurrency in 2020 that might skyrocket — you might not need to go any further than Bitcoin itself.","The famous Stock-to-Flow model for Bitcoin is predicting a shot at $100,000 in the future.","If you’re not experienced in trading other altcoins or simply don’t want to risk your funds on their projects — then putting a little bit into Bitcoin might be the way to go.","Of course, as with all of these cryptocurrencies, never spend more than you’re afraid to lose….not only because you might lose all your money, but also because if you’re emotionally tied to your crypto then you might sell too early or buy/re-buy too late.","Just like it was said at the start of this article — arm yourself with knowledge. Read more about these cryptocurrencies and many others. Then you can decide how much you want to spend and where to put it so that you can gain the most from the combination of your risk appetite and your circumstances."],"create_date":"2020-08-20T10:25:32+01:00","tag":"Contributions","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/04/one-of-canadas-largest-banks-considers-use-of-public-blockchain-for-asset-tracking/","web_url":"https://blog.coinspectator.com/","type":"article","description":"These days, more and more recognised companies and organisations are looking towards blockchain technology as a way to improve how they do business. Both large and small organisations are looking for ways to utilise blockchain, with one of Canada’s biggest banks becoming the latest to consider employing this technology in a meaningful way. Just last … Continue reading One of Canada’s largest banks considers use of public blockchain for asset tracking","title":"One of Canada\u0027s largest banks considers use of public blockchain for asset tracking - CoinSpectator Blog","content":["These days, more and more recognised companies and organisations are looking towards blockchain technology as a way to improve how they do business.","Both large and small organisations are looking for ways to utilise blockchain, with one of Canada’s biggest banks becoming the latest to consider employing this technology in a meaningful way.","Just last week, a patent application was published which revealed TD Bank’s idea to track assets digitally through the use of a public blockchain.","The patent application detailed the banks idea to use a public distributed ledger, which would in turn help point-of-sale computers keep track of the transactions. The computers would then hold blocks of data that would include information about the assets and their value.","The file states that an advantage of this use of blockchain would be the transparent nature of the data.","It read “One advantage of block chain [sic] based ledgers is the public nature of the block chain architecture that allows anyone in the public to review the content of the ledger and verify ownership.”","The application was filed all the way back in Autumn 2016 and it’s not known whether or not the bank has pursued this plan further. Generally speaking, large bank blockchains have been used for only private or permissioned ledgers, so this represents the possibility of a monumental change.","The patent application praised the potential use of blockchain in this scenario, insisting that that a ledger such as this would be positive as it would “[minimize the] risk of falsification of ledgers.”","TD Bank’s application also suggested that this potential system doesn’t need to be judged by the speed of blockchains used by other organisations."],"create_date":"2018-04-04T08:51:19+01:00","tag":"TD Bank","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/04/29/tokenfi-targets-10-million-viewers-with-prime-time-tv-campaign-in-turkey/","web_url":"https://blog.coinspectator.com/","type":"article","description":"TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey Digital Asset Platform TokenFi Unveils Major Advertising Push on Turkey’s Leading Television Channels TokenFi, a key player in the asset tokenization market, is rolling out a large-scale advertising campaign aimed at capturing the attention of 10 million viewers across Turkey. The campaign, set … Continue reading TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey","title":"TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey - CoinSpectator Blog","content":["TokenFi Targets 10 Million Viewers with Prime Time TV Campaign in Turkey","Digital Asset Platform TokenFi Unveils Major Advertising Push on Turkey’s Leading Television Channels","TokenFi, a key player in the asset tokenization market, is rolling out a large-scale advertising campaign aimed at capturing the attention of 10 million viewers across Turkey. The campaign, set to launch on May 1st, 2024, will feature prime time slots on the nation’s most popular television channels.","In a strategic move to tap into Turkey’s robust television audience, TokenFi’s advertisements will be aired from 8 p.m. to 11 p.m. This timing coincides with peak viewing hours when families are most likely gathered to watch television. The chosen channels for this campaign include prominent networks such as Kanal D, ATV, Show TV, Star TV, NOW (formerly known as Fox), and TV8, ensuring widespread visibility.","The advertisement is specifically designed to appeal to a younger demographic with disposable income, leveraging popular programs such as “Tas Kagit Makas,” “Kurulus Osman,” and the Turkish version of “Survivor.” By featuring the ads during these highly rated shows, TokenFi plans to broadcast their message two to three times daily during these prime slots, maximizing exposure.","TokenFi’s initiative to position itself in the Turkish market comes at a time when television remains a dominant source of news and entertainment in the country. This campaign is part of TokenFi’s broader strategy to enhance brand recognition and engagement among potential users in a region known for its growing interest in digital financial solutions.","About TokenFi: TokenFi is pioneering the way in cryptocurrency and asset tokenization, offering a platform that simplifies the process of launching or tokenizing assets. With a focus on accessibility, TokenFi provides a user-friendly interface that does not require coding skills, aiming to transform the trillion-dollar tokenization industry."],"create_date":"2024-04-29T14:09:37+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2020/07/13/crypto-behemoth-huobi-futures-to-launches-bitcoin-options-trading/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Huobi Futures to launch Bitcoin Options Trading in Q3 of 2020.  Following the successful launch of Perpetual Swaps in Q2 of this year, Huobi Futures now has its sights on a Q3 launch for its Bitcoin Options. Bitcoin Options are a form of financial derivatives that provide traders with the right, but not the obligation, … Continue reading Crypto Behemoth Huobi to Launch Bitcoin Options Trading","title":"Crypto Behemoth Huobi to Launch Bitcoin Options Trading - CoinSpectator Blog","content":["Huobi Futures to launch Bitcoin Options Trading in Q3 of 2020.","Following the successful launch of Perpetual Swaps in Q2 of this year, Huobi Futures now has its sights on a Q3 launch for its Bitcoin Options.","Bitcoin Options are a form of financial derivatives that provide traders with the right, but not the obligation, to buy or sell Bitcoin at a specific price at a certain date of expiry.","Alpha testing is already in full swing as the Huobi team looks to iron out and streamline the Options trading offering. Once complete, Huobi Futures will announce the official launch on the Web and API. The options will also then be expanded to the Huobi Trading App.","The contracts will be offered in the European style meaning that buyer of the Option can only be exercised at the expiration. The Options contracts will, at first, only be available for Bitcoin.","Options have long been a popular derivatives trading tool in the traditional space, but this type of trading has also permeated the cryptocurrency space recently. A Bitcoin Options contract is similar to a futures contract with the main difference being that the trader has an option, rather than an obligation, to buy or sell on a fixed date at an agreed upon price.","The crypto behemoth’s entry into the derivatives market has been incredibly successful so far and continues to be bolstered. The company has been sitting at the top of many metrics regarding trading volume and has rocketed to the top in Perpetual Swaps in just a few months.",""],"create_date":"2020-07-13T22:08:40+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/06/16/bitcoin-latinum-pre-listed-on-coinmarketcap/","web_url":"https://blog.coinspectator.com/","type":"article","description":"If you are looking to invest in Bitcoin Latinum, then you may be in luck, as it is now pre-listing on CoinMarketCap. The fork, which is being pushed as a solution for large transaction volumes, digital asset management and cyber security, is already pre-listed on the platform and will be publicly launched on exchanges later … Continue reading Bitcoin Latinum Pre-listed on CoinMarketCap","title":"Bitcoin Latinum Pre-listed on CoinMarketCap - CoinSpectator Blog","content":[],"create_date":"2021-06-16T15:50:30+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2021/08/17/nimiq-launches-oasis-atomic-swaps-between-crypto-and-fiat-in-partnership-with-ten31-bank/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Crypto has just become more instant, with fiat-to-crypto exchanges now available. Nimiq Oasis, together with German TEN31 Bank, allows for these exchanges, using SEPA transfers, from any European bank that allows instant transactions. According to a press release detailing the launch, this is “designed to provide a secure and decentralized experience for its users, Nimiq … Continue reading Nimiq Launches ‘OASIS’ Atomic Swaps Between Crypto and Fiat In Partnership With TEN31 Bank","title":"Nimiq Launches \u0027OASIS\u0027 Atomic Swaps Between Crypto and Fiat In Partnership With TEN31 Bank - CoinSpectator Blog","content":["Crypto has just become more instant, with fiat-to-crypto exchanges now available.","Nimiq Oasis, together with German TEN31 Bank, allows for these exchanges, using SEPA transfers, from any European bank that allows instant transactions.","According to a press release detailing the launch, this is “designed to provide a secure and decentralized experience for its users, Nimiq built Oasis to be the perfect non-custodial bridge between fiat and crypto.”","Launched in 2017, Nimiq was designed to improve blockchain’s ease of use and accessibility. Philipp von Styp-Rekowsky, tech lead and co-founder of Nimiq, discussed their ambition.","He said: “We started the Nimiq project to make cryptocurrency accessible, usable and secure for everyone. It was clear to us that without a technology with which the new cryptocurrencies could easily be bought, sold or exchanged, there would be no mass market. With Nimiq Oasis, we have now finally overcome this barrier.”","Matthias von Hauff, CEO of TEN31 Bank, echoed this enthusiasm. He said: “OASIS is a revolution in trading with cryptocurrencies. With this project, we have come a lot closer to our goal of making trading with cryptocurrencies easy and offering everyone involved real added value.”","One of the main advantages of this development is the possibility of exchanging crypto for fiat without having to install software or register. However, Nimiq Oasis does charge a 1.25% fee per transaction and is currently only available for Nimiq Wallet users in Europe."],"create_date":"2021-08-17T11:41:21+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/03/09/floki-cryptocurrency-dazzles-times-square-with-three-month-ad-blitz/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Floki Cryptocurrency Dazzles Times Square with Three-Month Ad Blitz March 8, 2024: Floki, the cryptocurrency sensation, is set to commandeer New York City’s bustling Times Square with a monumental advertising campaign. Starting March 15th, a colossal HD LED screen will display Floki’s advertisement non-stop for three months, ensuring the digital coin’s presence is etched into … Continue reading Floki Cryptocurrency Dazzles Times Square with Three-Month Ad Blitz","title":"Floki Cryptocurrency Dazzles Times Square with Three-Month Ad Blitz - CoinSpectator Blog","content":["March 8, 2024: Floki, the cryptocurrency sensation, is set to commandeer New York City’s bustling Times Square with a monumental advertising campaign. Starting March 15th, a colossal HD LED screen will display Floki’s advertisement non-stop for three months, ensuring the digital coin’s presence is etched into the minds of New Yorkers and tourists alike.","Standing tall on the corner of 1500 Broadway at West 43rd Street, Floki’s advertisement will dominate a massive double-sided LED screen measuring 56 feet in width and 29 feet in height. This digital colossus, towering five stories high and spanning an area of 1,624 square feet, dwarfs the average Manhattan home, according to PropertyShark.","Positioned strategically next to the Nasdaq billboard, the Floki ad will be impossible to miss. Running for 10 seconds per display, it will grace the screen a minimum of four times every hour, for 20 hours each day, from 6 am to 2 am. Over the campaign’s duration, viewers will be treated to a staggering minimum of 7,440 separate displays of the advertisement.","Times Square, famously dubbed ‘The Gateway to New York,’ attracts approximately 330,000 visitors daily and hosts around 50 million pedestrians annually, cementing its status as the most visited destination in the United States.","Floki’s disruptive success story in the cryptocurrency realm stems from its innovative approach to blending solid utility with the viral power of memes, ensuring widespread appeal and adoption. Beyond its financial prowess, Floki has ventured into the realm of PlayToEarn NFT gaming with Valhalla, an NFT and merchandise marketplace, Digital Asset Locker FlokiFi, and a crypto education platform, positioning itself as a multifaceted player in the crypto landscape."],"create_date":"2024-03-09T10:02:20+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2023/11/20/floki-and-tokenfi-align-forces-with-legends-league-cricket-titans/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Strategic Partnership Unveiled: Floki and TokenFi Align Forces with Legends League Cricket Titans the Manipal Tigers and the Bhilwara Kings In a groundbreaking move set to resonate across the global cricketing landscape, Floki and its counterpart, TokenFi, have announced a strategic alliance with two iconic Legends League Cricket teams: the Manipal Tigers and the Bhilwara Kings. … Continue reading Floki and TokenFi Align Forces with Legends League Cricket Titans","title":"Floki and TokenFi Align Forces with Legends League Cricket Titans - CoinSpectator Blog","content":["In a groundbreaking move set to resonate across the global cricketing landscape, Floki and its counterpart, TokenFi, have announced a strategic alliance with two iconic Legends League Cricket teams: the Manipal Tigers and the Bhilwara Kings.","This strategic marketing partnership represents a concerted effort to unleash the power of the Floki and TokenFi brands on the massive stage of over 700 million cricket enthusiasts worldwide.","","As part of a comprehensive marketing campaign, Floki will take center stage as the back-of-shirt sponsor and primary upper-arm sponsor for the Manipal Tigers, while simultaneously, TokenFi will claim a prominent position as the back-of-shirt sponsor and leading upper-arm sponsor for the Bhilwara Kings.","Beyond traditional sponsorship, Floki and TokenFi secure a suite of marketing rights, spanning from assertive social media promotions to exclusive signed merchandise.","The upcoming Legends League Cricket event in India, scheduled between November 18 and December 9, 2023, will serve as the battleground for Floki and TokenFi’s prominence. With Floki featured prominently in the Manipal Tigers’ clash against the Gujarat Giants on November 20, and TokenFi making its debut in the opening match as the Bhilwara Kings face off against the India Capitals, the duo anticipates exposure in a total of 19 matches, captivating a global audience exceeding 700 million.","","A novel twist to this collaboration will unfold on November 24th when Floki and TokenFi take the spotlight across opposing teams during the “clash of the tokens” style event, as the Bhilwara Kings challenge the Manipal Tigers.","This strategic marketing move not only propels the Floki and TokenFi brands into the limelight in India and South Asia but also bolsters their global legitimacy.","The Legends League Cricket matches will not only be broadcasted across India, Pakistan, Sri Lanka, and Bangladesh but will also enjoy extensive international coverage on esteemed platforms such as ESPN in the United States, BT Sport in the United Kingdom and Ireland, Kayo in Australia, and Etilsat in the MENA region.","Key Insights into Legends League Cricket:","Additional Exposure for Floki and TokenFi:","In Conclusion: This strategic marketing move is a monumental step, introducing Floki and TokenFi to a global audience of over 700 million as the crypto market gears up for a bullish trend. It signifies just one of many strategic initiatives aimed at solidifying Floki and TokenFi as the foremost cryptocurrency brands worldwide."],"create_date":"2023-11-20T19:00:01+01:00","tag":"Blockchain","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/09/wall-street-heavy-weights-are-going-into-bitcoin/","web_url":"https://blog.coinspectator.com/","type":"article","description":"Have Wall Street legends turned the market? Ethereum, Bitcoin and many of the major cryptocurrencies are back in the green with the finger being pointed at Wall Street legends George Soros and John D. Rockefeller who are allegedly investing. Although it’s still early days, 2018 has not been a great start for crypto with the … Continue reading Wall Street heavy weights are going into Bitcoin","title":"Wall Street heavy weights are going into Bitcoin - CoinSpectator Blog","content":["Have Wall Street legends turned the market?","Ethereum, Bitcoin and many of the major cryptocurrencies are back in the green with the finger being pointed at Wall Street legends George Soros and John D. Rockefeller who are allegedly investing.","Although it’s still early days, 2018 has not been a great start for crypto with the price of Bitcoin plummeting from record highs.","What caused the crash? It would appear that several elements played a part but the massive tax bills American traders have racked up, estimated to be in the region of $25bn, are undoubtedly a factor, combined with regulatory uncertainty in several Asian countries and tech giants such as Facebook and Google banning adverts related to crypto.","Billionaire investment fund Soros Fund Management has been given the green light to trade in digital currencies, although the firm’s $26bn fund has not yet made a wager according to Bloomberg.","Venture capital firm Venrock, which was founded by descendants of John D. Rockefeller, recently announced it was partnering with a cryptocurrency firm from Brooklyn.","According to Hedge Fund Research, funds that invested in cryptocurrencies at the beginning of 2017 made colossal profits of around 3,000%.","It seems that April will be an interesting month for cryptocurrencies, as, at the time of writing, Bitcoin was trading at $7,147.92 with Ethereum at $415.72."],"create_date":"2018-04-09T09:35:23+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2023/12/13/floki-and-tokenfi-unleash-strategic-marketing-blitz-in-hong-kong/","web_url":"https://blog.coinspectator.com/","type":"article","description":"FLOKI LAUNCHES HONG KONG MARKETING CAMPAIGN ACROSS 69 HIGH-DEFINITION DIGITAL CITY BUSES Aggressive 2-Month Campaign Aims to Cement Dominance in Asia Amidst Crypto Boom In a strategic move to fortify their positions in the fast-evolving cryptocurrency landscape, Floki and its sister project, TokenFi, are set to unleash an assertive 2-month marketing campaign in Hong Kong. … Continue reading Floki and TokenFi Unleash Strategic Marketing Blitz in Hong Kong","title":"Floki and TokenFi Unleash Strategic Marketing Blitz in Hong Kong - CoinSpectator Blog","content":["Aggressive 2-Month Campaign Aims to Cement Dominance in Asia Amidst Crypto Boom","In a strategic move to fortify their positions in the fast-evolving cryptocurrency landscape, Floki and its sister project, TokenFi, are set to unleash an assertive 2-month marketing campaign in Hong Kong. Positioned as one of the world’s wealthiest cities and a pivotal financial hub, Hong Kong provides the backdrop for what many anticipate to be a groundbreaking crypto bull run.","","Timed strategically to coincide with the festive Christmas and New Year period, as well as the forthcoming Chinese New Year in 2024, the campaign seeks to introduce Floki and TokenFi to millions of Hongkongers. This concerted effort aims not only to solidify their dominance in the Asian market but also to expand their brands to a broader audience.","","The comprehensive campaign is anticipated to reach an extensive audience, boasting over 53 million impressions. The iconic Hong Kong Tramcar, a symbol of the city’s bustling energy, will prominently feature the brands as it navigates prime routes, passing through Metropolitan Zones, Central HK financial district, Shoppers paradise, and luxury residences between Quarry Bay and Central. Additionally, the brands will grace 69 high-definition digital City Bus screens strategically located in key commercial districts, enhancing visibility near landmarks like Hong Kong Park, Revenue Tower, HSBC, Mandarin Oriental, China Tower, and COFCO Tower.","","Scheduled to run from December 17, 2023, to February 13, 2024, this campaign aligns with the perceived onset of what many believe will be a pivotal crypto bull run.","","FLOKI 和 Tokenfi 将在为期 2 个月的积极营销活动中称霸香港","作为战略定位#Floki和我们的姊妹项目#TokenFi 是新的、积极的活动的一部分，以便在许多人认为将是迄今为止的加密货币项目之中，并且会是在牛市占据主导地位的项目类型之一，Floki 已经锁定了为期 2… https://t.co/P2YaDPRA3E pic.twitter.com/RmCxNL9xzK","— FLOKI (@RealFlokiInu) December 13, 2023",""],"create_date":"2023-12-13T20:30:43+01:00","tag":"Floki","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2024/03/21/floki-tokenfi-secure-exclusive-partnership-with-world-table-tennis-championship-in-south-korea/","web_url":"https://blog.coinspectator.com/","type":"article","description":"In a strategic move aimed at bolstering its presence in the cryptocurrency market and solidifying its influence in South Korea, Floki, alongside its sister company TokenFi, has forged a significant partnership with the World Table Tennis (WTT) Championships. As the Official Cryptocurrency Partner for the upcoming WTT Champions event in Incheon, South Korea, Floki and … Continue reading Floki \u0026 TokenFi Secure Exclusive Partnership with World Table Tennis Championship in South Korea","title":"Floki \u0026 TokenFi Secure Exclusive Partnership with World Table Tennis Championship in South Korea - CoinSpectator Blog","content":["In a strategic move aimed at bolstering its presence in the cryptocurrency market and solidifying its influence in South Korea, Floki, alongside its sister company TokenFi, has forged a significant partnership with the World Table Tennis (WTT) Championships. As the Official Cryptocurrency Partner for the upcoming WTT Champions event in Incheon, South Korea, Floki and TokenFi are set to take center stage in one of the world’s most renowned sporting spectacles.","Scheduled to unfold from March 27th to March 31st at the Mohegan INSPIRE Entertainment Resort, the WTT Champions event is anticipated to capture the attention of audiences worldwide. Building upon previous collaborations with WTT, including sponsorships for WTT Champions Frankfurt 2023 and the ITTF World Team Table Tennis Championships Finals in Busan just last month, Floki and TokenFi are poised to capitalize on this opportunity to enhance their global brand visibility and engagement.","The Incheon tournament will witness the participation of the top 32 men and women table tennis players as they vie for the coveted singles titles, promising an electrifying competition that will resonate with sports enthusiasts globally. With over 580 hours of anticipated broadcast coverage and a potential viewership exceeding 450 million people, coupled with a robust social media presence garnering over 46 million views, the event is primed for extensive exposure.","For Floki, the partnership with the WTT Champions Incheon tournament represents a strategic maneuver aligned with the evolving landscape of cryptocurrency in South Korea. By leveraging this collaboration, Floki aims to cultivate a robust community centered around the shared passion for sports, thereby strengthening its foothold in the region.","With past events yielding over 5.4 million online interactions, the WTT Champions platform presents an ideal avenue for Floki to engage with fans and enthusiasts alike. Moreover, the global table tennis community boasts an impressive following of over 519 million followers, with a significant demographic skew towards younger audiences, including 33% between the ages of 16 and 19 and 42% between 30 and 49.","Table tennis holds a revered status as one of the top four sports in Asia, with its matches broadcasted in more than 500 million households across the continent. Particularly in China, where the sport enjoys a fervent following of 241 million active fans, table tennis has emerged as a cultural cornerstone, dominating the airwaves during the Olympics and captivating audiences on China’s CCTV-5.","With such a formidable presence in Asia, underscored by an expansive fan base and robust viewership figures, Floki finds itself poised for heightened visibility and resonance within the cryptocurrency landscape. As the WTT Champions event unfolds in Incheon, South Korea, all eyes will undoubtedly be on Floki and TokenFi as they embark on this transformative journey at the intersection of sports and digital currency.",""],"create_date":"2024-03-21T13:46:10+01:00","tag":"Bitcoin","author":"@coinspectator"}
{"url":"https://blog.coinspectator.com/2018/04/14/unicornogo-the-next-level-of-cryptogaming/","web_url":"https://blog.coinspectator.com/","type":"article","description":"While the cryptocurrency market takes a bearish turn and most tokens go through record plunges, the blockchain technology does not stand still and continues to develop in all directions very rapidly. The gaming industry is also moving forward. After the success of PokemonGo and CryptoKitties, meet UnicornGo, a blockchain based online game with elements of … Continue reading UnicornoGo – The Next Level of Cryptogaming","title":"UnicornoGo – The Next Level of Cryptogaming - CoinSpectator Blog","content":["While the cryptocurrency market takes a bearish turn and most tokens go through record plunges, the blockchain technology does not stand still and continues to develop in all directions very rapidly. The gaming industry is also moving forward. After the success of PokemonGo and CryptoKitties, meet UnicornGo, a blockchain based online game with elements of augmented reality created by a solid team of developers in collaboration with genetic engineers.","Just imagine, a beautiful fantasy world where you can become an owner of mythical creatures, the unicorns, buy plots of land, grow candy trees and participate in tournaments. Each unicorn is unique and has its own colour, character and abilities. This is achieved through gene crossing and inheritance of various traits by the next generation of unicorns. Unicorn owners will be able to predict offspring traits by selecting a partner with genetic attributes of interest, resulting in unique unicorns that can bring significant profits to their owners. Unicorns with higher attributes are very desirable on a marketplace as breeding partners, allowing its owner to set a higher price for siring.","Users can buy unicorns using Ethereum or its own in-game currency, CandyCoin, which is already being traded on the ForkDelta exchange and will be listed on other exchanges in the near future. The tokens are based on Ethereum smart contracts, with a limited release of 12,000,000 tokens. But in nearest future, UnicornGo plans to move the game to the Universa blockchain, for higher speeds and almost zero transaction fees. CandyCoin is used on the in-game marketplace to buy/sell/exchange unicorns, plots of land, candy tree seeds to grow food for unicorns and other fairy tale accessories.","At the moment, users can buy the first generation GEN-0 unicorns on the game’s website play.unicorngo.io/. Sales of GEN-0 will last until 30,000 unicorns are sold, after which no new GEN-0 unicorns will ever be created again. All subsequent generations of unicorns will come from the GEN-0 generation. Furthermore, every purchaser of GEN-0 unicorn has a 30 percent higher chance than in later generations to receive a Legendary unicorn, which will have unique traits. All the lucky users who will randomly get the Legendary unicorn will also receive a special gift from UnicornGo team worth the amount of 10,000 USD!","On 8 April of 2018 the marketplace has been released, where all created unicorns can be traded. Users also can find partners for breeding, put their unicorns for sale and evaluate future opponents for tournaments. The presale of land plots has begun as well. It should be noted that land is a very important asset because it acts as a means of resource production in the game. Users can play around in sandbox mode and construct potential unicorns by visiting the page: http://demo.unicorngo.io/","The next stage is the integration of the UnicornGO interface with augmented reality in conjunction with IZETEX, as well as the introduction of mind control technology. The neural interface has already been developed by the BasisNeuro startup. In the next 2 to 4 months UnicornGo specialists in cooperation with a team of creative designers will develop a new gadget which will allow users to control unicorns with the power of thought, providing an incredible experience for everyone and great opportunities for disabled people. And this is only the beginning. Considering the strong support of the community and innovative development, the project has a great future.","To learn more about the project or buy unicorns visit the official website: https://play.unicorngo.io/"],"create_date":"2018-04-14T07:59:51+01:00","tag":"Contributions","author":"@coinspectator"}
