{"url":"https://coinpedia.org/news/notcoin-airdrops-80-billion-tokens-a-new-milestone-on-ton-blockchain/#","web_url":"https://coinpedia.org/","type":"article","description":"In the world of cryptocurrencies, one name stands out: Notcoin. This web3 clicker game has captured the attention of crypto enthusiasts everywhere. Today","title":"Notcoin Is Here! Prepare for the Massive 80 Billion Token Airdrop","content":["Notcoin, a popular crypto clicker game, is launching its own cryptocurrency (NOT) on the TON blockchain today.","Notcoin started on Telegram and grew to 35 million users without much marketing.","Launched in late 2023, Notcoin lets users mine NOT tokens by playing a simple game.","In the world of cryptocurrencies, one name stands out: Notcoin. This web3 clicker game has captured the attention of crypto enthusiasts everywhere. Today marks a big step forward for Notcoin as it launches its cryptocurrency on the TON blockchain.","The event comes with a massive airdrop of over 80 billion NOT tokens. Notcoin started as a hit Telegram Mini App and is now expanding its reach even further.","NOT tokens will be distributed among participants, fostering widespread adoption. Notcoin aims to list on prominent exchanges like Binance, OKX, and Bybit, as the project aims to provide users with seamless access to the NOT token, further enhancing liquidity and accessibility.","Moreover, OKX has also collaborated with the Notcoin community to launch the ‘NOT Learn and Earn Campaign’, which consists of several social media initiatives. Two hostings are scheduled for today: the Telegram AMA and X Spaces on Notcoin at 8:00 (UTC) and 16:00 (UTC), respectively.","Notcoin virality has helped it expand to a community of over 35 million players without significant marketing expenditure, all through its appeal and the power of viral communication on platforms like Telegram.","A Cultural Phenomenon?!","Ryan Dennis, brand director at TON Foundation, praises Notcoin as “one of the largest, most engaged communities in Web3.” This highlights Notcoin’s cultural significance and widespread impact. Since its launch on The Open Network blockchain in late 2023, Notcoin has made waves.","Notcoin believes in fairness and inclusivity. Users can mine NOT tokens by tapping their screens within the Telegram Mini App. Converting in-game balances to NOT tokens at a ratio of 1000:1 ensures a fair distribution process.","Notcoin’s ambitions go beyond its current success. The team plans to keep users engaged with rewards and initiatives using NOT tokens. They’re also looking to introduce a trading bot for TON-based tokens. Initiatives like Open Builders will help bring new users to the TON blockchain, driving innovation and growth.","As Notcoin continues to make waves in the crypto world, one thing is certain: its journey is far from over."],"create_date":"2024-05-16T13:26:00+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/crypto-live-news/nft-market-crash-trading-volume-drops-97-since-2021/","web_url":"https://coinpedia.org/","type":"article","description":"Once known for digital art and collectibles fetching millions, the NFT market is now nearly deserted. Trading volume has plummeted by a staggering 97%","title":"NFT Market Crash: Trading Volume Drops 97% Since 2021","content":[],"create_date":"2024-05-16T12:45:49+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/news/binance-battles-address-poisoning-scams-with-new-algorithm/","web_url":"https://coinpedia.org/","type":"article","description":"Cryptocurrency scams are on the rise, but Binance isn\u0027t sitting idly by. They\u0027ve launched a powerful tool to tackle one of the sneakiest scams out there:","title":"Binance Battles Address Poisoning Scams with New Algorithm","content":["Binance launched a new anti-scam algorithm to fight address poisoning scams where fake wallet addresses trick users into sending crypto.","The algorithm identifies suspicious transactions and fake addresses that closely resemble real ones.","Binance collaborates with security services to register fake addresses and raise awareness about how scammers exploit users.","Cryptocurrency scams are on the rise, but Binance isn’t sitting idly by. They’ve launched a powerful tool to tackle one of the sneakiest scams out there: address poisoning.","Let’s break down what it does and how it works.","Using advanced security mechanisms, Binance has recognized millions of fake addresses across BNB Smart Chain and Ethereum, stopping real-time threats. The program timestamps malicious behaviour by examining suspicious transactions and connecting them with possible victim addresses, revealing address-poisoning origins.","Binance believes that impersonating a valid Ethereum address like 0x19x30f…62657 can be done by using a similar-looking 0x19x30t…72657, which differs in the middle but retains the first and last few characters","To mitigate the losses, Binance quickly registers faked addresses in a database with HashDit, a major Web3 security service. This collaboration helps other crypto service providers improve security and safeguard people from similar scams.","A recent address-poisoning scam cost an anonymous trader $68 million, emphasizing the need for preventative safeguards. The cash was recovered, demonstrating the need for strong security protocols in protecting user assets.","Scammers thrive on loopholes, and one big gap is how traders verify wallet addresses. Many simply glance at the first and last digits, making it easy for scammers to slip in fake addresses using vanity address generators. Binance’s move to beef up security sends a clear message: it’s time to rethink how we verify addresses to stay one step ahead of the scammers.","Binance’s anti-scam algorithm is a game-changer in the fight against address poisoning scams. While the nitty-gritty details might be under wraps, its track record speaks for itself.","Feeling secure with Binance’s new solution? Stay tuned for more updates."],"create_date":"2024-05-16T12:51:54+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/web-stories/microstrategy-buys-16130-bitcoin-as-holdings-surpass-1b-gains/","web_url":"https://coinpedia.org/","type":"article","description":"MicroStrategy Buys 16,130 Bitcoin As Holdings Surpass $1B Gains","title":"MicroStrategy Buys 16,130 Bitcoin As Holdings Surpass $1B Gains","content":[],"create_date":"2023-12-01T11:58:25+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/crypto-live-news/paul-ryan-advocates-stablecoin-regulation-to-tackle-u-s-debt-crisis/#","web_url":"https://coinpedia.org/","type":"article","description":"Former U.S. House Speaker Paul Ryan supports stablecoin regulation to enhance U.S. economic stability and boost dollar adoption. In a Bloomberg interview,","title":"Paul Ryan Advocates Stablecoin Regulation to Tackle U.S. Debt Crisis","content":[],"create_date":"2024-05-16T06:36:34+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/cryptocurrency-regulation/cryptocurrency-regulations-in-singapore/#","web_url":"https://coinpedia.org/","type":"article","description":"Singapore is presently Asia’s cryptocurrency and blockchain hub with its welcoming attitude towards emerging technologies. Right from 2016, government...","title":"Cryptocurrency Regulations in Singapore","content":["Singapore, as a country, has a high adoption rate of 11.05% owing to the tech-savviness of the population there. The pro-crypto stance upheld by Singapore is supporting the growth of cryptocurrency in the region. Singapore has been one of the early adopters of cryptocurrencies, thus the environment here is crypto-friendly with basic regulations in place.","Cryptocurrency is not a legal tender in Singapore, however it can be used as an alternative means of payment. This means, crypto is not officially recognized currency in Singapore. Cryptocurrency is legal in Singapore and the regulations around Bitcoin and other assets are very clear. The Anti-money laundering laws and counter-terrorism financing laws in Singapore are very strict. The Payment Services Act (PSA) was passed in 2019 with the goal of clarifying the legal stature of cryptocurrencies.","Let us uncover the details about how PSA of Singapore governs these digital assets in 2024.","The Payment Services Act (PSA) 2019 established a regulatory framework for Digital Payment Token (DPT) service providers in Singapore. The main law regulating crypto businesses in the PSA introduced in 2019 to provide a clear set of regulations for licensing cryptocurrency.","The Monetary Authority of Singapore (MAS) is working day in and day out to improve the regulatory framework of DPT services in Singapore. There have been certain clarifications on regulatory requirements for crypto businesses like:","The new measures from the MAS , applicable in 2024 include:","02 April 2024: MAS Expands Scope of Regulated Payment Services MAS introduced amendments to the Payment Services Act (PS Act) expanding regulation to include custodial services, DPT transmission, and cross-border transfers. Effective from April 4, 2024.","23 November 2023: MAS published its final tranche of responses regarding DPT service providers in Singapore. The new proposal aimed to minimize the potential consumer harm and cyber risks.","15 August 2023: MAS Finalises Stablecoin Regulatory Framework MAS introduced a regulatory framework for stable coins pegged to SGD or G10 currencies with over SGD 5 million circulation. Compliance leads to MAS regulation, distinguishing from unregulated stablecoins.","03 July 2023: MAS Publishes Investor Protection Measures for Digital Payment Token Services MAS implemented new regulatory measures for the cryptocurrency sector, emphasizing investor protection and market integrity, requiring service providers to safeguard assets. This decision followed a public consultation from October 2022. 26 June 2023: MAS Proposes Framework for Digital Asset Networks MAS and CPMI released a report proposing a framework for open digital asset networks, aiming to establish global standards for financial infrastructure. 21 June 2023 : MAS Proposes Standards for Digital Money MAS proposed a universal protocol outlining terms for digital currency use. In a June 21 white paper, MAS introduced Purpose Bound Money (PBM), enabling senders to specify transaction conditions. This collaboration involved international partners.","26 October 2022: MAS proposes measures for Safeguarding Crypto and Elevating Stablecoins MAS introduced regulatory measures under the Payment Services Act to mitigate cryptocurrency trading risks, ensure stablecoin advancement, and safeguard consumers through risk disclosures, prohibition of credit facilities, and technology infrastructure reinforcement. 2022: Singapore banned crypto service providers from promoting their services in public areas or through third parties like social media influencers. 2020: The Inland Revenue Authority of Singapore ruled that goods services tax (GST)would no longer apply to cryptocurrencies. On the other hand, there are no capital gains taxes in Singapore, so businesses that purchase digital tokens as long-term investments are not liable for taxes on capital gains. July, 2020: The firms were ordered to safekeep customer assets under a statutory trust before the year ends. MAS restricted firms from facilitating lending or staking of their retail customers’ assets. January, 2020: The Payment Services Act first came into effect in Singapore 2019: The PSA of 2019 allows MAS to oversee crypto exchanges and issue required licenses. MAS requires all exchanges to adhere to AML/CFT requirements. They must also adhere to the Financial Advisors Act, Insurance Act, Securities and futures ACt and Trust Companies Act.","2017: The Monetary Authority of Singapore clarified that it had regulatory authority over the offering and issuance of digital tokens in Singapore, as they fall under the definition of “capital market products” . In addition, MAS also issued “notice on prevention of money laundering and countering the financing of terrorism (AML/ CFT).","Also Read : Global Crypto Adoption Report 2023 : A Pivotal Year for Crypto Acceptance Worldwide","Singapore is considered quite favourable when it comes to cryptocurrencies. With the evolution in technology and growing acceptance for cryptocurrencies, Singapore is constantly adapting itself to the changing scenario. The country holds a place in all crypto traders’ list of top countries to choose for easy and well-governed crypto activities."],"create_date":"2024-05-16T13:30:00+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/news/top-analyst-warns-of-pepe-coin-downtrend-amid-memecoin-surge/","web_url":"https://coinpedia.org/","type":"article","description":"Meme markets surged with excitement as Keith Gill, famously known as Roaring Kitty, made a comeback, reminiscent of his pivotal role in the January 2021","title":"Don\u0027t Bet on PEPE! Top Analyst Warns of Potential Price Drop","content":["Following a post by popular investor Roaring Kitty, meme coins like Dogecoin and Shiba Inu saw significant gains.","Crypto analyst Ali Martinez identified bearish signals for PEPE coin, suggesting a possible price drop.","Despite buyer efforts, PEPE coin is trading below its recent high and faces potential decline.","Meme markets surged with excitement as Keith Gill, famously known as Roaring Kitty, made a comeback, reminiscent of his pivotal role in the January 2021 GameStop short squeeze.","In his latest enigmatic post, Gill shared a meme portraying a focused gamer, sparking speculation about a potential surge in the meme coin arena.","According to data from CryptoSlate’s top gainers list, relatively obscure meme coins like MOG Coin, Popcat, and Book of Meme witnessed notable upswings following Gill’s post. Meanwhile, established meme coins like Dogecoin, Shiba Inu, and Floki also saw substantial upticks during this period.","Crypto analyst Ali Martinez cautions that not all altcoins will reap equal benefits from the market frenzy. Martinez singles out PEPE as a cryptocurrency potentially poised for a price retracement.",".@TheRoaringKitty\u0027s return has the crypto community buzzing about #memecoins! While some #altcoins may thrive, others might not. $PEPE, in particular, seems poised for a retrace. The TD Sequential shows two sell signals on the #PEPE 3-day chart: an aggressive 13 and a green nine… pic.twitter.com/9spYZnQ1LO","Currently under bearish pressure, Pepe is showing signs of a sell-off around its recent high of $0.0000116. The coin’s attempt to breach below the EMA20 trend line signals a possible shift in the prevailing trend.","A decisive dip below the critical support range of $0.00001 to $0.000008 could confirm a bearish pattern, potentially pushing the pair toward a robust support level at $0.0000055.","Delving deeper into the $PEPE token’s performance on a 3-day chart, Martinez identifies significant indicators hinting at a potential downturn. Notably, the TD Sequential indicator recently flashed two noteworthy sell signals: an aggressive 13 and a green nine candle, suggesting a probable reversal in price momentum.","Additionally, Martinez highlights a bearish divergence between $PEPE’s price action and the Relative Strength Index (RSI), with the RSI’s sharp decline toward the midline indicating prevailing bearish sentiment.","Despite these bearish signals, buyers are striving to maintain Pepe’s price above the 20-day Exponential Moving Average (EMA) at $0.00001. A successful defense of this level could prompt a rise toward the recent high of $0.0000116.","As of now, Pepe Coin is trading at $0.0000102, reflecting a decline of over 4.9% in the last 24 hours.","Think PEPE can defy the odds?"],"create_date":"2024-05-16T13:31:32+00:00","tag":"","author":"Mustafa Mulla"}
{"url":"https://coinpedia.org/price-analysis/myro-breaks-out-of-sideway-pattern-may-be-its-time-to-buy/#","web_url":"https://coinpedia.org/","type":"article","description":"Named after the Dog of Solana co-founder MYRO token is one of the Solana network memecoin. The Token today has moved +14% in 24 hours and 34.90% in a","title":"MYRO Breaks Out Of Sideway Pattern, May Be Its Time To Buy","content":["Named after the Dog of Solana co-founder MYRO token is one of the Solana network memecoin. The Token today has moved +14% in 24 hours and 34.90% in a month and currently trading at a weekly high of 0.193 USD.","In the daily chart, we can see the meme coin achieved a new all-time high of $0.446 in March 2024, and could not breach further. MYRO performance from the ATH till mid-April was bearish and a break out from there pushed the wave to trade sideways till then.","But Yesterday, the price made a breach above the sideway channel and heading towards the resistance of $0.196. Supported by the memecoin season If the buyers get in to accumulate more, the price will rally above the resistance.","Having a resistance at $0.122, the RSI at 59 reads the signal coming out of neutral zone to a bullish zone. With Bull Bear Power reading Positive at 0.03 shows a uptrend coming.","The current market uptrend with Bitcoin crossing $66K gives a positive moment to the meme coins too. While we see all the top meme coins like Doge, PEPE, Shib and WIF are up and growing with market.","With the new breakout here is the time for Trend traders who can rely on the increase buying pressure.","Traders can wait for the breach above the resistance of $0.196 and enter the position in the same zone.If the price breaches this resistance we can see the rally enter int $0.2 to $0.25 range by this weekend. Reaching All time high could be invalidate as per the other indicators."],"create_date":"2024-05-16T09:52:22+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/behind-the-20-million-sonne-finance-hack-unveiling-the-technical-details/#","web_url":"https://coinpedia.org/","type":"article","description":"Staggeringly, a crypto attacker succeeded in the hack on Sonne Finance to conduct a heist using a very complex exploit that drained the company’s assets,","title":"Sonne Finance Vulnerability Exposed in $20 Million Crypto Heist","content":["An attacker exploited a vulnerability in Sonne Finance\u0027s VELO integration, allowing them to manipulate the system and steal $20 million worth of crypto assets.","The attacker used a two-step process involving tiny VELO transactions to trick the system.","Staggeringly, a crypto attacker succeeded in the hack on Sonne Finance to conduct a heist using a very complex exploit that drained the company’s assets, bringing in about $20 million to the attacker. The attack played out for a few days, spotting carefully the backdoor of Sonne Finance’s VELO integration with the Optimism network.","Here are details of the attack.","The exploit transaction of two days duration started from the date of the attack according to the detailed analysis released by CertiK. A few days before, Sonne Finance had carried out a unanimous vote to make VELO transactions possible on the Optimism blockchain and finished all the relevant transactions through the multi-sig wallet.","This wallet included a two-day time lock which was designed to provide an added layer of security by causing transactions to be delayed for two days.","With the completion of the two-day counting period, the attacker implemented a “c-factor” to the markets by afternoon. At this crucial step, the Vulnerable attacker transmitted 400,000,001wei VELO (a minuscule part of the VELO token) in order to mint only 2 wei.","The one to get the loan was the newly issued soVELO which borrowed 35,469,150 VELO from the AMM liquidity pool immediately after the overcollateralized VELO was moved to the soVELO contract.","However, this transfer didn’t mint additional soVELO tokens, leading to an imbalance. The total cash money in the system continued to grow while the total quantity soVELO remained at 2 wei.","That is why the attacker successfully borrowed 265 wei of Wrapped Ethereum, with just the collateral as two wei soVeLO. Due to rounding errors in the division calculations, the adversary was able to become the owner of 35,471,603 VELO. He redeemed the number of tokens for only 1 wei of soVELO instead of the 1 VELO that was suggested.","The attacker had not stopped sufficiently by then. The second period, they had used 100 wei of VELO at the same time at soVELO, so that generated another wei of soVELO as a total supply of 2 wei. This way they kept running the system and got assets drained from several sources.","The assets stolen included: 2,352. 96 VELO, 795. 38 WETH, 768,933. 76 USDC. With the emergence of e ish (a USDC coin on top of Ethereum), 162,92 WBTC (Wrapped Bitcoin), 1667. 45 wstETH (wrapped staked ETH), 777k. 566 USD (Tether) and 1,264,790. 21 USDC.","This audacious exploit serves as a stark reminder of the importance of conducting thorough code audits and implementing robust security measures to safeguard digital assets within decentralized environments.","Even the slightest oversight can pave the way for catastrophic breaches, emphasizing the critical need for vigilance in cryptocurrency security.","Also Check Out : Crypto Hack Report Q1 2024: Trends, Losses, and Recovery Efforts","Could this happen again? Yes. It’s important to keep your investments safe. Read this guide now: A Comprehensive Guide to Keeping Your Crypto Safe"],"create_date":"2024-05-16T10:18:46+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/price-analysis/breakout-rally-for-the-graph-grt-price-to-result-in-a-60-surge/#","web_url":"https://coinpedia.org/","type":"article","description":"The Graph price has recorded a significant bullish momentum by adding approximately 16% within the past day.","title":"Breakout Rally For The Graph (GRT) Price To Result In A 60% Surge?","content":["Amid increased price volatility in the crypto market, the star crypto, Bitcoin price has successfully reclaimed the $65K mark. Moreover, top altcoins have recorded a significant jump in their respective portfolios, highlighting an increase in the bullish influence.","Moreover, The Graph price has recorded a significant bullish momentum by adding approximately 16% within the past day. With successfully recording a bullish break out of its symmetric triangle, will GRT price hit $0.5 in Q2?","After facing rejection at the resistance level of $0.4950, the GRT price lost momentum and recorded a significant correction of 53.03% in its valuation. This resulted in the Artificial Intelligence (AI) token forming a symmetric triangle pattern in the 1D time frame.","At the time of writing, the trading price of The Graph (GRT) token was $0.3116 with a 24-hour gain of 16.21% and a trading volume of $214.061 Million, a jump of 147.99%.","With the rising bullish sentiment in the cryptocurrency market, The Graph price displays a high potential of a break-out rally, resulting in the altcoin attempting to test its upper high during the upcoming weeks.","The Simple Moving Average (SMA) displays a bullish crossover in the 1D time frame, indicating a significant increase in the buying pressure within the crypto space.","On the other hand, the MACD shows a constant rise in the green histogram, highlighting a strong bullish influence in the crypto space. Furthermore, the averages display a constant uptrend, suggesting a positive outlook for the Graph price during the upcoming time.","If the bulls continue to trade under a bullish sentiment, the GRT price will test its resistance level of $0.3550 over the coming weekend. Moreover, if the market holds the price at that level, it will set the stage for The Graph token to attempt to test its upper resistance level of $0.4225 this month.","Negatively, if the bearish trend reversal occurs, the GRT token will retest its support level of $0.2950 soon. Furthermore, if the bears continue to dominate the market, the GRT price will plunge toward its lower support level of $0.2325 in the coming time."],"create_date":"2024-05-16T08:52:16+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/price-analysis/eth-btc-ratio-declines-to-three-year-low-despite-market-recovery-whats-next-for-eth-price/","web_url":"https://coinpedia.org/","type":"article","description":"Bitcoin\u0027s price surged robustly towards $66K following softer-than-expected U.S. inflation data. This push has brought the crypto market close to","title":"ETH/BTC Ratio Declines to Three-Year Low Despite Market Recovery: What’s Next for ETH Price?","content":["Bitcoin’s price surged robustly towards $66K following softer-than-expected U.S. inflation data. This push has brought the crypto market close to resistance levels. However, the ETHBTC ratio has been declining sharply. Analysts see this as a sign of declining interest in Ethereum’s price as Bitcoin’s ETF hype continues to attract altcoin investors.","The price ratio between ether (ETH) and bitcoin (BTC) continues to decline, reflecting year-to-date losses, as predicted by the bearish death cross pattern observed a month ago.","On crypto exchange Binance, the ETH/BTC ratio dropped to 0.04483 just before press time, hitting its lowest point since April 2021, as reported by charting platform TradingView. This year, the ratio has fallen by nearly 15.8%, highlighting a preference for Bitcoin.","The decline to three-year lows is due to a decreased demand for exchange-traded products (ETPs) linked to ether. Ether exchange-traded products (ETPs) saw net outflows of approximately $63 million last week, with Hong Kong-listed ETFs experiencing the most significant losses. In contrast, bitcoin ETPs gained $92 million during the same period.","ETH is likely losing popularity among investors due to several factors, including competition from other layer 1 blockchains and ongoing uncertainty about the approval of spot ETH trading in the U.S.","Also read: Ethereum Bulls To Take Over After Symmetrical Triangle Break","For example, Solana’s share of total decentralized exchange volumes has increased significantly, rising from 2% to 20% in one year, taking market share from Ethereum.","In January, the SEC approved nearly a dozen spot BTC ETFs. Since then, these funds have attracted around $12 billion in net inflows. Approval of spot ETFs linked to ether could attract a similar amount of capital for Ethereum’s native token. However, it is still uncertain when the SEC will grant approval.","Ethereum recently broke $3K and the last time it closed above $3,000 was more than six days ago. Ethereum is lagging behind Bitcoin, underperforming the leading cryptocurrency by 22% since the beginning of 2024.","Ether’s robust rebound from the $2,900 support indicates strong defense by the bulls at this level. Despite a strong surge in BTC price, ETH failed to follow the trend and rejected the $3,050 mark. This plunged the price below the psychological $3K mark. As of writing, ETH price trades at $2,966, declining over 0.16% in the last 24 hours.","If the price moves above the descending resistance line, the ETH/USDT pair may climb to the crucial level of $3,100. Bears are expected to put up a strong defense at this resistance line, but if the bulls succeed, the pair could begin a rally towards $3,400.","Conversely, if the price declines from the 20-day EMA, it suggests bears are selling during minor rallies. This could lead to a retest of the $2,800 support. A break below this level may initiate a downward move towards the support line of the descending channel."],"create_date":"2024-05-16T14:56:14+00:00","tag":"","author":"Shayan Chowdhury"}
{"url":"https://coinpedia.org/cryptocurrency-regulation/cryptocurrency-regulations-in-singapore/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Singapore is presently Asia’s cryptocurrency and blockchain hub with its welcoming attitude towards emerging technologies. Right from 2016, government...","title":"Cryptocurrency Regulations in Singapore","content":["Singapore, as a country, has a high adoption rate of 11.05% owing to the tech-savviness of the population there. The pro-crypto stance upheld by Singapore is supporting the growth of cryptocurrency in the region. Singapore has been one of the early adopters of cryptocurrencies, thus the environment here is crypto-friendly with basic regulations in place.","Cryptocurrency is not a legal tender in Singapore, however it can be used as an alternative means of payment. This means, crypto is not officially recognized currency in Singapore. Cryptocurrency is legal in Singapore and the regulations around Bitcoin and other assets are very clear. The Anti-money laundering laws and counter-terrorism financing laws in Singapore are very strict. The Payment Services Act (PSA) was passed in 2019 with the goal of clarifying the legal stature of cryptocurrencies.","Let us uncover the details about how PSA of Singapore governs these digital assets in 2024.","The Payment Services Act (PSA) 2019 established a regulatory framework for Digital Payment Token (DPT) service providers in Singapore. The main law regulating crypto businesses in the PSA introduced in 2019 to provide a clear set of regulations for licensing cryptocurrency.","The Monetary Authority of Singapore (MAS) is working day in and day out to improve the regulatory framework of DPT services in Singapore. There have been certain clarifications on regulatory requirements for crypto businesses like:","The new measures from the MAS , applicable in 2024 include:","02 April 2024: MAS Expands Scope of Regulated Payment Services MAS introduced amendments to the Payment Services Act (PS Act) expanding regulation to include custodial services, DPT transmission, and cross-border transfers. Effective from April 4, 2024.","23 November 2023: MAS published its final tranche of responses regarding DPT service providers in Singapore. The new proposal aimed to minimize the potential consumer harm and cyber risks.","15 August 2023: MAS Finalises Stablecoin Regulatory Framework MAS introduced a regulatory framework for stable coins pegged to SGD or G10 currencies with over SGD 5 million circulation. Compliance leads to MAS regulation, distinguishing from unregulated stablecoins.","03 July 2023: MAS Publishes Investor Protection Measures for Digital Payment Token Services MAS implemented new regulatory measures for the cryptocurrency sector, emphasizing investor protection and market integrity, requiring service providers to safeguard assets. This decision followed a public consultation from October 2022. 26 June 2023: MAS Proposes Framework for Digital Asset Networks MAS and CPMI released a report proposing a framework for open digital asset networks, aiming to establish global standards for financial infrastructure. 21 June 2023 : MAS Proposes Standards for Digital Money MAS proposed a universal protocol outlining terms for digital currency use. In a June 21 white paper, MAS introduced Purpose Bound Money (PBM), enabling senders to specify transaction conditions. This collaboration involved international partners.","26 October 2022: MAS proposes measures for Safeguarding Crypto and Elevating Stablecoins MAS introduced regulatory measures under the Payment Services Act to mitigate cryptocurrency trading risks, ensure stablecoin advancement, and safeguard consumers through risk disclosures, prohibition of credit facilities, and technology infrastructure reinforcement. 2022: Singapore banned crypto service providers from promoting their services in public areas or through third parties like social media influencers. 2020: The Inland Revenue Authority of Singapore ruled that goods services tax (GST)would no longer apply to cryptocurrencies. On the other hand, there are no capital gains taxes in Singapore, so businesses that purchase digital tokens as long-term investments are not liable for taxes on capital gains. July, 2020: The firms were ordered to safekeep customer assets under a statutory trust before the year ends. MAS restricted firms from facilitating lending or staking of their retail customers’ assets. January, 2020: The Payment Services Act first came into effect in Singapore 2019: The PSA of 2019 allows MAS to oversee crypto exchanges and issue required licenses. MAS requires all exchanges to adhere to AML/CFT requirements. They must also adhere to the Financial Advisors Act, Insurance Act, Securities and futures ACt and Trust Companies Act.","2017: The Monetary Authority of Singapore clarified that it had regulatory authority over the offering and issuance of digital tokens in Singapore, as they fall under the definition of “capital market products” . In addition, MAS also issued “notice on prevention of money laundering and countering the financing of terrorism (AML/ CFT).","Also Read : Global Crypto Adoption Report 2023 : A Pivotal Year for Crypto Acceptance Worldwide","Singapore is considered quite favourable when it comes to cryptocurrencies. With the evolution in technology and growing acceptance for cryptocurrencies, Singapore is constantly adapting itself to the changing scenario. The country holds a place in all crypto traders’ list of top countries to choose for easy and well-governed crypto activities."],"create_date":"2024-05-16T13:30:00+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/web-stories/xrp-lawsuit-ripples-top-lawyer-asserts-sec-is-on-the-losing-side-of-legal-dispute/","web_url":"https://coinpedia.org/","type":"article","description":"XRP Lawsuit: Ripple’s Top Lawyer Asserts SEC Is on the Losing Side of Legal Dispute","title":"XRP Lawsuit: Ripple’s Top Lawyer Asserts SEC Is on the Losing Side of Legal Dispute","content":[],"create_date":"2023-11-17T10:57:44+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/news/indias-securities-and-commodity-watchdog-sebi-indicates-openness-to-crypto-oversight/","web_url":"https://coinpedia.org/","type":"article","description":"India\u0027s Securities and Exchange Board (SEBI) is steering the regulatory narrative on cryptocurrencies in a fresh direction, suggesting a multi-agency","title":"India Softens Stance on Crypto! SEBI Proposes Regulatory Framework","content":["India\u0027s SEBI is proposing a shared regulatory approach to cryptocurrencies, unlike the RBI\u0027s previous stance of a total ban.","SEBI would oversee ICOs and equity-linked crypto products, while other regulators would handle insurance, pensions, and consumer protection aspects.","This suggests a shift towards regulating crypto in India, with different bodies managing various aspects.","India’s Securities and Exchange Board (SEBI) is steering the regulatory narrative on cryptocurrencies in a fresh direction, suggesting a multi-agency approach to oversight. This signals a significant departure from the past stance of the Reserve Bank of India (RBI), which leaned towards an outright ban.","Ultra Huge News from India🇮🇳 SEBI has expressed interest in handling crypto, as in most countries, securities exchanges are handling this subject. Submits report to government.","Here’s what you should know.","According to India’s SEBI, it could monitor the cryptocurrency sector involving new offerings such as initial coin offerings (ICOs). Additionally, the regulatory agency indicated that it could issue licenses for all equity market-related crypto products.","Meanwhile, SEBI informed the government that the Insurance Regulatory and Development Authority of India (IRDAI) and the Pension Fund Regulatory and Development Authority (PFRDA) should regulate all insurance and pension-related virtual assets.","Specialized Regulation in Place","As for crypto-related grievances, India’s SEBI recommended that the country’s Consumer Protection Act be implemented. The SEBI submission to the Indian government suggested that the RBI should regulate all crypto assets backed by fiat currencies.","In this regard, the RBI should further monitor concerns over crypto tax evasion and fiscal stability risk posed by cryptocurrencies.","These developments come against the backdrop of the Indian government’s preparations to formalize regulations governing the web3 industry and digital assets. Despite the imposition of a 30 percent crypto tax, the increasing adoption of decentralized financial platforms reflects a growing acceptance of alternative financial systems beyond traditional banking.","Welcome Back","In a surprising turn, India’s Financial Intelligence Unit (FIU) recently announced the lifting of the ban on IPs associated with major crypto exchanges like Binance and Kocoin. This move signifies a nuanced approach towards crypto exchanges, hinting at a more inclusive regulatory environment."],"create_date":"2024-05-16T12:29:16+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/web-stories/john-e-deaton-slams-secs-gary-gensler-after-krakens-30m-sec-settlement/","web_url":"https://coinpedia.org/","type":"article","description":"John E Deaton Slams SEC’s Gary Gensler after Kraken’s $30M SEC Settlement","title":"John E Deaton Slams SEC’s Gary Gensler after Kraken’s $30M SEC Settlement","content":[],"create_date":"2023-11-21T11:20:50+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/news/bitcoin-surges-above-66k-as-inflation-data-sparks-48-million-in-liquidations/","web_url":"https://coinpedia.org/","type":"article","description":"Bitcoin has surged past the $66,000 mark, sparking a frenzy of short liquidations totaling over $48 million in just one day. This surge came on the heels","title":"Bitcoin Bulls Charge Past $66K on Positive Inflation News, Triggers Short Squeeze","content":["Bitcoin price surged above $66,000 after positive inflation data, leading to short squeezes and market gains.","Lower inflation data fueled investor confidence, with Bitcoin spot ETFs experiencing their largest daily inflow since early May.","Bitcoin\u0027s dominance increased, reflecting the broad-based bullish sentiment across the cryptocurrency market.","Bitcoin has surged past the $66,000 mark, sparking a frenzy of short liquidations totaling over $48 million in just one day. This surge came on the heels of positive U.S. inflation data, suggesting a potential easing of inflationary pressures.","New data on Wednesday revealed a slight increase in the monthly core CPI rate by 0.3%, along with a year-on-year rise of 3.6%, marking the lowest 12-month core inflation rate since April 2021. These numbers hinted at a slowdown in inflation, reigniting bullish sentiment around Bitcoin and resulting in a total of $58 million worth of Bitcoin positions being liquidated.","Wednesday saw a significant net inflow of over $302 million, with Bitcoin spot ETFs experiencing their largest daily influx since early May. Fidelity’s FBTC led the charge with an impressive $131 million inflow, followed closely by Bitwise Bitcoin ETF (BITB) at $86 million. Ark Invest and 21Shares’ ARKB also attracted $39 million in this liquidation frenzy.","Bitcoin’s dominance surged to 51.9%, while Ether’s dominance dipped to 14.4%. This reshuffling coincided with a 5.5% increase in the global cryptocurrency market cap, now standing at $2.51 trillion. The GM 30 Index, comprising the top 30 cryptocurrencies, also surged by 5.45% to 133.49.","With favorable inflation data setting the stage, the cryptocurrency trading landscape underwent a significant shift following Bitcoin’s rapid ascent. However, beyond the numbers, the growing institutional interest in Bitcoin positions it not just as a digital asset but as a symbol of a new era in investment.","Do you think this is a sign of a sustained bull run for Bitcoin?"],"create_date":"2024-05-16T12:59:20+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/top-analyst-warns-of-pepe-coin-downtrend-amid-memecoin-surge/#","web_url":"https://coinpedia.org/","type":"article","description":"Meme markets surged with excitement as Keith Gill, famously known as Roaring Kitty, made a comeback, reminiscent of his pivotal role in the January 2021","title":"Don\u0027t Bet on PEPE! Top Analyst Warns of Potential Price Drop","content":["Following a post by popular investor Roaring Kitty, meme coins like Dogecoin and Shiba Inu saw significant gains.","Crypto analyst Ali Martinez identified bearish signals for PEPE coin, suggesting a possible price drop.","Despite buyer efforts, PEPE coin is trading below its recent high and faces potential decline.","Meme markets surged with excitement as Keith Gill, famously known as Roaring Kitty, made a comeback, reminiscent of his pivotal role in the January 2021 GameStop short squeeze.","In his latest enigmatic post, Gill shared a meme portraying a focused gamer, sparking speculation about a potential surge in the meme coin arena.","According to data from CryptoSlate’s top gainers list, relatively obscure meme coins like MOG Coin, Popcat, and Book of Meme witnessed notable upswings following Gill’s post. Meanwhile, established meme coins like Dogecoin, Shiba Inu, and Floki also saw substantial upticks during this period.","Crypto analyst Ali Martinez cautions that not all altcoins will reap equal benefits from the market frenzy. Martinez singles out PEPE as a cryptocurrency potentially poised for a price retracement.",".@TheRoaringKitty\u0027s return has the crypto community buzzing about #memecoins! While some #altcoins may thrive, others might not. $PEPE, in particular, seems poised for a retrace. The TD Sequential shows two sell signals on the #PEPE 3-day chart: an aggressive 13 and a green nine… pic.twitter.com/9spYZnQ1LO","Currently under bearish pressure, Pepe is showing signs of a sell-off around its recent high of $0.0000116. The coin’s attempt to breach below the EMA20 trend line signals a possible shift in the prevailing trend.","A decisive dip below the critical support range of $0.00001 to $0.000008 could confirm a bearish pattern, potentially pushing the pair toward a robust support level at $0.0000055.","Delving deeper into the $PEPE token’s performance on a 3-day chart, Martinez identifies significant indicators hinting at a potential downturn. Notably, the TD Sequential indicator recently flashed two noteworthy sell signals: an aggressive 13 and a green nine candle, suggesting a probable reversal in price momentum.","Additionally, Martinez highlights a bearish divergence between $PEPE’s price action and the Relative Strength Index (RSI), with the RSI’s sharp decline toward the midline indicating prevailing bearish sentiment.","Despite these bearish signals, buyers are striving to maintain Pepe’s price above the 20-day Exponential Moving Average (EMA) at $0.00001. A successful defense of this level could prompt a rise toward the recent high of $0.0000116.","As of now, Pepe Coin is trading at $0.0000102, reflecting a decline of over 4.9% in the last 24 hours.","Think PEPE can defy the odds?"],"create_date":"2024-05-16T13:31:32+00:00","tag":"","author":"Mustafa Mulla"}
{"url":"https://coinpedia.org/crypto-live-news/ex-mit-graduates-arrested-for-laundering-25-million-crypto/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Anton and James Peraire-Bueno, ex-MIT graduates, were accused of wire fraud and money laundering to the tune of $25 million of cryptocurrency in 12","title":"Ex-MIT Graduates Arrested For Laundering $25 Million Crypto","content":[],"create_date":"2024-05-16T07:21:31+00:00","tag":"","author":"Sohrab Khawas"}
{"url":"https://coinpedia.org/price-analysis/eth-btc-ratio-declines-to-three-year-low-despite-market-recovery-whats-next-for-eth-price/#","web_url":"https://coinpedia.org/","type":"article","description":"Bitcoin\u0027s price surged robustly towards $66K following softer-than-expected U.S. inflation data. This push has brought the crypto market close to","title":"ETH/BTC Ratio Declines to Three-Year Low Despite Market Recovery: What’s Next for ETH Price?","content":["Bitcoin’s price surged robustly towards $66K following softer-than-expected U.S. inflation data. This push has brought the crypto market close to resistance levels. However, the ETHBTC ratio has been declining sharply. Analysts see this as a sign of declining interest in Ethereum’s price as Bitcoin’s ETF hype continues to attract altcoin investors.","The price ratio between ether (ETH) and bitcoin (BTC) continues to decline, reflecting year-to-date losses, as predicted by the bearish death cross pattern observed a month ago.","On crypto exchange Binance, the ETH/BTC ratio dropped to 0.04483 just before press time, hitting its lowest point since April 2021, as reported by charting platform TradingView. This year, the ratio has fallen by nearly 15.8%, highlighting a preference for Bitcoin.","The decline to three-year lows is due to a decreased demand for exchange-traded products (ETPs) linked to ether. Ether exchange-traded products (ETPs) saw net outflows of approximately $63 million last week, with Hong Kong-listed ETFs experiencing the most significant losses. In contrast, bitcoin ETPs gained $92 million during the same period.","ETH is likely losing popularity among investors due to several factors, including competition from other layer 1 blockchains and ongoing uncertainty about the approval of spot ETH trading in the U.S.","Also read: Ethereum Bulls To Take Over After Symmetrical Triangle Break","For example, Solana’s share of total decentralized exchange volumes has increased significantly, rising from 2% to 20% in one year, taking market share from Ethereum.","In January, the SEC approved nearly a dozen spot BTC ETFs. Since then, these funds have attracted around $12 billion in net inflows. Approval of spot ETFs linked to ether could attract a similar amount of capital for Ethereum’s native token. However, it is still uncertain when the SEC will grant approval.","Ethereum recently broke $3K and the last time it closed above $3,000 was more than six days ago. Ethereum is lagging behind Bitcoin, underperforming the leading cryptocurrency by 22% since the beginning of 2024.","Ether’s robust rebound from the $2,900 support indicates strong defense by the bulls at this level. Despite a strong surge in BTC price, ETH failed to follow the trend and rejected the $3,050 mark. This plunged the price below the psychological $3K mark. As of writing, ETH price trades at $2,966, declining over 0.16% in the last 24 hours.","If the price moves above the descending resistance line, the ETH/USDT pair may climb to the crucial level of $3,100. Bears are expected to put up a strong defense at this resistance line, but if the bulls succeed, the pair could begin a rally towards $3,400.","Conversely, if the price declines from the 20-day EMA, it suggests bears are selling during minor rallies. This could lead to a retest of the $2,800 support. A break below this level may initiate a downward move towards the support line of the descending channel."],"create_date":"2024-05-16T14:56:14+00:00","tag":"","author":"Shayan Chowdhury"}
{"url":"https://coinpedia.org/price-analysis/sol-potential-breakout-resistance-ready-to-jump-again/","web_url":"https://coinpedia.org/","type":"article","description":"Solana (SOL) price today soared above the $157 resistance trendline but ran out of steam with increased selling pressure and now seeking support above it.","title":"SOL Potential Breakout Resistance, Ready To Jump Again? ","content":["Solana (SOL) price today soared above the $157 resistance trendline but ran out of steam with increased selling pressure and now seeking support above it. We may also see a potential retest sitting on the edge which is also a pullback support.","With a sharp increase of 31.78% in 24-hour trading volume, the meme coin favorite coin SOL is now trading at $160.28, at press time. With 5.46% growth in the daytime and, 24% in a month Solana is among the top yearly bullish assets.","This year February SOL succeeded in an attempt to breach the $200 but couldn’t continue the rally as investors decided to book profit.","The SOL/USDT 4-hour chart will draw investors’ attention, now trading above the 20-day EMA with a bullish momentum. After a corrective phase, the chart now has a validated Cup and handle pattern. With RSI at 62 heading back to the neutral zone, demonstrating a sideways trend.","While all the technical indicators show a bullish momentum, if there is a pullback, we can rely on the demand zone to provide support. But be cautious in the demand zone, any breakouts from this level may lead to a sharp decline."],"create_date":"2024-05-16T16:40:19+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/sponsored/eth-surge-expected-what-it-means-for-shiba-inu-furrever-token/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"When ETH goes up, it usually impacts other digital coins, especially meme coins. Lately, Shiba Inu, new Furrever Token have attention.","title":"Ethereum Surge Expected: See What It Means for Meme Coins Shiba Inu and Furrever Token","content":["Investors look forward to Ethereum’s expected surge and how it could shake up the cryptocurrency market. When Ethereum goes up, it usually impacts other digital coins, especially meme coins. Lately, Shiba Inu and the new Furrever Token have received much attention. These coins have active communities and unique themes. Due to Ethereum’s recent performance, it might undergo significant changes.","Ethereum’s current price is around $2,903.95, showing a slight 0.4% decline since yesterday. A digital assets lawyer warned that the SEC may soon classify Ethereum as a security. The SEC is set to decide on several spot Ethereum ETF applications, with VanEck’s application decision due on May 23, followed by ARK Invest/21Shares the next day. BlackRock, Fidelity, and Grayscale also have pending applications.","In March, the SEC raised potential “grounds for disapproval” of BlackRock’s application and Nasdaq’s proposal to list it. The SEC questioned if Nasdaq properly filed its proposal under the rules for Commodity-Based Trust Shares. This inclusion suggests a possible denial because these filings are improperly classified as commodity-based trust shares.","Rather than indirectly excluding Ethereum as a commodity, the SEC might explicitly declare it a regulated security. However, this is considered unlikely due to political tensions, according to Terrence Yang of Swan Bitcoin.","Hopes for spot Ethereum ETFs approval have diminished since the SEC approved spot Bitcoin ETFs in January. On Polymarket, traders estimate a 16% chance of approval this month. Despite SEC Chair Gary Gensler affirming Bitcoin as a commodity, he remains silent on Ethereum’s regulatory status. A lawsuit by Consensys claims the SEC views Ethereum as a security, seeking a federal declaration of it as a commodity.","If the SEC denies the Ethereum ETFs, citing market manipulation, it could face legal challenges and political backlash, similar to its previous stance on Bitcoin ETFs.","Shiba Inu (SHIB) is now priced at $0.00002334, down 1% from yesterday. Despite this downturn, the token shows signs of a potential bounce back. Market analyst Dami DeFi highlighted SHIB’s recent price correction, suggesting it might be good. The coin aims to return to its late February rally, which saw a 380% increase from February 25 to March 5, reaching a high of $0.00004567. However, market ups and downs and decreased momentum have led to a nearly 50% drop from this peak.","SHIB has formed a falling wedge pattern during this decline, often signalling a potential reversal. On-chain data supports this, showing significant reductions in SHIB exchange reserves. Since Feb. 29, exchanges have seen an outflow of 13 trillion SHIB, with 5 trillion removed since March 31, indicating a shift to self-custodial storage by investors, potentially for long-term holding.","Despite mixed signals from SHIB’s derivatives data, the falling wedge and reduction in exchange reserves suggest a possible price increase. Analyst Dami predicts a 50% surge, bringing SHIB to $0.00003456 once it breaks out of the wedge.","Shiba Inu’s situation is closely tied to Ethereum’s performance, currently at $2,903.95. Ethereum has struggled to maintain below $3,000, experiencing a 0.4% downtick since yesterday. Significant fluctuations in ETH can influence broader market dynamics, including meme coins like Shiba Inu. A stable or rising ETH could provide the needed market confidence for SHIB to achieve its predicted breakout.","Introducing Furrever Token (FURR), the newest sensation in the cryptocurrency world, designed to revolutionize the space with an irresistible dose of cuteness. Priced at an appealing $0.000648, Furrever Token offers investors a unique and delightful experience centred around the universal love for adorable kitties. With the potential for up to 15X returns, this token is more than just an investment—it is an invitation to join a fun, whimsical community.","Built on the BNB-20 blockchain, Furrever Token boasts a total supply of 9 billion tokens, with 65% available during the presale, 25% allocated for DEX listings, and 10% reserved for the team, locked for a year to ensure stability and trust. This carefully designed tokenomics structure supports a robust and secure ecosystem, further enhanced by audits and safety measures.","Furrever Token is not just about financial growth; it’s about creating a warm and engaging community. With features like cat-themed stickers, emojis, and regular community challenges, Furrever Token transforms everyday interactions into adorable experiences. The future promises exclusive content, rewarding the loyal Furrever community with delightful surprises.","Currently, Furrever Token has raised over $1.1 million and is nearing the end of its 8th presale stage. It aims to raise $1.9 million before launching on PancakeSwap. As part of its launch campaign, Furrever Token hosts a $20,000 Highest Total Buys Competition, offering substantial rewards to the top 10 buyers. With prizes ranging from $5,000 to $1,000 worth of FURR, this competition adds an exciting incentive for early investors.","Join the Furrever Token community today and become a part of this innovative, heartwarming crypto journey. Visit furrevertoken.com to learn more and secure your tokens before the presale ends. Don’t miss out on the purrfect opportunity to invest in the cutest crypto on the market!","Join Furrever Token Presale Now:","Join $20,000 Furrever Token Giveaway","Join Official Telegram Group","Follow Official X Account"],"create_date":"2024-05-16T12:38:33+00:00","tag":"","author":"PR Manager"}
{"url":"https://coinpedia.org/price-analysis/ethereum-bulls-to-take-over-after-symmetrical-triangle-break/#","web_url":"https://coinpedia.org/","type":"article","description":"Ethereum(ETH) since the last bull trend in March 2024 is down nearly 30% and has been struggling to settle above its supreme mark of $3000 since May 2024.","title":"Ethereum Bulls To Take Over After Symmetrical Triangle Break","content":["Ethereum(ETH) since the last bull trend in March 2024 is down nearly 30% and has been struggling to settle above its supreme mark of $3000 since May 2024. Well, the bulls have been slightly merciful and ETH has regained the region and currently trading in a range of $2980 to $3041.","The recent 24-hour surge of 3.17% is considered to be the uplift of Bitcoin (BTC) and a starting point for the Ethereum bull rally.","In a short-term angle, we witness the price swing in the bound range of this symmetrical triangle pattern. A break above $3100 can only strengthen the trend for higher movements.","The price has resistance near its 50Day EMA, the breach above this will signify a good buying pressure. However, the neckline holds 3 reversal supports in the $2880 and $2818, wherein the retest is possible.","The US CPI inflation rate released yesterday ha driven buyers towards the stock and crypto market, turning Bitcoin to hit $66k and triggering the other coins.","Ethereum’s 2 main fundamentals are the inexperienced impact of the Dencun upgrade and the long-awaited Ethereum ETF approval. Any of these positive headlines would fire up the diamond for the upward rally.","The other factor to watch is the MVR value, Market Value to Realized Value a technical indicator that helps identify whether the asset is overvalued or undervalued. A high ratio suggests an overvalued consumption, whereas a lower ratio suggests a buying opportunity. The MVR ratio for Ethereum has been falling since March and that shows an increasing buying opportunity.","Traders can set confident positions anywhere between $2880 and $3050, as there are critical resistance strong support levels being plotted."],"create_date":"2024-05-16T13:56:25+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/crypto-live-news/elon-musks-xai-launches-grok-ai-chatbot-in-europe/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Elon Musk’s xAI has officially launched its AI chatbot, Grok, in Europe. Grok aims to give users a real-time understanding of current events and tackle","title":"Elon Musk’s xAI Launches Grok AI Chatbot in Europe","content":[],"create_date":"2024-05-16T14:11:22+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/crypto-live-news/paul-ryan-advocates-stablecoin-regulation-to-tackle-u-s-debt-crisis/","web_url":"https://coinpedia.org/","type":"article","description":"Former U.S. House Speaker Paul Ryan supports stablecoin regulation to enhance U.S. economic stability and boost dollar adoption. In a Bloomberg interview,","title":"Paul Ryan Advocates Stablecoin Regulation to Tackle U.S. Debt Crisis","content":[],"create_date":"2024-05-16T06:36:34+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/price-analysis/myro-breaks-out-of-sideway-pattern-may-be-its-time-to-buy/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Named after the Dog of Solana co-founder MYRO token is one of the Solana network memecoin. The Token today has moved +14% in 24 hours and 34.90% in a","title":"MYRO Breaks Out Of Sideway Pattern, May Be Its Time To Buy","content":["Named after the Dog of Solana co-founder MYRO token is one of the Solana network memecoin. The Token today has moved +14% in 24 hours and 34.90% in a month and currently trading at a weekly high of 0.193 USD.","In the daily chart, we can see the meme coin achieved a new all-time high of $0.446 in March 2024, and could not breach further. MYRO performance from the ATH till mid-April was bearish and a break out from there pushed the wave to trade sideways till then.","But Yesterday, the price made a breach above the sideway channel and heading towards the resistance of $0.196. Supported by the memecoin season If the buyers get in to accumulate more, the price will rally above the resistance.","Having a resistance at $0.122, the RSI at 59 reads the signal coming out of neutral zone to a bullish zone. With Bull Bear Power reading Positive at 0.03 shows a uptrend coming.","The current market uptrend with Bitcoin crossing $66K gives a positive moment to the meme coins too. While we see all the top meme coins like Doge, PEPE, Shib and WIF are up and growing with market.","With the new breakout here is the time for Trend traders who can rely on the increase buying pressure.","Traders can wait for the breach above the resistance of $0.196 and enter the position in the same zone.If the price breaches this resistance we can see the rally enter int $0.2 to $0.25 range by this weekend. Reaching All time high could be invalidate as per the other indicators."],"create_date":"2024-05-16T09:52:22+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/price-analysis/altcoin-rally-ethereum-eth-and-solana-sol-set-to-dominate-crypto-market/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"The crypto market has experienced a strong bullish price action within the past day, resulting in the BTC surpassing the $65,000 mark.","title":"Altcoin Rally: Ethereum (ETH) And Solana (SOL) Set To Dominate Crypto Market?","content":["The crypto market has experienced a strong bullish price action within the past day, resulting in the BTC price surpassing the $65,000 mark. Moreover, the leader of altcoins, ETH price, successfully reclaimed the $3,000 mark, indicating an increase in the bullish sentiment in the crypto space.","On the other hand, the Solana token has successfully breached its important resistance level of $155.25 by adding 14.26% to its portfolio within the past 24 hours. With a fresh inflow of bullish sentiment in the crypto market, will top Layer-1 (L1) tokens outperform the crypto space this month?","After recording a significant bullish price action by adding 80.80% during February, the ETH price faced rejection at $4,094.75 on 12th March. Since then, the price has been trading under a falling channel pattern in the 1D time frame, indicating a strong bearish sentiment in the crypto space.","However, following the market rebound, the Ethereum price has successfully regained the $3,000 mark. Moreover, the price is on the verge of breaking out of the resistance trendline, highlighting increased buying pressure in the crypto market.","The technical indicator, MACD, shows a constant flatline in the 1D time frame, indicating a weak price action for the leader of altcoins in the market. However, the averages display a bullish convergence, suggesting a positive outlook for the ETH price in the coming time.","If the market holds the price above the support level of $3,000, the bulls will prepare to test its resistance level of $3,250 in the coming time. However, bearish price action will pull the price below its crucial support level of $3K this week.","The SOL coin price has been constantly displaying a higher low in its chart, indicating an increase in the buying-over-selling pressure in the crypto market. Moreover, the price is on the verge of breaking out of its resistance zone, highlighting a bullish outlook for the altcoin.","The Moving Average Convergence Divergence (MACD) shows a constant rise in the green histogram, highlighting an increase in the buying-over-selling pressure in the crypto industry. Furthermore, the averages display a bullish curve, suggesting the price will continue gaining value in the coming time.","If the bulls surpass the resistance zone, the Solana price will experience a breakout rally and attempt to test its upper resistance level of $200. Negatively, if the bears regain momentum, the SOL price will plunge toward its lower support level of $126.75 this month.","At the time of writing, the Total Value Locked (TVL) on the Ethereum chain was $131.959 Billion, a change of +3.47% from $127.528 Billion yesterday. On the other hand, the Solana chain has a TVL of $10.556 Billion with a rise of $900 Million (+9.32%) within the past day.","Furthermore, the Ethereum chain has added $8.516 Billion (6.89%) since the month started, whereas the Solana chain has added $2.043 Billion to its valuation during the same time.","Presently, Ethereum has 386,161 active addresses with 1.2m TXs on its chain. On the other hand, the Solana chain has 841,149 active addresses, 117.82% more when compared with Ethereum and 27.52 TXs on its chain."],"create_date":"2024-05-16T12:32:50+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/crypto-live-news/nft-market-crash-trading-volume-drops-97-since-2021/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Once known for digital art and collectibles fetching millions, the NFT market is now nearly deserted. Trading volume has plummeted by a staggering 97%","title":"NFT Market Crash: Trading Volume Drops 97% Since 2021","content":[],"create_date":"2024-05-16T12:45:49+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/web-stories/coinbase-ceo-criticizes-openais-decision-sam-altmans-exit-fallout/","web_url":"https://coinpedia.org/","type":"article","description":"Coinbase CEO Criticizes OpenAI\u0027s Decision Sam Altman\u0027s Exit Fallout.","title":"Coinbase CEO Criticizes OpenAI\u0027s Decision Sam Altman\u0027s Exit Fallout.","content":[],"create_date":"2023-11-20T10:19:57+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/news/indias-securities-and-commodity-watchdog-sebi-indicates-openness-to-crypto-oversight/#","web_url":"https://coinpedia.org/","type":"article","description":"India\u0027s Securities and Exchange Board (SEBI) is steering the regulatory narrative on cryptocurrencies in a fresh direction, suggesting a multi-agency","title":"India Softens Stance on Crypto! SEBI Proposes Regulatory Framework","content":["India\u0027s SEBI is proposing a shared regulatory approach to cryptocurrencies, unlike the RBI\u0027s previous stance of a total ban.","SEBI would oversee ICOs and equity-linked crypto products, while other regulators would handle insurance, pensions, and consumer protection aspects.","This suggests a shift towards regulating crypto in India, with different bodies managing various aspects.","India’s Securities and Exchange Board (SEBI) is steering the regulatory narrative on cryptocurrencies in a fresh direction, suggesting a multi-agency approach to oversight. This signals a significant departure from the past stance of the Reserve Bank of India (RBI), which leaned towards an outright ban.","Ultra Huge News from India🇮🇳 SEBI has expressed interest in handling crypto, as in most countries, securities exchanges are handling this subject. Submits report to government.","Here’s what you should know.","According to India’s SEBI, it could monitor the cryptocurrency sector involving new offerings such as initial coin offerings (ICOs). Additionally, the regulatory agency indicated that it could issue licenses for all equity market-related crypto products.","Meanwhile, SEBI informed the government that the Insurance Regulatory and Development Authority of India (IRDAI) and the Pension Fund Regulatory and Development Authority (PFRDA) should regulate all insurance and pension-related virtual assets.","Specialized Regulation in Place","As for crypto-related grievances, India’s SEBI recommended that the country’s Consumer Protection Act be implemented. The SEBI submission to the Indian government suggested that the RBI should regulate all crypto assets backed by fiat currencies.","In this regard, the RBI should further monitor concerns over crypto tax evasion and fiscal stability risk posed by cryptocurrencies.","These developments come against the backdrop of the Indian government’s preparations to formalize regulations governing the web3 industry and digital assets. Despite the imposition of a 30 percent crypto tax, the increasing adoption of decentralized financial platforms reflects a growing acceptance of alternative financial systems beyond traditional banking.","Welcome Back","In a surprising turn, India’s Financial Intelligence Unit (FIU) recently announced the lifting of the ban on IPs associated with major crypto exchanges like Binance and Kocoin. This move signifies a nuanced approach towards crypto exchanges, hinting at a more inclusive regulatory environment."],"create_date":"2024-05-16T12:29:16+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/web-stories/solana-dexs-shatter-records-with-3-billion-trading-surge/","web_url":"https://coinpedia.org/","type":"article","description":"Solana DEXs Shatter Records with $3 Billion Trading Surge!","title":"Solana DEXs Shatter Records with $3 Billion Trading Surge!","content":[],"create_date":"2024-04-30T06:59:48+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/news/raoul-pal-crypto-banana-zone-to-hit-in-2-weeks-prices-to-quadruple/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"In a recent podcast, Raoul Pal sheds insights into the “Banana Zone” and his “Everything Code” framework, which provides a comprehensive understanding of","title":"Raoul Pal: Crypto \u0027Banana Zone\u0027 to Hit in 2 Weeks, Prices to EXPLODE 4x!","content":["Raoul Pal\u0027s framework explains how rising global liquidity inflates asset prices, especially tech and crypto.","He predicts a \"Banana Zone\" of rapid growth for crypto in the next 2 weeks.","Take a long-term view, avoid leverage, and focus on established tokens with a small allocation to riskier altcoins.","In a recent podcast, Raoul Pal sheds insights into the “Banana Zone” and his “Everything Code” framework, which provides a comprehensive understanding of how global liquidity cycles drive asset prices, particularly in the tech and crypto sectors.","According to Pal, the “Everything Code” is a conceptual framework that suggests the business cycle repeats itself as liquidity rises to debase currency and service debt rollovers. This cyclical phenomenon has been observed since the global financial crisis of 2008, when central banks reset interest payments to zero and initiated a new cycle of debt maturity every 3-4 years.","He says, “Macro summer and fall are all about liquidity rising,” and liquidity should climb “into the end of 2025.” Moreover, growth assets like tech and crypto tend to perform exceptionally well during these periods due to their secular trends driven by adoption.","Because of its outperformance, crypto’s Banana Zone is considerably stronger than tech’s overbroad summer and fall. However, assets like tech stocks and cryptocurrencies do well during this time. Pal believes cryptocurrencies’ swift adoption and competitive potential will lead to exponential market capitalization. He predicts that the banana zone will arrive 2 weeks from now, causing exponential growth and chaotic events.","The Banana Zone, where asset prices soar, begins with liquidity growth in the macro summer. Pal warns that market conditions can change, even though the Everything Code’s repeating cycle predicts this transformation. Investors might expect strong corrections or protracted sideways movements.","Ready for an Adventure?","Moreover, he noted that the “bigger game” is the altseason or “Banana Zone,” referring to altcoins’ huge rises and parabolic price charts. Bitcoin still dominates with a 54.7% market share. For the altseason to begin, this must drop to the mid-40% level, as it did last cycle.","According to Pal, the Everything Code is the best way to understand how markets work and get through the Banana Zone and beyond. With disciplined portfolio management techniques, he tells investors to be patient, take a long-term view, and be careful with their money.","Pal warns investors against rash judgments based on hype. He recommends avoiding leverage, investing mostly in the top three to five market cap tokens, and allocating 10% to higher-risk altcoins."],"create_date":"2024-05-16T14:12:37+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/web-stories/shiba-inu-price-to-surge-130-in-february/","web_url":"https://coinpedia.org/","type":"article","description":"With a market cap of $5.36 billion, the second biggest meme coin, Shiba Inu Price, is preparing for a bullish breakout this month.","title":"Shiba Inu Price To Surge 130% in February","content":[],"create_date":"2024-02-06T13:58:42+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/news/top-analyst-warns-of-pepe-coin-downtrend-amid-memecoin-surge/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Meme markets surged with excitement as Keith Gill, famously known as Roaring Kitty, made a comeback, reminiscent of his pivotal role in the January 2021","title":"Don\u0027t Bet on PEPE! Top Analyst Warns of Potential Price Drop","content":["Following a post by popular investor Roaring Kitty, meme coins like Dogecoin and Shiba Inu saw significant gains.","Crypto analyst Ali Martinez identified bearish signals for PEPE coin, suggesting a possible price drop.","Despite buyer efforts, PEPE coin is trading below its recent high and faces potential decline.","Meme markets surged with excitement as Keith Gill, famously known as Roaring Kitty, made a comeback, reminiscent of his pivotal role in the January 2021 GameStop short squeeze.","In his latest enigmatic post, Gill shared a meme portraying a focused gamer, sparking speculation about a potential surge in the meme coin arena.","According to data from CryptoSlate’s top gainers list, relatively obscure meme coins like MOG Coin, Popcat, and Book of Meme witnessed notable upswings following Gill’s post. Meanwhile, established meme coins like Dogecoin, Shiba Inu, and Floki also saw substantial upticks during this period.","Crypto analyst Ali Martinez cautions that not all altcoins will reap equal benefits from the market frenzy. Martinez singles out PEPE as a cryptocurrency potentially poised for a price retracement.",".@TheRoaringKitty\u0027s return has the crypto community buzzing about #memecoins! While some #altcoins may thrive, others might not. $PEPE, in particular, seems poised for a retrace. The TD Sequential shows two sell signals on the #PEPE 3-day chart: an aggressive 13 and a green nine… pic.twitter.com/9spYZnQ1LO","Currently under bearish pressure, Pepe is showing signs of a sell-off around its recent high of $0.0000116. The coin’s attempt to breach below the EMA20 trend line signals a possible shift in the prevailing trend.","A decisive dip below the critical support range of $0.00001 to $0.000008 could confirm a bearish pattern, potentially pushing the pair toward a robust support level at $0.0000055.","Delving deeper into the $PEPE token’s performance on a 3-day chart, Martinez identifies significant indicators hinting at a potential downturn. Notably, the TD Sequential indicator recently flashed two noteworthy sell signals: an aggressive 13 and a green nine candle, suggesting a probable reversal in price momentum.","Additionally, Martinez highlights a bearish divergence between $PEPE’s price action and the Relative Strength Index (RSI), with the RSI’s sharp decline toward the midline indicating prevailing bearish sentiment.","Despite these bearish signals, buyers are striving to maintain Pepe’s price above the 20-day Exponential Moving Average (EMA) at $0.00001. A successful defense of this level could prompt a rise toward the recent high of $0.0000116.","As of now, Pepe Coin is trading at $0.0000102, reflecting a decline of over 4.9% in the last 24 hours.","Think PEPE can defy the odds?"],"create_date":"2024-05-16T13:31:32+00:00","tag":"","author":"Mustafa Mulla"}
{"url":"https://coinpedia.org/news/raoul-pal-crypto-banana-zone-to-hit-in-2-weeks-prices-to-quadruple/","web_url":"https://coinpedia.org/","type":"article","description":"In a recent podcast, Raoul Pal sheds insights into the “Banana Zone” and his “Everything Code” framework, which provides a comprehensive understanding of","title":"Raoul Pal: Crypto \u0027Banana Zone\u0027 to Hit in 2 Weeks, Prices to EXPLODE 4x!","content":["Raoul Pal\u0027s framework explains how rising global liquidity inflates asset prices, especially tech and crypto.","He predicts a \"Banana Zone\" of rapid growth for crypto in the next 2 weeks.","Take a long-term view, avoid leverage, and focus on established tokens with a small allocation to riskier altcoins.","In a recent podcast, Raoul Pal sheds insights into the “Banana Zone” and his “Everything Code” framework, which provides a comprehensive understanding of how global liquidity cycles drive asset prices, particularly in the tech and crypto sectors.","According to Pal, the “Everything Code” is a conceptual framework that suggests the business cycle repeats itself as liquidity rises to debase currency and service debt rollovers. This cyclical phenomenon has been observed since the global financial crisis of 2008, when central banks reset interest payments to zero and initiated a new cycle of debt maturity every 3-4 years.","He says, “Macro summer and fall are all about liquidity rising,” and liquidity should climb “into the end of 2025.” Moreover, growth assets like tech and crypto tend to perform exceptionally well during these periods due to their secular trends driven by adoption.","Because of its outperformance, crypto’s Banana Zone is considerably stronger than tech’s overbroad summer and fall. However, assets like tech stocks and cryptocurrencies do well during this time. Pal believes cryptocurrencies’ swift adoption and competitive potential will lead to exponential market capitalization. He predicts that the banana zone will arrive 2 weeks from now, causing exponential growth and chaotic events.","The Banana Zone, where asset prices soar, begins with liquidity growth in the macro summer. Pal warns that market conditions can change, even though the Everything Code’s repeating cycle predicts this transformation. Investors might expect strong corrections or protracted sideways movements.","Ready for an Adventure?","Moreover, he noted that the “bigger game” is the altseason or “Banana Zone,” referring to altcoins’ huge rises and parabolic price charts. Bitcoin still dominates with a 54.7% market share. For the altseason to begin, this must drop to the mid-40% level, as it did last cycle.","According to Pal, the Everything Code is the best way to understand how markets work and get through the Banana Zone and beyond. With disciplined portfolio management techniques, he tells investors to be patient, take a long-term view, and be careful with their money.","Pal warns investors against rash judgments based on hype. He recommends avoiding leverage, investing mostly in the top three to five market cap tokens, and allocating 10% to higher-risk altcoins."],"create_date":"2024-05-16T14:12:37+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/binance-battles-address-poisoning-scams-with-new-algorithm/#","web_url":"https://coinpedia.org/","type":"article","description":"Cryptocurrency scams are on the rise, but Binance isn\u0027t sitting idly by. They\u0027ve launched a powerful tool to tackle one of the sneakiest scams out there:","title":"Binance Battles Address Poisoning Scams with New Algorithm","content":["Binance launched a new anti-scam algorithm to fight address poisoning scams where fake wallet addresses trick users into sending crypto.","The algorithm identifies suspicious transactions and fake addresses that closely resemble real ones.","Binance collaborates with security services to register fake addresses and raise awareness about how scammers exploit users.","Cryptocurrency scams are on the rise, but Binance isn’t sitting idly by. They’ve launched a powerful tool to tackle one of the sneakiest scams out there: address poisoning.","Let’s break down what it does and how it works.","Using advanced security mechanisms, Binance has recognized millions of fake addresses across BNB Smart Chain and Ethereum, stopping real-time threats. The program timestamps malicious behaviour by examining suspicious transactions and connecting them with possible victim addresses, revealing address-poisoning origins.","Binance believes that impersonating a valid Ethereum address like 0x19x30f…62657 can be done by using a similar-looking 0x19x30t…72657, which differs in the middle but retains the first and last few characters","To mitigate the losses, Binance quickly registers faked addresses in a database with HashDit, a major Web3 security service. This collaboration helps other crypto service providers improve security and safeguard people from similar scams.","A recent address-poisoning scam cost an anonymous trader $68 million, emphasizing the need for preventative safeguards. The cash was recovered, demonstrating the need for strong security protocols in protecting user assets.","Scammers thrive on loopholes, and one big gap is how traders verify wallet addresses. Many simply glance at the first and last digits, making it easy for scammers to slip in fake addresses using vanity address generators. Binance’s move to beef up security sends a clear message: it’s time to rethink how we verify addresses to stay one step ahead of the scammers.","Binance’s anti-scam algorithm is a game-changer in the fight against address poisoning scams. While the nitty-gritty details might be under wraps, its track record speaks for itself.","Feeling secure with Binance’s new solution? Stay tuned for more updates."],"create_date":"2024-05-16T12:51:54+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/cryptocurrency-regulation/cryptocurrency-regulations-in-singapore/","web_url":"https://coinpedia.org/","type":"article","description":"Singapore is presently Asia’s cryptocurrency and blockchain hub with its welcoming attitude towards emerging technologies. Right from 2016, government...","title":"Cryptocurrency Regulations in Singapore","content":["Singapore, as a country, has a high adoption rate of 11.05% owing to the tech-savviness of the population there. The pro-crypto stance upheld by Singapore is supporting the growth of cryptocurrency in the region. Singapore has been one of the early adopters of cryptocurrencies, thus the environment here is crypto-friendly with basic regulations in place.","Cryptocurrency is not a legal tender in Singapore, however it can be used as an alternative means of payment. This means, crypto is not officially recognized currency in Singapore. Cryptocurrency is legal in Singapore and the regulations around Bitcoin and other assets are very clear. The Anti-money laundering laws and counter-terrorism financing laws in Singapore are very strict. The Payment Services Act (PSA) was passed in 2019 with the goal of clarifying the legal stature of cryptocurrencies.","Let us uncover the details about how PSA of Singapore governs these digital assets in 2024.","The Payment Services Act (PSA) 2019 established a regulatory framework for Digital Payment Token (DPT) service providers in Singapore. The main law regulating crypto businesses in the PSA introduced in 2019 to provide a clear set of regulations for licensing cryptocurrency.","The Monetary Authority of Singapore (MAS) is working day in and day out to improve the regulatory framework of DPT services in Singapore. There have been certain clarifications on regulatory requirements for crypto businesses like:","The new measures from the MAS , applicable in 2024 include:","02 April 2024: MAS Expands Scope of Regulated Payment Services MAS introduced amendments to the Payment Services Act (PS Act) expanding regulation to include custodial services, DPT transmission, and cross-border transfers. Effective from April 4, 2024.","23 November 2023: MAS published its final tranche of responses regarding DPT service providers in Singapore. The new proposal aimed to minimize the potential consumer harm and cyber risks.","15 August 2023: MAS Finalises Stablecoin Regulatory Framework MAS introduced a regulatory framework for stable coins pegged to SGD or G10 currencies with over SGD 5 million circulation. Compliance leads to MAS regulation, distinguishing from unregulated stablecoins.","03 July 2023: MAS Publishes Investor Protection Measures for Digital Payment Token Services MAS implemented new regulatory measures for the cryptocurrency sector, emphasizing investor protection and market integrity, requiring service providers to safeguard assets. This decision followed a public consultation from October 2022. 26 June 2023: MAS Proposes Framework for Digital Asset Networks MAS and CPMI released a report proposing a framework for open digital asset networks, aiming to establish global standards for financial infrastructure. 21 June 2023 : MAS Proposes Standards for Digital Money MAS proposed a universal protocol outlining terms for digital currency use. In a June 21 white paper, MAS introduced Purpose Bound Money (PBM), enabling senders to specify transaction conditions. This collaboration involved international partners.","26 October 2022: MAS proposes measures for Safeguarding Crypto and Elevating Stablecoins MAS introduced regulatory measures under the Payment Services Act to mitigate cryptocurrency trading risks, ensure stablecoin advancement, and safeguard consumers through risk disclosures, prohibition of credit facilities, and technology infrastructure reinforcement. 2022: Singapore banned crypto service providers from promoting their services in public areas or through third parties like social media influencers. 2020: The Inland Revenue Authority of Singapore ruled that goods services tax (GST)would no longer apply to cryptocurrencies. On the other hand, there are no capital gains taxes in Singapore, so businesses that purchase digital tokens as long-term investments are not liable for taxes on capital gains. July, 2020: The firms were ordered to safekeep customer assets under a statutory trust before the year ends. MAS restricted firms from facilitating lending or staking of their retail customers’ assets. January, 2020: The Payment Services Act first came into effect in Singapore 2019: The PSA of 2019 allows MAS to oversee crypto exchanges and issue required licenses. MAS requires all exchanges to adhere to AML/CFT requirements. They must also adhere to the Financial Advisors Act, Insurance Act, Securities and futures ACt and Trust Companies Act.","2017: The Monetary Authority of Singapore clarified that it had regulatory authority over the offering and issuance of digital tokens in Singapore, as they fall under the definition of “capital market products” . In addition, MAS also issued “notice on prevention of money laundering and countering the financing of terrorism (AML/ CFT).","Also Read : Global Crypto Adoption Report 2023 : A Pivotal Year for Crypto Acceptance Worldwide","Singapore is considered quite favourable when it comes to cryptocurrencies. With the evolution in technology and growing acceptance for cryptocurrencies, Singapore is constantly adapting itself to the changing scenario. The country holds a place in all crypto traders’ list of top countries to choose for easy and well-governed crypto activities."],"create_date":"2024-05-16T13:30:00+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/news/cme-to-offer-spot-bitcoin-trading-impact-on-binance-and-coinbase/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Big changes are on the horizon in the world of cryptocurrency as the Chicago Mercantile Exchange (CME), known for its bitcoin futures, mulls over stepping","title":"CME to Offer Spot Bitcoin Trading: Coinbase, Binance on High Alert?!","content":["The Chicago Mercantile Exchange, a leader in futures, might offer direct bitcoin buying and selling.","This move by CME could hurt major unregulated exchanges like Binance by offering a safer alternative for spot trading.","The news of CME\u0027s potential spot trading and recent ETF approvals contribute to a positive crypto market with rising bitcoin prices.","Big changes are on the horizon in the world of cryptocurrency as the Chicago Mercantile Exchange (CME), known for its bitcoin futures, mulls over stepping into spot bitcoin trading.","This move could significantly impact major players like Binance and Coinbase by providing a regulated trading environment for bitcoin, addressing growing demand among market participants. Interestingly, followed by the news Bitcoin spot ETF trading has surged, reaching $5.65 billion, the highest since March 24th as per Santiment data.","📈 #BitcoinETF volume is picking up major steam, with the 7 largest #ETF\u0027s hitting $5.65B, the highest day since March 24th. Gone are the days of whales only accumulating #onchain. Keep a close eye on whether momentum stays high with our free dashboard: https://t.co/fyI2IS1U79 pic.twitter.com/77ZD0e7gpz","Already a powerhouse in bitcoin futures, CME is now eyeing the spot market. Currently, the spot scene is dominated by offshore, unregulated exchanges like Binance. But CME’s potential entry could change the game, giving traders a regulated platform to navigate both spot and futures markets seamlessly, potentially transforming their trading strategies.","Markus Thielen, from 10x Research, predicts a big shake-up in the crypto exchange scene if CME moves forward. He suggests that institutional investors, driving the current bullish trend, prefer trading on regulated platforms.","With CME possibly offering a regulated spot trading hub, it could redirect business away from existing crypto exchanges, signaling a new era of institutional involvement in crypto.","The Financial Times reported that CME has engaged in discussions with traders who are keen on trading Bitcoin on a regulated marketplace. The new spot trading operations might be conducted through Switzerland’s EBS currency trading venue. Although CME has not officially commented, the potential launch is seen as a strategic expansion to complement its existing future products.","Notably, CME wants to add spot trading to its futures contracts, which big investors are using at present. This could make CME even more important in the crypto world, drawing in more big investors.","With the recent approval of 11 spot bitcoin exchange-traded funds, CME’s potential venture into spot bitcoin trading opens another door for Wall Street players to explore digital assets. While exchanges like Coinbase and Binance already offer spot trading, CME’s entry could bring a fresh perspective, drawing more institutional investors into the crypto space.","Market Outlook","Despite regulatory shifts and growing institutional interest, the crypto market remains upbeat. The surge in spot bitcoin exchange-traded funds, coupled with CME’s possible expansion, bodes well for the future of digital assets.","With Bitcoin’s value on the rise, currently at $65,995 with a notable 6.72% increase in the last 24 hours, it’s clear that change is in the air for crypto enthusiasts.","Also Check Out : Bitcoin Poised To Surge 62%: Legendary Trader Identifies Similar Historic Pattern","Do you think CME’s entry will benefit or disrupt the crypto market? Weigh in with your take!"],"create_date":"2024-05-16T11:10:15+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/crypto-live-news/elon-musks-xai-launches-grok-ai-chatbot-in-europe/#","web_url":"https://coinpedia.org/","type":"article","description":"Elon Musk’s xAI has officially launched its AI chatbot, Grok, in Europe. Grok aims to give users a real-time understanding of current events and tackle","title":"Elon Musk’s xAI Launches Grok AI Chatbot in Europe","content":[],"create_date":"2024-05-16T14:11:22+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/sponsored/eth-surge-expected-what-it-means-for-shiba-inu-furrever-token/","web_url":"https://coinpedia.org/","type":"article","description":"When ETH goes up, it usually impacts other digital coins, especially meme coins. Lately, Shiba Inu, new Furrever Token have attention.","title":"Ethereum Surge Expected: See What It Means for Meme Coins Shiba Inu and Furrever Token","content":["Investors look forward to Ethereum’s expected surge and how it could shake up the cryptocurrency market. When Ethereum goes up, it usually impacts other digital coins, especially meme coins. Lately, Shiba Inu and the new Furrever Token have received much attention. These coins have active communities and unique themes. Due to Ethereum’s recent performance, it might undergo significant changes.","Ethereum’s current price is around $2,903.95, showing a slight 0.4% decline since yesterday. A digital assets lawyer warned that the SEC may soon classify Ethereum as a security. The SEC is set to decide on several spot Ethereum ETF applications, with VanEck’s application decision due on May 23, followed by ARK Invest/21Shares the next day. BlackRock, Fidelity, and Grayscale also have pending applications.","In March, the SEC raised potential “grounds for disapproval” of BlackRock’s application and Nasdaq’s proposal to list it. The SEC questioned if Nasdaq properly filed its proposal under the rules for Commodity-Based Trust Shares. This inclusion suggests a possible denial because these filings are improperly classified as commodity-based trust shares.","Rather than indirectly excluding Ethereum as a commodity, the SEC might explicitly declare it a regulated security. However, this is considered unlikely due to political tensions, according to Terrence Yang of Swan Bitcoin.","Hopes for spot Ethereum ETFs approval have diminished since the SEC approved spot Bitcoin ETFs in January. On Polymarket, traders estimate a 16% chance of approval this month. Despite SEC Chair Gary Gensler affirming Bitcoin as a commodity, he remains silent on Ethereum’s regulatory status. A lawsuit by Consensys claims the SEC views Ethereum as a security, seeking a federal declaration of it as a commodity.","If the SEC denies the Ethereum ETFs, citing market manipulation, it could face legal challenges and political backlash, similar to its previous stance on Bitcoin ETFs.","Shiba Inu (SHIB) is now priced at $0.00002334, down 1% from yesterday. Despite this downturn, the token shows signs of a potential bounce back. Market analyst Dami DeFi highlighted SHIB’s recent price correction, suggesting it might be good. The coin aims to return to its late February rally, which saw a 380% increase from February 25 to March 5, reaching a high of $0.00004567. However, market ups and downs and decreased momentum have led to a nearly 50% drop from this peak.","SHIB has formed a falling wedge pattern during this decline, often signalling a potential reversal. On-chain data supports this, showing significant reductions in SHIB exchange reserves. Since Feb. 29, exchanges have seen an outflow of 13 trillion SHIB, with 5 trillion removed since March 31, indicating a shift to self-custodial storage by investors, potentially for long-term holding.","Despite mixed signals from SHIB’s derivatives data, the falling wedge and reduction in exchange reserves suggest a possible price increase. Analyst Dami predicts a 50% surge, bringing SHIB to $0.00003456 once it breaks out of the wedge.","Shiba Inu’s situation is closely tied to Ethereum’s performance, currently at $2,903.95. Ethereum has struggled to maintain below $3,000, experiencing a 0.4% downtick since yesterday. Significant fluctuations in ETH can influence broader market dynamics, including meme coins like Shiba Inu. A stable or rising ETH could provide the needed market confidence for SHIB to achieve its predicted breakout.","Introducing Furrever Token (FURR), the newest sensation in the cryptocurrency world, designed to revolutionize the space with an irresistible dose of cuteness. Priced at an appealing $0.000648, Furrever Token offers investors a unique and delightful experience centred around the universal love for adorable kitties. With the potential for up to 15X returns, this token is more than just an investment—it is an invitation to join a fun, whimsical community.","Built on the BNB-20 blockchain, Furrever Token boasts a total supply of 9 billion tokens, with 65% available during the presale, 25% allocated for DEX listings, and 10% reserved for the team, locked for a year to ensure stability and trust. This carefully designed tokenomics structure supports a robust and secure ecosystem, further enhanced by audits and safety measures.","Furrever Token is not just about financial growth; it’s about creating a warm and engaging community. With features like cat-themed stickers, emojis, and regular community challenges, Furrever Token transforms everyday interactions into adorable experiences. The future promises exclusive content, rewarding the loyal Furrever community with delightful surprises.","Currently, Furrever Token has raised over $1.1 million and is nearing the end of its 8th presale stage. It aims to raise $1.9 million before launching on PancakeSwap. As part of its launch campaign, Furrever Token hosts a $20,000 Highest Total Buys Competition, offering substantial rewards to the top 10 buyers. With prizes ranging from $5,000 to $1,000 worth of FURR, this competition adds an exciting incentive for early investors.","Join the Furrever Token community today and become a part of this innovative, heartwarming crypto journey. Visit furrevertoken.com to learn more and secure your tokens before the presale ends. Don’t miss out on the purrfect opportunity to invest in the cutest crypto on the market!","Join Furrever Token Presale Now:","Join $20,000 Furrever Token Giveaway","Join Official Telegram Group","Follow Official X Account"],"create_date":"2024-05-16T12:38:33+00:00","tag":"","author":"PR Manager"}
{"url":"https://coinpedia.org/price-analysis/myro-breaks-out-of-sideway-pattern-may-be-its-time-to-buy/","web_url":"https://coinpedia.org/","type":"article","description":"Named after the Dog of Solana co-founder MYRO token is one of the Solana network memecoin. The Token today has moved +14% in 24 hours and 34.90% in a","title":"MYRO Breaks Out Of Sideway Pattern, May Be Its Time To Buy","content":["Named after the Dog of Solana co-founder MYRO token is one of the Solana network memecoin. The Token today has moved +14% in 24 hours and 34.90% in a month and currently trading at a weekly high of 0.193 USD.","In the daily chart, we can see the meme coin achieved a new all-time high of $0.446 in March 2024, and could not breach further. MYRO performance from the ATH till mid-April was bearish and a break out from there pushed the wave to trade sideways till then.","But Yesterday, the price made a breach above the sideway channel and heading towards the resistance of $0.196. Supported by the memecoin season If the buyers get in to accumulate more, the price will rally above the resistance.","Having a resistance at $0.122, the RSI at 59 reads the signal coming out of neutral zone to a bullish zone. With Bull Bear Power reading Positive at 0.03 shows a uptrend coming.","The current market uptrend with Bitcoin crossing $66K gives a positive moment to the meme coins too. While we see all the top meme coins like Doge, PEPE, Shib and WIF are up and growing with market.","With the new breakout here is the time for Trend traders who can rely on the increase buying pressure.","Traders can wait for the breach above the resistance of $0.196 and enter the position in the same zone.If the price breaches this resistance we can see the rally enter int $0.2 to $0.25 range by this weekend. Reaching All time high could be invalidate as per the other indicators."],"create_date":"2024-05-16T09:52:22+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/price-analysis/altcoin-rally-ethereum-eth-and-solana-sol-set-to-dominate-crypto-market/#","web_url":"https://coinpedia.org/","type":"article","description":"The crypto market has experienced a strong bullish price action within the past day, resulting in the BTC surpassing the $65,000 mark.","title":"Altcoin Rally: Ethereum (ETH) And Solana (SOL) Set To Dominate Crypto Market?","content":["The crypto market has experienced a strong bullish price action within the past day, resulting in the BTC price surpassing the $65,000 mark. Moreover, the leader of altcoins, ETH price, successfully reclaimed the $3,000 mark, indicating an increase in the bullish sentiment in the crypto space.","On the other hand, the Solana token has successfully breached its important resistance level of $155.25 by adding 14.26% to its portfolio within the past 24 hours. With a fresh inflow of bullish sentiment in the crypto market, will top Layer-1 (L1) tokens outperform the crypto space this month?","After recording a significant bullish price action by adding 80.80% during February, the ETH price faced rejection at $4,094.75 on 12th March. Since then, the price has been trading under a falling channel pattern in the 1D time frame, indicating a strong bearish sentiment in the crypto space.","However, following the market rebound, the Ethereum price has successfully regained the $3,000 mark. Moreover, the price is on the verge of breaking out of the resistance trendline, highlighting increased buying pressure in the crypto market.","The technical indicator, MACD, shows a constant flatline in the 1D time frame, indicating a weak price action for the leader of altcoins in the market. However, the averages display a bullish convergence, suggesting a positive outlook for the ETH price in the coming time.","If the market holds the price above the support level of $3,000, the bulls will prepare to test its resistance level of $3,250 in the coming time. However, bearish price action will pull the price below its crucial support level of $3K this week.","The SOL coin price has been constantly displaying a higher low in its chart, indicating an increase in the buying-over-selling pressure in the crypto market. Moreover, the price is on the verge of breaking out of its resistance zone, highlighting a bullish outlook for the altcoin.","The Moving Average Convergence Divergence (MACD) shows a constant rise in the green histogram, highlighting an increase in the buying-over-selling pressure in the crypto industry. Furthermore, the averages display a bullish curve, suggesting the price will continue gaining value in the coming time.","If the bulls surpass the resistance zone, the Solana price will experience a breakout rally and attempt to test its upper resistance level of $200. Negatively, if the bears regain momentum, the SOL price will plunge toward its lower support level of $126.75 this month.","At the time of writing, the Total Value Locked (TVL) on the Ethereum chain was $131.959 Billion, a change of +3.47% from $127.528 Billion yesterday. On the other hand, the Solana chain has a TVL of $10.556 Billion with a rise of $900 Million (+9.32%) within the past day.","Furthermore, the Ethereum chain has added $8.516 Billion (6.89%) since the month started, whereas the Solana chain has added $2.043 Billion to its valuation during the same time.","Presently, Ethereum has 386,161 active addresses with 1.2m TXs on its chain. On the other hand, the Solana chain has 841,149 active addresses, 117.82% more when compared with Ethereum and 27.52 TXs on its chain."],"create_date":"2024-05-16T12:32:50+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/price-analysis/eth-btc-ratio-declines-to-three-year-low-despite-market-recovery-whats-next-for-eth-price/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Bitcoin\u0027s price surged robustly towards $66K following softer-than-expected U.S. inflation data. This push has brought the crypto market close to","title":"ETH/BTC Ratio Declines to Three-Year Low Despite Market Recovery: What’s Next for ETH Price?","content":["Bitcoin’s price surged robustly towards $66K following softer-than-expected U.S. inflation data. This push has brought the crypto market close to resistance levels. However, the ETHBTC ratio has been declining sharply. Analysts see this as a sign of declining interest in Ethereum’s price as Bitcoin’s ETF hype continues to attract altcoin investors.","The price ratio between ether (ETH) and bitcoin (BTC) continues to decline, reflecting year-to-date losses, as predicted by the bearish death cross pattern observed a month ago.","On crypto exchange Binance, the ETH/BTC ratio dropped to 0.04483 just before press time, hitting its lowest point since April 2021, as reported by charting platform TradingView. This year, the ratio has fallen by nearly 15.8%, highlighting a preference for Bitcoin.","The decline to three-year lows is due to a decreased demand for exchange-traded products (ETPs) linked to ether. Ether exchange-traded products (ETPs) saw net outflows of approximately $63 million last week, with Hong Kong-listed ETFs experiencing the most significant losses. In contrast, bitcoin ETPs gained $92 million during the same period.","ETH is likely losing popularity among investors due to several factors, including competition from other layer 1 blockchains and ongoing uncertainty about the approval of spot ETH trading in the U.S.","Also read: Ethereum Bulls To Take Over After Symmetrical Triangle Break","For example, Solana’s share of total decentralized exchange volumes has increased significantly, rising from 2% to 20% in one year, taking market share from Ethereum.","In January, the SEC approved nearly a dozen spot BTC ETFs. Since then, these funds have attracted around $12 billion in net inflows. Approval of spot ETFs linked to ether could attract a similar amount of capital for Ethereum’s native token. However, it is still uncertain when the SEC will grant approval.","Ethereum recently broke $3K and the last time it closed above $3,000 was more than six days ago. Ethereum is lagging behind Bitcoin, underperforming the leading cryptocurrency by 22% since the beginning of 2024.","Ether’s robust rebound from the $2,900 support indicates strong defense by the bulls at this level. Despite a strong surge in BTC price, ETH failed to follow the trend and rejected the $3,050 mark. This plunged the price below the psychological $3K mark. As of writing, ETH price trades at $2,966, declining over 0.16% in the last 24 hours.","If the price moves above the descending resistance line, the ETH/USDT pair may climb to the crucial level of $3,100. Bears are expected to put up a strong defense at this resistance line, but if the bulls succeed, the pair could begin a rally towards $3,400.","Conversely, if the price declines from the 20-day EMA, it suggests bears are selling during minor rallies. This could lead to a retest of the $2,800 support. A break below this level may initiate a downward move towards the support line of the descending channel."],"create_date":"2024-05-16T14:56:14+00:00","tag":"","author":"Shayan Chowdhury"}
{"url":"https://coinpedia.org/crypto-live-news/elon-musks-xai-launches-grok-ai-chatbot-in-europe/","web_url":"https://coinpedia.org/","type":"article","description":"Elon Musk’s xAI has officially launched its AI chatbot, Grok, in Europe. Grok aims to give users a real-time understanding of current events and tackle","title":"Elon Musk’s xAI Launches Grok AI Chatbot in Europe","content":[],"create_date":"2024-05-16T14:11:22+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/raoul-pal-crypto-banana-zone-to-hit-in-2-weeks-prices-to-quadruple/#","web_url":"https://coinpedia.org/","type":"article","description":"In a recent podcast, Raoul Pal sheds insights into the “Banana Zone” and his “Everything Code” framework, which provides a comprehensive understanding of","title":"Raoul Pal: Crypto \u0027Banana Zone\u0027 to Hit in 2 Weeks, Prices to EXPLODE 4x!","content":["Raoul Pal\u0027s framework explains how rising global liquidity inflates asset prices, especially tech and crypto.","He predicts a \"Banana Zone\" of rapid growth for crypto in the next 2 weeks.","Take a long-term view, avoid leverage, and focus on established tokens with a small allocation to riskier altcoins.","In a recent podcast, Raoul Pal sheds insights into the “Banana Zone” and his “Everything Code” framework, which provides a comprehensive understanding of how global liquidity cycles drive asset prices, particularly in the tech and crypto sectors.","According to Pal, the “Everything Code” is a conceptual framework that suggests the business cycle repeats itself as liquidity rises to debase currency and service debt rollovers. This cyclical phenomenon has been observed since the global financial crisis of 2008, when central banks reset interest payments to zero and initiated a new cycle of debt maturity every 3-4 years.","He says, “Macro summer and fall are all about liquidity rising,” and liquidity should climb “into the end of 2025.” Moreover, growth assets like tech and crypto tend to perform exceptionally well during these periods due to their secular trends driven by adoption.","Because of its outperformance, crypto’s Banana Zone is considerably stronger than tech’s overbroad summer and fall. However, assets like tech stocks and cryptocurrencies do well during this time. Pal believes cryptocurrencies’ swift adoption and competitive potential will lead to exponential market capitalization. He predicts that the banana zone will arrive 2 weeks from now, causing exponential growth and chaotic events.","The Banana Zone, where asset prices soar, begins with liquidity growth in the macro summer. Pal warns that market conditions can change, even though the Everything Code’s repeating cycle predicts this transformation. Investors might expect strong corrections or protracted sideways movements.","Ready for an Adventure?","Moreover, he noted that the “bigger game” is the altseason or “Banana Zone,” referring to altcoins’ huge rises and parabolic price charts. Bitcoin still dominates with a 54.7% market share. For the altseason to begin, this must drop to the mid-40% level, as it did last cycle.","According to Pal, the Everything Code is the best way to understand how markets work and get through the Banana Zone and beyond. With disciplined portfolio management techniques, he tells investors to be patient, take a long-term view, and be careful with their money.","Pal warns investors against rash judgments based on hype. He recommends avoiding leverage, investing mostly in the top three to five market cap tokens, and allocating 10% to higher-risk altcoins."],"create_date":"2024-05-16T14:12:37+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/notcoin-airdrops-80-billion-tokens-a-new-milestone-on-ton-blockchain/","web_url":"https://coinpedia.org/","type":"article","description":"In the world of cryptocurrencies, one name stands out: Notcoin. This web3 clicker game has captured the attention of crypto enthusiasts everywhere. Today","title":"Notcoin Is Here! Prepare for the Massive 80 Billion Token Airdrop","content":["Notcoin, a popular crypto clicker game, is launching its own cryptocurrency (NOT) on the TON blockchain today.","Notcoin started on Telegram and grew to 35 million users without much marketing.","Launched in late 2023, Notcoin lets users mine NOT tokens by playing a simple game.","In the world of cryptocurrencies, one name stands out: Notcoin. This web3 clicker game has captured the attention of crypto enthusiasts everywhere. Today marks a big step forward for Notcoin as it launches its cryptocurrency on the TON blockchain.","The event comes with a massive airdrop of over 80 billion NOT tokens. Notcoin started as a hit Telegram Mini App and is now expanding its reach even further.","NOT tokens will be distributed among participants, fostering widespread adoption. Notcoin aims to list on prominent exchanges like Binance, OKX, and Bybit, as the project aims to provide users with seamless access to the NOT token, further enhancing liquidity and accessibility.","Moreover, OKX has also collaborated with the Notcoin community to launch the ‘NOT Learn and Earn Campaign’, which consists of several social media initiatives. Two hostings are scheduled for today: the Telegram AMA and X Spaces on Notcoin at 8:00 (UTC) and 16:00 (UTC), respectively.","Notcoin virality has helped it expand to a community of over 35 million players without significant marketing expenditure, all through its appeal and the power of viral communication on platforms like Telegram.","A Cultural Phenomenon?!","Ryan Dennis, brand director at TON Foundation, praises Notcoin as “one of the largest, most engaged communities in Web3.” This highlights Notcoin’s cultural significance and widespread impact. Since its launch on The Open Network blockchain in late 2023, Notcoin has made waves.","Notcoin believes in fairness and inclusivity. Users can mine NOT tokens by tapping their screens within the Telegram Mini App. Converting in-game balances to NOT tokens at a ratio of 1000:1 ensures a fair distribution process.","Notcoin’s ambitions go beyond its current success. The team plans to keep users engaged with rewards and initiatives using NOT tokens. They’re also looking to introduce a trading bot for TON-based tokens. Initiatives like Open Builders will help bring new users to the TON blockchain, driving innovation and growth.","As Notcoin continues to make waves in the crypto world, one thing is certain: its journey is far from over."],"create_date":"2024-05-16T13:26:00+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/news/bitcoin-surges-above-66k-as-inflation-data-sparks-48-million-in-liquidations/#","web_url":"https://coinpedia.org/","type":"article","description":"Bitcoin has surged past the $66,000 mark, sparking a frenzy of short liquidations totaling over $48 million in just one day. This surge came on the heels","title":"Bitcoin Bulls Charge Past $66K on Positive Inflation News, Triggers Short Squeeze","content":["Bitcoin price surged above $66,000 after positive inflation data, leading to short squeezes and market gains.","Lower inflation data fueled investor confidence, with Bitcoin spot ETFs experiencing their largest daily inflow since early May.","Bitcoin\u0027s dominance increased, reflecting the broad-based bullish sentiment across the cryptocurrency market.","Bitcoin has surged past the $66,000 mark, sparking a frenzy of short liquidations totaling over $48 million in just one day. This surge came on the heels of positive U.S. inflation data, suggesting a potential easing of inflationary pressures.","New data on Wednesday revealed a slight increase in the monthly core CPI rate by 0.3%, along with a year-on-year rise of 3.6%, marking the lowest 12-month core inflation rate since April 2021. These numbers hinted at a slowdown in inflation, reigniting bullish sentiment around Bitcoin and resulting in a total of $58 million worth of Bitcoin positions being liquidated.","Wednesday saw a significant net inflow of over $302 million, with Bitcoin spot ETFs experiencing their largest daily influx since early May. Fidelity’s FBTC led the charge with an impressive $131 million inflow, followed closely by Bitwise Bitcoin ETF (BITB) at $86 million. Ark Invest and 21Shares’ ARKB also attracted $39 million in this liquidation frenzy.","Bitcoin’s dominance surged to 51.9%, while Ether’s dominance dipped to 14.4%. This reshuffling coincided with a 5.5% increase in the global cryptocurrency market cap, now standing at $2.51 trillion. The GM 30 Index, comprising the top 30 cryptocurrencies, also surged by 5.45% to 133.49.","With favorable inflation data setting the stage, the cryptocurrency trading landscape underwent a significant shift following Bitcoin’s rapid ascent. However, beyond the numbers, the growing institutional interest in Bitcoin positions it not just as a digital asset but as a symbol of a new era in investment.","Do you think this is a sign of a sustained bull run for Bitcoin?"],"create_date":"2024-05-16T12:59:20+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/web-stories/bitcoins-future-could-it-dip-below-30k-what-to-watch-for/","web_url":"https://coinpedia.org/","type":"article","description":"\"Bitcoin\u0027s Future: Could it Dip Below $30K? What to Watch For\"","title":"\"Bitcoin\u0027s Future: Could it Dip Below $30K? What to Watch For\"","content":[],"create_date":"2024-02-01T10:05:17+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/web-stories/el-salvadors-bitcoin-investment-challenges/","web_url":"https://coinpedia.org/","type":"article","description":"El Salvador\u0027s Bitcoin Investment Challenges","title":"El Salvador\u0027s Bitcoin Investment Challenges","content":[],"create_date":"2023-11-16T07:53:13+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/web-stories/top-4-altcoins-to-rally-in-february/","web_url":"https://coinpedia.org/","type":"article","description":"Coinpedia brings the Top 4 altcoin picks that can pump and outperform the market in early February.","title":"Top 4 Altcoins To Rally in February","content":[],"create_date":"2024-02-06T13:43:35+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/news/cme-to-offer-spot-bitcoin-trading-impact-on-binance-and-coinbase/","web_url":"https://coinpedia.org/","type":"article","description":"Big changes are on the horizon in the world of cryptocurrency as the Chicago Mercantile Exchange (CME), known for its bitcoin futures, mulls over stepping","title":"CME to Offer Spot Bitcoin Trading: Coinbase, Binance on High Alert?!","content":["The Chicago Mercantile Exchange, a leader in futures, might offer direct bitcoin buying and selling.","This move by CME could hurt major unregulated exchanges like Binance by offering a safer alternative for spot trading.","The news of CME\u0027s potential spot trading and recent ETF approvals contribute to a positive crypto market with rising bitcoin prices.","Big changes are on the horizon in the world of cryptocurrency as the Chicago Mercantile Exchange (CME), known for its bitcoin futures, mulls over stepping into spot bitcoin trading.","This move could significantly impact major players like Binance and Coinbase by providing a regulated trading environment for bitcoin, addressing growing demand among market participants. Interestingly, followed by the news Bitcoin spot ETF trading has surged, reaching $5.65 billion, the highest since March 24th as per Santiment data.","📈 #BitcoinETF volume is picking up major steam, with the 7 largest #ETF\u0027s hitting $5.65B, the highest day since March 24th. Gone are the days of whales only accumulating #onchain. Keep a close eye on whether momentum stays high with our free dashboard: https://t.co/fyI2IS1U79 pic.twitter.com/77ZD0e7gpz","Already a powerhouse in bitcoin futures, CME is now eyeing the spot market. Currently, the spot scene is dominated by offshore, unregulated exchanges like Binance. But CME’s potential entry could change the game, giving traders a regulated platform to navigate both spot and futures markets seamlessly, potentially transforming their trading strategies.","Markus Thielen, from 10x Research, predicts a big shake-up in the crypto exchange scene if CME moves forward. He suggests that institutional investors, driving the current bullish trend, prefer trading on regulated platforms.","With CME possibly offering a regulated spot trading hub, it could redirect business away from existing crypto exchanges, signaling a new era of institutional involvement in crypto.","The Financial Times reported that CME has engaged in discussions with traders who are keen on trading Bitcoin on a regulated marketplace. The new spot trading operations might be conducted through Switzerland’s EBS currency trading venue. Although CME has not officially commented, the potential launch is seen as a strategic expansion to complement its existing future products.","Notably, CME wants to add spot trading to its futures contracts, which big investors are using at present. This could make CME even more important in the crypto world, drawing in more big investors.","With the recent approval of 11 spot bitcoin exchange-traded funds, CME’s potential venture into spot bitcoin trading opens another door for Wall Street players to explore digital assets. While exchanges like Coinbase and Binance already offer spot trading, CME’s entry could bring a fresh perspective, drawing more institutional investors into the crypto space.","Market Outlook","Despite regulatory shifts and growing institutional interest, the crypto market remains upbeat. The surge in spot bitcoin exchange-traded funds, coupled with CME’s possible expansion, bodes well for the future of digital assets.","With Bitcoin’s value on the rise, currently at $65,995 with a notable 6.72% increase in the last 24 hours, it’s clear that change is in the air for crypto enthusiasts.","Also Check Out : Bitcoin Poised To Surge 62%: Legendary Trader Identifies Similar Historic Pattern","Do you think CME’s entry will benefit or disrupt the crypto market? Weigh in with your take!"],"create_date":"2024-05-16T11:10:15+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/news/indias-securities-and-commodity-watchdog-sebi-indicates-openness-to-crypto-oversight/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"India\u0027s Securities and Exchange Board (SEBI) is steering the regulatory narrative on cryptocurrencies in a fresh direction, suggesting a multi-agency","title":"India Softens Stance on Crypto! SEBI Proposes Regulatory Framework","content":["India\u0027s SEBI is proposing a shared regulatory approach to cryptocurrencies, unlike the RBI\u0027s previous stance of a total ban.","SEBI would oversee ICOs and equity-linked crypto products, while other regulators would handle insurance, pensions, and consumer protection aspects.","This suggests a shift towards regulating crypto in India, with different bodies managing various aspects.","India’s Securities and Exchange Board (SEBI) is steering the regulatory narrative on cryptocurrencies in a fresh direction, suggesting a multi-agency approach to oversight. This signals a significant departure from the past stance of the Reserve Bank of India (RBI), which leaned towards an outright ban.","Ultra Huge News from India🇮🇳 SEBI has expressed interest in handling crypto, as in most countries, securities exchanges are handling this subject. Submits report to government.","Here’s what you should know.","According to India’s SEBI, it could monitor the cryptocurrency sector involving new offerings such as initial coin offerings (ICOs). Additionally, the regulatory agency indicated that it could issue licenses for all equity market-related crypto products.","Meanwhile, SEBI informed the government that the Insurance Regulatory and Development Authority of India (IRDAI) and the Pension Fund Regulatory and Development Authority (PFRDA) should regulate all insurance and pension-related virtual assets.","Specialized Regulation in Place","As for crypto-related grievances, India’s SEBI recommended that the country’s Consumer Protection Act be implemented. The SEBI submission to the Indian government suggested that the RBI should regulate all crypto assets backed by fiat currencies.","In this regard, the RBI should further monitor concerns over crypto tax evasion and fiscal stability risk posed by cryptocurrencies.","These developments come against the backdrop of the Indian government’s preparations to formalize regulations governing the web3 industry and digital assets. Despite the imposition of a 30 percent crypto tax, the increasing adoption of decentralized financial platforms reflects a growing acceptance of alternative financial systems beyond traditional banking.","Welcome Back","In a surprising turn, India’s Financial Intelligence Unit (FIU) recently announced the lifting of the ban on IPs associated with major crypto exchanges like Binance and Kocoin. This move signifies a nuanced approach towards crypto exchanges, hinting at a more inclusive regulatory environment."],"create_date":"2024-05-16T12:29:16+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/price-analysis/ethereum-bulls-to-take-over-after-symmetrical-triangle-break/","web_url":"https://coinpedia.org/","type":"article","description":"Ethereum(ETH) since the last bull trend in March 2024 is down nearly 30% and has been struggling to settle above its supreme mark of $3000 since May 2024.","title":"Ethereum Bulls To Take Over After Symmetrical Triangle Break","content":["Ethereum(ETH) since the last bull trend in March 2024 is down nearly 30% and has been struggling to settle above its supreme mark of $3000 since May 2024. Well, the bulls have been slightly merciful and ETH has regained the region and currently trading in a range of $2980 to $3041.","The recent 24-hour surge of 3.17% is considered to be the uplift of Bitcoin (BTC) and a starting point for the Ethereum bull rally.","In a short-term angle, we witness the price swing in the bound range of this symmetrical triangle pattern. A break above $3100 can only strengthen the trend for higher movements.","The price has resistance near its 50Day EMA, the breach above this will signify a good buying pressure. However, the neckline holds 3 reversal supports in the $2880 and $2818, wherein the retest is possible.","The US CPI inflation rate released yesterday ha driven buyers towards the stock and crypto market, turning Bitcoin to hit $66k and triggering the other coins.","Ethereum’s 2 main fundamentals are the inexperienced impact of the Dencun upgrade and the long-awaited Ethereum ETF approval. Any of these positive headlines would fire up the diamond for the upward rally.","The other factor to watch is the MVR value, Market Value to Realized Value a technical indicator that helps identify whether the asset is overvalued or undervalued. A high ratio suggests an overvalued consumption, whereas a lower ratio suggests a buying opportunity. The MVR ratio for Ethereum has been falling since March and that shows an increasing buying opportunity.","Traders can set confident positions anywhere between $2880 and $3050, as there are critical resistance strong support levels being plotted."],"create_date":"2024-05-16T13:56:25+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/bitcoin-surges-above-66k-as-inflation-data-sparks-48-million-in-liquidations/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Bitcoin has surged past the $66,000 mark, sparking a frenzy of short liquidations totaling over $48 million in just one day. This surge came on the heels","title":"Bitcoin Bulls Charge Past $66K on Positive Inflation News, Triggers Short Squeeze","content":["Bitcoin price surged above $66,000 after positive inflation data, leading to short squeezes and market gains.","Lower inflation data fueled investor confidence, with Bitcoin spot ETFs experiencing their largest daily inflow since early May.","Bitcoin\u0027s dominance increased, reflecting the broad-based bullish sentiment across the cryptocurrency market.","Bitcoin has surged past the $66,000 mark, sparking a frenzy of short liquidations totaling over $48 million in just one day. This surge came on the heels of positive U.S. inflation data, suggesting a potential easing of inflationary pressures.","New data on Wednesday revealed a slight increase in the monthly core CPI rate by 0.3%, along with a year-on-year rise of 3.6%, marking the lowest 12-month core inflation rate since April 2021. These numbers hinted at a slowdown in inflation, reigniting bullish sentiment around Bitcoin and resulting in a total of $58 million worth of Bitcoin positions being liquidated.","Wednesday saw a significant net inflow of over $302 million, with Bitcoin spot ETFs experiencing their largest daily influx since early May. Fidelity’s FBTC led the charge with an impressive $131 million inflow, followed closely by Bitwise Bitcoin ETF (BITB) at $86 million. Ark Invest and 21Shares’ ARKB also attracted $39 million in this liquidation frenzy.","Bitcoin’s dominance surged to 51.9%, while Ether’s dominance dipped to 14.4%. This reshuffling coincided with a 5.5% increase in the global cryptocurrency market cap, now standing at $2.51 trillion. The GM 30 Index, comprising the top 30 cryptocurrencies, also surged by 5.45% to 133.49.","With favorable inflation data setting the stage, the cryptocurrency trading landscape underwent a significant shift following Bitcoin’s rapid ascent. However, beyond the numbers, the growing institutional interest in Bitcoin positions it not just as a digital asset but as a symbol of a new era in investment.","Do you think this is a sign of a sustained bull run for Bitcoin?"],"create_date":"2024-05-16T12:59:20+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/news/behind-the-20-million-sonne-finance-hack-unveiling-the-technical-details/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Staggeringly, a crypto attacker succeeded in the hack on Sonne Finance to conduct a heist using a very complex exploit that drained the company’s assets,","title":"Sonne Finance Vulnerability Exposed in $20 Million Crypto Heist","content":["An attacker exploited a vulnerability in Sonne Finance\u0027s VELO integration, allowing them to manipulate the system and steal $20 million worth of crypto assets.","The attacker used a two-step process involving tiny VELO transactions to trick the system.","Staggeringly, a crypto attacker succeeded in the hack on Sonne Finance to conduct a heist using a very complex exploit that drained the company’s assets, bringing in about $20 million to the attacker. The attack played out for a few days, spotting carefully the backdoor of Sonne Finance’s VELO integration with the Optimism network.","Here are details of the attack.","The exploit transaction of two days duration started from the date of the attack according to the detailed analysis released by CertiK. A few days before, Sonne Finance had carried out a unanimous vote to make VELO transactions possible on the Optimism blockchain and finished all the relevant transactions through the multi-sig wallet.","This wallet included a two-day time lock which was designed to provide an added layer of security by causing transactions to be delayed for two days.","With the completion of the two-day counting period, the attacker implemented a “c-factor” to the markets by afternoon. At this crucial step, the Vulnerable attacker transmitted 400,000,001wei VELO (a minuscule part of the VELO token) in order to mint only 2 wei.","The one to get the loan was the newly issued soVELO which borrowed 35,469,150 VELO from the AMM liquidity pool immediately after the overcollateralized VELO was moved to the soVELO contract.","However, this transfer didn’t mint additional soVELO tokens, leading to an imbalance. The total cash money in the system continued to grow while the total quantity soVELO remained at 2 wei.","That is why the attacker successfully borrowed 265 wei of Wrapped Ethereum, with just the collateral as two wei soVeLO. Due to rounding errors in the division calculations, the adversary was able to become the owner of 35,471,603 VELO. He redeemed the number of tokens for only 1 wei of soVELO instead of the 1 VELO that was suggested.","The attacker had not stopped sufficiently by then. The second period, they had used 100 wei of VELO at the same time at soVELO, so that generated another wei of soVELO as a total supply of 2 wei. This way they kept running the system and got assets drained from several sources.","The assets stolen included: 2,352. 96 VELO, 795. 38 WETH, 768,933. 76 USDC. With the emergence of e ish (a USDC coin on top of Ethereum), 162,92 WBTC (Wrapped Bitcoin), 1667. 45 wstETH (wrapped staked ETH), 777k. 566 USD (Tether) and 1,264,790. 21 USDC.","This audacious exploit serves as a stark reminder of the importance of conducting thorough code audits and implementing robust security measures to safeguard digital assets within decentralized environments.","Even the slightest oversight can pave the way for catastrophic breaches, emphasizing the critical need for vigilance in cryptocurrency security.","Also Check Out : Crypto Hack Report Q1 2024: Trends, Losses, and Recovery Efforts","Could this happen again? Yes. It’s important to keep your investments safe. Read this guide now: A Comprehensive Guide to Keeping Your Crypto Safe"],"create_date":"2024-05-16T10:18:46+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/price-analysis/altcoin-rally-ethereum-eth-and-solana-sol-set-to-dominate-crypto-market/","web_url":"https://coinpedia.org/","type":"article","description":"The crypto market has experienced a strong bullish price action within the past day, resulting in the BTC surpassing the $65,000 mark.","title":"Altcoin Rally: Ethereum (ETH) And Solana (SOL) Set To Dominate Crypto Market?","content":["The crypto market has experienced a strong bullish price action within the past day, resulting in the BTC price surpassing the $65,000 mark. Moreover, the leader of altcoins, ETH price, successfully reclaimed the $3,000 mark, indicating an increase in the bullish sentiment in the crypto space.","On the other hand, the Solana token has successfully breached its important resistance level of $155.25 by adding 14.26% to its portfolio within the past 24 hours. With a fresh inflow of bullish sentiment in the crypto market, will top Layer-1 (L1) tokens outperform the crypto space this month?","After recording a significant bullish price action by adding 80.80% during February, the ETH price faced rejection at $4,094.75 on 12th March. Since then, the price has been trading under a falling channel pattern in the 1D time frame, indicating a strong bearish sentiment in the crypto space.","However, following the market rebound, the Ethereum price has successfully regained the $3,000 mark. Moreover, the price is on the verge of breaking out of the resistance trendline, highlighting increased buying pressure in the crypto market.","The technical indicator, MACD, shows a constant flatline in the 1D time frame, indicating a weak price action for the leader of altcoins in the market. However, the averages display a bullish convergence, suggesting a positive outlook for the ETH price in the coming time.","If the market holds the price above the support level of $3,000, the bulls will prepare to test its resistance level of $3,250 in the coming time. However, bearish price action will pull the price below its crucial support level of $3K this week.","The SOL coin price has been constantly displaying a higher low in its chart, indicating an increase in the buying-over-selling pressure in the crypto market. Moreover, the price is on the verge of breaking out of its resistance zone, highlighting a bullish outlook for the altcoin.","The Moving Average Convergence Divergence (MACD) shows a constant rise in the green histogram, highlighting an increase in the buying-over-selling pressure in the crypto industry. Furthermore, the averages display a bullish curve, suggesting the price will continue gaining value in the coming time.","If the bulls surpass the resistance zone, the Solana price will experience a breakout rally and attempt to test its upper resistance level of $200. Negatively, if the bears regain momentum, the SOL price will plunge toward its lower support level of $126.75 this month.","At the time of writing, the Total Value Locked (TVL) on the Ethereum chain was $131.959 Billion, a change of +3.47% from $127.528 Billion yesterday. On the other hand, the Solana chain has a TVL of $10.556 Billion with a rise of $900 Million (+9.32%) within the past day.","Furthermore, the Ethereum chain has added $8.516 Billion (6.89%) since the month started, whereas the Solana chain has added $2.043 Billion to its valuation during the same time.","Presently, Ethereum has 386,161 active addresses with 1.2m TXs on its chain. On the other hand, the Solana chain has 841,149 active addresses, 117.82% more when compared with Ethereum and 27.52 TXs on its chain."],"create_date":"2024-05-16T12:32:50+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/web-stories/terraform-labs-pumps-15-million-to-revive-the-terra-luna-ecosystem/","web_url":"https://coinpedia.org/","type":"article","description":"Terraform Labs Pumps $15 Million to Revive the Terra (LUNA) Ecosystem","title":"Terraform Labs Pumps $15 Million to Revive the Terra (LUNA) Ecosystem","content":[],"create_date":"2023-11-23T14:17:37+00:00","tag":"","author":""}
{"url":"https://coinpedia.org/price-analysis/ethereum-bulls-to-take-over-after-symmetrical-triangle-break/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Ethereum(ETH) since the last bull trend in March 2024 is down nearly 30% and has been struggling to settle above its supreme mark of $3000 since May 2024.","title":"Ethereum Bulls To Take Over After Symmetrical Triangle Break","content":["Ethereum(ETH) since the last bull trend in March 2024 is down nearly 30% and has been struggling to settle above its supreme mark of $3000 since May 2024. Well, the bulls have been slightly merciful and ETH has regained the region and currently trading in a range of $2980 to $3041.","The recent 24-hour surge of 3.17% is considered to be the uplift of Bitcoin (BTC) and a starting point for the Ethereum bull rally.","In a short-term angle, we witness the price swing in the bound range of this symmetrical triangle pattern. A break above $3100 can only strengthen the trend for higher movements.","The price has resistance near its 50Day EMA, the breach above this will signify a good buying pressure. However, the neckline holds 3 reversal supports in the $2880 and $2818, wherein the retest is possible.","The US CPI inflation rate released yesterday ha driven buyers towards the stock and crypto market, turning Bitcoin to hit $66k and triggering the other coins.","Ethereum’s 2 main fundamentals are the inexperienced impact of the Dencun upgrade and the long-awaited Ethereum ETF approval. Any of these positive headlines would fire up the diamond for the upward rally.","The other factor to watch is the MVR value, Market Value to Realized Value a technical indicator that helps identify whether the asset is overvalued or undervalued. A high ratio suggests an overvalued consumption, whereas a lower ratio suggests a buying opportunity. The MVR ratio for Ethereum has been falling since March and that shows an increasing buying opportunity.","Traders can set confident positions anywhere between $2880 and $3050, as there are critical resistance strong support levels being plotted."],"create_date":"2024-05-16T13:56:25+00:00","tag":"","author":"Zameer Attar"}
{"url":"https://coinpedia.org/price-analysis/breakout-rally-for-the-graph-grt-price-to-result-in-a-60-surge/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"The Graph price has recorded a significant bullish momentum by adding approximately 16% within the past day.","title":"Breakout Rally For The Graph (GRT) Price To Result In A 60% Surge?","content":["Amid increased price volatility in the crypto market, the star crypto, Bitcoin price has successfully reclaimed the $65K mark. Moreover, top altcoins have recorded a significant jump in their respective portfolios, highlighting an increase in the bullish influence.","Moreover, The Graph price has recorded a significant bullish momentum by adding approximately 16% within the past day. With successfully recording a bullish break out of its symmetric triangle, will GRT price hit $0.5 in Q2?","After facing rejection at the resistance level of $0.4950, the GRT price lost momentum and recorded a significant correction of 53.03% in its valuation. This resulted in the Artificial Intelligence (AI) token forming a symmetric triangle pattern in the 1D time frame.","At the time of writing, the trading price of The Graph (GRT) token was $0.3116 with a 24-hour gain of 16.21% and a trading volume of $214.061 Million, a jump of 147.99%.","With the rising bullish sentiment in the cryptocurrency market, The Graph price displays a high potential of a break-out rally, resulting in the altcoin attempting to test its upper high during the upcoming weeks.","The Simple Moving Average (SMA) displays a bullish crossover in the 1D time frame, indicating a significant increase in the buying pressure within the crypto space.","On the other hand, the MACD shows a constant rise in the green histogram, highlighting a strong bullish influence in the crypto space. Furthermore, the averages display a constant uptrend, suggesting a positive outlook for the Graph price during the upcoming time.","If the bulls continue to trade under a bullish sentiment, the GRT price will test its resistance level of $0.3550 over the coming weekend. Moreover, if the market holds the price at that level, it will set the stage for The Graph token to attempt to test its upper resistance level of $0.4225 this month.","Negatively, if the bearish trend reversal occurs, the GRT token will retest its support level of $0.2950 soon. Furthermore, if the bears continue to dominate the market, the GRT price will plunge toward its lower support level of $0.2325 in the coming time."],"create_date":"2024-05-16T08:52:16+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/press-release/analysts-are-recommending-this-new-altcoin-kangamoon/#","web_url":"https://coinpedia.org/","type":"article","description":"Learn about the future price potential behind Cardano, Ripple and KangaMoon to see which crypto can see the most significant gains in 2024 and beyond.","title":"KangaMoon (KANG) Reaches Over 20,000 Members ","content":["Recent price movements have dampened the diversification appeal and opportunities seen within Cardano (ADA) and Ripple (XRP). ADA’s decline has pushed it down significantly, and it’s no longer recommended by analysts, while XRP’s initial bullish run suffered and is now in a correction phase. In contrast to this, KangaMoon (KANG) has emerged as a potential opportunity for any traders looking for growth, especially as it experienced a 400% price increase which warrants a closer look through its technical analysis and technology to truly understand the underlying factors for this surge.","To see why analysts are recommending this new altcoin as the best crypto investment, we will be taking an in-depth look at all it has to offer.","Cardano (ADA) was a good crypto to buy but is now heading in a downward pattern, and at this rate, risks losing far more value. While the ecosystem has upgraded, especially with Hydra, a project that can scale the network operating as a Layer-2 solution, the Cardano price has still gone downwards.","The platform’s key highlights this month initially pushed its value forward, as information on Hydra /commit API endpoint changes, alongside information on the Gummiworm L2 concept based on Hydra Head sparked major developer interest. Now however, the Cardano crypto is heading downwards with negative RSI and MACD data. According to the Cardano price prediction, the furthest point it can reach is $0.6313 by Q4, 2024.","Ripple (XRP) has made strides towards expanding its ecosystem as a means of appealing to more traders and spike in value. The recent partnership between Ripple and XRPL Labs with the DeRec Alliance is a significant development intended to push interest in the Ripple crypto further.","The alliance also puts its focus on creating standardized protocols for digital asset recovery within Web3. Simplifying and expediting the recovery process, especially for non-crypto experts, could lead to wider adoption of blockchain technology and a potential increase in the Ripple price. Yet, based on the Ripple price prediction, it can reach $0.73 as its maximum point of value by the end of 2024. If Ripple does make this growth, it will become a good crypto to buy.","KangaMoon (KANG) has reached major milestones during its blockchain ICO, exceeding $6.7 million and attracting over 20,000 community members. This strong presale performance, coupled with a dedicated user base exceeding 6,000 KANG holders, underscores investor confidence in the project’s long-term viability and could result in the project raising over $8 million by the end of the month.","Furthermore, KangaMoon differentiates itself by prioritizing sustainable growth within the burgeoning Play-to-Earn (P2E) market. The native KANG crypto serves multiple purposes, as its the in-game currency, and the reward incentive. Players wield control over their characters, engaging in tournaments and battles to accumulate KANG and NFTs, which can later be sold in a dedicated marketplace to fuel an entire economy.","🌟 Upcoming New Listing 🌟 🤩 #BitMart will list #KANG @Kangamoon_P2E soon! Keep an eye on our socials for further announcements. Share in the comments what you like about this project👇 pic.twitter.com/YvT39QoKba","The Social-Fi model also incentivizes social-media engagement by rewarding users with KANG tokens. The current Bonus Round in the presale offers the KANG token at $0.025, marking a 400% price increase from its starting value. At launch, analysts project a 100x price surge, especially once it launches on major exchanges in Q2, 2024, making it the best crypto investment.","Cardano’s focus on smart contracts and dApp development did initially put it at the top, and Ripple’s focus on the financial sector for cross-border transactions made it one of the largest in its niche. Despite this, they have both recently struggled to maintain an upward momentum, while KangaMoon has been surging. With its vast utility, and focus on the P2E market, it can be a game-changer and spike significantly at launch.","Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!","Website: https://Kangamoon.com/","Join Telegram Community: https://t.me/Kangamoonofficial"],"create_date":"2024-05-16T08:04:09+00:00","tag":"","author":"PR Manager"}
{"url":"https://coinpedia.org/news/binance-battles-address-poisoning-scams-with-new-algorithm/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Cryptocurrency scams are on the rise, but Binance isn\u0027t sitting idly by. They\u0027ve launched a powerful tool to tackle one of the sneakiest scams out there:","title":"Binance Battles Address Poisoning Scams with New Algorithm","content":["Binance launched a new anti-scam algorithm to fight address poisoning scams where fake wallet addresses trick users into sending crypto.","The algorithm identifies suspicious transactions and fake addresses that closely resemble real ones.","Binance collaborates with security services to register fake addresses and raise awareness about how scammers exploit users.","Cryptocurrency scams are on the rise, but Binance isn’t sitting idly by. They’ve launched a powerful tool to tackle one of the sneakiest scams out there: address poisoning.","Let’s break down what it does and how it works.","Using advanced security mechanisms, Binance has recognized millions of fake addresses across BNB Smart Chain and Ethereum, stopping real-time threats. The program timestamps malicious behaviour by examining suspicious transactions and connecting them with possible victim addresses, revealing address-poisoning origins.","Binance believes that impersonating a valid Ethereum address like 0x19x30f…62657 can be done by using a similar-looking 0x19x30t…72657, which differs in the middle but retains the first and last few characters","To mitigate the losses, Binance quickly registers faked addresses in a database with HashDit, a major Web3 security service. This collaboration helps other crypto service providers improve security and safeguard people from similar scams.","A recent address-poisoning scam cost an anonymous trader $68 million, emphasizing the need for preventative safeguards. The cash was recovered, demonstrating the need for strong security protocols in protecting user assets.","Scammers thrive on loopholes, and one big gap is how traders verify wallet addresses. Many simply glance at the first and last digits, making it easy for scammers to slip in fake addresses using vanity address generators. Binance’s move to beef up security sends a clear message: it’s time to rethink how we verify addresses to stay one step ahead of the scammers.","Binance’s anti-scam algorithm is a game-changer in the fight against address poisoning scams. While the nitty-gritty details might be under wraps, its track record speaks for itself.","Feeling secure with Binance’s new solution? Stay tuned for more updates."],"create_date":"2024-05-16T12:51:54+00:00","tag":"","author":"Qadir AK"}
{"url":"https://coinpedia.org/crypto-live-news/ex-mit-graduates-arrested-for-laundering-25-million-crypto/","web_url":"https://coinpedia.org/","type":"article","description":"Anton and James Peraire-Bueno, ex-MIT graduates, were accused of wire fraud and money laundering to the tune of $25 million of cryptocurrency in 12","title":"Ex-MIT Graduates Arrested For Laundering $25 Million Crypto","content":[],"create_date":"2024-05-16T07:21:31+00:00","tag":"","author":"Sohrab Khawas"}
{"url":"https://coinpedia.org/news/notcoin-airdrops-80-billion-tokens-a-new-milestone-on-ton-blockchain/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"In the world of cryptocurrencies, one name stands out: Notcoin. This web3 clicker game has captured the attention of crypto enthusiasts everywhere. Today","title":"Notcoin Is Here! Prepare for the Massive 80 Billion Token Airdrop","content":["Notcoin, a popular crypto clicker game, is launching its own cryptocurrency (NOT) on the TON blockchain today.","Notcoin started on Telegram and grew to 35 million users without much marketing.","Launched in late 2023, Notcoin lets users mine NOT tokens by playing a simple game.","In the world of cryptocurrencies, one name stands out: Notcoin. This web3 clicker game has captured the attention of crypto enthusiasts everywhere. Today marks a big step forward for Notcoin as it launches its cryptocurrency on the TON blockchain.","The event comes with a massive airdrop of over 80 billion NOT tokens. Notcoin started as a hit Telegram Mini App and is now expanding its reach even further.","NOT tokens will be distributed among participants, fostering widespread adoption. Notcoin aims to list on prominent exchanges like Binance, OKX, and Bybit, as the project aims to provide users with seamless access to the NOT token, further enhancing liquidity and accessibility.","Moreover, OKX has also collaborated with the Notcoin community to launch the ‘NOT Learn and Earn Campaign’, which consists of several social media initiatives. Two hostings are scheduled for today: the Telegram AMA and X Spaces on Notcoin at 8:00 (UTC) and 16:00 (UTC), respectively.","Notcoin virality has helped it expand to a community of over 35 million players without significant marketing expenditure, all through its appeal and the power of viral communication on platforms like Telegram.","A Cultural Phenomenon?!","Ryan Dennis, brand director at TON Foundation, praises Notcoin as “one of the largest, most engaged communities in Web3.” This highlights Notcoin’s cultural significance and widespread impact. Since its launch on The Open Network blockchain in late 2023, Notcoin has made waves.","Notcoin believes in fairness and inclusivity. Users can mine NOT tokens by tapping their screens within the Telegram Mini App. Converting in-game balances to NOT tokens at a ratio of 1000:1 ensures a fair distribution process.","Notcoin’s ambitions go beyond its current success. The team plans to keep users engaged with rewards and initiatives using NOT tokens. They’re also looking to introduce a trading bot for TON-based tokens. Initiatives like Open Builders will help bring new users to the TON blockchain, driving innovation and growth.","As Notcoin continues to make waves in the crypto world, one thing is certain: its journey is far from over."],"create_date":"2024-05-16T13:26:00+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/press-release/analysts-are-recommending-this-new-altcoin-kangamoon/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Learn about the future price potential behind Cardano, Ripple and KangaMoon to see which crypto can see the most significant gains in 2024 and beyond.","title":"KangaMoon (KANG) Reaches Over 20,000 Members ","content":["Recent price movements have dampened the diversification appeal and opportunities seen within Cardano (ADA) and Ripple (XRP). ADA’s decline has pushed it down significantly, and it’s no longer recommended by analysts, while XRP’s initial bullish run suffered and is now in a correction phase. In contrast to this, KangaMoon (KANG) has emerged as a potential opportunity for any traders looking for growth, especially as it experienced a 400% price increase which warrants a closer look through its technical analysis and technology to truly understand the underlying factors for this surge.","To see why analysts are recommending this new altcoin as the best crypto investment, we will be taking an in-depth look at all it has to offer.","Cardano (ADA) was a good crypto to buy but is now heading in a downward pattern, and at this rate, risks losing far more value. While the ecosystem has upgraded, especially with Hydra, a project that can scale the network operating as a Layer-2 solution, the Cardano price has still gone downwards.","The platform’s key highlights this month initially pushed its value forward, as information on Hydra /commit API endpoint changes, alongside information on the Gummiworm L2 concept based on Hydra Head sparked major developer interest. Now however, the Cardano crypto is heading downwards with negative RSI and MACD data. According to the Cardano price prediction, the furthest point it can reach is $0.6313 by Q4, 2024.","Ripple (XRP) has made strides towards expanding its ecosystem as a means of appealing to more traders and spike in value. The recent partnership between Ripple and XRPL Labs with the DeRec Alliance is a significant development intended to push interest in the Ripple crypto further.","The alliance also puts its focus on creating standardized protocols for digital asset recovery within Web3. Simplifying and expediting the recovery process, especially for non-crypto experts, could lead to wider adoption of blockchain technology and a potential increase in the Ripple price. Yet, based on the Ripple price prediction, it can reach $0.73 as its maximum point of value by the end of 2024. If Ripple does make this growth, it will become a good crypto to buy.","KangaMoon (KANG) has reached major milestones during its blockchain ICO, exceeding $6.7 million and attracting over 20,000 community members. This strong presale performance, coupled with a dedicated user base exceeding 6,000 KANG holders, underscores investor confidence in the project’s long-term viability and could result in the project raising over $8 million by the end of the month.","Furthermore, KangaMoon differentiates itself by prioritizing sustainable growth within the burgeoning Play-to-Earn (P2E) market. The native KANG crypto serves multiple purposes, as its the in-game currency, and the reward incentive. Players wield control over their characters, engaging in tournaments and battles to accumulate KANG and NFTs, which can later be sold in a dedicated marketplace to fuel an entire economy.","🌟 Upcoming New Listing 🌟 🤩 #BitMart will list #KANG @Kangamoon_P2E soon! Keep an eye on our socials for further announcements. Share in the comments what you like about this project👇 pic.twitter.com/YvT39QoKba","The Social-Fi model also incentivizes social-media engagement by rewarding users with KANG tokens. The current Bonus Round in the presale offers the KANG token at $0.025, marking a 400% price increase from its starting value. At launch, analysts project a 100x price surge, especially once it launches on major exchanges in Q2, 2024, making it the best crypto investment.","Cardano’s focus on smart contracts and dApp development did initially put it at the top, and Ripple’s focus on the financial sector for cross-border transactions made it one of the largest in its niche. Despite this, they have both recently struggled to maintain an upward momentum, while KangaMoon has been surging. With its vast utility, and focus on the P2E market, it can be a game-changer and spike significantly at launch.","Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!","Website: https://Kangamoon.com/","Join Telegram Community: https://t.me/Kangamoonofficial"],"create_date":"2024-05-16T08:04:09+00:00","tag":"","author":"PR Manager"}
{"url":"https://coinpedia.org/crypto-live-news/nft-market-crash-trading-volume-drops-97-since-2021/#","web_url":"https://coinpedia.org/","type":"article","description":"Once known for digital art and collectibles fetching millions, the NFT market is now nearly deserted. Trading volume has plummeted by a staggering 97%","title":"NFT Market Crash: Trading Volume Drops 97% Since 2021","content":[],"create_date":"2024-05-16T12:45:49+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/news/behind-the-20-million-sonne-finance-hack-unveiling-the-technical-details/","web_url":"https://coinpedia.org/","type":"article","description":"Staggeringly, a crypto attacker succeeded in the hack on Sonne Finance to conduct a heist using a very complex exploit that drained the company’s assets,","title":"Sonne Finance Vulnerability Exposed in $20 Million Crypto Heist","content":["An attacker exploited a vulnerability in Sonne Finance\u0027s VELO integration, allowing them to manipulate the system and steal $20 million worth of crypto assets.","The attacker used a two-step process involving tiny VELO transactions to trick the system.","Staggeringly, a crypto attacker succeeded in the hack on Sonne Finance to conduct a heist using a very complex exploit that drained the company’s assets, bringing in about $20 million to the attacker. The attack played out for a few days, spotting carefully the backdoor of Sonne Finance’s VELO integration with the Optimism network.","Here are details of the attack.","The exploit transaction of two days duration started from the date of the attack according to the detailed analysis released by CertiK. A few days before, Sonne Finance had carried out a unanimous vote to make VELO transactions possible on the Optimism blockchain and finished all the relevant transactions through the multi-sig wallet.","This wallet included a two-day time lock which was designed to provide an added layer of security by causing transactions to be delayed for two days.","With the completion of the two-day counting period, the attacker implemented a “c-factor” to the markets by afternoon. At this crucial step, the Vulnerable attacker transmitted 400,000,001wei VELO (a minuscule part of the VELO token) in order to mint only 2 wei.","The one to get the loan was the newly issued soVELO which borrowed 35,469,150 VELO from the AMM liquidity pool immediately after the overcollateralized VELO was moved to the soVELO contract.","However, this transfer didn’t mint additional soVELO tokens, leading to an imbalance. The total cash money in the system continued to grow while the total quantity soVELO remained at 2 wei.","That is why the attacker successfully borrowed 265 wei of Wrapped Ethereum, with just the collateral as two wei soVeLO. Due to rounding errors in the division calculations, the adversary was able to become the owner of 35,471,603 VELO. He redeemed the number of tokens for only 1 wei of soVELO instead of the 1 VELO that was suggested.","The attacker had not stopped sufficiently by then. The second period, they had used 100 wei of VELO at the same time at soVELO, so that generated another wei of soVELO as a total supply of 2 wei. This way they kept running the system and got assets drained from several sources.","The assets stolen included: 2,352. 96 VELO, 795. 38 WETH, 768,933. 76 USDC. With the emergence of e ish (a USDC coin on top of Ethereum), 162,92 WBTC (Wrapped Bitcoin), 1667. 45 wstETH (wrapped staked ETH), 777k. 566 USD (Tether) and 1,264,790. 21 USDC.","This audacious exploit serves as a stark reminder of the importance of conducting thorough code audits and implementing robust security measures to safeguard digital assets within decentralized environments.","Even the slightest oversight can pave the way for catastrophic breaches, emphasizing the critical need for vigilance in cryptocurrency security.","Also Check Out : Crypto Hack Report Q1 2024: Trends, Losses, and Recovery Efforts","Could this happen again? Yes. It’s important to keep your investments safe. Read this guide now: A Comprehensive Guide to Keeping Your Crypto Safe"],"create_date":"2024-05-16T10:18:46+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/crypto-live-news/ex-mit-graduates-arrested-for-laundering-25-million-crypto/#","web_url":"https://coinpedia.org/","type":"article","description":"Anton and James Peraire-Bueno, ex-MIT graduates, were accused of wire fraud and money laundering to the tune of $25 million of cryptocurrency in 12","title":"Ex-MIT Graduates Arrested For Laundering $25 Million Crypto","content":[],"create_date":"2024-05-16T07:21:31+00:00","tag":"","author":"Sohrab Khawas"}
{"url":"https://coinpedia.org/crypto-live-news/paul-ryan-advocates-stablecoin-regulation-to-tackle-u-s-debt-crisis/#go-to-tie-body","web_url":"https://coinpedia.org/","type":"article","description":"Former U.S. House Speaker Paul Ryan supports stablecoin regulation to enhance U.S. economic stability and boost dollar adoption. In a Bloomberg interview,","title":"Paul Ryan Advocates Stablecoin Regulation to Tackle U.S. Debt Crisis","content":[],"create_date":"2024-05-16T06:36:34+00:00","tag":"","author":"Nidhi Kolhapur"}
{"url":"https://coinpedia.org/price-analysis/breakout-rally-for-the-graph-grt-price-to-result-in-a-60-surge/","web_url":"https://coinpedia.org/","type":"article","description":"The Graph price has recorded a significant bullish momentum by adding approximately 16% within the past day.","title":"Breakout Rally For The Graph (GRT) Price To Result In A 60% Surge?","content":["Amid increased price volatility in the crypto market, the star crypto, Bitcoin price has successfully reclaimed the $65K mark. Moreover, top altcoins have recorded a significant jump in their respective portfolios, highlighting an increase in the bullish influence.","Moreover, The Graph price has recorded a significant bullish momentum by adding approximately 16% within the past day. With successfully recording a bullish break out of its symmetric triangle, will GRT price hit $0.5 in Q2?","After facing rejection at the resistance level of $0.4950, the GRT price lost momentum and recorded a significant correction of 53.03% in its valuation. This resulted in the Artificial Intelligence (AI) token forming a symmetric triangle pattern in the 1D time frame.","At the time of writing, the trading price of The Graph (GRT) token was $0.3116 with a 24-hour gain of 16.21% and a trading volume of $214.061 Million, a jump of 147.99%.","With the rising bullish sentiment in the cryptocurrency market, The Graph price displays a high potential of a break-out rally, resulting in the altcoin attempting to test its upper high during the upcoming weeks.","The Simple Moving Average (SMA) displays a bullish crossover in the 1D time frame, indicating a significant increase in the buying pressure within the crypto space.","On the other hand, the MACD shows a constant rise in the green histogram, highlighting a strong bullish influence in the crypto space. Furthermore, the averages display a constant uptrend, suggesting a positive outlook for the Graph price during the upcoming time.","If the bulls continue to trade under a bullish sentiment, the GRT price will test its resistance level of $0.3550 over the coming weekend. Moreover, if the market holds the price at that level, it will set the stage for The Graph token to attempt to test its upper resistance level of $0.4225 this month.","Negatively, if the bearish trend reversal occurs, the GRT token will retest its support level of $0.2950 soon. Furthermore, if the bears continue to dominate the market, the GRT price will plunge toward its lower support level of $0.2325 in the coming time."],"create_date":"2024-05-16T08:52:16+00:00","tag":"","author":"Elena R"}
{"url":"https://coinpedia.org/press-release/analysts-are-recommending-this-new-altcoin-kangamoon/","web_url":"https://coinpedia.org/","type":"article","description":"Learn about the future price potential behind Cardano, Ripple and KangaMoon to see which crypto can see the most significant gains in 2024 and beyond.","title":"KangaMoon (KANG) Reaches Over 20,000 Members ","content":["Recent price movements have dampened the diversification appeal and opportunities seen within Cardano (ADA) and Ripple (XRP). ADA’s decline has pushed it down significantly, and it’s no longer recommended by analysts, while XRP’s initial bullish run suffered and is now in a correction phase. In contrast to this, KangaMoon (KANG) has emerged as a potential opportunity for any traders looking for growth, especially as it experienced a 400% price increase which warrants a closer look through its technical analysis and technology to truly understand the underlying factors for this surge.","To see why analysts are recommending this new altcoin as the best crypto investment, we will be taking an in-depth look at all it has to offer.","Cardano (ADA) was a good crypto to buy but is now heading in a downward pattern, and at this rate, risks losing far more value. While the ecosystem has upgraded, especially with Hydra, a project that can scale the network operating as a Layer-2 solution, the Cardano price has still gone downwards.","The platform’s key highlights this month initially pushed its value forward, as information on Hydra /commit API endpoint changes, alongside information on the Gummiworm L2 concept based on Hydra Head sparked major developer interest. Now however, the Cardano crypto is heading downwards with negative RSI and MACD data. According to the Cardano price prediction, the furthest point it can reach is $0.6313 by Q4, 2024.","Ripple (XRP) has made strides towards expanding its ecosystem as a means of appealing to more traders and spike in value. The recent partnership between Ripple and XRPL Labs with the DeRec Alliance is a significant development intended to push interest in the Ripple crypto further.","The alliance also puts its focus on creating standardized protocols for digital asset recovery within Web3. Simplifying and expediting the recovery process, especially for non-crypto experts, could lead to wider adoption of blockchain technology and a potential increase in the Ripple price. Yet, based on the Ripple price prediction, it can reach $0.73 as its maximum point of value by the end of 2024. If Ripple does make this growth, it will become a good crypto to buy.","KangaMoon (KANG) has reached major milestones during its blockchain ICO, exceeding $6.7 million and attracting over 20,000 community members. This strong presale performance, coupled with a dedicated user base exceeding 6,000 KANG holders, underscores investor confidence in the project’s long-term viability and could result in the project raising over $8 million by the end of the month.","Furthermore, KangaMoon differentiates itself by prioritizing sustainable growth within the burgeoning Play-to-Earn (P2E) market. The native KANG crypto serves multiple purposes, as its the in-game currency, and the reward incentive. Players wield control over their characters, engaging in tournaments and battles to accumulate KANG and NFTs, which can later be sold in a dedicated marketplace to fuel an entire economy.","🌟 Upcoming New Listing 🌟 🤩 #BitMart will list #KANG @Kangamoon_P2E soon! Keep an eye on our socials for further announcements. Share in the comments what you like about this project👇 pic.twitter.com/YvT39QoKba","The Social-Fi model also incentivizes social-media engagement by rewarding users with KANG tokens. The current Bonus Round in the presale offers the KANG token at $0.025, marking a 400% price increase from its starting value. At launch, analysts project a 100x price surge, especially once it launches on major exchanges in Q2, 2024, making it the best crypto investment.","Cardano’s focus on smart contracts and dApp development did initially put it at the top, and Ripple’s focus on the financial sector for cross-border transactions made it one of the largest in its niche. Despite this, they have both recently struggled to maintain an upward momentum, while KangaMoon has been surging. With its vast utility, and focus on the P2E market, it can be a game-changer and spike significantly at launch.","Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!","Website: https://Kangamoon.com/","Join Telegram Community: https://t.me/Kangamoonofficial"],"create_date":"2024-05-16T08:04:09+00:00","tag":"","author":"PR Manager"}
{"url":"https://coinpedia.org/sponsored/eth-surge-expected-what-it-means-for-shiba-inu-furrever-token/#","web_url":"https://coinpedia.org/","type":"article","description":"When ETH goes up, it usually impacts other digital coins, especially meme coins. Lately, Shiba Inu, new Furrever Token have attention.","title":"Ethereum Surge Expected: See What It Means for Meme Coins Shiba Inu and Furrever Token","content":["Investors look forward to Ethereum’s expected surge and how it could shake up the cryptocurrency market. When Ethereum goes up, it usually impacts other digital coins, especially meme coins. Lately, Shiba Inu and the new Furrever Token have received much attention. These coins have active communities and unique themes. Due to Ethereum’s recent performance, it might undergo significant changes.","Ethereum’s current price is around $2,903.95, showing a slight 0.4% decline since yesterday. A digital assets lawyer warned that the SEC may soon classify Ethereum as a security. The SEC is set to decide on several spot Ethereum ETF applications, with VanEck’s application decision due on May 23, followed by ARK Invest/21Shares the next day. BlackRock, Fidelity, and Grayscale also have pending applications.","In March, the SEC raised potential “grounds for disapproval” of BlackRock’s application and Nasdaq’s proposal to list it. The SEC questioned if Nasdaq properly filed its proposal under the rules for Commodity-Based Trust Shares. This inclusion suggests a possible denial because these filings are improperly classified as commodity-based trust shares.","Rather than indirectly excluding Ethereum as a commodity, the SEC might explicitly declare it a regulated security. However, this is considered unlikely due to political tensions, according to Terrence Yang of Swan Bitcoin.","Hopes for spot Ethereum ETFs approval have diminished since the SEC approved spot Bitcoin ETFs in January. On Polymarket, traders estimate a 16% chance of approval this month. Despite SEC Chair Gary Gensler affirming Bitcoin as a commodity, he remains silent on Ethereum’s regulatory status. A lawsuit by Consensys claims the SEC views Ethereum as a security, seeking a federal declaration of it as a commodity.","If the SEC denies the Ethereum ETFs, citing market manipulation, it could face legal challenges and political backlash, similar to its previous stance on Bitcoin ETFs.","Shiba Inu (SHIB) is now priced at $0.00002334, down 1% from yesterday. Despite this downturn, the token shows signs of a potential bounce back. Market analyst Dami DeFi highlighted SHIB’s recent price correction, suggesting it might be good. The coin aims to return to its late February rally, which saw a 380% increase from February 25 to March 5, reaching a high of $0.00004567. However, market ups and downs and decreased momentum have led to a nearly 50% drop from this peak.","SHIB has formed a falling wedge pattern during this decline, often signalling a potential reversal. On-chain data supports this, showing significant reductions in SHIB exchange reserves. Since Feb. 29, exchanges have seen an outflow of 13 trillion SHIB, with 5 trillion removed since March 31, indicating a shift to self-custodial storage by investors, potentially for long-term holding.","Despite mixed signals from SHIB’s derivatives data, the falling wedge and reduction in exchange reserves suggest a possible price increase. Analyst Dami predicts a 50% surge, bringing SHIB to $0.00003456 once it breaks out of the wedge.","Shiba Inu’s situation is closely tied to Ethereum’s performance, currently at $2,903.95. Ethereum has struggled to maintain below $3,000, experiencing a 0.4% downtick since yesterday. Significant fluctuations in ETH can influence broader market dynamics, including meme coins like Shiba Inu. A stable or rising ETH could provide the needed market confidence for SHIB to achieve its predicted breakout.","Introducing Furrever Token (FURR), the newest sensation in the cryptocurrency world, designed to revolutionize the space with an irresistible dose of cuteness. Priced at an appealing $0.000648, Furrever Token offers investors a unique and delightful experience centred around the universal love for adorable kitties. With the potential for up to 15X returns, this token is more than just an investment—it is an invitation to join a fun, whimsical community.","Built on the BNB-20 blockchain, Furrever Token boasts a total supply of 9 billion tokens, with 65% available during the presale, 25% allocated for DEX listings, and 10% reserved for the team, locked for a year to ensure stability and trust. This carefully designed tokenomics structure supports a robust and secure ecosystem, further enhanced by audits and safety measures.","Furrever Token is not just about financial growth; it’s about creating a warm and engaging community. With features like cat-themed stickers, emojis, and regular community challenges, Furrever Token transforms everyday interactions into adorable experiences. The future promises exclusive content, rewarding the loyal Furrever community with delightful surprises.","Currently, Furrever Token has raised over $1.1 million and is nearing the end of its 8th presale stage. It aims to raise $1.9 million before launching on PancakeSwap. As part of its launch campaign, Furrever Token hosts a $20,000 Highest Total Buys Competition, offering substantial rewards to the top 10 buyers. With prizes ranging from $5,000 to $1,000 worth of FURR, this competition adds an exciting incentive for early investors.","Join the Furrever Token community today and become a part of this innovative, heartwarming crypto journey. Visit furrevertoken.com to learn more and secure your tokens before the presale ends. Don’t miss out on the purrfect opportunity to invest in the cutest crypto on the market!","Join Furrever Token Presale Now:","Join $20,000 Furrever Token Giveaway","Join Official Telegram Group","Follow Official X Account"],"create_date":"2024-05-16T12:38:33+00:00","tag":"","author":"PR Manager"}
{"url":"https://coinpedia.org/news/cme-to-offer-spot-bitcoin-trading-impact-on-binance-and-coinbase/#","web_url":"https://coinpedia.org/","type":"article","description":"Big changes are on the horizon in the world of cryptocurrency as the Chicago Mercantile Exchange (CME), known for its bitcoin futures, mulls over stepping","title":"CME to Offer Spot Bitcoin Trading: Coinbase, Binance on High Alert?!","content":["The Chicago Mercantile Exchange, a leader in futures, might offer direct bitcoin buying and selling.","This move by CME could hurt major unregulated exchanges like Binance by offering a safer alternative for spot trading.","The news of CME\u0027s potential spot trading and recent ETF approvals contribute to a positive crypto market with rising bitcoin prices.","Big changes are on the horizon in the world of cryptocurrency as the Chicago Mercantile Exchange (CME), known for its bitcoin futures, mulls over stepping into spot bitcoin trading.","This move could significantly impact major players like Binance and Coinbase by providing a regulated trading environment for bitcoin, addressing growing demand among market participants. Interestingly, followed by the news Bitcoin spot ETF trading has surged, reaching $5.65 billion, the highest since March 24th as per Santiment data.","📈 #BitcoinETF volume is picking up major steam, with the 7 largest #ETF\u0027s hitting $5.65B, the highest day since March 24th. Gone are the days of whales only accumulating #onchain. Keep a close eye on whether momentum stays high with our free dashboard: https://t.co/fyI2IS1U79 pic.twitter.com/77ZD0e7gpz","Already a powerhouse in bitcoin futures, CME is now eyeing the spot market. Currently, the spot scene is dominated by offshore, unregulated exchanges like Binance. But CME’s potential entry could change the game, giving traders a regulated platform to navigate both spot and futures markets seamlessly, potentially transforming their trading strategies.","Markus Thielen, from 10x Research, predicts a big shake-up in the crypto exchange scene if CME moves forward. He suggests that institutional investors, driving the current bullish trend, prefer trading on regulated platforms.","With CME possibly offering a regulated spot trading hub, it could redirect business away from existing crypto exchanges, signaling a new era of institutional involvement in crypto.","The Financial Times reported that CME has engaged in discussions with traders who are keen on trading Bitcoin on a regulated marketplace. The new spot trading operations might be conducted through Switzerland’s EBS currency trading venue. Although CME has not officially commented, the potential launch is seen as a strategic expansion to complement its existing future products.","Notably, CME wants to add spot trading to its futures contracts, which big investors are using at present. This could make CME even more important in the crypto world, drawing in more big investors.","With the recent approval of 11 spot bitcoin exchange-traded funds, CME’s potential venture into spot bitcoin trading opens another door for Wall Street players to explore digital assets. While exchanges like Coinbase and Binance already offer spot trading, CME’s entry could bring a fresh perspective, drawing more institutional investors into the crypto space.","Market Outlook","Despite regulatory shifts and growing institutional interest, the crypto market remains upbeat. The surge in spot bitcoin exchange-traded funds, coupled with CME’s possible expansion, bodes well for the future of digital assets.","With Bitcoin’s value on the rise, currently at $65,995 with a notable 6.72% increase in the last 24 hours, it’s clear that change is in the air for crypto enthusiasts.","Also Check Out : Bitcoin Poised To Surge 62%: Legendary Trader Identifies Similar Historic Pattern","Do you think CME’s entry will benefit or disrupt the crypto market? Weigh in with your take!"],"create_date":"2024-05-16T11:10:15+00:00","tag":"","author":"Qadir AK"}
