[{"url":"https://blog.coinjar.com/laser-eyes-sysiphus-and-pandoras-box/","web_url":"https://blog.coinjar.com/","type":"article","description":"On February 11th, Joe Biden posted a picture of himself featuring laser eyes referencing a conspiracy theory that stated the Super Bowl (the major media event where 22 men run after a Papaya-shaped ball and tackle each other ruthlessly) would be rigged to make sure that the team with Taylor Swift's boyfriend wins - so that she could endorse Biden for president.","title":"Laser eyes, Sysiphus, and Pandora's box","content":" Laser eye's making a comeback wasn't exactly on my 2024 bingo card. Life is full of surprises, and so is Joe Biden.\nOn February 11th, he posted a picture of himself featuring laser eyes referencing a conspiracy theory that stated the Super Bowl (the major media event where 22 men run after a Papaya-shaped ball and tackle each other ruthlessly) would be rigged to make sure that the team with Taylor Swift's boyfriend wins - so that she could endorse Biden for president.\nConspiracies aside, the crypto crowd quickly called this cultural appropriation. After all, laser eyes are a symbol rocked by Bitcoiners to signal to \"all the single ladies\" who they shouldn't let put a ring on it, to paraphrase Beyonce. In 2021, laser eyes symbolized perma bulls who believed Bitcoin would hit $100k by the end of the year. As this failed to happen, the lasers slowly disappeared.\nSpeaking of laser eyes, Biden wasn't the only one. Justin Sun, the founder of Tron, spent over $600k to purchase a JPEG of a rock with laser eyes and is using it as his profile picture.\nTakeaway: Will laser eyes stay, who knows? Crypto isn't one to neglect old trends; after all, Bitcoin Wizards embrace the magic internet meme rather successfully, and that one is more than ten years old. 🧙\nIt all seemed to go so well for Solana. BONK propelled their lackluster Saga phone sales to new heights, and they hadn't experienced an outage for more than 330 days. But, as the good German proverb goes, \"everything has an end; only the sausage has two.\"\nSolana's uptime streak ended on February 7th when no transactions were processed for 5 hours. The outage was caused by a previously known bug that resulted in infinite loops. Infinite loops are a coding error that occurs when you set up a loop where the terminating condition is never met. They are fun when you learn to code and freeze your system. It turns out they do the same for chains.\nWhen the infinite loop was triggered, validators were stuck in a continuous cycle of trying to process the same block over and over again in a modern interpretation of Sysiphus' tragic tale. Unfortunately, this prevented them from doing their actual work of confirming new transactions, the thing blockchains are supposed to do.\nThe SOL price quickly dipped but has recovered since. Even better, pre-orders for the 2nd Solana phone reached 100,000, meaning the foundation now has an additional $45 million in cash.\nTakeaway: This was the sixth outage for Solana, yet it remains a regular among the top 5 tokens by market cap. We have to cut them some slack for that. They are in the arena, trying things, and some fail.\nPandora, the first woman on Earth, owned a box containing all the world's evils. Obviously, it was unleashed and gave us, among other things, HEX. One crypto project now decided that Pandora was a great name for their project, so here we are: contemplating Greek mythology in a space that otherwise does not seem to learn from history.\nPandora (the project, not Greek lady) is the first to run with a new experimental token standard, fittingly called ERC-404. It combines the existing Ethereum standards for fungible and non-fungible tokens, allowing the creation of so-called \"semi-fungibles.\"\nIn other words, NFTs can be fractionalized from the start with this new standard. While splitting NFTs into a set amount of tokens and distributing them has existed before, the process always involved locking the original NFT and issuing new tokens. With ERC-404, multiple wallets can own a single NFT directly, removing the need to fractionalize NFTs manually. Pandora has had success with it, with tokens trading as high as $32k, up from $250 the week before.\nTakeaway: Experiments are part of crypto. If you decide to partake, that's on you. I, for one, abstain. We know what happened to the world after Pandora opened that box, and I don't want to risk the same happening to my wallet.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-02-14T23:07:07.000Z","tag":"Opinion","author":"Naomi"},
{"url":"https://blog.coinjar.com/usd-deposits-and-withdrawals-via-wire-transfer-now-available/","web_url":"https://blog.coinjar.com/","type":"article","description":"Currency\nDeposit\nWithdrawal\n\n\n\n\nAUD\nPayID, Bank account transfer\nBank account transfer\n\n\nGBP\nFaster Payments\nFaster Payments\n\n\nUSD\nFedwire\nFedwire\n\n\nEUR\nSEPA\nSEPA","title":"USD Deposits and Withdrawals Via Wire Transfer Now Available","content":" We’re thrilled to announce that USD deposits and withdrawals are once again available at CoinJar through Wire Transfer. This service is supported by major banks in Australia, the UK, EU and the US that facilitate international transfers. You must be a customer of CoinJar in Australia or in the UK to use this feature.\nPlease note the standard risk warning at the bottom of this article.\nUSD Transfer Fees\nDeposit: $10 USD\nWithdrawal: $10 USD\nSome banks may charge additional fees when sending or receiving USD. This may include intermediary bank fees, currency conversion fees or flat transaction fees. CoinJar does not not have any control over the fees charged by banks and financial institutions. We encourage you to contact your bank if you are unsure of their fee structure. Note also that returns might increase or decrease according to currency fluctuations.\nFor more detailed information, please visit our CoinJar Support article.\nWe also want to remind you that CoinJar and CoinJar Exchange support trading pairs, deposits, and withdrawals in USD, GBP, EUR and AUD. This enables you to trade these fiat currencies against all available crypto and fiat currencies on our platform.\nAdditionally, you can seamlessly transfer funds between your CoinJar wallets and linked bank accounts in Australia, the UK, EU and the United States.\nCoinJar app\n1. If you haven't already, you can download CoinJar's iOS or Android app\n2. Open the CoinJar app and sign in\n3. If you haven't already, add your desired fiat currency account by going to:\nAccounts > Add Account > Select a Fiat Currency\n4. From the Home tab, tap 'Deposit'\n5. Select your preferred deposit method.\n6. Select 'View deposit details'\nCoinJar web app\n1. Sign in to the CoinJar web app\n2. If you haven't already, add your desired fiat currency account by going to:\nAccounts > Add Account under the Cash heading > Select a Fiat Currency\n3. Click ‘Deposit’ in the top right of the screen\nPlease remember that the bank account you transfer funds from must be in your name and your CoinJar needs to be verified before you can deposit funds.\nFor our Australian customers, trading AUD, USD, EUR and GBP pairs as well as AUD and USD deposits and withdrawals, are available for individual, corporate, trust and SMSF accounts. EUR and GBP deposits and withdrawals are available for individual accounts, and upon request for Australian corporate, trust or SMSF customers.\nFor our UK customers, trading GBP, EUR, USD, and AUD pairs as well as AUD and USD deposits and withdrawals, are available for individual, corporate, trust and SMSF accounts.\nPlease note the standard risk warning below.\nIf you have any other questions or queries, visit the CoinJar Knowledge base article or contact Support.\nThis article should not be deemed to be investment advice and all readers should seek independent financial advice before investing in any form of asset.\nReturns might increase or decrease according to currency fluctuations. UK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nHappy Trading!\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service.\nWe use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets.\nWe recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in the UK by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767). CoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-04-22T06:56:22.000Z","tag":"","author":"Dom Gluchowski"},
{"url":"https://blog.coinjar.com/diversity-crisis-frames-vampire-atacc/","web_url":"https://blog.coinjar.com/","type":"article","description":"Ethereum has a diversity crisis. You, dear reader, probably also fall under the \"bro\" category (crypto, VC, trader, finance bro... there are nuances, I know). Relax, this isn't about sending some Karen from the diversity department your way and telling you to hire more minorities.","title":"Diversity crisis, frames, and a vampire/atacc","content":" Ethereum has a diversity crisis. You, dear reader, probably also fall under the \"bro\" category (crypto, VC, trader, finance bro... there are nuances, I know). Relax, this isn't about sending some Karen from the diversity department your way and telling you to hire more minorities.\nIt's about Ethereum clients whose diversity pales even against X after Elon Musk fired half of the team. Clients are software that allows validator nodes to interact with the blockchain and execute transactions. 84% of Ethereum nodes currently use the Go Ethereum (GETH) client, a so-called supermajority. Otherwise known as the election results democratic leaders dream of.\nGeth dominance isn't new, but on the 22nd of January, a minority client experienced a bug that awakened Ethereum devs from their blissful ignorance.\nEven though the bug was quickly resolved, it still highlighted that clients could break, and if this occurred on Geth, it wouldn't go down as well. As Lefteris pointed out, if there was a complete loss of stake of validators using Geth, more than 20% of the ETH supply could be burned.\nAs an ETH holder, certainly, that's bullish for my small bags, right? The problem is, if the client failed, your sell order wouldn't go through, and instead, we'd have to deal with a chain that can't finalize and lots of forks.\nFor now, the only thing done to address the issue seems to be appealing to validators to do the right thing. Good luck with that.\nTakeaway: Once again, you wonder if these supposed cypherpunk values are really what drives people running blockchains or if it's just, as economics suggests, good old greed.\nSpeaking of clients, the most-used Farcaster client, Warpcast, has spurred a frenzy in activity this weekend with the launch of its latest feature: Frames. 🖼️\nTo add some context, Farcaster is a sufficiently decentralized social protocol that can be accessed through a variety of clients with different focuses, such as search, books, or cross-platform posting.\nBack to frames, they are an extension of the OpenGraph standard that turns static embeds into interactive experiences. If you've been an early Facebook user, you're familiar with the idea: having games embedded and playable right on the Facebook page.\nUnlike farming games on FB, Frames are natively embedded in the broader crypto ecosystem, which means you can access web3 things without having to deal with the usual UX pains. Within 48 hours since launch, devs hacked together frames that allow you to one-click, subscribe to publications on Paragraph (a web3 blogging platform), mint NFTs, play Doom, get random Tarot cards, and more.\nTakeaway: You know they are onto something when even the Solana spokesperson Mert highlights the potential of it. As experience on Twitter degrades, come over to the Purple side. They got on-chain cows and a foray into how crypto-enabled experiences can look like when you focus on fun.\nRemember Eigenlayer? With millions in TVL locked, the re-staking protocol has attracted liquidity-sucking competition named EtherFi. Even though Eigenlayer did the socially responsible thing and capped deposits, they didn't set limits on re-staking, which means people can re-stake their ETH locked in Eigenlayer to earn additional yield and rewards from projects that use Eigenlayer to bootstrap security.\nIn other words, it's all about earning as many rewards as possible. EtherFi is well aware of the modus operandi of Degens and launched a Vampire attack to benefit from Eigenlayer users. Unhinged as they are, they called the campaign deVamp, and went as far as creating VAMP badges.\nAdd to that the ability to earn points per re-staked ETH, and you get a protocol that has attracted over $475 million in Total Value Locked.\nAs a cherry on top, EtherFi even committed to using Minority Clients.\nTakeaway: Vampire attacks are like Dio in Jojo's Bizarre Adventure: hard to get rid of. For as long as there are enough mercenaries, there are incentives to launch one.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-01-31T04:22:18.000Z","tag":"Opinion","author":"Naomi"},
{"url":"https://blog.coinjar.com/onchain-a-w-an-l-and-something-in-between/","web_url":"https://blog.coinjar.com/","type":"article","description":"But as they say, one should always deliver the bad news first, so here we go. Wormhole's W airdrop more of an L?","title":"Onchain: A W, an L, and something in between","content":" But as they say, one should always deliver the bad news first, so here we go.\nIf there were an Oscar for giving free money to the wrong people, Wormhole would be a top nominee.\nAs a protocol in the back, Wormhole connects multiple blockchains, including Ethereum, BNB chain, Solana, Polygon, and Oasis - enabling token and NFT bridges, cross-chain oracles, and other messaging apps.\nUntil recently, Wormhole was best known as a top DeFi hack with a $320 million exploit of its flagship product. Nomen et omen. If your product is called something-hole, maybe it's expected to become a sinkhole for liquidity.\nHowever, with their airdrop announcement, the team has moved beyond that, offering 6% of the W token supply to 400,000 wallets. To ensure Degens could check their future bags in advance, Wormhole released an eligibility checker, which didn't quite satisfy community members.\nIt turns out that some users who grinded relentlessly and bridged significant amounts using Wormhole tech stood to receive very little, while people who just bought the right NFT got a lot.\nTakeaway: Way to waste your airdrop budget. But maybe they are just having a nihilistic phase, and this is a bold move to showcase the absurdity of crypto. If so, more power to them.\nThat's the verdict of CT and media publications like Cointelegraph. SocialFi, the combination of Social Media with financialization, was hyped as the best thing since sliced bread until we all realized that dumping your friends' keys is not a great way to maintain friendship.\nDespite the launch of a points program, Friendtech has been struggling to maintain more than 3k transactions per day. Similarly, Farcaster has seen user numbers drop off since its user ATH of 40,000, driven by a flurry of activity surrounding frames. Even adding support for transactions in-frame and Solana wallets to the mix hasn't stopped what appears to be an exodus.\nThe only one seemingly bucking the trend is Lens Protocol, which went permissionless on February 27th and has since witnessed an influx in new users and a revenue growth from profile minting to over $500,000. It might have helped that early Lens users woke up to an airdrop.\nTakeaway: While it seems that putting a price on your friends isn't a great market, community could be. A sticky user base continues to be active on these platforms. So far, Farcaster has been the only place where I found people willing to sing Karaoke at 10 am on a Saturday during a crypto conference. Maybe the real treasures is the frens we make, and that's kenough 🎤\nThe best news, aside from Bitcoin hitting numbers, is that a crypto protocol is actually making revenue. Considering the lack of profitable business models in crypto, you're forgiven for believing this isn't an industry with sound business acumen. Protocols pay millions to validators to serve queries worth, at best, 10s of thousands.\nNot so Ethena. In just weeks since launch, the DeFi bond has become the highest-earning dApp after hitting over $6.8 million in daily cumulative rewards. The only blockchain stacking higher returns is Tron, with $38.6 million. And that's largely thanks to Justin Sun staking his retirement funds and millions of people in developing countries who use USDT on Tron as an easy, cheap, and fast on- and off-ramp to the dollar economy.\nThe secret behind Ethena's success is simple: high yields. Ethena bundles staked ETH and derivatives and uses them as backing for its synthetic dollar.\nWhoever holds this dollar benefits from staking rewards and other income. Currently, yields are at a reasonable 67.2%.\nTakeaway: At least all of the backings is onchain, and you can see what's really behind your synthetic dollars. Nevertheless, it never hurts to be cautious about things we do not fully understand.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-03-13T23:55:39.000Z","tag":"Opinion","author":"Naomi"},
{"url":"https://blog.coinjar.com/you-can-now-verify-your-coinjar-account-in-a-web-browser-no-mobile-app-needed/","web_url":"https://blog.coinjar.com/","type":"article","description":"Good news! You can now get verified using a web browser by following the below steps.","title":"You Can Now Verify Your CoinJar Account in a Web Browser","content":" Good news! You can now get verified using a web browser by following the below steps:\nLearn how to get your CoinJar account verified using a web browser by visiting our Knowledge Base.\nSince 2013, we’ve helped more than 600,000 people worldwide to buy, sell, sell and receive billions of dollars in Bitcoin, Ethereum and more than 50 other cryptocurrencies. We help newcomers and experienced traders alike to build their cryptocurrency portfolios with our intuitive mobile app.\nPlease note the disclaimer at the bottom of this article.\nIf you have any questions, please get in touch with CoinJar Support.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-05-03T01:26:36.000Z","tag":"Company &amp; Product","author":"https://www.facebook.com/CoinJar/"},
{"url":"https://blog.coinjar.com/sell-the-news-happy-bears-and-rpgf-going-brrr/","web_url":"https://blog.coinjar.com/","type":"article","description":"Now that 11 ETFs are approved, issuers have started engaging in a fee war, slashing their usual costs, with Blackrock charging 0.25%  and Bitwise setting its fee at just 0.2%. Then Franklin Templeton entered the scene, placing its fees at 0/19%. The race to the bottom is on.","title":"Sell the news, Happy Bears, and RPGF going brrr","content":" Now that 11 ETFs are approved, issuers have started engaging in a fee war, slashing their usual costs, with Blackrock charging 0.25% and Bitwise setting its fee at just 0.2%. Then Franklin Templeton entered the scene, placing its fees at 0.19%. The race to the bottom is on.\nDespite the discounts, institutions didn't buy enough to counteract the crypto crowd selling. In typical sell-the-news fashion, Bitcoin holders started getting rid of their bags, so Bitcoin just marked spot 99 of assets in terms of price performance over the past seven days. Not the rally some had hoped for, but maybe the one we deserve.\nBut all hope is not lost. Institutions' pockets are deep, and the next bullish Bitcoin narrative is just around the corner: the halving. During the halving, Bitcoin mining rewards are cut in half, reducing supply, which has usually led to price increases. However, whether that benefits the network's overall health remains to be seen, with CoinShares suggesting this halving could lead to an exodus of miners, as they might become unprofitable.\nTakeaway: Bitcoin ETF is great stuff depending on who you ask. For one, even Gary finds it a bit ironic, but it offers some legitimacy. The more pressing question now is, what comes after the halving? If miners exit en masse, that might be in the interest of centralized institutions but not so much in ours.\nIf you feel a little bearish on vibes after spending too much time reading TradFi's takes on crypto, there's one place where you can still find the crypto-anarchists living in the spirit of chaos, experimentation, and a lot of drama: Cosmos. It's also home to the next hyped alt L1 testnet launch: berachain.\nWonder why on earth a Layer-1 launch made it into this newsletter when the latest meta was L3s? Mostly because of Berachain's unapologetically crypto-native website. Not to spoil it, but you don't scroll down there. 🐻\nBerachain also deserves some credit on the tech front. The pseudonymous team has built an EVM-compatible chain with additional features to enhance the user experience. Or, as they call it, EVM +.\nWith a proof of liquidity consensus algorithm, the Beras aim to foster systemic liquidity building, solve stake centralization, and become a prime place for Cosmos DeFi.\nTakeaway: The memes are strong in this one. That's nearly a guarantee of success in crypto these days. So, if you're tired of TradFi discussing Bitcoin, why not hang out with bears instead? One thing is sure: the risk of them getting TradFi approval is pretty low. That's a feature.\nWhile tech companies are welcoming the new year with massive lay-offs, the only thing that's being let go at the Optimism DAO is the idea that public goods can't be funded sustainably. Optimism, home to thriving L2s like Base, has distributed 30 million OP tokens (~ $100 million to more than 501 contributors via RPGF). Yet another acronym in crypto. This one stands for retroactive public goods funding and describes a mechanism by which developers of public goods receive funding after they build something. After all, it's a lot easier to judge the usefulness of something after it exists and not when it's still in the idea phase.\nJust like countries build roads to enable citizens to go places (work), crypto devs build tools that are useful for the entire ecosystem but can't be monetized. While countries finance their infrastructure via taxes, Optimism now finances its' contributor ecosystem using its treasury.\nThe current fund distribution was already the third iteration of Optimism running its RPGF program, funding 643 projects in total now in categories like infrastructure, education, governance, and dev ecosystem.\nTakeaway: RPGF is a feel-good crypto use case. Enabling the collective to vote on what's been useful to them could even be extended beyond the realm of web3. I, for example, would like to retroactively fund the person who put a free public bookshelf in my neighborhood.\nYet, there should be some thought about avoiding keeping zombie projects alive without the prospect of making it.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-01-17T04:49:29.000Z","tag":"Opinion","author":"Naomi"},
{"url":"https://blog.coinjar.com/new-coinjar-features-alert-search-sort-and-more/","web_url":"https://blog.coinjar.com/","type":"article","description":"We're delighted to announce the launch of highly requested features on CoinJar's web and mobile apps, designed to streamline your crypto management experience.","title":"New CoinJar Features Alert: Search, Sort, and More!","content":" We're delighted to announce the launch of highly requested features on CoinJar's web and mobile apps, designed to streamline your crypto management experience:\nThese updates are live now, and we encourage you to update your app to access these new features.\nTo learn more about these features, visit our Knowledge Base.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nHappy Trading!\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-03-06T03:03:31.000Z","tag":"Company &amp; Product","author":"https://www.facebook.com/CoinJar/"},
{"url":"https://blog.coinjar.com/solana-eclipse-another-fee-switch-ptsd/","web_url":"https://blog.coinjar.com/","type":"article","description":"Millions gathered across the US, Mexico, and Canada to watch the Solar eclipse. Meanwhile, all the manlets transacting on Solana experienced their own eclipse in the form of dramatic transaction failure.","title":"Solana eclipse, another fee switch, and PTSD","content":" Millions gathered across the US, Mexico, and Canada to watch the Solar eclipse. Meanwhile, all the manlets transacting on Solana experienced their own eclipse in the form of dramatic transaction failure. On April 4th, 75% of all non-vote transactions on Solana failed, and the chain continues to be heavily congested. Of course, it didn't go unnoticed on CT.\nBut let's not jump the gun and assume that the handful of vocal people on Twitter would mean there is actual user impact. According to Mert, CEO of Helius Labs, a Solana dev shop, the failed transaction chart is a bad way to measure users' experience. Fair enough, 50% of the transactions appear to be created by bots trying to exploit arbitrage opportunities. The launch of a protocol called Ore, where users could earn one coin/minute, likely didn't help matters.\nAs they say, when it rains, it pours. ⛈️\nStill, on the bright side, it is not a liveness failure as is Solana's usual problem, but one of congestion. In a sense, it's once again a victim of its success.\nTakeaway: If this incident highlights anything, it's that people will spam the hell out of any low-cost blockchain when there's something to be gained from it. At least, people's failed transactions on Solana don't cost them hundreds of dollars. 😏\nDidn't think we'd talk about DAOs this year, but here we are. Maybe tired of receiving stepmotherly treatment, governance discussions of DeFi protocols have pivoted to the one thing that has a visceral pull on degens: money.\nAnd not just any money, money made from fees. The latest DeFi project to explore this topic is Aave, a lending and borrowing platform.\nOn Aave, lenders deposit their crypto as collateral and borrow against it. It's popular enough that Aave's profits sit around $60 million. And who wouldn't want a piece of that?\nMarc Zeller, leader of the Aave Chan initiative, a driving force in Aave governance, has shared his proposal to activate the fee switch, hinting at an eventual re-distribution of fees to stakers.\nLetting people vote on if they can get money? Sounds like the outcome is obvious.\nTakeaway: At this stage, I'd like to reference Rune Christensen, founder of Maker DAO, one of the oldest DAOs, who recently said that \"having Rando's making decisions\" is no bueno. Unfortunately, he didn't deliver any recommendations for recruiting non-Randos\nEver since humans discovered gold, alchemists have dedicated their lives to finding the philosophers' stone that would turn any material into gold and solve all our problems.\nOf course, to anyone who has read \"Can't we just print more money,\" it's obvious this wouldn't solve much. A must-read for people in crypto, and one cohort in particular: those chasing algorithmic stablecoins. I vividly recall finding out that my UST holdings had evaporated, just like the Negroni I spilled on the beach in surprise.\nSure, it sounded too good to be true, but when would that ever deter people from f*cking around and finding out?\nNow, we have a new coin competing in that category: Ethena, the synthetic dollar using delta hedging (backing the coin with Ether derivatives), which at some point offered 70% yields.\nYields have dropped, but what hasn't is their ambition to dominate the stablecoin market. To grow, Ethena Labs is expanding its balance sheet to Bitcoin. Probably because they realized holding more than 20% of Ether Open Interest isn't a good look (yes their size is size).\nTakeaway: First of all, the yield is just 7% now—that's a yield for ants. Second, I'm not the only one who got some PTSD, seeing they're adding Bitcoin. But this time, my Negroni is safe. I'm simply not checking the crypto news while on holiday.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-04-10T03:04:43.000Z","tag":"Opinion","author":"Naomi"},
{"url":"https://blog.coinjar.com/onchain-inscriptions-claim-a-new-victim-points-everywhere-and-a-dog-coin/","web_url":"https://blog.coinjar.com/","type":"article","description":"Remember Ordinals, also called inscriptions, an NFT standard that arose on Bitcoin, allowing users to attach data to tokens? Well, it turns out this standard can easily be transferred to other chains, and it has spread like wildfire, wreaking havoc outside of Bitcoin.","title":"Onchain: Inscriptions claim a new victim, Points everywhere, and a dog coin","content":" Remember Ordinals, also called inscriptions, an NFT standard that arose on Bitcoin, allowing users to attach data to tokens? Well, it turns out this standard can easily be transferred to other chains, and it has spread like wildfire, wreaking havoc outside of Bitcoin.\nAfter taking down the TON blockchain earlier this month, Arbitrum has become the latest victim. L2s like Arbtirum are connected to the Ethereum mainnet via a (centralized) sequencer. Because inscriptions increase the data attached to transactions, they require more computing power to process. With a big data load comes a big responsibility - not something Arbitrum could handle.\n1.5 hrs downtime followed. What's worse, traders started taking their transactions back to the Ethereum mainnet, where gas fees began to increase, leading to pretty much the opposite of what L2s were supposed to achieve: congestion on L1, and high fees.\nOther chains haven't done much better. Gas fees on Avalanche went up to $400 when inscriptions hit the network, while NEAR wallets started showing errors because of the fast gas fee increase that they had never deemed possible.\nTakeaway: No low-fee chain is safe. So, if you run a blockchain or L2 that advertises cheap fees, be careful what you wish for. While inscriptions have driven chains like zkSync to transaction records for L2s, others had their marketing claims exposed as nothing but white lies. As an outside observer, though, it's great entertainment.\nAnyone on crypto Twitter in the past few days will notice that points are the new alpha. Points are a great way to scale communities while relying entirely on off-chain, highly scalable infrastructure called servers.\nIt's one of those moments where crypto discovers something from the real world and adopts it with much fanfare. Even though Blur offered points to its traders, and so did Jito ahead of their million-dollar airdrop, it was only when Blast and Rainbow Wallet introduced their versions, that points became the current thing.\nBlast, the infamous L2, em multi-sig, promising yield backed by Paradigm, introduced points for deposits and referrals with the unspoken promise that more points = more financial gains eventually. Rainbow Wallet went even bigger, giving points to everyone who had used Ethereum. Don't get the wrong idea, though. It's not that they had three ghosts visit them to make them realize that the real spirit of Christmas is generosity. This is just a vampire attack on their competitor. Anyone switching from MetaMask to Rainbow will get extra points.\nTakeaway: Points aren't on-chain and can easily be created out of thin air (like tokens minus the gas fees 😼). Like everything that goes well in crypto, others quickly copy and adopt the marketing strategy. This, too, shall pass.\nImagine you created a blockchain phone. You price it at an affordable $1000. Despite giving it a Solana OS, sales don't go well. A few months later you admit in an interview that only 2500 units were sold, which is somewhat of a fail.\nThis seemed to be the fate of the Solana Saga until, ten days later, Saga phones were flying off the shelves, quickly selling out in the U.S. and the European Union.\nThe reason? Degeneracy finds a way. Each Saga phone comes with an NFT that unlocks rewards, including $20 USDC and 30 million worth of Solana's dog memecoin BONK.\nWhile the price of BONK didn't make it worth buying a phone in June this year, the memecoin has rallied since and is up more than 8000%. This rise created an arbitrage opportunity where buyers could offset the cost of the phone entirely. If they bought it at the normal sales price, that is ($599, after a heavy discount because of lackluster initial sales).\nThe surge in demand for this scarce asset quickly created secondary markets, on which some even spent $5000 for the phone.\nTakeaway: They make fun of girl math, but honestly, this boy math isn't much better. At the current rate, you make roughly $600 when cashing in on the BONK reward. How's that a win when you spent $5000?! Someone needs a bonk.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2023-12-19T23:53:29.000Z","tag":"Opinion","author":"Naomi"},
{"url":"https://blog.coinjar.com/4-things-i-want-less-of-next-bull-market/","web_url":"https://blog.coinjar.com/","type":"article","description":"The ETF has arrived and we’re working out what comes next. While we wait, I’m gonna yell at the clouds for a bit.","title":"4 Things I Want Less Of Next Crypto Bull Market","content":" The ETF has arrived and we’re working out what comes next. While we wait, I’m gonna yell at the clouds for a bit.\nAlright, the ETF dropped, price went up, price went down. It’s never nice when you cede ground, but at a mere 20% this could only possibly be described as a market dip for ants. Let’s drop the BTC price into the teens again, just so we can really feel alive.\nShort-term price gyrations notwithstanding, it’s hard not to feel like forces are coalescing in that fizzing, crackling way that suggests silly season could soon be upon us once more – with all the good and bad that entails.\nThe ridiculousness of 2020/21 simultaneously feels like only yesterday and something that happened before the dawn of recorded history. Head back to 2017 and you may as well be describing a scene from the late Cretaceous.\nBut if we don’t learn from history, we’re doomed to keep thinking that the world is flat and flames are talking to us, so here are four things I hope we all agree to put in the bin for the coming cycle.\nLook back at the anointed deities of the last cycle and basically the only people left standing are Coinbase’s Brian Armstrong and Tron overlord Justin Sun, who at this point in time has cheated death so many times he must surely be down to his final Horcrux.\nSBF, Barry Silbert, Arthur Hayes, Do Kwon, Kyle Davies, Su Zhu, the Winklevoss Twins – at a certain point this shambling conga line of serial incompetents and straight-up fraudsters made up like 50% of any given crypto Twitter feed. They opined, they made bets, they bickered, they set the agenda. They told us things were good when they really weren’t. And now they’re all in jail, on the run, or just generally disgraced.\nSo, enough of that. The biggest thing Satoshi taught us is that blockchain technology doesn’t need great prophets – it speaks for itself. Now’s the time to let it do just that.\nI believe in crypto. I do. But I also recognise that if it’s going to change the world, then at some point it’s going to have to make itself a little more appealing to use.\nCrypto was already in trouble when the infamous slurp juice tweet became an instant meme, but given the timing it’s hard not to believe it single-handedly caused the LUNA meltdown a few days later.\nMost people in this world are just focussed on making it through the day without falling over. Asking them to partake in an entirely new metaverse, one that’s only accessible via an arduous and expensive series of network linkages and abstract currency transfers, and that may or may not be populated solely by Nazis, ain’t gonna cut it.\nBasically what I’m saying is let’s try and work out how we can improve the day to day of our users before asking them to commit to some unholy mix of escape room, foreign bank account and 3-day hallucinogenic bender.\nBack in 2022 the only thing arriving with more frequency than crypto company collapses were $100+ million hacks.\nThe problem had been brewing for years, but everyone was making so much money it created the kind of moral hazard that led to the GFC – no matter how egregious the error, you could usually rely on some VC with deep pockets to bail you out.\nHow could the most secure digital technology ever invented become a byword for the worst security this side of a Medibank gettogether?\nThe problem is developers would use the infallibility of the blockchain as cover for their own shortcuts. “If I build an application on the blockchain, then it must be as secure as the blockchain itself,” they say as they install a multi-sig system where one person holds all the keys.\nThe issue is not so entirely different from number 2 up there – complexity creates problems, whether it’s in the user interface, or in the digital architecture powering it. But blockchain was meant to eliminate human frailty. This time around let’s make our own mistakes less of the story.\nThis is probably too much to ask as Twitter/X/Elon’s Beautiful Dark Twisted Fantasy crumbles further and further into an outright parody of itself. But it would be nice if the visual representation of the average crypto user wasn’t the kind of loud-mouthed, wannabe dick-swinger whose crippling-insecurity-as-big-car-machismo shtick is so exaggerated it verges on performance art.\nI know you’re never going to get rid of them entirely – these bona fide beta boys are part of the beautiful multihued tapestry that is humanity, etc – but surely this time around we can start reaching new audiences and the concept of the crypto bro will stop holding such salience.\nCrypto’s whole thing is democratisation and equality of access. Time to start inviting people in.\nUK residents: Don’t invest unless you’re prepared to lose all the money you invest. This is a high‑risk investment and you should not expect to be protected if something goes wrong. Take 2 minutes to learn more: www.coinjar.com/uk/risk-summary.\nCryptoassets traded on CoinJar UK Limited are largely unregulated in the UK, and you are unable to access the Financial Service Compensation Scheme or the Financial Ombudsman Service. We use third party banking, safekeeping and payment providers, and the failure of any of these providers could also lead to a loss of your assets. We recommend you obtain financial advice before making a decision to use your credit card to purchase cryptoassets or to invest in cryptoassets. Capital Gains Tax may be payable on profits.\nCoinJar’s digital currency exchange services are operated in Australia by CoinJar Australia Pty Ltd ACN 648 570 807, a registered digital currency exchange provider with AUSTRAC; and in the United Kingdom by CoinJar UK Limited (company number 8905988), registered by the Financial Conduct Authority as a Cryptoasset Exchange Provider and Custodian Wallet Provider in the United Kingdom under the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, as amended (Firm Reference No. 928767).\n","create_date":"2024-01-24T23:42:25.000Z","tag":"Opinion","author":"Luke at CoinJar"}
]