[{"url":"https://blog.kraken.com/product/asset-listings/trading-for-jup-w-wif-and-more-starts-now-in-the-united-kingdom","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Bonk (BONK), Dymension (DYM), Jito (JTO), Jupiter (JUP), Polygon Ecosystem Token (POL), Wormhole (W) and Dogwifhat (WIF) are now available on Kraken for residents in the United Kingdom! Funding and trading BONK, DYM, JTO, JUP, POL, WIF and W funding and trading are live. Add your token to your Kraken […]","title":"Trading for JUP, W, WIF and more starts now in the United Kingdom","content":" We’re thrilled to announce that Bonk (BONK), Dymension (DYM), Jito (JTO), Jupiter (JUP), Polygon Ecosystem Token (POL), Wormhole (W) and Dogwifhat (WIF) are now available on Kraken for residents in the United Kingdom!\nBONK, DYM, JTO, JUP, POL, WIF and W funding and trading are live. Add your token to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nMake sure to deposit your tokens into the networks supported by Kraken. Deposits made using other networks will be lost.\nGot BONK, WIF or W? and a Kraken account? ⤵️\nBONK, DYM, JTO, JUP, POL, W and WIF are tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nBonk (BONK) is a cryptocurrency launched on Christmas Day, 2022, as a free airdrop to the Solana blockchain community. It has gained popularity in the Web3 space and operates on the Solana blockchain as a cryptocurrency that emphasizes community involvement and decentralized finance principles.\nIf you want to learn more about specific risks related to Bonk (BONK), please visit our crypto asset statements page.\nDymension (DYM) is a blockchain network known for its RollApps. The blockchain focuses on the play-to-earn gaming and decentralized finance (DeFi) sectors, and is managed by the Dymension Hub. It enhances data handling through Data Availability Networks and offers a RollApp Development Kit for developers. The network’s operations and user rewards system are anchored by the DYM token, which was initially distributed to the community through the Genesis Rolldrop, forming a key part of Dymension’s strategic growth in the blockchain sector.\nIf you want to learn more about Dymension (DYM), please visit our crypto asset statements page.\nJito (JTO) is a liquid staking platform on the Solana blockchain, enabling users to stake their SOL tokens in exchange for JitoSOL, a token representing both staking and MEV (Maximum Extractable Value) rewards. JTO is Jito’s governance token, which grants holders a say in the protocol’s strategic decision making process and future evolution per the guidelines set by the Jito Foundation Constitution.\nIf you want to learn more about Jito (JTO), please visit our crypto asset statements page.\nJupiter (JUP) is a decentralized finance (DeFi) protocol on the Solana blockchain that began as a liquidity aggregator for token swaps and has expanded to include perpetual futures. The governance token of Jupiter, JUP, allows community members to vote on key decisions regarding the platform’s development and operations.\nIf you want to learn more about Jupiter (JUP), please visit our crypto asset statements page.\nPolygon Ecosystem Token (POL) is a multi-chain scaling solution for the Ethereum blockchain. Polygon is a Layer 2 scaling solution for Ethereum that aims to improve the speed and reduce the cost and complexities of transactions on its network. Polygon uses sidechains to help with off-chain computation while maintaining security and uses a decentralized network of proof-of-stake (PoS) validators. POL is an upgrade and renaming of the MATIC token. Switching to POL tokens enhances tokenomics and governance rights, allowing stakeholders greater involvement in decision-making and shaping the platform through community initiatives.\nIf you want to learn more about Polygon Ecosystem Token (POL), please visit our crypto asset statements page.\nWormhole (W) is a platform that enables connectivity across different blockchains, allowing for the creation of both standalone crypto bridges and integrated multi-chain applications. It features a governance token, W, which empowers holders to influence the platform’s development and direction through on-chain governance within a dedicated DAO.\nIf you want to learn more about Wormhole (W), please visit our crypto asset statements page.\nDogwifhat (WIF) is a memecoin on the Solana blockchain, featuring a Shiba Inu dog wearing a hat. It’s a playful token inspired by Dogecoin (DOGE) that focuses on community engagement through meme contests and charity events, rather than serious financial investment. In the project team’s words, it’s literally just a dog wif a hat.\nIf you want to learn more about Dog Wif Hat (WIF), please visit our crypto asset statements page.\nCheck out more information about the above assets in our Crypto Asset Statement.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-04-19T13:13:13+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/performance-at-kraken","web_url":"https://blog.kraken.com/","type":"article","description":"Authored by: Shannon Kurtas, Product Director, Pro & Institutional Trading Max Kaplan, Sr. Engineering Director, Core Infrastructure & Data Engineering Suketu Gandhi, Sr. Engineering Director, Trading Technology Steve Hunt, VP Engineering Nearly twelve years ago, Kraken began its pioneering mission to become one of the first and most successful digital asset exchanges. We started trading […]","title":"Scaling Kraken's trading infrastructure for the next decade of growth","content":" Authored by:\nShannon Kurtas, Product Director, Pro & Institutional Trading Max Kaplan, Sr. Engineering Director, Core Infrastructure & Data Engineering Suketu Gandhi, Sr. Engineering Director, Trading Technology Steve Hunt, VP Engineering\nNearly twelve years ago, Kraken began its pioneering mission to become one of the first and most successful digital asset exchanges. We started trading only four cryptocurrencies, but we now support over 220 assets on 67 blockchains, and over 700 markets.\nWe’ve grown quickly. Thanks to our product and engineering teams — including experts in blockchain technology, security, networking, infrastructure, and trading systems — we’ve been able to keep up with massive demand.\nAs the industry has matured and evolved, so has the size and nature of our client base. While we continue to serve individual investors and traders via our Kraken and Kraken Pro platforms, a growing part of our order flow arrives algorithmically via our API from professional and institutional clients. These include corporations, hedge funds, proprietary trading firms, prime brokers, fintechs, as well as other exchanges relying on Kraken’s deep liquidity.\nOur trading systems have had to scale to meet these increased demands, particularly for those that heavily depend on speed, stability, and uptime in order to improve execution costs, manage market risk, and capitalize on trading opportunities. We achieved all of this without compromising on our number one priority — security.\nToday, we’re delighted to highlight some of our recent efforts, successes, and results of that scaling.\nWe put significant emphasis on instrumenting code to watch and understand our system performance under heavy, real-world conditions. We also employ competitive benchmarking to confirm how we stack up over time. Let’s explore some of those results.\nWe measure trading speed in the form of latency. Latency is the round-trip delay and we define it as the time between a trading request (e.g., add order) being sent by client systems and it being acknowledged by the exchange.\nUnlike traditional exchanges, crypto venues are generally less geographically concentrated and don’t offer full colocation. In many cases, they are entirely cloud-based.\nLatency-sensitive clients will deploy code wherever it is most physically proximate to the venue. Therefore, a fair comparison includes measuring latency from the region most relevant for that specific venue.\nLatency will also vary between trading requests, even on a persistent connection between a single client and the exchange. This is due to both differences and variability in internet-based trading, as well as how the exchange is handling load. Therefore, we must discuss latencies in terms of percentiles rather than single figures. For example, P25 latency refers to the 25th-percentile latency. In other words, a P25 of 5ms means that 25% of all trading requests within a given sampling time frame had a latency of 5ms or better.\nHere you see Kraken’s best path P25 latency versus some of our top competitors in different regions, normalized for location, during a baseline measurement last month.\n\nOur baseline round-trip latency of about 2.5ms represents over a 97% improvement vs. Q1 2021.\n\nAs mentioned before, real-world performance under heavy load is as important, if not more important, than best case performance and absolute latency figures.\nImproving execution cost, reducing slippage, and managing market risk depends on minimizing the variability of latency between each trading request. We call this variability jitter, and we measure the difference between different latency percentile figures for the same sampling time frame.\nBy measuring jitter with P25 and P95 latencies, we can capture a significant range of performance and observed behavior over time. For example, we measured how our jitter stacked up with a broader set of top competitors during the week of 5-12 November 2022, a time when market volatility was acute due to the distress and ultimate shutdown of FTX.\nHere you can see how our trading infrastructure behaved exceptionally well, despite the dramatically increased volatility and load. At no point during the week did this jitter exceed 30ms. Meanwhile, for many other exchanges, it regularly reached several hundred milliseconds, or requests timed out entirely as indicated by the vertical spikes.\n\nThroughput reflects the number of successful trading requests (add order, cancel order, edit order, etc.) handled by an exchange in a given amount of time.\nSimilar to latency, we discuss throughput in either theoretical or observed terms.\nObserved throughput is more relevant since it reflects many interrelated factors including rate limits. We set these limits to prevent DDoS attacks and keep traffic comfortably within theoretical limits. Size of the client base, general market demand, order flow (which is impacted heavily by price volatility and trading activity elsewhere), and performance under load (since beyond a certain level of service degradation, clients would start throttling their own requests) all affect these limits.\nHere we’ve illustrated the over 4x improvement in our maximum observed throughput between Q1 2021 and Q1 2023. This change is a move from 250k requests/min to over 1mm requests/min, and there is significant headroom left between this level and our dramatically improved theoretical maximum throughput.\n\nThis year, we made efforts to minimize downtime due to planned maintenance, reduce the frequency and impact of unscheduled downtime, and increase the velocity of feature updates and performance improvements without negatively impacting uptime.\n\nThese changes included both technical and operational improvements, such as an increasingly mature and large operational resilience team which operates 24/7.\nWhile uptime for our worst month in 2021 was close to 99%, these improvements have allowed us to set increasingly aggressive error budgets and a trading uptime target of 99.9+%.\nWe have made increasing use of a blue/green deployment strategy across our API gateways and many internal services. You can see a very simplified illustration of this is highlighted in Figure 6. By operating multiple fully-fledged code stacks in parallel, we can deploy features without disturbing the main stack which is currently receiving client traffic. Afterward, traffic can be re-routed to the new stack, leading to a zero-impact deployment, or a very quick rollback procedure should anything go wrong. Furthermore, for our many services which operate multiple instances for purposes of load balancing, updates to these instances happen on a rolling basis rather than all-or-none. These approaches now allow us to conduct zero-impact, and more frequent updates, to the vast majority of our tech stack.\n\nKraken heavily leverages Infrastructure as Code (IaC) with Terraform and Nomad, in large part to guarantee consistency of all code deployments as well as repeatability. We automate our Terraform repositories with continuous integration and continuous delivery so we can roll changes out quickly and reliably. For the past two years, we have deployed new infrastructure using IaC and nearly all of our infrastructure today uses this pattern. This move was a major milestone and we leverage IaC for both cloud-based and on-premise applications.\nWe leverage private connectivity between AWS and our on-premise data centers. This connectivity allows Kraken to guarantee we have the lowest possible latency, highest possible security, and redundant paths to make sure we can reach out to AWS at all times. Recent networking and routing improvements have enabled a significant part of the baseline round-trip trading latency reduction highlighted above.\nFine-grained and accurate logging, metrics, and request tracing have allowed us to quickly identify, diagnose, and resolve any unexpected bottlenecks and performance issues in real-time. Beyond this telemetry and our own competitive monitoring, we’ve also recently updated our API latency and uptime metrics on status.kraken.com with external monitor deployments to, in general, more accurately reflect these numbers as experienced by clients.\nAt any given moment, our APIs and trading stack support tens of thousands of connections trading algorithmically through our Websockets or REST APIs. Hundreds of thousands more connections come from our UI platforms, including our new high-performance Kraken Pro platform. While these platforms reap many of the same core trading infrastructure benefits described in this post, the workloads are fundamentally different and have different requirements. Bespoke API deployments to support our UI platforms, with specific data feeds, compression, throttling, aggregation, etc have allowed us to further improve speed and reduce wasted bandwidth, and therefore increase overall client capacity.\nWe have made a range of further, dramatic improvements across the stack through re-engineering core services in Rust and C++. These changes make increased use of asynchronous messaging and data persistence where possible and help us build robust performance profiling into more of our CI/CD pipelines. They also lets us employ best known methods for static and dynamic code analysis. Several of these improvements have culminated in the matching engine’s average latency dropping from milliseconds to microseconds. This a more than 90% improvement vs two years prior, while supporting over 4x the throughput.\n\nWe’ll also soon be launching our native FIX API for spot market data and trading. FIX, which stands for Financial Information Exchange, is a powerful and comprehensive but flexible industry-standard API that many institutions use for trading equities, FX, and fixed income at a massive scale. It’s a trusted and battle-tested protocol, with broad third party software and open source support, making it easier and quicker for institutions to integrate with Kraken and begin trading.\nKraken’s native FIX API also comes with architectural nuances and benefits relative to our Websockets and REST APIs, including session-based cancel-on-disconnect, guaranteed in-order message delivery, session recovery, and replay. Our FIX API is currently in beta testing — reach out if you’d like to help kick the tires!\nWe’ve made significant inroads on the frequency of zero-impact deployments of API gateways and various backend services (authentication, audit, telemetry, etc.). Material updates to our matching engine, though, still require scheduling maintenance and brief downtime, which we carry out roughly biweekly.\nHowever, our team underwent a significant effort to re-engineer some of our internal messaging systems with multicast technology, making use of Aeron, an extremely performant and robust suite of tools for fault-tolerant high availability systems. The result of this will be zero-downtime planned deployments across the trading stack, available later in 2023.\nPlease reach out to our account management and institutional sales teams using the email address [email protected] to learn more about any of these updates, to discuss how to optimize your trading connectivity, or to beta test forthcoming features like our FIX API.\nInterested in helping to scale Kraken for the next decade of growth? Check out our careers page.\nNeed more proof? Keep an eye out and subscribe to updates on status.kraken.com for any planned maintenance, service information and latency and uptime statistics.\n","create_date":"2023-04-06T17:48:32+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/uncategorized/hv-mtl-and-5-boro-bodega-x-reddit-collectible-avatars-added-to-kraken-nft","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that we have added two new NFT collections to Kraken NFT for our clients to explore, collect and trade.  After revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas […]","title":"HV-MTL and 5 Boro Bodega x Reddit Collectible Avatars added to Kraken NFT","content":" We’re thrilled to announce that we have added two new NFT collections to Kraken NFT for our clients to explore, collect and trade.\nAfter revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*\nWe will continue to add a wide range of new NFT collections every week — from the hottest profile picture communities to the latest gaming experiences — across the Ethereum, Solana and Polygon blockchains.\nCheck out these collections on Kraken NFT.\nYour opinion will help shape Kraken NFT as we expand across the global NFT market. Please check out our Support Center for any FAQs about using the marketplace, or contact Kraken Support for 24/7 assistance.\nIf you’re new to the world of NFTs, you can check out our Kraken Learn Center article, What is an NFT? to discover what all the excitement is about.\nIn addition to these latest NFT collections that have just been added, you can also browse the full list of all 250+ NFT collections available for you to explore, collect and trade on Kraken NFT.\nFollow the Kraken Blog and our @KrakenNFT social account to be the first to know when we add new features and NFT collections.\nThat’s right, we launched a new Twitter account for all things NFTs! Follow us on Twitter at KrakenNFT to be the first to know about all of the exciting things happening on Kraken NFT.\nYes! But our policy is to never reveal any details until shortly before launch — not even which NFTs we are considering. All of the NFTs available on Kraken can be found on our website, and all future NFTs will be announced on Kraken NFT’s Twitter. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nSpecific asset availability and liquidity are not guaranteed. When Kraken makes an NFT collection available for trading, it’s not a recommendation to buy, sell, or participate in the associated collection. Do your own research and invest at your own risk.\n*Gas fees will be incurred when transferring NFTs and other cryptoassets on and off the Kraken platform.\n","create_date":"2023-07-13T12:19:02+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-one-of-newsweeks-2023-top-100-american-most-loved-workplaces","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken is proud to announce that we have made Newsweek’s Top 100 American Most Loved Workplaces list. This recognition reflects our ongoing commitment to providing a flexible workplace that prioritizes well-being and career development. Newsweek’s rankings, backed by the rigorous analysis of the Best Practice Institute, are based on survey results of more than two […]","title":"Kraken one of Newsweek’s 2023 Top 100 American Most Loved Workplaces","content":" Kraken is proud to announce that we have made Newsweek’s Top 100 American Most Loved Workplaces list. This recognition reflects our ongoing commitment to providing a flexible workplace that prioritizes well-being and career development.\nNewsweek’s rankings, backed by the rigorous analysis of the Best Practice Institute, are based on survey results of more than two million employees from different industries and company sizes. Newsweek publishes its annual list of the Top 100 American companies that build their business models around respect, care and employee appreciation.\n“Company culture and workplace practices are hot-button topics in corporate America. We’re proud to be paving the way by offering an alternative operating model that allows our Krakenites to excel while also loving the work they do,” said Pranesh Anthapur, Kraken’s Chief People Officer. “We’ve built an innovative, world-class workplace with a focused company mission that rallies our Krakenites, while also offering flexibility and autonomy, empowering them to succeed.”\nWhat makes Kraken such a great place to work? In addition to compelling career growth and learning opportunities, we offer holistic health and wellness benefits. These include truly flexible PTO practices, access to in-house fitness and well-being coaches, as well as a generous grant to build a customized in-home office.\nKrakenites are also invested in the success of the company and the broader industry. Nearly 40% receive a part of their salary in digital assets and many of our roles come with company share options included in the compensation package.\nReady to join the revolution? Find your role at Kraken today!\n","create_date":"2023-09-20T16:02:42+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/expanded-margin-pairs-available-for-near-and-sei","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken now supports new margin pairs for NEAR Protocol (NEAR) and Sei network (SEI)! Margin trading is now available using the below pairs for NEAR and SEI:  Pair base Pair name Available leverage Long Position Limit  Short Position Limit NEAR NEARUSD 3 8000 10000 SEI SEIUSD 3 40000 45000 Here’s what you need to know […]","title":"Expanded margin pairs available for NEAR and SEI!","content":" Kraken now supports new margin pairs for NEAR Protocol (NEAR) and Sei network (SEI)!\nMargin trading is now available using the below pairs for NEAR and SEI:\nNEAR Protocol (NEAR) is a cloud-based computing platform for Web3 and decentralized applications (dApps). The protocol’s community-operated cloud infrastructure and novel sharding architecture allow developers to create interoperable and scalable applications. NEAR is the native token of the platform which is used to pay for network transaction fees and earn rewards for helping secure the protocol via staking.\nSei Network (SEI) is a Layer 1 blockchain developed on Cosmos that aims to provide a next-generation DeFi infrastructure. Utilizing Centralized Order Books (CLOB), Sei Network facilitates dApp integration and access to liquidity within the Cosmos ecosystem. SEI validators can choose to accept other Comos ecosystem approved tokens for gas payment based on network governance. The SEI token allows users to pay for gas fees and also functions as the protocol’s governance token.\nYes! But our policy is to never reveal any details before launch – not even which pairs we are considering. All of Kraken’s listed margin pairs are available on our website. Our client engagement specialists cannot answer any questions about which pairs we may be listing in the future.\nThere is no guarantee that a limit order will execute. There is no guarantee of margin pool availability at all times. There is also no guarantee of a market order executing at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nOffering margin trading on an asset or token is not a recommendation to buy, sell or participate in the associated network. Do your own research and invest at your own risk.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-01-05T16:27:01+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/in-markets-this-time-is-almost-never-different-this-bitcoin-halving-is-different","web_url":"https://blog.kraken.com/","type":"article","description":"Bitcoin is about to experience its fourth halving, when the block reward for miners is cut in half. This time, it’s going from 6.25 bitcoins to 3.125 bitcoins. That means that every day, all of the Bitcoin miners in the world will be competing for just 450 new bitcoins.","title":"In markets, this time is almost never different. This Bitcoin halving is different.","content":" Guest blog by Nathaniel Whittemore (NLW) NLW is the host of Coindesk’s The Breakdown – the fastest-growing podcast in crypto. Whittemore has been a VC with Learn Capital and was on the founding team of Change.org\nThe views and opinions expressed in this article are those of the author and do not necessarily represent the views or opinions of Kraken or its employees.\nEach Bitcoin halving is the same in that they all reduce the block mining award by half. This common dynamic has led to similar patterns of BTC trading following past halvings.\nStill, the current narrative surrounding Bitcoin – along with the structural forces driving the BTC market – are unique this time around.\nIn the lead-up to every previous halving, the main question was whether Bitcoin would survive at all. If there was a previous bull cycle, was it a fluke? Was the last all-time high just a speculative mania before a crash to zero? By a large margin, the consensus across financial markets is that Bitcoin is here to stay as an asset class.\nFollowing SEC approval, several Wall St. firms are now offering Bitcoin ETFs. Global regulatory schemes are being rolled out. The Bitcoin network has been cryptographically securing value for 15 years and Kraken celebrated its 12th anniversary.\nThis is an industry building on a solid foundation. Markets are beginning to understand that Bitcoin is a permanent technological advance – a monetary innovation that can’t be undone.\nWith increased credibility has come increased institutional confidence and understanding. Hedge funds and asset managers aren’t being taken by surprise by the halving. During the last halving, in May 2020, there was very little interest in Bitcoin until Paul Tudor Jones began singing its praises.\nThe legendary hedge fund manager warned about currency debasement and called Bitcoin “the fastest horse in the race.” That was the week before the last halving.\nThe bull market that ensued was frenetic but it got off to a relatively slow start. It took Bitcoin six months to double following the halving. Traditional investors still openly scoffed at the idea of adding Bitcoin to a diversified portfolio.\nHeading into this halving, and especially with the debut of 11 BTC ETFs, institutional investors are pouring billions into Bitcoin. They’re not waiting around until after the halving to see if Bitcoin is real. Allocations are being bought in anticipation. Putting Bitcoin on a corporate balance sheet is no longer a weird gimmick, it’s now a viable treasury strategy.\nThe biggest reason that this halving is different is the Bitcoin price. Bitcoin is already up 300% from its sub-$16,000 price in November 2022 at the depth of crypto winter.* We head into the halving close to its all-time high, a level that has never coincided with a halving before. Not even close.\nFollowing the previous two halvings it took Bitcoin seven months to reach new all-time highs. The halvings themselves were anticlimactic. Each time, Bitcoin remained stubbornly stagnant immediately afterward while everyone wondered if another bull market would ever arrive. This time around, Bitcoin has been rallying for several months already.\nEach halving is much less impactful on the Bitcoin market in terms of supply reduction than the previous one. When Bitcoin went through its first halving in 2012, less than half of the Bitcoin supply had been mined. The block reward was cut from 50 bitcoins to 25 bitcoins. Bitcoin went from adding 25% to its annual supply to 12.5%, overnight.\nDuring this halving, the vast majority of the Bitcoin that will ever exist has already been produced. Just 1.7% annually is added to the total bitcoin supply. But reducing that rate to 0.85% is a watershed event, as there will now be a larger percentage of gold added to the total gold supply every year than there will be bitcoin added to the bitcoin supply.\nAnnually, newly mined gold adds 1% or more (3% was added in 2023) to gold’s total supply. So even gold – once the global standard for store of value due to its scarcity – joins the long, long list of assets with more value-diluting supply inflation vs. Bitcoin. No other asset – none – has a perfectly finite supply. There will never be more than 21 million bitcoins.\nFor the first time before a halving, Bitcoin is widely available via ETF and increasingly accepted as a new, permanent asset class. Traditional finance has only just begun to buy bitcoin. Bitcoin’s market cap trades at a tiny fraction – around 8% – of gold’s, even though it’s a demonstrably superior store of value. The new supply added annually to existing Bitcoin will be cut to a trickle, just 0.85%.\nAs we move into an era in which $300T of professionally managed tradfi AUM begins to adopt Bitcoin as a permanent asset class – just as its newly minted supply dwindles toward zero – there’s every reason to believe we are much closer to the very beginning of the Bitcoin revolution than the end.\n*Past Performance is not a reliable indicator of future results.\nInvesting in crypto assets is risky and each token can have its own set of risks. Below is a list of risks that generally apply to all crypto assets:\nVolatility: The performance of crypto assets can be highly volatile, with their value dropping as quickly as it can rise. You should be prepared to lose all the money you invest in crypto assets.\nLack of protections: Crypto asset investments are unregulated and neither the Financial Services Compensation Scheme (FSCS) nor the Financial Ombudsman Service (FOS) will assist or protect you in the event that something goes wrong with your crypto asset investments.\nLiquidity: Some crypto asset markets may suffer from low liquidity, which could prevent you buying or selling your crypto assets at the price that you want or expect.\nComplexity: Specific crypto assets may carry with them specific complex risks that are hard to understand. Do your own research, and if something sounds too good to be true, it probably is.\nDon’t put all your eggs in one basket: Putting all your money into a single type of investment is risky. Spreading your money across different investments makes you less dependent on any one to do well.\n","create_date":"2024-04-18T16:07:56+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/opinion-why-there-will-never-be-another-bitcoin","web_url":"https://blog.kraken.com/","type":"article","description":"On October 31, 2008, an unknown coder named Satoshi Nakamoto published a paper that laid the foundation for an entirely new monetary system – 15 years later, the world is only just catching on to its true value and potential.","title":"Opinion: Why there will never be another Bitcoin","content":" By Pete Rizzo, Kraken Editor at Large\nPete Rizzo is a leading Bitcoin Historian and author of over 2,000 articles on cryptocurrency. He is also an Editor at Bitcoin Magazine.\nThe views and opinions expressed in this article are those of the author and does not necessarily reflect the views of Kraken or its management. This opinion is not investment advice.\nBitcoin wasn’t created out of thin air. Decades of prior electronic cash projects failed, but each one built on the incremental progress the others had made. Bitcoin was the culmination of this process, a triumph shared by an entire scientific community.\nSome predecessors, like DigiCash, were too reliant on trusted authorities and so never gained market acceptance. Others, like HashCash, created working currencies backed by computer networks, but couldn’t hold value over time.\nFinally, there were horror stories like Liberty Reserve, where the operators of working e-currencies were outright arrested and jailed for their work.\nAll of these projects shared a common aim – to disrupt the government’s monetary monopoly and create a viable internet currency free from central control.\nMany in the digital assets space agree that Bitcoin has achieved all of the above – and this makes it incredibly unlikely Bitcoin will ever be outcompeted by a government or private market alternative.\nTogether, these accomplishments represent a value proposition that exceeds the sum of its parts. Even among thousands of cryptocurrencies, Bitcoin remains unique.\nSatoshi’s stroke of genius was the decision to use a prior invention called proof-of-work (PoW) to distribute bitcoin to any user willing to secure the network with computing power.\nTo issue new bitcoins, Bitcoin users compete to solve mathematical puzzles using computer equipment, validating their work by expending electricity and resources. In return, they receive newly minted BTC in a process referred to as mining.\nThis distribution created a level playing field and fostered a global community.\nCrucially, this system meant Nakamoto didn’t need to sell, issue or market bitcoins. In 2011, he even turned over the operation of Bitcoin’s software to an open-source developer community, none of whom he paid directly, or that received any form of financial compensation.\nUsers earned bitcoins by offering a service to the protocol, trading energy for ownership, or by trading with each other directly. This design ensured that work was required to receive Bitcoin.\nBitcoin’s success was about more than creating a new money; it was about creating a system to distribute value in a way that couldn’t be gamed and that didn’t unfairly advantage any user. Even Satoshi mined all the Bitcoin he received, just like everyone else.\nToday Bitcoin’s issuance remains a fair contest, but that is not the case for the many alternative cryptocurrencies circulating, which are still searching for an alternative to PoW.\nMany of them allocate the scarce data within their networks disproportionately, often via insider sales. This provides these advantaged users the ability to accrue more of the currency or to have a direct say in both the network’s development and economic policies.\nBitcoin is free from these fairness and manipulation concerns.\nAt its core, Bitcoin is a system of rules for governing a global, distributed database that tracks the ownership of the data within its economy.\nFor the network to operate effectively, many participants must retain and sync their copies of the database and agree that those copies are without discrepancies. Otherwise, like the electronic currencies of old, there is a risk that a user might be able to allocate data they don’t own or didn’t earn – fraudulently creating new coins and issuing them into circulation.\nEvery Bitcoin competitor faces a problem: There is a direct relationship between the size of the database and the ability of network users to maintain their own copy of that database.\nBitcoin makes thoughtful tradeoffs to keep this critical functionality accessible. You can think of every blockchain network as consisting of three types of actors:\nAs with any cryptocurrency, these essential functions have barriers to entry. Crucially, however, Bitcoin’s barriers are not the product of the protocol, but of market forces. Any user who wants to secure the database can do so by finding access to electricity and computing power. Any user who wants to verify the database can do so by downloading and storing its ledger.\nBoth activities are influenced only by the market for computing resources.\nOther cryptocurrencies add features that increase the cost of executing these functions. Some allocate the ability to determine their cost to specific users, allowing the users that secure the database to dictate that their peers hold a certain amount of the cryptocurrency, or to meet some other criteria they dictate in order to receive the cryptocurrency.\nThese sacrifices tend to reward wealth and influence – similar to government-run economies where the supply and distribution of money is not governed by market forces, but by a small number of individuals. Bitcoin, again, is free of these compromises.\nProperty rights are defined as the exclusive right of an individual or organization to use, manage and dispose of a resource that they earned through their labor at their own discretion.\nWhile this may be intuitive to anyone living in a country that protects these rights, not everyone around the world is entitled to them. In some countries, even democratic ones, governments can freeze the bank accounts of individuals by using (or abusing) the legal system.\nThis is another dilemma common to other cryptocurrencies. It is possible to add features to any cryptocurrency, or to change the rules, altering the allocations of ownership by forcing users to download a new, incompatible software.\nBitcoin relies on making backwards-compatible upgrades to its software. This means that its developers prioritize changes that do not force users to upgrade. Users can run any software that is compatible with the Bitcoin network without sacrificing functionality (though this may come at the cost of security).\nOther cryptocurrencies often introduce incompatible changes to their software, where those who dissent from the change may no longer be able to enjoy the same benefits as others. Should you choose to reject the upgrade, your coins may not be accepted within the economy.\nDevelopers may measure user opinion when proposing incompatible softwares, but, ultimately, every user is at the mercy of the majority of other users.\nWith Bitcoin, minority groups can stick with the older version, keeping their Bitcoin and its value intact, though they face security trade-offs. This allowance for differing opinions sets Bitcoin apart as a champion of property rights.\nAs long as you hold the private keys to your Bitcoin, you are guaranteed ownership over these coins. As long as you are running any Bitcoin-compatible software, you can be sure you will be able to transact with those keys within the Bitcoin economy. Likewise, you can be sure there will never be more than 21 million Bitcoins.\nAll money is based on a social contract. Users agree to exchange their labor for a medium that they can use to freely acquire products and services at a later date.\nMonetary history has been dominated by two types of systems, both with different kinds of social contracts.\nBitcoin is a market-based money, and it has all the characteristics that determine money:\nBecause of its fair launch, open network, and strong property rights, Bitcoin’s monetary policy isn’t just fixed, it’s credible. Users can be assured it will remain unchanged, unless all of its millions of users agree on the change, however unlikely.\nOther cryptocurrencies, by contrast, offer variable monetary policies, with less credibility.\nSome change so often they are not dissimilar from government-managed monies, whose value can be subject to the whims of politics. Like central banks, they control the money supply and take actions that aim for price stability and economic growth.\nOthers have no limits on their issuance, undermining their credibility.\nLikewise, global central banks use monetary policy tools to control the supply of their national currencies. As the Federal Reserve has shown, these institutions are vague about when and why these rates change. Often only insiders aid in the decision making. Those using stablecoins, dollar-backed crypto assets, or some formal form of central bank digital currency (CBDC), similarly, are only opting into this existing system.\nWhile the above qualities lay a strong foundation for Bitcoin, these attributes alone aren’t enough to ensure it will never be replaced by an alternative. This is why its last attribute is perhaps the most important: Bitcoin’s ability to change and improve.\nIt appears unlikely Bitcoin can scale to provide its benefits to the world’s eight billion people as constructed. Work needs to be done to develop additional, transactional layers that can expand Bitcoin’s foundational capacity – without sacrificing its core value propositions.\nIn the past year alone, Bitcoin developers have achieved feats never before thought possible, without changing the core code, unlocking Turing-complete smart contracts as well as new ways to transform bitcoins into non-fungible tokens.\nThe ability of Bitcoin users to successfully implement compelling new features makes existing crypto networks that offer similar functionalities redundant.\nIn an expanding sea of competing cryptocurrencies and government-managed monies, with diverse and ever-changing policies, Bitcoin stands alone.\nInvesting in crypto assets is risky and each token can have its own set of risks. Below is a list of risks that generally apply to all crypto assets:\nVolatility: The performance of crypto assets can be highly volatile, with their value dropping as quickly as it can rise. You should be prepared to lose all the money you invest in crypto assets.\nLack of protections: Crypto asset investments are unregulated and neither the Financial Services Compensation Scheme (FSCS) nor the Financial Ombudsman Service (FOS) will assist or protect you in the event that something goes wrong with your crypto asset investments.\nLiquidity: Some crypto asset markets may suffer from low liquidity, which could prevent you buying or selling your crypto assets at the price that you want or expect.\nComplexity: Specific crypto assets may carry with them specific complex risks that are hard to understand. Do your own research, and if something sounds too good to be true, it probably is.\nDon’t put all your eggs in one basket: Putting all your money into a single type of investment is risky. Spreading your money across different investments makes you less dependent on any one to do well.\n","create_date":"2024-04-19T13:12:31+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-jito-jto-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Jito (JTO) is now available on Kraken! Funding and trading JTO funding and trading are live. Add JTO to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit JTO on Solana. Deposits using other networks will be lost. Got JTO and a Kraken account? […]","title":"Trading for Jito (JTO) starts now","content":" We’re thrilled to announce that Jito (JTO) is now available on Kraken!\nJTO funding and trading are live. Add JTO to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit JTO on Solana. Deposits using other networks will be lost.\nGot JTO and a Kraken account? ⤵️\nJTO is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nJito (JTO) is a liquid staking platform on the Solana blockchain, enabling users to stake their SOL tokens in exchange for JitoSOL, a token representing both staking and MEV (Maximum Extractable Value) rewards. JTO is Jito’s governance token, which grants holders a say in the protocol’s strategic decision making process and future evolution per the guidelines set by the Jito Foundation Constitution.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-21T16:45:44+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/introducing-kraken-institutional","web_url":"https://blog.kraken.com/","type":"article","description":"Today, Kraken is officially launching Kraken Institutional, a comprehensive crypto solution that offers institutions all they need to engage in the digital asset class.","title":"Introducing Kraken Institutional","content":" By Tim Ogilvie, Global Head of Institutional\nIn crypto, there’s no substitute for experience. Institutions need a dedicated and experienced partner: one that’s innovative and flexible enough to offer solutions that suit the growing needs of institutions as they adopt, manage and scale their crypto practices.\nThat’s where Kraken Institutional comes in. Made up of one of the world’s most experienced cryptocurrency teams, Kraken Institutional is a new brand that brings together Kraken’s existing products and services tailored specifically for institutions to trade, stake and custody crypto.*\nKraken has a reputation, built up over 10+ years, as a safe and reliable exchange partner. Those who already work with us know how we’re driven to offer the best experience via our trade execution, breadth of technical integrations, debt solutions or through the deep expertise and commitment to ensure our clients can trade at velocity.\nKraken has a history of crypto innovation. We built out one of the most comprehensive OTC offerings and best-in-class staking solutions* available in the space today. Indeed, Kraken is the market leader when it comes to latency and the quality of our marketplace. Kraken Institutional deepens that commitment, providing a one-stop-shop for institutions that need reliable, scalable and easy to integrate crypto solutions.\nKraken Institutional is set for an exciting 2024. Backed by a seasoned team, we will deliver an exciting product suite this year, including a qualified custody** solution that will launch later this year.\n* Geographic restrictions apply. Staking not available in the US and certain other geos.\n** Custody services provided by Kraken Financial, a Wyoming-chartered Special Purpose Depository Institution. Kraken Financial is not an FDIC-insured bank and deposits are neither insured by nor subject to the protections of the FDIC.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any crypto asset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular crypto asset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the crypto asset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-02-27T14:40:39+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/industry-news/kraken-execs-talk-u-s-crypto-regulation-at-blockchain-association-policy-summit","web_url":"https://blog.kraken.com/","type":"article","description":"“This industry is a nonpartisan issue.” So declared U.S. House of Representatives Majority Whip Tom Emmer (R-MN) at the Blockchain Association Policy Summit, Nov. 29-30, in Washington, D.C. He joined Kraken Chief Legal Officer Marco Santori for a fireside chat, the first of two panels to feature executives from our platform.","title":"Kraken execs talk U.S. crypto regulation at Blockchain Association Policy Summit","content":" The intimate conversation between two prominent crypto-sector thought leaders provided a comprehensive snapshot of how far the U.S. financial technology regulatory discussion has come. Its tone resonated through following panels with other influential crypto policy experts including SEC Commissioner Hester Pierce, CFTC Commissioner Kristin Johnson, Senators Cynthia Lummis (R-WY) and Kirsten Gillibrand (D-NY), Representative Ritchie Torres (D-NY) and others.\nEmmer reflected on the evolution of the discussion in D.C, highlighting the 2021 Infrastructure Investment and Jobs Act as the pivotal moment when lawmakers recognized both crypto’s innovation potential and its strong support among American voters.\n“We had worked hard to get Congress to pay attention, but it wasn’t until that bill that this grassroots group [was] activated. That was years of growth in a short period of time,” he said.\nEmmer emphasized the nonpartisan nature of crypto industry advocacy since the bill’s passage, citing the significant progress made with the Clarity for Payment Stablecoins Act of 2023. He asserted that the voice of crypto is gaining traction, transcending political divides.\nTom Emmer and Marco Santori at the Blockchain Association Policy Summit\nSantori led a frank discussion on U.S. governmental attempts to curtail private sector innovation by increasing regulatory controls.\n“The central bank mismanaged our financial system. That’s why crypto exists,” Emmer said. “Then, people started trying to snuff out innovation; you can’t, it’s coming, it’s here already.”\nEmmer also described support for central bank digital currencies (CBDCs) as misguided. “It’s nothing more than a surveillance tool if they can’t make it open, permissionless and private. Which they can’t.”\nHe pointed out that Congress is the branch of government Constitutionally empowered to regulate these matters, cautioning against granting unchecked authority to agencies or waiting for court decisions to establish market structure. He stressed that the ultimate job of Congress is to protect the rights of citizens through common sense legislation.\nElsewhere at the conference, Kraken’s Global Head of Tax Michael Nydegger led a panel of tax experts that included CoinTracker COO Vera Tzoneva and Coinbase Vice President of Global Tax Lawrence Zlatkin. Nydegger said the latest proposed IRS broker regulations are “completely unworkable.” He explained the original, narrow mandate of the change to the broker reporting rule adopted by Congress: to close a perceived tax gap and help fund the aforementioned 2021 Infrastructure Investment and Jobs Act. Nydegger said that as currently written, the proposed, sprawling Treasury regulations enacting Congress’ change would overburden an entire industry.\nNydegger noted that companies like Kraken are best situated to implement the sort of legislation Congress originally intended.\n“With the way we enforce know-your-customer controls and gather data about our customers, we are in a position to be able to comply with this kind of rule,” he said. “When moving to the decentralized space, the rules would require systems [that] don’t even exist.”\nWhen asked about ways to improve the rule, the panelists agreed that tax reporting could be better solved at the blockchain level or by using the information on smart contracts recorded on blockchains. All agreed that the timeframe proposed to implement the rule was incredibly short for the kind of systems and data reporting that the rule would require.\nThe panel agreed that the proposed rule’s challenges would create excessive, inaccurate and duplicative documentation. Taxpayers might have to sort through dozens of tax reporting forms to figure out what taxes they owe on crypto trades. The IRS systems would also have to be developed to ingest the massive amount of information required under the proposed regulations.\nThe panel agreed that a more phased or measured implementation focused in the right places would have made more sense. All expressed hope that industry recommendations would lead to thoughtful adjustments before the rule is finalized.\nOverall, the conversation throughout the conference echoed Rep. Emmer’s optimistic tone.\nMany noted the joint effort by both the House Financial Services Committee and the House Committee on Agriculture to define key questions about crypto market structure and regulation, a foundational requirement so the United States can remain globally competitive in the industry.\nHigh-profile message bearers all noted the progress crypto market participants have made to raise concerns and influence change. Most credited the industry for creating jobs and promoting innovation, noting the urgency to protect these priorities alongside consumer interests as U.S. regulation comes into focus.\nRegardless of the current state of politics, crypto’s advocacy efforts were repeatedly lauded by regulators and attendees alike for improving Congressional understanding of this emerging technology and its potential in the global economy.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-06T18:33:18+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/why-liquidity-is-an-important-metric-in-crypto-markets","web_url":"https://blog.kraken.com/","type":"article","description":"Some exchange measures – like liquidity – have a direct impact on the client experience and enhance marketplace resilience","title":"Why liquidity is an important metric in crypto markets","content":" Trading volume has long been the default metric cited by analysts, media pundits and aggregators to rank cryptocurrency exchanges. While volume provides a high-level overview of marketplace activity, it can be faked to create the impression there’s more legitimate trading activity on a marketplace than there really is.\nThe exchange can simply print non-existent trades or they can incentivize clients to engage in wash trading (the placement of buy and sell orders in the same size at the same price that instantly cancel each other out, creating additional exchange trade volume that adds no actual liquidity). Volume can be abused as a vanity metric that doesn’t offer a meaningful indicator of a legitimate trader’s expected experience.\nThink of liquidity as the speed and ease with which orders are filled without impacting an asset’s spot price. As a metric, it tells participants how easy it is to execute trades either at or close to the current market price.\nAcross the various market health metrics that Kraken monitors, we use six to track exchange liquidity:\nThe price difference between the highest bid (price a buyer is willing to pay) and lowest ask (price a seller is willing to take). Tighter spreads make for better trading because they mean a lower cost of trading (beyond just fees) and represent a better consensus on an asset’s current market value.\nThe relative size and number of open bids and asks at any one time. Marketplace depth means new orders can be more readily filled, reducing impact to the trading price.\nThe degree marketplace depth varies across a given time period, but particularly during distressed market conditions. High order book stability means orders have a consistent level of market impact. This is particularly important when volatility is high.\nThe comparative size of bids and asks at a given depth. Imbalances (e.g., much larger sized bids than asks) create unstable directional liquidity, leaving an asset price susceptible to high volatility in one direction.\nThe market order cost measured by taker fees. Setting taker fees at the right level ensures market orders can be placed at the optimum opportunity cost.\nThe speed at which exchanges update market prices relative to other exchanges. Minimal price dispersion means traders can act promptly on new price information.\nHigh liquidity saves time and money. Like an actual physical marketplace, transactions occur swiftly and seamlessly if there are plenty of buyers and sellers. On the flipside, illiquid marketplaces incur an opportunity cost: transactions take longer to fill and get executed at less favorable prices.\nBecause of this, liquidity also encourages trading activity… which leads to more order flow… which creates still more liquidity: a virtuous cycle. Low liquidity can create a higher execution risk that discourages clients from trading on the platform, further lowering liquidity.\nAs a metric, liquidity speaks to the quality of the trading experience: It’s self-evident to the client whether a marketplace is liquid or not. If exchanges were ranked by liquidity, there’d be no benefit to venues printing fake trades or inducing clients to wash trade.\nThere would be no point to artificially inflating nominal volume numbers. The focus would be on aligning incentives between the exchange and the end user.\nConsider liquidity as a byword for marketplace resilience. In an illiquid market, orders have a significant price impact, which discourages legitimate trading activity. Illiquidity also provides opportunities for bad actors to manipulate prices with high-volume orders around one depth or price point.\nRegulators have previously expressed concern that crypto prices are too easily swayed by whales. In a liquid marketplace, large orders are more easily absorbed, preventing disruptive market impacts.\nEmphasizing liquidity over trading volume would directly incentivize exchanges to offer a better practical trading experience to attract new clients. Wider awareness of these dynamics will yield a healthy, flourishing ecosystem and marketplaces that clients can confidently and efficiently navigate.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-04-22T10:56:59+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/new-analytics-widgets-on-kraken-pro-elevate-your-trading-strategy","web_url":"https://blog.kraken.com/","type":"article","description":"In the ever-evolving world of crypto trading, staying ahead requires having the right tools at your disposal. Kraken Pro is thrilled to unveil 11 new analytics layout widgets, designed to enrich your trading interface with deeper market insights.","title":"New analytics widgets on Kraken Pro: Elevate your trading strategy","content":" These widgets not only offer advanced analytics for both spot and futures markets, they also seamlessly integrate with existing Trade and Portfolio widgets. Open up new avenues for discovering opportunities and finding alpha; enhance your trading like never before.\nOur commitment to your trading experience brings you a suite of widgets catering to a wide array of analytical needs. Whether you’re looking to gauge market sentiment with the Aggressor Ratio, monitor market activity through Trade Count or make informed investment decisions with Volatility and Volume, our latest additions provide comprehensive market data at your fingertips.\nTailor your analytics view to your trading strategy with our customizable, real-time-updating widgets. With flexibility to drag, drop and resize – along with period selectors from one minute to one week – these widgets integrate seamlessly into your custom trading layout. They dynamically update with your selected market, ensuring data relevance and timeliness.\nCombine the Volume and Volatility widgets with Market Chart, Order Book and Order Forms for a layout that offers quick insights into market movements. Add Trade Count to monitor intraday high-frequency trading activity levels.\nFor those focusing on medium-term strategies, integrating Aggressor Ratio and Futures Premium widgets with a Depth Chart and Price Alerts can provide a deeper understanding of market sentiment and potential price breakouts.\nTraders looking for arbitrage opportunities might find a layout combining Spread (for futures markets), Order Book Analytics and Volume widgets invaluable. These can be used alongside Market Chart and Order Forms to quickly spot and act on price discrepancies between markets or pairs.\nIncorporating Liquidation Volume and Long/Short Ratio widgets with Funding Rate and Open Interest allows clients to assess market risk and leverage positions more effectively. Pair these with Price Alerts and Order Book to maintain a close watch on your trades and market conditions.\nBy integrating the new analytics widgets with Kraken Pro’s customizable layout tools, clients can unlock a plethora of trading strategies tailored to both spot and futures markets. This cohesive approach not only enriches your trading experience but also equips you with the insights needed to navigate the crypto markets with confidence and precision.\nExplore new possibilities, customize your interface and leverage these powerful tools to enhance your trading strategy!\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the crypto-asset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-03-20T14:21:31+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-polygon-ecosystem-token-pol-starts-now-in-canada","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Polygon Ecosystem Token (POL) is now available on Kraken for residents of Canada! Funding and trading POL funding and trading are live. Add POL to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit POL on Polygon. Deposits using other networks will be lost. […]","title":"Trading for Polygon Ecosystem Token (POL) starts now in Canada","content":" We’re thrilled to announce that Polygon Ecosystem Token (POL) is now available on Kraken for residents of Canada!\nPOL funding and trading are live. Add POL to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit POL on Polygon. Deposits using other networks will be lost.\nGot POL and a Kraken account? ⤵️\nPOL is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nPolygon Ecosystem Token (POL) is a multi-chain scaling solution for the Ethereum blockchain. Polygon is a Layer 2 scaling solution for Ethereum that aims to improve the speed and reduce the cost and complexities of transactions on its network. Polygon uses sidechains to help with off-chain computation while maintaining security and uses a decentralized network of proof-of-stake (PoS) validators. POL is an upgrade and renaming of the MATIC token. Switching to POL tokens enhances tokenomics and governance rights, allowing stakeholders greater involvement in decision-making and shaping the platform through community initiatives.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\nPayward Canada Inc., operating as Kraken, has filed an application for registration in certain Canadian jurisdictions but has not yet obtained registration. Until such time as Payward Canada Inc., operating as Kraken, obtains registration, Payward Canada Inc. has agreed to abide by the terms of an undertaking available at the following page: https://www.securities-administrators.ca/wp-content/uploads/2023/04/20230324-Kraken-PRU-publication-version.pdf.\n","create_date":"2024-02-08T12:15:37+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-launches-virtual-asset-service-provider-vasp-services-in-belgium","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken has launched VASP services in Belgium, utilising its EU subsidiary, which has registered under the VASP regimes in Ireland, Spain and Italy. This launch reinforces Kraken’s ongoing commitment to upholding Europe’s robust anti-money laundering and compliance standards. And further underscores Kraken’s dedication to advancing crypto adoption across Europe, now and into the future. “We’re […]","title":"Kraken launches Virtual Asset Service Provider (VASP) services in Belgium","content":" Kraken has launched VASP services in Belgium, utilising its EU subsidiary, which has registered under the VASP regimes in Ireland, Spain and Italy.\nThis launch reinforces Kraken’s ongoing commitment to upholding Europe’s robust anti-money laundering and compliance standards. And further underscores Kraken’s dedication to advancing crypto adoption across Europe, now and into the future.\n“We’re pleased to announce another key landmark in our European expansion journey. This launch enables us to continue fulfilling our mission and educate more Belgians about the transformative impact of cryptoasset technology,” said Brian Gahan, Managing Director, Europe. “We believe in offering a compliant trading experience powered by our industry-leading client service, robust security protocols and market-leading position in liquidity and volume for EUR crypto pairs.”\nWith the Belgian launch and growing European footprint, Kraken is deepening its commitment to Belgian clients and improving their ability to access an extensive array of cryptoassets.\nIn September 2023, Kraken announced that it was authorised by the Central Bank of Ireland as an e-money institution (EMI). This enables Kraken to expand its EUR fiat services to clients, in partnership with European banks, across the 27 EU member states and European Economic Area countries.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-11-07T14:17:08+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-dymension-dym-and-jupiter-jup-starts-now-in-canada","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Dymension (DYM) and Jupiter (JUP) are now available on Kraken for residents in Canada! Funding and trading DYM and JUP funding and trading are live in Canada. Add DYM and JUP to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit DYM on Dymension […]","title":"Trading for Dymension (DYM) and Jupiter (JUP) starts now in Canada","content":" We’re thrilled to announce that Dymension (DYM) and Jupiter (JUP) are now available on Kraken for residents in Canada!\nDYM and JUP funding and trading are live in Canada. Add DYM and JUP to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit DYM on Dymension and JUP on Solana. Deposits using other networks will be lost.\nGot DYM and/or JUP and a Kraken account? ⤵️\nDYM and JUP are tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nDymension (DYM) is a blockchain network known for its RollApps. The blockchain focuses on the play-to-earn gaming and decentralized finance (DeFi) sectors, and is managed by the Dymension Hub. It enhances data handling through Data Availability Networks and offers a RollApp Development Kit for developers. The network’s operations and user rewards system are anchored by the DYM token, which was initially distributed to the community through the Genesis Rolldrop, forming a key part of Dymension’s strategic growth in the blockchain sector.\nMore information about Dymension in the Crypto Asset Statement.\nJupiter (JUP) is a decentralized finance (DeFi) protocol on the Solana blockchain that began as a liquidity aggregator for token swaps and has expanded to include perpetual futures. The governance token of Jupiter, JUP, allows community members to vote on key decisions regarding the platform’s development and operations.\nMore information about Jupiter in the Crypto Asset Statement.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\nPayward Canada Inc., operating as Kraken, has filed an application for registration in certain Canadian jurisdictions but has not yet obtained registration. Until such time as Payward Canada Inc., operating as Kraken, obtains registration, Payward Canada Inc. has agreed to abide by the terms of an undertaking available at the following page: https://www.securities-administrators.ca/wp-content/uploads/2023/04/20230324-Kraken-PRU-publication-version.pdf.\n","create_date":"2024-03-07T10:59:40+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-celestia-tia-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Celestia (TIA) is now available on Kraken! Funding and trading TIA funding and trading are live. Add TIA to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. Only deposit TIA on Celestia. Deposits using other networks will be lost. Got TIA and a Kraken account? […]","title":"Trading for Celestia (TIA) starts now!","content":" We’re thrilled to announce that Celestia (TIA) is now available on Kraken!\nTIA funding and trading are live. Add TIA to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit TIA on Celestia. Deposits using other networks will be lost.\nGot TIA and a Kraken account? ⤵️\nTIA is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nHere’s what you need to know about the token:\nCelestia (TIA) is a modular blockchain network focusing on scalable data availability for blockchains. By separating transaction ordering from network consensus, Celestia helps to address the data availability challenges many blockchains face while scaling. TIA is the native token used for data transactions, network security via proof-of-stake, and enabling decentralized governance within the ecosystem.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\n","create_date":"2023-10-31T17:08:15+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-trueusd-tusd-starts-june-29-deposit-now","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken now supports the deposits and withdrawals of TrueUSD (TUSD) on the Tron Network! Tron is a blockchain platform where developers can deploy their own decentralized applications (dApps). Tron is powered by delegated proof-of-stake (DPoS), a system that’s considered highly democratic and inclusive for selecting block producers. The company’s vision is to create a decentralized […]","title":"Trading for TrueUSD (TUSD) starts June 29 – deposit now!","content":" Kraken now supports the deposits and withdrawals of TrueUSD (TUSD) on the Tron Network!\nTron is a blockchain platform where developers can deploy their own decentralized applications (dApps). Tron is powered by delegated proof-of-stake (DPoS), a system that’s considered highly democratic and inclusive for selecting block producers. The company’s vision is to create a decentralized version of the internet. Learn more about Tron in our Kraken Learn Center article How to buy Tron (TRX)!\nFunding is live and trading starts on June 29. You can transfer TUSD to your Kraken account by navigating to Funding, selecting TUSD, and choosing the desired deposit method from the drop-down box (network): Tron.\nAlready have TUSD on the Tron network and a Kraken account? ⤵️\nNote:\nTUSD is tradeable on Kraken and Kraken Pro with the following parameters:\nHere’s what you need to know about the asset:\nTrueUSD (TUSD) is a stablecoin issued by TrustToken whose value is tied to the US dollar. According to TrustToken, TUSD is fully collateralized by fiat reserves verified by third party accounting firms and subject to independent on-chain attestations. Holders can trade TUSD for other cryptocurrencies on platforms that list the token. They can also use TUSD to execute cross-border payments and earn rewards by staking and providing liquidity on various blockchain networks.\nReady to deposit but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\n","create_date":"2023-06-29T14:31:04+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-one-of-newsweeks-2023-top-100-uk-most-loved-workplaces","web_url":"https://blog.kraken.com/","type":"article","description":"We’re proud to announce that we have been named #18 on Newsweek’s Top 100 UK Most Loved Workplaces list. This recognition showcases our truly unique employer brand offering, which emphasises flexibility, career development and the well-being of our Krakenites.   Newsweek’s rankings, backed by the rigorous analysis of the Best Practice Institute, are based on survey […]","title":"Kraken one of Newsweek’s 2023 Top 100 UK Most Loved Workplaces","content":" We’re proud to announce that we have been named #18 on Newsweek’s Top 100 UK Most Loved Workplaces list. This recognition showcases our truly unique employer brand offering, which emphasises flexibility, career development and the well-being of our Krakenites.\nNewsweek’s rankings, backed by the rigorous analysis of the Best Practice Institute, are based on survey results of more than two million employees from different industries and company sizes. Newsweek publishes its annual list of the Top 100 UK companies that build their business models around respect, care and employee appreciation.\n“The UK has a track record of pioneering innovative HR and workplace practices. We’re incredibly proud to be regarded alongside the UK’s best known companies for our strong employer brand credentials,” said Pranesh Anthapur, Kraken’s Chief People Officer.\nAnthapur added, “Our employer brand approach is one of a kind, but we recognise and value our Krakenites’ daily efforts to drive our overall mission of accelerating crypto adoption. In return, we have built a framework that provides flexibility, autonomy and holistic benefits to enable our people to love their workplace experience.”\nToday’s recognition follows our inclusion in Newsweek’s Top 100 Global Most Loved Workplaces list in May 2023, and Newsweek’s Top 100 American Most Loved Workplaces list last month.\nWhat makes Kraken such a great place to work? In addition to compelling career growth and learning opportunities, we offer holistic health and wellness benefits. These include truly flexible annual leave practices, access to in-house fitness and well-being coaches, as well as a generous grant to build a customised in-home office.\nKrakenites are also invested in the success of the company and the broader industry. Nearly 40% receive a part of their salary in digital assets and many of our roles come with company share options included in the compensation package.\nReady to join the revolution? Find your role at Kraken today!\n","create_date":"2023-10-04T14:15:11+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/announcing-the-2023-kraken-transparency-report","web_url":"https://blog.kraken.com/","type":"article","description":"Consistent disclosure of compliance information demonstrates our longtime commitment to complying with legal and regulatory requests in a way that is consistent with law enforcement and aligns with our ideals: financial freedom, permissionless access to assets, and the acceleration of global crypto adoption -- with a vigilant commitment to regulatory compliance and our clients’ privacy.","title":"Announcing the 2023 Kraken Transparency Report","content":" We offer a variety of crypto products and services to over nine million clients in 190 different countries. Last year, we received data requests from law enforcement and government agencies located in 69 countries:\nWhile these requesting agencies were spread across the federal, state, and local levels, most of the requests received were from law enforcement agencies. The most common requests for which data was provided were:\nMany types of information requests are received, and Kraken has strict policies and procedures to comply with laws and regulations and protect client privacy while supplying data when we have a legal obligation to do so.\nKraken received 4,923 data requests in 2023; the U.S. issued the most (1,393), as it did in 2022. The FBI, again, had the most requests of any U.S. agency (33.1%):\n2023 U.S. requests primarily originated with law enforcement agencies. While the SEC represented just 1.8% of total U.S. agency requests, they issued 58.1% of all U.S. regulatory agency requests:\nOur Compliance Team consists of seasoned AML professionals, attorneys, former law enforcement officers, Association of Certified Anti-Money Laundering Specialists (ACAMS)-certified analysts and many other professionals with cryptocurrency-related accreditations.\nThey work to ensure we conduct appropriate investigations and monitoring for our clients and the industry. To efficiently and professionally meet law enforcement and regulatory agency requests, we continue to expand and strengthen our compliance program, including a 33% decrease in 2023’s average request turnaround time vs. 2022, as we built specialized teams and automated some processes.\nThe privacy of your personal information is very important to us. We relentlessly work to protect your information through the dedicated design efforts of our Security Team as well as our Data Privacy team. For more than a decade, we’ve been building an industry leading security practice led by some of the top security experts in the world:\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-02-12T13:30:23+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/pro/trailing-stop-orders-on-kraken-pro","web_url":"https://blog.kraken.com/","type":"article","description":"We’re excited to announce the introduction of trailing stop orders, now available across all spot and futures markets on the Kraken Pro web interface. Start trading on Kraken Pro This new conditional order type seeks to secure maximum upside without having to repeatedly, manually readjust orders. Trailing stop orders allow you to stay dynamic and […]","title":"Announcing trailing stop orders on Kraken Pro","content":" We’re excited to announce the introduction of trailing stop orders, now available across all spot and futures markets on the Kraken Pro web interface.\nThis new conditional order type seeks to secure maximum upside without having to repeatedly, manually readjust orders. Trailing stop orders allow you to stay dynamic and lock in profits at a specific level once a price rally reverses against your favored direction:\n\nTrailing stop orders are a type of conditional stop order that automatically adjusts as the market price of an asset changes. Traders use them when they are looking to protect current gains in a trade. They allow a trade to remain open as long as it continues to earn additional profits. It only closes the position out once a certain retracement loss amount (either in percentage or nominal price terms) occurs.\nTrailing stops on Kraken Pro can be triggered against either the last, index or mark price of the corresponding spot or futures market.\nUsing trailing stop orders on Kraken Pro involves setting two main parameters:\nImagine you’re a swing trader who has an active long position in BTC. The current BTC price is $28,000, and you anticipate that the price will rise in the short term.\nYou enter your trade at $28,000 and place a trailing stop sell order with a trailing offset of $100. If the BTC price rises to $30,000 (without ever retracing by $100 or more) during the upside rally, your stop order will continually trail the BTC price by $100 — in this example, all the way up to $29,900, $100 below $30,000.\nIf the price then dips from $30,000 to $29,900, the trailing stop order will execute with a market sell executed at $29,900, thus locking in a +$1,900 price swing on your initial $28,000 entry price.\nIn this example, using trailing stop orders allows swing traders to capitalize on short term price movements in a moving market.\nFor swing traders, trailing orders on Kraken Pro offer a wealth of strategic benefits:\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-13T14:49:13+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-wormhole-w-starts-april-3-deposit-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Wormhole (W) is now available on Kraken! Funding and trading Funding for W is live and trading will begin on April 3. Add W to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit W on Solana. Deposits using other networks will be lost. […]","title":"Trading for Wormhole (W) starts April 3 - deposit now","content":" We’re thrilled to announce that Wormhole (W) is now available on Kraken!\nFunding for W is live and trading will begin on April 3. Add W to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit W on Solana. Deposits using other networks will be lost.\nGot W and a Kraken account? ⤵️\nW is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nWormhole (W) is a platform that enables seamless connectivity across different blockchains, allowing for the creation of both standalone crypto bridges and integrated multi-chain decentralized applications (dApps). It features a governance token, W, which empowers holders to influence the platform’s development and direction through on-chain governance within a dedicated DAO.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-04-02T16:10:08+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-continues-to-fight-for-its-mission-and-crypto-innovation-in-the-united-states","web_url":"https://blog.kraken.com/","type":"article","description":"Today, the SEC filed a complaint alleging that Kraken operates as an unregistered securities exchange, broker, and clearing house. We disagree, and intend to vigorously defend our position in court. Today’s news has no impact on the products we offer and we will continue to provide services to our clients without interruption. We remain fully committed to our U.S. and global clients and partners.","title":"Kraken continues to fight for its mission and crypto innovation in the United States","content":" The complaint against Kraken alleges no fraud, no market manipulation, no customer losses due to hacking or compromised security, and no breaches of fiduciary duty. It includes big dollar amounts but does not allege a single one of those dollars is missing or misused – no ponzi scheme, no failure to maintain adequate reserves, and no failure to preserve the identity of client funds 1:1. Indeed, none of these things would be true.\nInstead, the complaint makes a technical argument: that Kraken’s business requires special securities licenses to operate because the digital assets we support are really “investment contracts.” This is incorrect as a matter of law, false as a matter of fact, and disastrous as a matter of policy.\nThe SEC already tried this theory and a court rejected it outright. The SEC argued in that case that digital assets bought and sold on trading platforms were really securities transactions. The Federal Court for the Southern District of New York disagreed, ruling that the SEC failed entirely to satisfy the relevant legal test. The court held that the SEC’s unprecedented legal theory was contrary to the “economic reality” of such transactions. The SEC’s case against Kraken will fail, too, and for the same reasons.\nThe SEC alleges that Kraken “commingled” its own funds with its clients’. This is a similar allegation already made of other crypto trading platforms. The SEC cannot and does not allege that any customer funds are missing, or any loss has occurred. Nor does it allege that any loss will occur. The complaint itself concedes that this so-called “commingling” is no more than Kraken spending fees it has already earned.\nThe SEC famously argues that digital asset trading platforms like Kraken can simply “come in and register” with the agency. As most securities law experts know, there is not a single law on the books supporting this position. The SEC has promulgated no rule describing how an order in a digital asset should be matched, no guidance on how a trade should be cleared, and articulated no standards for how to broker a digital asset transaction. The allegation is hollow; there is no such thing as an exchange, broker dealer, or clearing agency for investment contracts. The SEC is demanding compliance with a regime that doesn’t exist.\nMeanwhile, groups of lawmakers from both sides of the aisle have questioned what they call SEC’s “regulation via enforcement” approach. They have asked why the agency’s actions against crypto firms seem less focused on “compliance and customer protection,” but were instead “calculated for maximum publicity and political impact.” Others have observed that the SEC’s strategy “does not protect the public.” Indeed, this suit does nothing to protect the public. Like those in complaints that have come before, its allegations are factually incorrect, contrary to law, and the wrong way to create policy in the United States.\nCongress is advancing bipartisan bills in both the House and the Senate that would put in place clear registration and oversight frameworks for centralized trading platforms. Congressional action by elected lawmakers, not agency enforcement, is the right path to creating new law for centralized crypto trading platforms in the United States. As our global presence and diverse product offering continues to expand, Kraken remains firmly committed to the U.S. We will continue to defend our U.S. spot market business, our clients, and our community of innovators.\nWhile some critics may argue that digital asset trading platforms simply do not want to be regulated, that is not our position. In fact, Kraken has operated for more than a decade and holds registrations, licenses, authorizations and approvals around the world, including in the United States, United Kingdom, European Union, and Canada, among other developed and emerging markets. We have consistently advocated for practical, effective rules for digital assets. Our testimony to Congress in May of this year emphasized Kraken’s commitment to strong, harmonized consumer protections and anti-money laundering practices in the U.S.\nSince our company’s inception in 2011, we have worked tirelessly to ensure U.S. consumers can safely access evolving digital asset technology which was designed to create a fairer, more inclusive financial system. Comprehensive Congressional action is the right path forward and can avoid the U.S. litigating its way to the back of the line as Crypto and Web3 advances around the world.\nKraken was founded in the U.S. in 2011. Since then, we have steadily grown into a diversified, global digital asset business serving over 10 million clients around the world.\nWe consistently rank among the best places to buy and sell digital assets thanks to our industry-leading client support, intuitive client experience, fast and reliable performance, and rigorous information security standards. We also rank among the world’s best places to work: We were recently certified by Newsweek as a “Most Loved Workplace” because of our positive vision of the future, alignment of values, and collaborative environment.\nOur mission is to accelerate the adoption of cryptocurrency so that everyone can achieve financial freedom and inclusion. Today’s news will not distract us from this mission. It has no impact on the products we offer and we will continue to provide our services to our clients without interruption. We remain committed to do what we believe is right for our clients and the community of innovators using cryptocurrency.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-11-20T23:53:10+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/usdc-deposits-and-withdrawals-now-available-on-optimism","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports deposits and withdrawals of USD Coin (USDC) on Optimism! Funding USDC funding via Optimism is already live. You can transfer USD Coin (USDC) to your Kraken account by navigating to Funding and selecting USDC. From there, use the drop-down box to select the desired deposit method (network): […]","title":"USDC deposits and withdrawals now available on Optimism!","content":" We’re thrilled to announce that Kraken now supports deposits and withdrawals of USD Coin (USDC) on Optimism!\nUSDC funding via Optimism is already live. You can transfer USD Coin (USDC) to your Kraken account by navigating to Funding and selecting USDC. From there, use the drop-down box to select the desired deposit method (network): Optimism.\nNote: Kraken currently supports two versions of USDC: USDC.e and Optimism’s native USDC.\nGot USDC on Optimism? ⤵️\nUSD Coin (USDC) is a USD-backed stablecoin that is backed by the US dollar. It allows for faster and more cost effective transactions compared to traditional banking options. Each USD Coin is valued at one US dollar, effectively providing a price-stable cryptocurrency. Learn how to add USDC to your crypto portfolio with our Learn Center article How to Buy USD Coin (USDC).\nOptimism (OP) is a Layer 2 scaling solution implemented on the Ethereum network. It employs a technology known as optimistic rollups to aggregate multiple transactions, thereby alleviating congestion and lowering transaction fees on the Ethereum mainnet. OP is Optimism’s native governance token, which allows OP token holders to participate in decisions regarding the protocol’s future direction, upgrades and parameters.\nReady to deposit but don’t have a Kraken account yet? Sign up today!\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-05T15:22:25+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/staking/bonded-staking-for-dym-sei-and-trx-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce the support for bonded on-chain staking strategies for DYM, SEI and TRX starts now in most regions! Start staking on Kraken Pro How can I start staking? Add crypto assets to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. Clients can now stake crypto assets and […]","title":"Bonded Staking for DYM, SEI and TRX starts now","content":" We’re thrilled to announce the support for bonded on-chain staking strategies for DYM, SEI and TRX starts now in most regions!\nAdd crypto assets to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. Clients can now stake crypto assets and earn up to 18% in yearly rewards from the Earn section of your Kraken Pro account or from the Kraken Pro mobile app.\nNew to crypto staking? Check out the Kraken Learn Center article What is crypto staking? to learn more. Available bonded staking assets:\nNote:\nDymension (DYM) is a blockchain network known for its RollApps. The blockchain focuses on the play-to-earn gaming and decentralized finance (DeFi) sectors, and is managed by the Dymension Hub. It enhances data handling through Data Availability Networks and offers a RollApp Development Kit for developers. The network’s operations and user rewards system are anchored by the DYM token, which was initially distributed to the community through the Genesis Rolldrop, forming a key part of Dymension’s strategic growth in the blockchain sector. Check out the Kraken Learn Center guide How to buy Dymension (DYM) for more information.\nSei network (SEI) is a Layer 1 blockchain developed on Cosmos that aims to provide a next-generation DeFi infrastructure. Utilizing central limit order books (CLOBs), Sei Network facilitates decentralized application (dApp) integration and access to liquidity within the Cosmos ecosystem. SEI validators can choose to accept other Cosmos ecosystem approved tokens for gas payment based on network governance. The SEI token allows users to pay for gas fees and also functions as the protocol’s governance token. Check out the Kraken Learn Center guide How to buy Sei Network (SEI) for more information.\nTron (TRX) is a smart-contract-enabled blockchain platform where developers can deploy their own decentralized apps (dApps). TRON is powered by Delegated Proof of Stake (DPoS) consensus mechanism, allowing holders of its native token, TRX, to vote on who can earn rewards for validating transactions on the blockchain. TRON’s vision is to create a decentralized version of the Internet. Check out the Kraken Learn Center guide How to buy Tron (TRX) for more information.\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-03-22T12:32:57+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/security/the-kraken-security-playbook-how-to-avoid-holiday-crypto-scams","web_url":"https://blog.kraken.com/","type":"article","description":"Financial fraud has been a part of transactional business since the dawn of transactional business. If you were unfortunate enough to have been on the other side of an insurance deal with Hegestratos, he would have had you insure the corn cargo on his ship – then removed the corn, sold the corn, sank the […]","title":"The Kraken security playbook: how to avoid holiday crypto scams","content":" Financial fraud has been a part of transactional business since the dawn of transactional business. If you were unfortunate enough to have been on the other side of an insurance deal with Hegestratos, he would have had you insure the corn cargo on his ship – then removed the corn, sold the corn, sank the ship, and collected his payout. The year was 300 B.C.\nHegestratos then drowned after he was caught in the act and pursued by angry victims. This represented a limitation of the times: Hegestratos had to conduct his fraud in person. In the digital age, fraud is far more anonymous: a confident voice on the phone claiming to be from your bank, a forcefully worded email demanding urgent action or your account will be closed.\nSkilled con artists act with no remorse for the pain and suffering inflicted on their victims and their families. They are experts at instilling gut-level fear and a false sense of urgency; the need to act now before you take time to think things over and reach out to your financial institution to verify anything.\nEveryone has an important role to play in preventing these frauds from happening. The good news is that the most powerful weapon against getting scammed is universally available, free and easy: do nothing. Ignore any high-pressure, unusual request. Hang up the phone, do not reply to the text or email.\nThen contact the financial institution the scammer claimed to represent (making sure to use the customer service number provided on the company’s official website). Their customer service representatives will provide your accurate account status, and very likely confirm that all is well and no action is required of you.\nBy Nick Percoco, Kraken Chief Security Officer\nCrypto scams are just a recent addition to the kinds of financial scams that have existed for millennia. If an asset has value, scammers will try to get you to transfer that value to them by lying to you.\nSocial engineering plays a significant role. Social engineering involves a scammer gaining the confidence of their victim – often over a lengthy period of time spanning dozens of back–and-forth communications – eventually persuading the victim to willingly send assets to the scammer.\nThis particular approach, the gaining of trust of time, is called pig butchering. The scammer, often through flattery and apparent intense interest in the victim’s hobbies and activities, “fattens” the victim over time. Only once the scammer feels they are in a position to extract a large sum of money does the “butchering” part come into play. Days, weeks, months, even years: if the potential, eventual theft is large enough, scammers will spend all the time it takes to earn your trust.\nMost crypto scams involve a scammer convincing their victim to share their seed phrase (effectively their password) so that the fraudster can access their crypto. Anytime anyone, under any circumstances, asks for your seed phrase, they are asking for unrestricted access to your crypto. Stop. Hang up. Do not reply to the email or text. Do nothing.\nScammers know that if you do nothing, they lose. Sowing fear is an effective tactic to trigger immediate action on the victim’s part. Scammers will pose as a frightened family member that urgently needs money to get home. Even though a simple direct text or call from the would-be victim to this family member would foil this fraud instantly, scammers are expert at keeping victims on the phone and in a state of panic. Hang up, remain calm, contact the family member independently.\nCrypto fraud losses attract a disproportionate amount of attention despite accounting for a fraction of fraud losses in government-issued currency. Sending any monetary unit of value to another party is a largely similar process, regardless of the technology used to complete the transaction.\nAnother common scam angle is the unsolicited “opportunity.” High-pressure cold calls from “stockbrokers” in so-called boiler rooms have been around for decades. Same deal: for no reason that makes any common sense, they are calling you, a perfect stranger, to enrich you with an extraordinary opportunity to make enormous amounts of money in a short period of time. Similar crypto scams exist.\nHang up, block the number, don’t reply. If you had a legitimate opportunity to double a sum of money in days or weeks, you would not pick up the phone and start trying to find total strangers to tell about it.\nSo here’s my advice to help you avoid scams:\nAnytime you have any doubt about an incoming call, email or text — especially one that requests personal information or an asset transaction — remember your first, best course of action is no action at all: first, do nothing.\nThe holiday season is about sharing time with the people we love most. Follow our simple playbook and avoid sharing your crypto with the people who wish you the worst.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-21T17:27:43+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/announcing-krakens-liquidity-pool-for-futures","web_url":"https://blog.kraken.com/","type":"article","description":"Enhanced risk management We are always looking for ways to help our clients participate in crypto markets with greater confidence. So we are pleased to introduce our liquidity pool for futures, designed to minimize the need to unwind futures positions and improve the experience of Position Assignment System (PAS) participants. The liquidity pool provides additional […]","title":"Announcing Kraken's liquidity pool for futures","content":" We are always looking for ways to help our clients participate in crypto markets with greater confidence. So we are pleased to introduce our liquidity pool for futures, designed to minimize the need to unwind futures positions and improve the experience of Position Assignment System (PAS) participants. The liquidity pool provides additional downside protection against sudden market movements.\nIt is a dedicated pool of funds set aside specifically to cover slippage-related losses resulting from liquidations, particularly during volatile or low-liquidity market conditions. It acts as an additional protective buffer, in addition to our PAS, when a position cannot be assigned. It covers any shortfall before an unwind occurs. By maintaining this fund, we aim to protect our traders and the integrity of our platform.\nWhen a futures trader’s position reaches its liquidation price, our platform first attempts to liquidate the position in the order book at a price that would prevent the liquidated counterparty’s equity from going negative. If the position cannot be liquidated via the orderbook, it is sent through the PAS to be filled by volunteer liquidity providers. Normally, if the liquidated position cannot be liquidated in the order book nor assigned in the PAS, then it would be unwound.\nInstead of unwinding a position, the liquidity pool enables covered liquidations. The remaining position is filled in the order book and the pool covers any slippage-related losses incurred during the liquidation process.\nWe use a portion of our revenue from Multi-Collateral futures.\nWith the introduction of the liquidity pool, we have implemented improvements to the PAS.\nThe PAS is an optional program designed for experienced traders, notably liquidity providers. It allows participants to willingly accept high-risk positions resulting from unfilled liquidations. Offering a unique avenue to diversify risk management strategies and potentially realize higher returns, participants have the autonomy to set their assignment preferences. Given adequate margin, they can be assigned a position another trader was unable to sustain.\nThe sum total capacity of liquidity providers participating in the program offers a layer of protection against losses related to extreme volatility. It allows us not to require clawbacks and to have real-time settlement of profits.\nOur recent enhancements ensure that all assignments through the PAS now have a profitability window of 0.5% minimum and 2.5% maximum. The trade price will always be at least 0.5% more favorable than the mark price at the time of assignment. This creates a safer environment for the PAS – ensuring that assigned positions remain profitable as long as liquidity pool funds are available.\nFind out more about our PAS and how to participate here.\nWe constantly strive to provide our traders with the best possible trading experience, and that includes prioritizing their security and protection. Our liquidity pool is a testament to our ongoing commitment to maintaining a secure environment for our community.\nTrading futures, derivatives and other instruments using leverage involves an element of risk and may not be suitable for everyone. Read Kraken’s risk disclosure to learn more. Trading futures, derivatives and other instruments using leverage might be subject to national restrictions and limitations.\n","create_date":"2023-08-08T11:46:16+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/crypto-will-be-here-long-after-the-sbf-trial-is-over","web_url":"https://blog.kraken.com/","type":"article","description":"So as Sam Bankman-Fried stands trial for wire fraud, securities fraud, commodities fraud, money laundering and campaign finance violations, let’s remember one thing above all else: crypto itself is not on trial. Bitcoin is a technological fortress built to endure, and no amount of speculative narratives or individual fallibility could ever change that. After FTX’s […]","title":"Crypto will be here long after the SBF trial is over","content":" So as Sam Bankman-Fried stands trial for wire fraud, securities fraud, commodities fraud, money laundering and campaign finance violations, let’s remember one thing above all else: crypto itself is not on trial.\nBitcoin is a technological fortress built to endure, and no amount of speculative narratives or individual fallibility could ever change that.\nAfter FTX’s collapse and the ensuing legal drama become a distant memory, what will the enduring story of the 21st century be?\nThe world being built on the foundation of what crypto can do:\n🔐 1. Empower Financial Sovereignty: Cryptocurrency, exemplified by Bitcoin, makes it possible for digital assets to be entirely yours. It removes the need for intermediaries and creates financial empowerment.\n🪙 2. Build a Tokenized Future: We envisage a world where every conceivable asset is tokenized, unlocking unprecedented opportunities for investors, athletes, musicians and others to interact and transact in innovative ways with their audiences and stakeholders.\n🏢 3. Create Jobs: From harnessing stranded energy through bitcoin mining in rural locales to fueling countless startups, crypto continues to be a potent job creator, significantly impacting communities and individuals.\n🌐 4. Facilitate Global, Borderless Commerce: Cryptocurrency effortlessly melds with the global internet, eliminating barriers erected by traditional financial channels, enabling seamless, global value transactions no more difficult than sending an email.\n🧠 5. Maximize Intellectual Capital: An influx of brilliant minds and the world’s top computer science experts continue to drive progress as the life-changing potential of cryptocurrency and blockchain technology becomes more evident every day.\n🌎 6. Drive an Inclusive Financial World: DeFi, NFTs and the fullness of Web3 are mere hints as to what crypto will bring in coming years and decades. The full universe of possibilities is endless, and we can’t even imagine the extraordinary financial world, built around crypto, yet to come.\nFTX’s downfall was a business failure that involved a dysfunctional company, run by a deeply flawed person, who had nearly unlimited power. Any company – in any industry – without a real risk or security department and oversight protocols preventing someone from yielding too much power is fundamentally broken.\nThe beauty of crypto is that there are trusted third parties that enable you to transact, but you also have the choice to self custody with complete autonomy. Trusted third parties play an important role bridging people into crypto while creating connectivity among decentralized networks. But ultimately, they are not necessary.\nBeyond that, because every transaction is on the blockchain, crypto allows for unprecedented, real-time public accountability.\nWhile some of our competitors were spending nine figures to put their names on stadiums, we were investing in ways to make crypto more accessible and understandable – something we continue to do to this day.\nA dependable, trustworthy crypto platform must be built on sound engineering, risk management, security and compliance practices; not on hype or speculation.\nCrypto is real technology that solves real problems. It was here long before the rise and fall of SBF and its impact will long succeed him. We’re proud to be the bridge that connects you to that evolving impact: the future of finance.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-10-24T14:16:27+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-jupiter-jup-starts-january-31","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Jupiter (JUP) is now available on Kraken! Deposits and withdrawals are live and JUP will start trading on Kraken on January 31. Funding and trading JUP funding is live. Add JUP to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit JUP on Solana. […]","title":"Trading for Jupiter (JUP) starts January 31","content":" We’re thrilled to announce that Jupiter (JUP) is now available on Kraken! Deposits and withdrawals are live and JUP will start trading on Kraken on January 31.\nJUP funding is live. Add JUP to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit JUP on Solana. Deposits using other networks will be lost.\nGot JUP and a Kraken account? ⤵️\nJUP is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nHere’s some more information about the token:\nJupiter (JUP) is a decentralized finance (DeFi) protocol on the Solana blockchain that began as a liquidity aggregator for token swaps and has expanded to include perpetual futures. The governance token of Jupiter, JUP, allows community members to vote on key decisions regarding the platform’s development and operations.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-01-31T15:24:32+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-dymension-dym-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Dymension (DYM) is now available on Kraken! Funding and trading DYM funding and trading are live. Add DYM to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit DYM on Dymension. Deposits using other networks will be lost. Got DYM and a Kraken account? […]","title":"Trading for Dymension (DYM) starts now","content":" We’re thrilled to announce that Dymension (DYM) is now available on Kraken!\nDYM funding and trading are live. Add DYM to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit DYM on Dymension. Deposits using other networks will be lost.\nGot DYM and a Kraken account? ⤵️\nDYM is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nDymension (DYM) is a blockchain network known for its RollApps. The blockchain focuses on the play-to-earn gaming and decentralized finance (DeFi) sectors, and is managed by the Dymension Hub. It enhances data handling through Data Availability Networks and offers a RollApp Development Kit for developers. The network’s operations and user rewards system are anchored by the DYM token, which was initially distributed to the community through the Genesis Rolldrop, forming a key part of Dymension’s strategic growth in the blockchain sector.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-02-06T20:24:30+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/bitcoin-at-15-the-relentless-resilience-of-peer-to-peer-electronic-cash","web_url":"https://blog.kraken.com/","type":"article","description":"In 2008, an 8-page white paper outlined a new form of money. Today, we celebrate the 15th anniversary of Bitcoin. On October 31, 2008, an anonymous entity named Satoshi Nakamoto published a white paper for a decentralized, “peer-to-peer electronic cash system.” The Bitcoin white paper was a direct response to the systemic weaknesses laid bare […]","title":"Bitcoin at 15: the relentless resilience of peer-to-peer electronic cash","content":" In 2008, an 8-page white paper outlined a new form of money. Today, we celebrate the 15th anniversary of Bitcoin.\nOn October 31, 2008, an anonymous entity named Satoshi Nakamoto published a white paper for a decentralized, “peer-to-peer electronic cash system.”\nThe Bitcoin white paper was a direct response to the systemic weaknesses laid bare in the 2008 financial crisis. With its fixed supply and decentralized nature, it proposed a radical alternative to the world’s government-issued money systems.\nOne million drachma, Greece, 1944\nGovernment-issued money derives its value from the trust its holders have in the institutions that issue and manage it, like the central banks.\nThese institutions benefit from having a good reputation for governance. But levels of trust citizens have in them vary over time, and when trust is the main value determinant of a currency, anything challenging that trust will tend to negatively impact that currency’s value.\nFive hundred million dinars, Croatia, 1993\nOne of the most notable examples in recent years is the Turkish lira, which has collapsed against other global currencies. Largely due to persistent inflation and the nonsensical policy idea that keeping interest rates near zero (encouraging aggressive borrowing and spending) will result in lower prices, a lack of confidence in the Turkish government’s fiscal management ability has only accelerated the lira’s devaluation.\nThe risks of a monetary system based on trust are exponentially increased because governments can print money at will. There are no longer any governments or central banks that issue asset-backed currency. This makes it all too easy for officials to print money in an attempt to alleviate any manner of national crisis.\n10 quintillion pengő, Hungary, 1946\nBut the problem is that unlimited money printing leads to an ever-larger pool of currency chasing a finite pool of goods. This invariably leads to people having to pay more for those same goods.\n10 million zaïres, Zaire, 1992\nCurrency failures are far from a new phenomenon; history is littered with government-issued currencies that were printed until they lost all of their value. For centuries, around the world, money printing has been the de facto governmental solution in times of war, financial stress or social upheaval. And as the value of a country’s currency is perpetually diluted by more of it entering the marketplace, trust in it is further eroded.\n50 billion dinars, Yugoslavia, 1993\nIn the early twentieth century, Germany’s gold-backed currency – the mark – was one of the strongest in the world. After the outbreak of World War 1, the government dropped the gold standard and introduced a new currency, the papiermark, to finance its war effort. The papiermark promptly lost value, a process that accelerated after Germany’s defeat in 1918.\nGerman officials did what governments always do as their last resort: print more money, faster. This led to one of the most dramatic instances of hyperinflation in history. By 1923, one pre-war mark was worth one trillion papiermarks.\nTwo trillion marks, Germany, 1923\nThis underscores an important truth: trust is a shaky foundation for a monetary system. Trust can last a long time, but government currencies are systemically vulnerable when nothing else backs them. While mass printing of more currency often stops an immediate crisis from turning into a near-term catastrophic collapse, it also reminds a country’s citizens that their government is creating money out of thin air.\nOne million pesos, Argentina, 1992\nBitcoin was designed specifically to address these risks. A system built on a fixed supply and a transparent, immutable ledger, Bitcoin is structurally engineered so its holders don’t end up with a currency that can be printed into inflationary oblivion for political reasons.\nBitcoin’s supply is algorithmically capped at 21 million coins. This built-in scarcity preserves its purchasing power. This is the same reason gold has maintained value for thousands of years: its supply is relatively fixed and its primary value determinant is demand. Created billions of years ago in cosmic nuclear explosions, mankind can’t just print more of it.\nOne million intis, Peru, 1990\nBitcoin has no central authority. It is protected from the whims of government bodies, individual leaders and financial institutions. The rules governing Bitcoin are public and apply equally to everyone, regardless of where they live, what they look like or who they know. Everyone gets the same deal: reliable money.\nBitcoin is a beacon of operational stability, a monetary system for the digital age, custom-built as a lesson learned from centuries of failures. Bitcoin has provided a reliable, disintermediated and decentralized means of exchange and store of value since the Genesis Block.\nTwo million zlotys, Poland, 1992\nOver the past 15 years, Bitcoin has been declared dead 474 times. Yet it continues to work, executing its code unemotionally, while some people villainize and rail angrily against it. And day by day, more of the world’s citizens realize that no amount of doubt or name-calling changes the simple fact that Bitcoin just works.\nOne hundred trillion dollars, Zimbabwe, 2008\nSo as we celebrate the 15th anniversary of the Bitcoin white paper, we herald this new era of monetary sovereignty where individuals can take control of their wealth. At Kraken, we are proud to help accelerate its global adoption so that everyone can achieve financial freedom and inclusion.\nSource for currency images: The Hyperinflation Gallery\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-10-31T19:14:11+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/staking/bonded-and-flex-staking-for-celestia-tia-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce the support for bonded on-chain staking strategies for TIA starts now in most regions! Start staking on Kraken Pro How can I start staking? Add crypto assets to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. Clients can now stake crypto assets and earn up to […]","title":"Bonded and Flex Staking for Celestia (TIA) starts now","content":" We’re thrilled to announce the support for bonded on-chain staking strategies for TIA starts now in most regions!\nAdd crypto assets to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nClients can now stake crypto assets and earn up to 18% in yearly rewards from the Earn section of your Kraken Pro account or from the Kraken Pro mobile app.\nNote:\nCelestia (TIA) is a modular blockchain network focusing on scalable data availability for blockchains. By separating transaction ordering from network consensus, Celestia helps to address the data availability challenges many blockchains face while scaling. TIA is the native token used for data transactions, network security via proof-of-stake, and enabling decentralized governance within the ecosystem.\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-04-15T13:11:44+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/expanded-margin-pairs-available-for-inj-op-snx-and-tia","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports new margin pairs for Optimism (OP), Synthetic (SNX), Injective (INJ) and Celestia (TIA)! Margin trading is now available for the below pairs for OP, SNX and TIA:  Pair base Pair name Available leverage Long Position Limit  Short Position Limit OP OPUSD 2X 14000 14000 SNX SNXUSD 2X […]","title":"Expanded margin pairs available for INJ, OP, SNX and TIA!","content":" We’re thrilled to announce that Kraken now supports new margin pairs for Optimism (OP), Synthetic (SNX), Injective (INJ) and Celestia (TIA)!\nMargin trading is now available for the below pairs for OP, SNX and TIA:\nOptimism (OP) is a Layer 2 scaling solution implemented on the Ethereum network. It employs a technology known as optimistic rollups to aggregate multiple transactions, thereby alleviating congestion and lowering transaction fees on the Ethereum mainnet. OP is Optimism’s native governance token, which allows OP token holders to participate in decisions regarding the protocol’s future direction, upgrades and parameters.\nSynthetic (SNX) offers an alternative way to invest in fiat currencies, cryptocurrencies and commodities through crypto derivatives. Synthetix is a decentralized protocol built on Ethereum that allows users to gain exposure to assets without actually holding or taking custody of the underlying resource. These synthetic assets (Synths) are backed by the platform’s cryptocurrency, Synthetix Network Token (SNX), which can be staked as collateral in order to generate rewards.\nInjective (INJ) is a decentralized exchange (DEX) that offers various features such as cross-chain margin trading, derivatives and forex futures trading. Built on the Cosmos blockchain a Layer 2 application, Injective uses bridges to offer cross-chain capabilities for traders to trade across other networks. The exchange is operated by the INJ token, Injective’s native cryptocurrency, which is used by makers and takers to pay for transaction fees on its network.\nCelestia (TIA) is a modular blockchain network focusing on scalable data availability for blockchains. By separating transaction ordering from network consensus, Celestia helps to address the data availability challenges many blockchains face while scaling. TIA is the native token used for data transactions, network security via proof-of-stake, and enabling decentralized governance within the ecosystem.\nBefore you start, what you should know:\nReady to start ⤵️\nYes! But our policy is to never reveal any details before launch – not even which pairs we are considering. All of Kraken’s listed margin pairs are available on our website. Our client engagement specialists cannot answer any questions about which pairs we may be listing in the future.\nThere is no guarantee that a limit order will execute. There is no guarantee of margin pool availability at all times. There is also no guarantee of a market order executing at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nOffering margin trading on an asset or token is not a recommendation to buy, sell or participate in the associated network. Do your own research and invest at your own risk.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-22T13:51:35+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/crypto-education/bitcoin-pizza-day-a-celebration-of-decentralization","web_url":"https://blog.kraken.com/","type":"article","description":"Pizza parties rarely need an explanation. But pizza parties on Bitcoin Pizza Day deserve one.  Thirteen years ago today, Laszlo Hanyecz created a thread in the bitcointalk.org forum titled Pizza for bitcoins? After some explanation and much discussion, Hanyecz found someone willing to buy him two pizzas (valued at ~$41) in exchange for his 10,000 […]","title":"Bitcoin Pizza Day — A celebration of decentralization","content":" Pizza parties rarely need an explanation. But pizza parties on Bitcoin Pizza Day deserve one.\nThirteen years ago today, Laszlo Hanyecz created a thread in the bitcointalk.org forum titled Pizza for bitcoins? After some explanation and much discussion, Hanyecz found someone willing to buy him two pizzas (valued at ~$41) in exchange for his 10,000 bitcoin.\nAt bitcoin’s price today, those pizzas are worth ~$270,000,000.\nMany look back on Bitcoin Pizza Day as a cautionary tale that demonstrates why people HODL crypto for the long term. Yet, many others look to the future on this day while considering the unrealized potential of Bitcoin and the power of decentralization.\nUltimately, Bitcoin Pizza Day has become a celebration of Bitcoin’s viability as a complete “peer-to-peer electronic cash system” — just as Satoshi envisioned in the Bitcoin white paper.\nMoney (including cash) is generally defined as:\nOn this day more than a decade ago, the world saw that Bitcoin could be used as a medium of exchange. After all, Hanyecz was able to use Bitcoin while transacting with another individual — without any intermediary’s participation.\nYet, as time has gone on, Bitcoin Pizza Day has also become a reminder of the progress Bitcoin has made in the other two functions of money as well.\nAs individuals continue to exchange Bitcoin for goods and services — just as Hanyecz did years ago — Bitcoin’s viability as a global unit of account and independent store of value has also emerged. Days like today are a reminder that first proving its effectiveness as a medium of exchange is what has ultimately allowed Bitcoin to prove its legitimacy as a globally recognized unit of account and self-sovereign store of value as well.\nBitcoin Pizza Day is a celebration of cryptocurrency and blockchain technology’s effectiveness in decentralizing information. It is also a celebration of Bitcoin’s reliability as a sound form of money.\nFor many others, Bitcoin Pizza Day is a celebration of the crypto values Kraken embodies and the mission we deliver on each day. It is a celebration of the freedom that Bitcoin brings back to individuals’ ability to connect and transact.\nKraken makes it easy to share the gift of financial freedom on Bitcoin Pizza Day.\nInvite your friends to Kraken and you’ll each get $10 in BTC through our referral program.*\nYou can also use Kraken to send Bitcoin around the world in seconds using our Lightning Network integration. Lightning Network is a highly secure and cost-effective way to send Bitcoin to anyone — with almost no fees.\nHave a Happy Bitcoin Pizza Day and count on Kraken while sharing the gift of Bitcoin today!\n*Geographic restrictions apply\n","create_date":"2023-05-22T17:41:20+00:00","tag":"","author":"krakenfx"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-bonk-bonk-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Bonk (BONK) is now available on Kraken! Funding and trading BONK funding and trading are live. Add BONK to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit BONK on Solana. Deposits using other networks will be lost. Got BONK and a Kraken account? […]","title":"Trading for Bonk (BONK) starts now","content":" We’re thrilled to announce that Bonk (BONK) is now available on Kraken!\nBONK funding and trading are live. Add BONK to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit BONK on Solana. Deposits using other networks will be lost.\nGot BONK and a Kraken account? ⤵️\nBONK is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nBonk (BONK) is a cryptocurrency launched on Christmas Day, 2022, as a free airdrop to the Solana blockchain community. It has gained popularity in the Web3 space and operates on the Solana blockchain as a cryptocurrency that emphasizes community involvement and decentralized finance principles.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-22T17:03:33+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-ondo-ondo-starts-april-11-deposit-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Ondo (ONDO) is now available on Kraken! Funding and trading Funding for ONDO is live and trading starts on April 11. Add ONDO to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit ONDO on Ethereum. Deposits using other networks will be lost. Got […]","title":"Trading for Ondo (ONDO) starts April 11 - deposit now","content":" We’re thrilled to announce that Ondo (ONDO) is now available on Kraken!\nFunding for ONDO is live and trading starts on April 11.\nAdd ONDO to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit ONDO on Ethereum. Deposits using other networks will be lost.\nGot ONDO and a Kraken account? ⤵️\n\nNote:\nOndo (ONDO) is a decentralized finance (DeFi) protocol dedicated to democratizing access to institutional-grade financial products and services. It focuses on integrating real-world financial instruments into the blockchain. ONDO serves as a governance token that grants holders voting rights on proposals that influence the future of the protocol.\nCheck out more information about Ondo our Crypto Asset Statement.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-04-09T15:43:15+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/trading-for-polygon-ecosystem-token-pol-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Polygon Ecosystem Token (POL) is now available on Kraken! Funding and trading POL funding and trading are live. Add POL to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit POL on Polygon. Deposits using other networks will be lost. Got POL and a […]","title":"Trading for Polygon Ecosystem Token (POL) starts now","content":" We’re thrilled to announce that Polygon Ecosystem Token (POL) is now available on Kraken!\nPOL funding and trading are live. Add POL to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit POL on Polygon. Deposits using other networks will be lost.\nGot POL and a Kraken account? ⤵️\nPOL is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nPolygon Ecosystem Token (POL) is a multi-chain scaling solution for the Ethereum blockchain. Polygon is a Layer 2 scaling solution for Ethereum that aims to improve the speed and reduce the cost of executing transactions on Ethereum. Polygon uses sidechains to help with off-chain computation while maintaining security and uses a decentralized network of proof-of-stake (PoS) validators. POL is an upgrade and renaming of the MATIC token. Switching to POL token is expected to enhance tokenomics and governance rights, allowing stakeholders greater involvement in decision-making process of Polygon through community initiatives.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-21T16:51:45+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/new-features/right-click-chart-trading","web_url":"https://blog.kraken.com/","type":"article","description":"Smarter, faster decisions are now just a right-click away In Kraken Pro. Streamline your trading with new right-click trade functionality.","title":"Introducing right-click trading: Place limit and stop orders directly from price charts","content":" Cryptocurrency trading requires precision, speed and strategic risk management. Kraken Pro’s new right-click feature enables clients to place limit and stop orders directly from a cryptoasset’s chart for more intuitive, less mistake-prone trading.\nThis upgrade is all about refining your trading process, allowing for immediate action based on chart analysis without the need to navigate away or manually enter detailed order information every time.\nThe ease and accuracy that comes with setting limit and stop loss orders directly on a chart can help you avoid mistakes that sometimes occur with manual order form entry, such as inadvertently selecting the wrong order type or buy/sell direction. By interacting directly with the chart, you can ensure your orders correctly reflect your analysis and intentions.\nRight-click trading enhances your ability to plan trades by visualizing entry and exit points directly on the chart. With a straightforward right-click action, you can set a limit sell or stop loss buy above the current price or a limit buy or stop loss sell below it, aligning your trade setup with your market analysis in real-time.\nIf a trader believes that the MOON/USD pair is on the verge of breaking out to new all-time highs, they might choose to leverage this momentum. This can be done by placing a strategic limit buy order at the support levels and a stop-buy order slightly above the breakout price, aiming to capitalize from the anticipated uptrend.\nFor a practical demonstration on how to set up both types of orders from the chart using our new right-click functionality, refer to the example in the video below:\nKraken Pro’s right-click trading for limit and stop orders, along with the ability to set price alerts directly on the chart, enhances your trading toolkit. This integration not only simplifies the trading process but also empowers you to make swift, informed decisions, minimizing the risk of input errors and keeping you in tune with market movements as they happen.\nExplore new dimensions of intuitive trading with Kraken Pro and take full advantage of chart-based order placement and price alerts for efficient, precise trading strategies.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-03-28T15:56:36+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/create-custom-layouts-on-kraken-pro","web_url":"https://blog.kraken.com/","type":"article","description":"Tailor your trading interface with presets or a unique configuration that suits your personal trading style using custom layouts on Kraken Pro.","title":"Create custom layouts on Kraken Pro","content":" January greetings, crypto traders! As we embark on a new year, it’s the perfect time to level up your trading experience on Kraken Pro.\nThe start of the year is an opportune moment to refine your strategies, explore new tools and optimize your trading setup for better performance and efficiency. Kraken Pro’s latest feature, custom layouts, are here to revolutionize your trading interface, making it more personal and adaptable to your unique style and requirements.\nKraken Pro recognizes that trading is a deeply personal endeavor. Custom layouts are designed to cater to this individuality, allowing traders to configure their interfaces in a way that best suits their trading style. Whether you’re a seasoned trader or just starting, these layouts offer flexibility and control over how you view and interact with the market.\nLayouts can be selected, renamed and switched using the top-right dropdown menu\nYou can choose from a range of popular presets or start from scratch to assemble any combination of widgets that align with your trading approach. These presets are thoughtfully designed to cater to different levels of expertise and trading styles:\n3/6: Simple Layout 🙂 Great for beginners! Get started with a market chart and a simple order form. pic.twitter.com/I0Qxd9Kqky\n4/6: Advanced Layout 🧰 Unleash Kraken Pro’s full power with advanced order types, customizable charts and tabs to keep track of your trading. pic.twitter.com/VwqvYsEgDn\n5/6: Terminal Layout ⚙️ Focus on analysis with live prices, a depth chart, market trades and an order book in full view. Configured for traders who favored the original Kraken terminal design. pic.twitter.com/IqT7UVUELq\nThe true beauty of custom layouts lies in versatility. You can create a layout that’s entirely unique to you. With the ability to drag, drop and resize 16 different widgets, the possibilities are nearly endless. This feature empowers you to build a trading interface that not only meets your needs but also reflects your personal trading identity:\n6/6: Create your own 👤 Design a layout from scratch to suit your personal style! Drag, drop and resize any configuration of 16 different widgets to create a trading interface unique to you. pic.twitter.com/67hTTRirLU\nThe beginning of the year is a symbolic and practical time to adopt new tools and strategies. It’s a chance to reflect on past performances, set new goals and embrace approaches that can help you achieve them. Custom layouts on Kraken Pro are more than just a cosmetic upgrade. They’re a functional enhancement that can lead to more informed decisions and efficient trading – and, ultimately, better outcomes.\nAs you set trading goals for the year, consider how custom layouts on Kraken Pro can play a pivotal role in your journey. Personalize, optimize and elevate your trading experience to new heights.\nHappy trading, and may the new year bring you prosperity and success in the crypto markets!\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-01-08T18:30:08+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/kraken-launches-your-gateway-to-the-world-of-nfts","web_url":"https://blog.kraken.com/","type":"article","description":"Since first opening Kraken NFT to beta testers, we’ve been building new features, adding more collections, and simplifying the NFT trading experience for all. Now, we’re pleased to announce that Kraken NFT is officially ready to launch. That’s right: we are no longer in Beta. Presenting Kraken NFT — your gateway to buying, selling, and […]","title":"Kraken launches your gateway to the world of NFTs","content":" Since first opening Kraken NFT to beta testers, we’ve been building new features, adding more collections, and simplifying the NFT trading experience for all. Now, we’re pleased to announce that Kraken NFT is officially ready to launch.\nThat’s right: we are no longer in Beta. Presenting Kraken NFT — your gateway to buying, selling, and learning about NFTs!\nWhat can you expect? As we’ve expanded the number of NFT collections available on Kraken NFT from 70 to over 250 (with no plans to slow down), we’ve also integrated one of the fastest growing blockchains for NFTs in the space. The ultra-fast and efficient Polygon network — along with its red-hot Reddit Collectible Avatars collection — is now accessible from Kraken NFT.\nAnd that’s not all. Let’s explore some of the things we’ve been building for you.\nWe’ve long understood that the communities behind the NFTs are often even more significant than the collectibles themselves. That’s why we’ve been curating many of the most active NFT collections the market has to offer.\nWe launched Kraken NFT with ecosystem defining collections — from groundbreaking projects like CryptoPunks and Bored Ape Yacht Club to cult-favorites like Mfers and CrypToadz.\nSince then, we kept our finger on the market’s pulse and added the hottest collections redefining the space. With anime-inspired collections like uwucrew and DigiDaigaku as well as pixel-art collections like Nakamigos and Solana Monkey Business, it is easy to find an NFT for you on Kraken NFT.\n\nWith thousands of NFTs available today for less than $100, Kraken NFT has once and for all busted the myth that NFTs are only for wealthy collectors. Check out the hundreds of NFTs available for less than $100 on Kraken NFT today.\nAll too often, gas fees stand between you and the NFT collections of your dreams. Thankfully, Kraken NFT helps your money go further by not charging gas fees for buying and selling on the platform.\nWhether there is a FOMO-inducing drop or a record-breaking spike in DeFi trading, gas fees will not stand between you and your new NFT on Kraken.\nKraken NFT makes it easy to buy and sell NFTs using the cash or cryptocurrency of your choice.\nWith Kraken NFT, there is no need to set up a Web3 crypto wallet or wrap your tokens just to get started in the space. No matter what cash or cryptocurrency a seller choses when listing an NFT, Kraken NFT makes it easy to bid on NFTs your way by choosing from more than 200 different cryptocurrencies and cash options.\nTo celebrate the launch of Kraken NFT, we’ll bring the true potential of NFT ownership to life by giving our clients the opportunity to showcase their NFTs on the world stage.\nIn partnership with the Williams Racing Formula 1 team, we will be announcing details on how you can win the opportunity to feature your favorite NFT on the rear wing of an F1 car during a race this year. If you are interested in seeing your NFT flying around the track at 200 mph, now is the time to get started with Kraken NFT.\nJust because we are out of Beta doesn’t mean we stopped building. We have an endless list of exciting perks and features you’ll love while getting started in the world of NFTs.\nFrom exclusive, client-only drops with Williams Racing to gas-free floor sweeping, we are still building the secure, easy, and innovative way to interact with the ever-evolving NFT ecosystem.\nFollow the Kraken Blog and our @KrakenNFT social account to be the first to know when we add new features and NFT collections.\nUntil then, don’t miss out! Get started with Kraken NFT today.\n\n","create_date":"2023-06-08T17:05:22+00:00","tag":"","author":"krakenfx"},
{"url":"https://blog.kraken.com/product/nft/why-buy-an-nft-collectibility","web_url":"https://blog.kraken.com/","type":"article","description":"For centuries, people have collected things. Some of these things may be nostalgic items like ticket stubs or lucky coins. Others might be especially rare items, like classic cars or limited-edition vintage watches. In many ways, the things we collect become a reflection of who we are. Whether they are physical objects we hold in […]","title":"Why buy an NFT? Collectibility","content":" For centuries, people have collected things. Some of these things may be nostalgic items like ticket stubs or lucky coins. Others might be especially rare items, like classic cars or limited-edition vintage watches.\nIn many ways, the things we collect become a reflection of who we are. Whether they are physical objects we hold in our hands, experiences we keep in our minds, or digital artifacts we admire on a screen — the items we collect are a reflection of us.\nOftentimes, we end up having deep attachments to the most unique items we collect at various stages of our lives.\nWhen things are in scarce supply, only a very limited number of people in the world can own them. This exclusivity often makes them highly appealing to prospective collectors. As a result, the high demand for these limited items typically leads to higher prices.\nThis relationship between scarcity and price is the driving mechanism behind much of the collectibles market. Rare items, whether they are pristine trading cards from a player’s rookie year or modern art masterpieces, are simply hard to come by. Because of that, people are willing to pay a premium to own them.\nThe market for limited-edition toys, stamps, and artwork is worth over $300 billion, according to a UnivDatos Markets Insights report. But even these figures pale in comparison to the potential of a relatively new form of collectibles.Non-fungible tokens (NFTs) represent the next generation of collectibles. These digital tokens have already begun opening the doors to entirely new revenue-generating opportunities. While collectibles have traditionally relied on an intermediary to verify authenticity and ownership, NFTs allow a distributed group of individuals to share this responsibility.\nNFTs are trackable, digital tokens that are immutably linked to unique tangible or intangible objects. These tokens are used to reference the current owner of an item. Items can be anything from a computer file stored on someone else’s hard drive, or a physical item kept in a safety deposit box.\nRegardless, all NFTs live on blockchains. This technology provides a fully transparent, globally accessible, and censorship-resistant method for tracking and storing ownership information. This factor allows anyone in the world to purchase and provably own items no matter where they exist in the world.\nGenerally speaking, any NFT has the potential to be collectible. However, there are some NFT-linked items that creators purposefully build to be collectible. Oftentimes, creators launch NFTs as part of a very limited collection or based on an existing franchise. Examples of these include, TIME: Pieces Build a Better Future, Damien Hirst: The Currency, and Anthony Hopkins’ The Eternal Collection.\nBeyond their aesthetic qualities, different NFT-based collections offer a range of different perks and benefits to their owners.\nSome collections focus heavily on the benefits of NFT community membership, hosting live events for their members to network and build relationships.\nOthers allow individuals to track ownership over unique digital items in metaverse experiences such as Decentraland and The Sandbox. Play-to-earn games such Axie Infinity and Star Atlas have also integrated NFTs. This feature allows players to truly own the in-game assets they accrue. Based on their accomplishments within these games, individuals can earn items that have real-world value in the form of NFTs.\nBecause NFTs exist as purely digital records that point (most commonly) to intangible items, they offer several unique advantages over physical collectibles, including:\nNFTs have value for the same reasons physical collectibles do: they’re scarce, aesthetically unique, and they represent membership in a community of fellow owners.\nAdditionally, some NFTs display traits that end up being rarer than other traits within the collection. These qualities allow individuals to quantify the rarity of different NFTs and base their numerical value on this score.\nBeyond rarity rankings, holders of certain NFT collections have begun creating their own exclusive communities that offer members-only access to private channels and platforms. Bored Ape Yacht Club (BAYC), Doodles, and Cool Cats are all examples of NFT membership-based communities. This process adds an extra layer of utility to collectible NFTs and aims to keep demand for these limited assets high.\nWhether you believe digital collectibles offer the same “value” as physical ones or not, there’s no denying that the market is gaining global interest. With sales already rivaling the prices of some extremely valuable physical collectibles, we’re definitely in uncharted — and exciting — territory.\nInterested in starting your own NFT collection? Sign up for Kraken NFT today!\n","create_date":"2023-05-25T23:31:59+00:00","tag":"","author":"krakenfx"},
{"url":"https://blog.kraken.com/news/industry-news/kraken-ceo-dave-ripley-at-dc-fintech-week-building-bridges-to-the-on-chain-future","web_url":"https://blog.kraken.com/","type":"article","description":"The collapse of FTX may have dominated discourse at DC Fintech Week, but onstage, Kraken CEO Dave Ripley made the case that this event was simply a bump in the road to a future where finance moves fully to the blockchain.  In a panel discussion featuring industry leaders like Galaxy founder Michael Novogratz, Bitso CEO […]","title":"Kraken CEO Dave Ripley at DC Fintech Week: building bridges to the on-chain future","content":" The collapse of FTX may have dominated discourse at DC Fintech Week, but onstage, Kraken CEO Dave Ripley made the case that this event was simply a bump in the road to a future where finance moves fully to the blockchain.\nIn a panel discussion featuring industry leaders like Galaxy founder Michael Novogratz, Bitso CEO Daniel Vogel and UniSwap COO Mary-Catherine Lader, Ripley took the lead in presenting how the market is evolving in the wake of the industry’s recent challenges.\nModerator Mackenzie Sigalos (CNBC) set the tone by posing a crucial question to Ripley directly, asking, “Is it a good time to be a centralized exchange?”\nRipley seized the opportunity to address the concerns surrounding custodians, which hold the private keys that control their users’ digital assets. He noted that responsible industry leaders can encourage users to embrace the benefits of blockchains by withdrawing to their wallets:\n“We’ve been a huge supporter of holding your own keys. We think FTX makes the case for cryptocurrency, because it’s the only place where you can remove trusted third parties. We are a trusted third party, we are the bridge to cryptocurrencies, and we play a meaningful role in bridging people to this world where you can do that.”\n\nKraken CEO Dave Ripley appears on the Future of Exchanges panel, starting at 1:20:00 in the video\nAs for how fast the future arrives, there was disagreement on the panel, with Lader emphasizing how blockchains like Ethereum are scaling quickly to enable more and more users to hold their own assets, and Novogratz projecting it could take decades for this transition to complete.\nNotably, he stressed the need for exchanges like Kraken, equipped with regulatory expertise and staffed by senior professionals, to help bring about that transition.\nElsewhere, the conversation shifted to the recent wave of ETF applications. Ripley noted his enthusiasm for products from incumbents that can appeal to new demographics and help rebuild trust in a crypto industry still seeking to put recent setbacks behind it.\n“All these new products that give people better access are fantastic for us,” he said, adding that Kraken’s mission is to grow cryptocurrency adoption, and that new products contribute to the industry’s overall growth, directly benefiting Kraken.\nAs an example, Ripley noted that Kraken subsidiary CF Benchmarks is the official reference rate provider for six of the over ten Bitcoin ETFs currently in the application approval process – another example of how the movement of incumbents into the industry benefits innovators like Kraken.\nThe discussion concluded with a thought-provoking question from Sigalos: “Could centralized exchanges like Kraken be replaced by decentralized exchanges?”\nIn response, Novogratz highlighted the ongoing role of centralized exchanges, especially for significant transactions involving institutional investors who are far from the “cutting edge.”\nFinally, Ripley acknowledged his belief that while finance will move to blockchains, client demand for trusted custodians like Kraken remains strong and growing:\n“We’re one of the top exchanges out there, with a team of over 2,500. We’re number one in euro trading, number one in British pound trading, and number one in Canadian dollar trading,” his remarks showcasing our global vision for crypto.\nThis was just a taste of the conversation from DC FinTech Week. For more action and highlights from the event, check out the official DC FinTech Week website.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-11-15T14:34:55+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/nft/2024-williams-grid-pass-perks","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken, the Official Crypto and Web3 Partner of Williams Racing, is excited to announce the 2024 roadmap for the Williams Racing Collectibles+ Grid Pass, powered by Kraken.","title":"Explore the perks of owning a 2024 Williams Racing Collectibles+ Grid Pass","content":" In October 2023, we launched the free Grid Pass in collaboration with Williams Racing. Since then, over 50,000 clients have claimed a Grid Pass and put it to work. They gained exclusive access to special perks like Fan Zone activities, new merchandise pre-sales and free digital collectible airdrops (that some fans have sold!).\nIn 2024, the Grid Pass has a fresh new look and will be offering a whole lot more perks including:\nIf you already have a Grid Pass there is nothing you need to do (except tell your friends who don’t have one!). Your Grid Pass design has been automatically updated to the 2024 livery.\nIf you don’t yet have a Grid Pass, what are you waiting for?! They are free (limited to one per Kraken client).\nEligibility: The Grid Pass is available in most countries around the world. To unlock all Grid Pass perks, holders will also need to create a Williams Racing account here.\nFor full terms, conditions and eligibility requirements, click here.\nClaiming a Grid Pass is instant, free, and it immediately appears in your account. Here’s a step-by-step video walkthrough:\nHere are just some of the perks for Grid Pass holders this year:\nFebruary\nMarch\nApril\nHow do I claim my Grid Pass?\nNote: To unlock all the perks of the Grid Pass, holders will also need to create a Williams Racing account here.\nWhat can I do with my Grid Pass?\nHow much does a Grid Pass cost?\nHow many Grid Passes will be available?\nCan I transfer my Grid Pass to another wallet?\nCan I lose my Grid Pass?\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any crypto asset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular crypto asset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the crypto asset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-03-11T13:00:04+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/new-otc-portal-pairs-available-for-eth-inj-and-sol","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken OTC is pleased to announce that our RFQ system now supports new Ethereum (ETH) and Solana (SOL) non-stablecoin crypto-to-crypto pairs (an OTC Portal first!) as well as a new pair for Injective (INJ).","title":"New OTC Portal pairs available for ETH, INJ and SOL","content":" Ethereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum.\nInjective (INJ) is a decentralized exchange (DEX) that offers various features such as cross-chain margin trading, derivatives and forex futures trading. Built on the Cosmos blockchain, a Layer 2 application, Injective uses bridges to offer cross-chain capabilities for traders to trade across other networks. The exchange is operated by the INJ token, Injective’s native cryptocurrency, which is used by makers and takers to pay for transaction fees on its network.\nSolana (SOL) is a blockchain platform aimed at improving user scalability. Solana is a blockchain platform that aims to increase user scalability through faster transaction settlement times and a flexible infrastructure. The SOL cryptocurrency plays a key role in maintaining and operating the Solana ecosystem and is used to execute smart contracts, send transactions, and incentivize actors that support the network.\nKraken OTC’s RFQ system is available to OTC clients. To onboard to Kraken OTC, you must be a Pro-verified Kraken client. Once this step is complete, reach out to the OTC desk to get started.\nExisting institutional clients can speak with their Account Manager to onboard to Kraken OTC.\nKraken OTC offers premium trading services to execute orders over $100,000 off the open exchange. OTC clients gain 24/7 access to deep liquidity and competitive execution and settlement services whether trading over chat or our RFQ system.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-02-01T16:12:26+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-is-recognized-as-a-newsweek-top-100-global-most-loved-workplace","web_url":"https://blog.kraken.com/","type":"article","description":"Kraken is excited to announce that we have been named #16 in Newsweek’s Top 100 Global Most Loved Workplaces® list. We are also the only crypto company on the list. This recognition reflects Kraken’s ongoing commitment to building a flexible workplace that prioritizes employee well-being. Newsweek’s rankings, backed by the rigorous analysis of the Best […]","title":"Kraken is recognized as a Newsweek Top 100 Global Most Loved Workplace","content":" Kraken is excited to announce that we have been named #16 in Newsweek’s Top 100 Global Most Loved Workplaces® list. We are also the only crypto company on the list. This recognition reflects Kraken’s ongoing commitment to building a flexible workplace that prioritizes employee well-being.\nNewsweek’s rankings, backed by the rigorous analysis of the Best Practice Institute, are based on survey results of more than two million employees from different industries and company sizes. Newsweek publishes its annual list of top-100 global companies that build their business models around respect, care, and employee appreciation.\n“We’re proud to tell the world that our unique company culture enables Krakenites to both love their work and excel in what they do,” said Pranesh Anthapur, Kraken’s Chief People Officer. “We know our Krakenites value the autonomy and flexibility we offer, and are inspired by our company’s global crypto mission. I’m pleased our teams value the dedication that has gone into building a world-class remote-first workplace.”\nWhat makes Kraken such a great place to work? In addition to compelling career growth and learning opportunities, we offer holistic health and wellness benefits. These include truly flexible PTO practices, access to in-house fitness and well-being coaches, as well as a generous grant to build a customized in-home office. Krakenites are also invested in the success of the company and the broader industry. Nearly 40% receive a part of their salary in digital assets and many of our roles come with company share options included in the compensation package.\nWe’re honored to be part of the list and we thank all our Krakenites for telling the world how much they love where they work.\nReady to join the revolution? Find the role for you at Kraken today!\nClick here to see Newsweek’s full list of 2023’s Top 100 Most Loved Workplaces®.\n","create_date":"2023-05-31T21:08:42+00:00","tag":"","author":"krakenfx"},
{"url":"https://blog.kraken.com/news/kraken-strengthens-leadership-team-with-two-key-appointments","web_url":"https://blog.kraken.com/","type":"article","description":"Gilles BianRosa appointed COO and CPO, Marcus Hughes named Global Head of Regulatory Strategy","title":"Kraken strengthens leadership team with two key appointments","content":" We are excited to announce we have further strengthened our leadership team with two key appointments that will help position us for continued growth amid evolving global regulatory environments.\nWith Gilles BianRosa as Chief Operating and Product Officer (COO/CPO) and Marcus Hughes as Global Head of Regulatory Strategy, we are gearing up to double down in our core markets as we increase product innovation and further diversify our global footprint.\n“As we get ready for the next phase of growth in crypto markets, we need to ensure we can quickly adapt to rapidly changing market trends while navigating an increasingly complex and divergent regulatory landscape,” said Kraken CEO David Ripley. “We will be innovating, launching new products, entering new markets and continuously improving our offering – all while ensuring compliance with applicable regulatory requirements across the many markets we operate in.”\nWith more than two decades of entrepreneurship and product leadership experience, Gilles brings a deep understanding of product development and operational excellence to us. Most recently, Gilles was CPO at leading European neobank N26, where he was responsible for defining, leading and implementing the global product strategy.\nHe also launched crypto trading in the neobank’s core markets. Prior to N26, Gilles was the CPO of SoundCloud and led Samsung Electronics’ content and services division.\n“I couldn’t be more excited to welcome Gilles to the Kraken team during a pivotal moment of growth for our company,” said Ripley. “He has a proven track record of delivering innovative products across global organizations with velocity. Combined with his strategic insight, this will enable us to continue carrying out our mission of making crypto accessible to its next billion users through Kraken’s leading products and services.”\nGilles will lead strategy, global business operations, product and design, driving the next generation of crypto products and services that will enable clients to seamlessly transact in crypto. Gilles reports to CEO David Ripley.\n“I’m thrilled to join Kraken in a role that blends my passions for product strategy, innovation and operational optimization,” said Gilles BianRosa. “I understand the importance of running cohesive and aligned product and operations functions and I’m looking forward to working with teams across the company to build and deploy innovative products that expand access to crypto globally.”\nWith Marcus, we gain a seasoned professional that brings a wealth of legal, commercial and regulatory expertise across traditional finance and crypto. Marcus was previously Managing Director of Coinbase’s European business and General Counsel for its international operations. With nearly a decade of traditional finance experience at Morgan Stanley before that, he is well positioned to drive our regulatory strategy and expansion efforts around the globe.\n“As a global player we need to adapt to changes in regulation across the markets we operate in while ensuring we are efficient and effective when building out our footprint to best serve our clients. There’s no one better equipped to help Kraken navigate the complexities of a fragmented and fast evolving regulatory landscape than Marcus,” said Ripley. “He will be instrumental in ensuring our offering meets the highest regulatory standards so we can offer our products and services across the globe.”\nIn his role, Marcus will collaborate with our leadership team to craft a strategy that takes into account the complex global nature of operating in crypto today. He will lead a team of legal regulatory experts across the markets we operate in. He will work closely with our government affairs team to inform our advocacy efforts and work with leaders across the organization to ensure the ongoing compliance of our offerings. Marcus reports to Chief Legal Officer Marco Santori.\n“I’m proud to be chosen to represent Kraken in our engagements with regulators across the world and help grow the company in this next phase of Kraken’s journey,” said Marcus Hughes. “Kraken’s mission of accelerating crypto adoption through a relentless focus on client satisfaction and security is contingent upon giving as many people as possible access to our product offering. I couldn’t be more motivated to help the company unlock the opportunities crypto creates for as many people as possible across the globe.”\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the crypto-asset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-01-25T13:41:45+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-successfully-passes-november-2023-proof-of-reserves","web_url":"https://blog.kraken.com/","type":"article","description":"We are thrilled to announce we have successfully completed our latest Proof of Reserves. Clients can verify their account balances are fully backed with on-chain assets, custodied securely by Kraken, for supported cryptocurrencies as of the November 30, 2023 snapshot.","title":"Kraken successfully passes November 2023 Proof of Reserves","content":" This most recent Proof of Reserves covered the most widely held cryptocurrencies: BTC, ETH, USDC, USDT, DOT, ADA and XRP. It also included the open margin positions, futures balances and on-chain staked amounts of those assets. In total, approximately 78% of all clients’ cryptoassets held on the platform were covered by this most recent attestation.\nWe pioneered the Proof of Reserves process in 2014 and have committed to undertaking it regularly since January 2022.\nProof of Reserves is still a relatively new process; it has no universally accepted definition or requirements. At Kraken, Proof of Reserves includes an independent third party attestation to prove we back your account holdings with in-kind, fully reserved assets.\nAs with our previous Proof of Reserves, we use a Merkle Tree to represent individual account balances identifiable by an encrypted, unique hash (a string of characters). We then successively hash these records until a single Merkle root hash represents the sum total of client balances covered. This means account balances can be easily verified as included in the Proof of Reserves without having to expose the underlying, unencrypted data set.\nIn this Proof of Reserves, clients can now download the full path within the Merkle Tree, from their account to the root. They can review its construction, gain a better understanding of how Kraken’s Proof of Reserves process works and personally verify the value and validity of the root hash included in the report.\nWe engaged The Network Firm, a registered CPA firm specializing in accounting and attestation services for crypto businesses, to attest to the fact that we had full control over the wallets holding client balances.\nIf you haven’t already, we encourage you to sign in to Kraken and self-verify your balances were included in this review. Please bear in mind that this Proof of Reserves only covers assets that were on the platform on November 30, 2023. Any assets held on the platform before or since that date are not included in this report. For a detailed runthrough, please check out The Network Firm’s full report accessible via the verification portal. You can also check out our What is Proof of Reserves? A Beginner’s Guide blog post. If you have any further questions, please reach out to Kraken support.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-22T16:15:21+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/promotions/new-uk-clients-can-win-a-bitcoin-with-kraken","web_url":"https://blog.kraken.com/","type":"article","description":"At Kraken, we’re committed to a world where everyone can achieve financial freedom and inclusion. So if you’re a U.K. resident thinking about getting into crypto, now is the perfect opportunity. Win a whole bitcoin Yes, you read that right! All new U.K. clients who sign up using the link below and make a trade […]","title":"New UK clients can win a bitcoin with Kraken","content":" At Kraken, we’re committed to a world where everyone can achieve financial freedom and inclusion. So if you’re a U.K. resident thinking about getting into crypto, now is the perfect opportunity.\nYes, you read that right! All new U.K. clients who sign up using the link below and make a trade of any size with our Buy Crypto widget get a shot at winning an entire bitcoin. What’s more, the first 1,000 new U.K. clients that trade £100 or more will also earn a £10-in-bitcoin bonus.\nThis offer expires Sept. 30, 2023 at 11:59 p.m. GMT +1, so don’t miss out!\n*This offer is not valid for transactions made on Kraken Pro.\n1. What’s the main prize of this campaign?\nA chance to win a whole bitcoin.\n2. Who is eligible to participate?\nNew Kraken clients, in the U.K. only\n3. How can I participate?\nRegister for a new Kraken account using the links on this page, complete the verification and make your first trade using the Buy Crypto widget:\n4. Are there any immediate bonuses available?\nYes, the first 1,000 new clients using the link on this page, to trade £100 or more using Buy Crypto widget will receive a £10-in-bitcoin bonus. Bonus will be credited to client’s Kraken wallet within 14 days of promotion conclusion.\n5. When does this offer end?\nThe offer lasts until Sept. 30, 2023 at 11:59 p.m. GMT +1.\n6. What’s the date for the whole-Bitcoin draw?\nThe draw is scheduled for Oct. 5, 2023.\n7. How long will it take for my bonus to reflect in my Kraken wallet?\nBonus will be credited within 14 days of the promotion conclusion.\n8. Are there any exclusions to this offer?\nNot valid for transactions made on Kraken Pro or for new clients outside the U.K.\n9. Are there any rules against bulk registrations or market manipulation?\nYes: wash trades, bulk registrations and other market manipulation strategies may lead to disqualification.\n10. Can Kraken modify or terminate this campaign?\nYes, Kraken reserves all rights related to this campaign, including modifications or terminations.\n11. What is the Kraken Buy Crypto widget?\nFor more information around Kraken Buy Crypto widget, click here.\n*For full terms and conditions, click here.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-09-05T15:35:00+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/bivu-das-joins-kraken-as-uk-managing-director","web_url":"https://blog.kraken.com/","type":"article","description":"We are pleased to announce the appointment of Bivu Das as our new UK Managing Director. Bivu brings nearly two decades of commercial enterprise and fintech strategy development experience to Kraken. His arrival coincides with the UK making important strides to become a globally recognised crypto hub. Bivu will oversee our extensive network of regulatory, […]","title":"Bivu Das joins Kraken as UK Managing Director","content":" We are pleased to announce the appointment of Bivu Das as our new UK Managing Director. Bivu brings nearly two decades of commercial enterprise and fintech strategy development experience to Kraken. His arrival coincides with the UK making important strides to become a globally recognised crypto hub.\nBivu will oversee our extensive network of regulatory, political and commercial relationships as we continue to scale our national footprint. We’re committed to the UK market and accelerating crypto adoption among consumers, pro traders and institutional clients.\n“Kraken has long advocated for the potential cryptoassets have to transform how everyday people interact with financial services,” said Bivu Das. “There are millions of people in the UK, as well as globally, that are underserved by the existing financial system. Kraken’s mission of accelerating crypto adoption, paired with an exceptional product offering, mean we can continue to demonstrate crypto’s disruptive potential. I’m proud to drive our UK operation forward and towards this next important phase of Kraken’s journey.”\nPrior to Kraken, Bivu co-founded a crypto startup that provides an accessible payment gateway for on-ramping and off-ramping with the digital asset ecosystem. He also led efforts by the popular neobank, Starling Bank, to navigate a hyper-growth stage of its operational development. Bivu started his career in financial services and technology consultancy, working with Big Four professional services firms and UK traditional banking institutions, such as Barclays, KPMG and Deloitte.\nKraken’s UK roots run deep:\nBivu’s appointment coincides with the UK reaching a critical juncture in its ambition to become a global crypto hub. With the recent implementation of a financial promotions framework for crypto and a broader legislative and regulatory framework well underway, the UK is now providing the regulatory clarity needed to capitalise on the opportunities of this asset class. Kraken will continue to support the UK’s regulatory authorities as they develop a competitive regulatory regime that enables innovation in the sector while protecting consumers from harm.\n“There’s an opportunity for firms committed to the UK to continue to engage with regulators as the UK’s framework for cryptoassets takes shape,” Das continued. “Better education and appreciation of the role crypto can play in the financial system of the future will be imperative for the industry to reach its mainstream potential.”\nBivu recently joined Kraken’s UK operation and will succeed Blair Halliday, who will be departing the business shortly, as Kraken’s UK Managing Director.\nTracking crypto adoption in the UK:\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-10-27T13:30:36+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/staking/earn-up-to-28-apr-when-you-stake-your-dym","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports Dymension (DYM) staking! Start staking DYM now Staking and funding DYM trading and staking are live. Add DYM to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. Stake your DYM and earn up to 28% in yearly rewards* from the Earn section […]","title":"Earn up to 28% in yearly rewards* when you stake your DYM","content":" We’re thrilled to announce that Kraken now supports Dymension (DYM) staking!\n\n\nDYM trading and staking are live. Add DYM to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nStake your DYM and earn up to 28% in yearly rewards* from the Earn section of your Kraken Pro account or from the Kraken Pro mobile app.\nDYM staking on Kraken is gasless, meaning there are no network transaction fees for staking and unstaking or for claiming and withdrawing staking rewards. Additionally, Kraken makes it easy for you to stake and unstake at any time, with no lockup periods.\nNote:\nDymension (DYM) is a blockchain network known for its RollApps. The blockchain focuses on the play-to-earn gaming and decentralized finance (DeFi) sectors, and is managed by the Dymension Hub. It enhances data handling through Data Availability Networks and offers a RollApp Development Kit for developers. The network’s operations and user rewards system are anchored by the DYM token, which was initially distributed to the community through the Genesis Rolldrop, forming a key part of Dymension’s strategic growth in the blockchain sector.\nCheck out the Kraken Learn Center article How to buy Dymension to get started!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-02-09T16:47:53+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/kraken-bolsters-its-canadian-offering","web_url":"https://blog.kraken.com/","type":"article","description":"Announcing Interac e-Transfer funding, new coin listings and updated local governance structure  Our presence in Canada is clear: We’re proud to be one of Canada’s leading crypto employers, as well as a crypto platform that offers Canadian clients over 180+ assets (and five Canadian dollar spot-trading pairs). And that’s just a start – we are […]","title":"Kraken bolsters its Canadian offering","content":" Our presence in Canada is clear: We’re proud to be one of Canada’s leading crypto employers, as well as a crypto platform that offers Canadian clients over 180+ assets (and five Canadian dollar spot-trading pairs). And that’s just a start – we are excited to announce three updates today:\nWe have added Interac e-Transfer as a funding option for all of our Canadian clients, regardless of how you access Kraken. It is now accessible across Kraken’s Mobile and Web platforms. Safely and securely conducting over a billion transactions per year, Interac e-Transfer is used by 90% of all Canadians to send CAD electronically. So what better partner to help us further our mission of accelerating the global adoption of crypto so that everyone can achieve financial freedom and inclusion?\nTo celebrate, we’ve reduced our Interac e-Transfer fee to 0.5%, providing cost-effective access to Kraken’s excellent spot pricing via deep liquidity and tight trading spreads.\nBecause we’re committed to being a bridge to the most exciting areas of crypto, we will soon be making eight new crypto assets available for trading in Canada through our secure and reliable trading platform. These include:\nExpect more to be added over time. If you have any questions about these crypto assets, or anything else, our 24/7/365 support offers tailored assistance for Canadian clients.\nFinally, we welcome cryptocurrency regulatory compliance specialist Dina Mainville to the Payward Canada board of directors. As founder of Collisionless, Dina has a deep understanding of money laundering controls for blockchain assets across multiple continents and has presented on global regulatory policy topics.\nDina has also advised numerous Global Fortune 500 companies on blockchain initiatives. She has trained hundreds of government and law enforcement professionals on cryptocurrency forensic investigation strategies which have combated money laundering, financial crime, human trafficking and other illicit activity.\nDina is the Founding Head and Chair of the Regulatory Committee at the Canadian Blockchain Consortium, and the Executive Sponsor and Head Facilitator in its Centre of Excellence. She is also a Northern Alberta Institute of Technology Advisory Board member.\nWe are constantly striving for new and better ways to serve our Canadian clients. All of these initiatives mark significant milestones in our continued efforts to give Canadians the best in crypto access while adhering to local regulations.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-09-28T12:31:26+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/eth-and-op-deposits-and-withdrawals-now-available-on-optimism","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) and Optimism (OP) on Optimism. Additionally, Optimism (OP) is now available on Kraken! Funding and trading Optimism (OP) funding and trading are already live. You can transfer ETH or OP to your Kraken account by navigating to Funding and selecting ETH […]","title":"ETH and OP deposits and withdrawals now available on Optimism!","content":" We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) and Optimism (OP) on Optimism.\nAdditionally, Optimism (OP) is now available on Kraken!\nOptimism (OP) funding and trading are already live. You can transfer ETH or OP to your Kraken account by navigating to Funding and selecting ETH or OP. From the drop-down menu, you can then select the desired deposit method (network): Optimism.\nGot ETH or OP on Optimism and a Kraken account? ⤵️\nOP is tradeable on Kraken and Kraken Pro with the following parameters:\nNote: Trading via Kraken App and Instant Buy will be available once the liquidity conditions are met (when a sufficient number of buyers and sellers have entered the market for their orders to be efficiently matched).\nEthereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum. Learn how to add ETH to your crypto portfolio with our Learn Center article How to Buy Ethereum (ETH).\nOptimism (OP) is a Layer 2 scaling solution implemented on the Ethereum network. It employs a technology known as optimistic rollups to aggregate multiple transactions, thereby alleviating congestion and lowering transaction fees on the Ethereum mainnet. OP is Optimism’s native governance token, which allows OP token holders to participate in decisions regarding the protocol’s future direction, upgrades and parameters.\nReady to deposit but don’t have a Kraken account yet? Sign up today!\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\n","create_date":"2023-09-29T11:27:21+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/eth-deposits-and-withdrawals-now-available-on-linea","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) on Linea! What is Linea?  Linea is a Layer 2 (L2) solution tailored for Ethereum, aiming to enhance scalability and flexibility for decentralized applications (dApps). It leverages zero-knowledge proofs alongside complete Ethereum Virtual Machine (EVM) compatibility, facilitating the easy development or […]","title":"ETH deposits and withdrawals now available on Linea!","content":" We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) on Linea!\nLinea is a Layer 2 (L2) solution tailored for Ethereum, aiming to enhance scalability and flexibility for decentralized applications (dApps). It leverages zero-knowledge proofs alongside complete Ethereum Virtual Machine (EVM) compatibility, facilitating the easy development or migration of dApps.\nETH funding using Linea is already live. You can transfer Ethereum (ETH) to your Kraken account by navigating to Funding, selecting ETH and in the drop-down box the desired deposit method (network): Linea.\nGot ETH on Linea? ⤵️\nEthereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum.\nLearn how to add ETH to your crypto portfolio with our Learn Center article How to Buy Ethereum (ETH).\nReady to deposit but don’t have a Kraken account yet? Sign up today!\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the crypto-asset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-04-23T15:03:25+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/trading-for-pyth-network-pyth-starts-now","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Pyth Network (PYTH) is now available on Kraken! Funding and trading PYTH funding and trading are live. Add PYTH to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.  Only deposit PYTH on Solana. Deposits using other networks will be lost. Got PYTH and a Kraken […]","title":"Trading for Pyth Network (PYTH) starts now","content":" We’re thrilled to announce that Pyth Network (PYTH) is now available on Kraken!\nPYTH funding and trading are live. Add PYTH to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit.\nOnly deposit PYTH on Solana. Deposits using other networks will be lost.\nGot PYTH and a Kraken account? ⤵️\nPYTH is tradeable on Kraken and Kraken Pro with the following parameters:\nNote:\nHere’s what you need to know about the token:\nPyth Network (PYTH) is a financial oracle solution that provides real-time market data to various blockchain protocols. The network aggregates data from multiple first-party sources in order to ensure accuracy. The PYTH token, following the Solana Program Library (SPL) standard, plays a role in the Pyth Network’s governance by allowing token holders to participate in various decisions that contribute to the future development of the network.\nReady to trade but don’t have a Kraken account yet? Sign up today!\nYes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-05T15:19:55+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/eth-deposits-and-withdrawals-now-available-on-arbitrum-nova","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) on Arbitrum Nova! Funding Funding is already live. You can transfer ETH to your Kraken account by navigating to Funding, selecting ETH and in the drop-down box the desired deposit method (network): Arbitrum Nova. Got ETH on Arbitrum Nova and a […]","title":"ETH deposits and withdrawals now available on Arbitrum Nova!","content":" We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) on Arbitrum Nova!\nFunding is already live. You can transfer ETH to your Kraken account by navigating to Funding, selecting ETH and in the drop-down box the desired deposit method (network): Arbitrum Nova.\nGot ETH on Arbitrum Nova and a Kraken account?\nEthereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network.\nIt’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum. Learn how to add ETH to your crypto portfolio with our Learn Center article, How to Buy Ethereum (ETH).\nReady to deposit but don’t have a Kraken account? Sign up today!\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\n","create_date":"2023-08-17T14:43:11+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/nft/mad-lads-bursted-bubbles-bodoggos-azuki-elementals-and-more-collections-added-to-kraken-nft","web_url":"https://blog.kraken.com/","type":"article","description":"We’ve just added five new NFT collections to Kraken NFT for our clients to explore, collect and trade.  After revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*  We will continue to […]","title":"Mad Lads, Bursted Bubbles, BODOGGOS, Azuki Elementals and more collections added to Kraken NFT","content":" We’ve just added five new NFT collections to Kraken NFT for our clients to explore, collect and trade.\nAfter revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*\nWe will continue to add a wide range of new NFT collections every week — from the hottest profile picture communities to the latest gaming experiences — across the Ethereum, Solana and Polygon blockchains.\nCheck out these collections on Kraken NFT.\nYour opinion will help shape Kraken NFT as we expand across the global market. Please check out our Support Center for any FAQs about using the marketplace, or contact Kraken Support for 24/7 assistance.\nIf you’re new to the world of NFTs, you can check out our Kraken Learn Center article, What is an NFT? to discover what all the excitement is about.\nIn addition to these latest NFT collections that have just been added, you can also browse the full list of all 250+ NFT collections available for you to explore, collect and trade on Kraken NFT.\nFollow the Kraken Blog and our @KrakenNFT social account to be the first to know when we add new features and NFT collections.\nThat’s right, we launched a new Twitter account for all things NFTs! Follow us on Twitter at KrakenNFT to be the first to know about all of the exciting things happening on Kraken NFT.\nYes! But our policy is to never reveal any details until shortly before launch — not even which NFTs we are considering. All of the NFTs available on Kraken can be found on our website, and all future NFTs will be announced on Kraken NFT’s Twitter. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nSpecific asset availability and liquidity are not guaranteed. When Kraken makes an NFT collection available for trading, it’s not a recommendation to buy, sell, or participate in the associated collection. Do your own research and invest at your own risk.\n*Gas fees will be incurred when transferring NFTs and other cryptoassets on and off the Kraken platform.\n","create_date":"2023-07-07T13:26:14+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/nft/y00ts-lo-fi-pepe-trump-digital-trading-cards-series-1-amp-2-and-more-collections-added-to-kraken-nft","web_url":"https://blog.kraken.com/","type":"article","description":"We’ve just added six new NFT collections to Kraken NFT for our clients to explore, collect and trade.  After revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*  We will continue to […]","title":"Y00ts, LO-FI PEPE, Trump Digital Trading Cards Series 1 & 2 and more collections added to Kraken NFT","content":" We’ve just added six new NFT collections to Kraken NFT for our clients to explore, collect and trade.\nAfter revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*\nWe will continue to add a wide range of new NFT collections every week — from the hottest profile picture communities to the latest gaming experiences — across the Ethereum, Solana and Polygon blockchains.\nCheck out these collections on Kraken NFT.\nYour opinion will help shape Kraken NFT as we expand across the global market. Please check out our Support Center for any FAQs about using the marketplace, or contact Kraken Support for 24/7 assistance.\nIf you’re new to the world of NFTs, you can check out our Kraken Learn Center article, What is an NFT? to discover what all the excitement is about.\nIn addition to these latest NFT collections that have just been added, you can also browse the full list of all 250+ NFT collections available for you to explore, collect and trade on Kraken NFT.\nFollow the Kraken Blog and our @KrakenNFT social account to be the first to know when we add new features and NFT collections.\nThat’s right, we launched a new Twitter account for all things NFTs! Follow us on Twitter at KrakenNFT to be the first to know about all of the exciting things happening on Kraken NFT.\nYes! But our policy is to never reveal any details until shortly before launch — not even which NFTs we are considering. All of the NFTs available on Kraken can be found on our website, and all future NFTs will be announced on Kraken NFT’s Twitter. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future.\nSpecific asset availability and liquidity are not guaranteed. When Kraken makes an NFT collection available for trading, it’s not a recommendation to buy, sell, or participate in the associated collection. Do your own research and invest at your own risk.\n*Gas fees will be incurred when transferring NFTs and other cryptoassets on and off the Kraken platform.\n","create_date":"2023-06-15T13:50:32+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/industry-news/crypto-upskilling","web_url":"https://blog.kraken.com/","type":"article","description":"When it comes to pace of innovation, few industries can match crypto. A fast-changing landscape constantly challenging assumptions, it forces us to rethink how we do things -- crypto innovation extends to the workplace, too.","title":"How crypto is leading the way in upskilling","content":" Upskilling focuses on expanding employees’ abilities and scope of knowledge within their current field. Our always-on mentality toward upskilling drives investment in the growth and advancement of our global team through initiatives like our Talent and Development program.\nDoom and gloom about technology eliminating human jobs has been around for hundreds of years. But how often do we hear about the other side of the coin?\nNew technology like generative AI empowers a workforce with ideas and new, creative directions. We believe companies that adapt to these latest tools – encouraging reskilling and upskilling – will be those best poised to reap their benefits.\nThe World Economic Forum’s 2023 Future of Jobs Report predicts 50% of all global employees will need reskilling by 2025 as technology adoption increases.\nFuture of Work thought leaders appreciate the benefits of upskilling:\nUpskilling looks different for every company. Our Talent & Development program prioritizes investing in our Krakenites, supporting our 2,300+ globally distributed Krakenites in 60+ countries.\nSo far, we’ve had great success with our upskilling courses. Krakenites that attend our workshops report a satisfaction score of 94%.\nFlexible, continuous and self-directed education opportunities foster a company full of lifelong learners. Themed training months — focusing on the latest crypto industry developments — empower employees. When AI burst onto the scene in 2023, we introduced a “Productively Paranoid” session integrating AI tips aligned with Kraken’s security policies.\nA variety of structured learning opportunities are integrated into our workday. Monthly info sessions cover key crypto topics, allowing Krakenites to upskill their knowledge through crypto fundamentals sessions and also address topics like time management and burnout prevention.\nWe foster a culture of continuous improvement by building courses based on Krakenites’ feedback. We provide sessions such as How To Talk About Crypto With Friends and Loved Ones, Derivatives and Futures in the DeFi World and Secure Elements, (where Kraken Security Labs reviews hardware wallet design and functionality).\nWe encourage Krakenites to act as educators, sharing expertise with peers every day through internal channels, cohort events and knowledge sharing platforms. Incorporating gamification into learning management systems enhances engagement and motivation. Our client engagement team organizes regular trading competitions – a form of dogfooding – to familiarize teams with our products.\nWe align learning content with our organizational priorities and business strategy, starting by clearly defining the skills required for different roles. We need to be comfortable learning on the go and operating with Savage Velocity — which requires focuses on cultivating an ownership mindset, clarifying priorities and embracing constructive disagreement. We always assume positive intent and commit to collective decisions.\nSoft skills — such as communication, teamwork and problem-solving — enable adaptable, cohesive teamwork in our rapidly evolving industry. While technical skills in blockchain development are irreplaceable, collaborative efforts and engagement with diverse teams, stakeholders and global communities are integral to the success of any crypto project.\nThat’s why Krakenites built our Level Up series. These trainings develop soft skills, building resilience, conflict resolution and time management:\nInvesting in growth and development through upskilling is a necessity in today’s crypto workplace. It benefits all involved. Upskilling is one of the most important tools for employee retention, helping any organization to maximize in-house talent.\nWant to stay ahead in crypto? Get started in the Kraken Learn Center:\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any crypto asset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular crypto asset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the crypto asset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2024-03-13T16:04:00+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/everything-must-evolve-even-finance-see-what-crypto-can-be","web_url":"https://blog.kraken.com/","type":"article","description":"We’re launching our first global marketing campaign to drive forward our mission of accelerating the adoption of crypto so everyone can achieve financial freedom and inclusion. There has been too much focus on what’s broken in the current financial system and not enough on crypto’s potential as a driver of financial freedom and inclusion. We’re […]","title":"Everything must evolve, even finance: See What Crypto Can Be","content":" We’re launching our first global marketing campaign to drive forward our mission of accelerating the adoption of crypto so everyone can achieve financial freedom and inclusion.\nThere has been too much focus on what’s broken in the current financial system and not enough on crypto’s potential as a driver of financial freedom and inclusion. We’re proud to help the world See What Crypto Can Be in our first-ever global campaign. It’s all about showcasing the incredible potential of cryptocurrency to transform lives and revolutionize finance worldwide.\nDriven by education, we’re aiming to inspire. We’re focusing on the tangible, life-changing advantages of crypto today, with an eye toward the limitless possibilities of crypto’s future:\nOur mission is clear: We are here to accelerate the global adoption of crypto so everyone can achieve financial freedom and inclusion.\nHow? By helping people understand the remarkable progress crypto represents and the role they can play in shaping the future financial landscape. And this is why:\nMother London was our creative partner on this campaign.\nIt’s all about moving forward together and creating a better experience for everyone. As one of the longest running and most trusted crypto platforms, we’ve seen many competitors come and go. We’ve been here for almost every market environment there is – for more than a decade. Through it all, we have never wavered from our mission and our cause.\n“This is our first global campaign for a reason — for 12 years we have grown organically through a great product built on world-class design and performance with a foundation of security and client service,” said David Ripley, Kraken CEO. “Now is the perfect time for us to step forward and celebrate Kraken as a mission-driven brand centered around our clients, while helping the next billion people understand what crypto can offer them today and into the future.”\nWe’re laying the foundation for the next crypto bull run by reaching out now to the audiences who will be at the forefront of the next wave of crypto adoption. We believe in focusing on facts and not hype, on education and not FOMO, on empathy and not anxiety.\n51% of people say they haven’t purchased any bitcoin because they don’t know enough about it, and we seek to empower them by providing the knowledge and tools needed to be part of this transformative journey.\n“Kraken has always valued education and providing the right resources to clients,” said Mayur Gupta, Kraken CMO. “The benefits of crypto are available to all, and Kraken is committed to providing beginners with a safe and accessible bridge to this exciting world. We want people to know Kraken and understand that we have always stood for crypto’s mission and doing what is best for clients with a deep commitment to continually improving their experience.”\nJoin us as we redefine the crypto narrative, putting the power of knowledge and the promise of a brighter financial future squarely in your hands. Get ready to embark on this incredible crypto adventure with us and See What Crypto Can Be.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-10-16T12:30:04+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/security/security-above-everything-why-every-month-is-cybersecurity-awareness-month-at-kraken","web_url":"https://blog.kraken.com/","type":"article","description":"By Nick Percoco, Kraken Chief Security Officer Cybersecurity cannot be an afterthought for a crypto platform. At Kraken, we consider securing our clients’ personal information and cryptoassets to be our highest priority, so we place security above everything. Following October’s Cybersecurity Awareness Month, we’d like to tell you more about our ongoing approach to safeguarding […]","title":"Security above everything: why every month is Cybersecurity Awareness Month at Kraken","content":" By Nick Percoco, Kraken Chief Security Officer\nCybersecurity cannot be an afterthought for a crypto platform. At Kraken, we consider securing our clients’ personal information and cryptoassets to be our highest priority, so we place security above everything. Following October’s Cybersecurity Awareness Month, we’d like to tell you more about our ongoing approach to safeguarding your personal data and cryptoassets.\nKraken was founded with a security-first mindset in 2011. Our Co-Founders witnessed the Mt. Gox exploit firsthand, as clients lost access to funds they had entrusted to that platform. It was a disaster for thousands of customers and the exchange itself.\nWe continue to strive to be a secure trading platform where clients can access the cryptoasset ecosystem and invest with confidence. For us, security is a way of life.\nSecurity is at the core of Kraken’s global operation. Over our 12-year history, we have consistently invested in our cybersecurity infrastructure, hired some of the brightest talent in the info-sec community and spent countless hours training all of our teams to be “productively paranoid.”\nBut security is not just about keeping the crypto we hold on behalf of our clients safe. The personal identifying information we maintain about our clients is just as valuable to malicious actors.\nWe aim to use the latest standards to encrypt all sensitive account information at both the system and data level. This means your identifying information is always hidden behind a powerful layer of security. After we encrypt your information, we follow a robust set of security procedures and controls that earned us ISO 27001 and SOC 2 certifications.\nWe also recognize that our security-first approach is most effective when clients understand the importance of remaining vigilant as they navigate the increasingly digital world we live in.\nBecause cybercriminals are constantly evolving their practices to extract personal information from their victims, we have invested significant resources to improve knowledge of good security practices for everyone.\nFor example, we entered a partnership with popular American scam-baiter KitBoga to creatively raise awareness of the most common crypto-related scams. We were also recognized by the CSO 50 awards for our ongoing efforts to reduce the prevalence of email phishing attacks.\nWhile Kraken is continuously striving to protect our client’s assets and personal data, we recognize the importance of clients implementing 2FA to help us in our efforts to maintain the highest level of operational security.\n2FA acts as a crucial second layer of defense that further protects your online life. We compare 2FA to having a deadbolt on the front door of your home. Yes, one lock might be sufficient to keep intruders out, but having a secondary lock that requires a different key is a powerful upgrade that further safeguards your home.\nBecause this secondary layer of protection is so vital, we believe everyone should enable 2FA on all the accounts and applications they can – especially their personal email.\nOur clients have a range of options for enabling 2FA on their Kraken accounts. For example, there are several common authenticator apps that generate one-time passcodes which can be used to authenticate an action – like verifying their account sign-in process. They can also use these passcodes to validate new wallet addresses being created or the initiation of a transaction from their Kraken account.\nWe actively encourage our clients to go one step further by enabling multiple forms of 2FAs when using our platform. This is known as multi-factor authentication (MFA), as each additional layer creates extra protection for assets and personal information.\nFor those who want an even higher level of protection, we also enable 2FA through physical hardware devices supporting the FIDO2 and WebAuthN standards. Similar to using authentication apps, hardware security devices generate unique keys that authenticate a device or service.\nHowever, these hardware devices are not subject to risks of phishing attacks, like a time-sensitive code can be. These devices use special security chips to securely generate keys that are unique to the authentic web service or mobile app they are designed for. This makes them resistant to common phishing attacks.\nFinally, while implementing a 2FA strategy is important, its effectiveness can be reduced by weak password management. Many people still use very common passwords such as password1, spring2023, qwerty or hunter2 to safeguard their accounts. The good news is that it’s easy to create secure passwords; learn how in about three minutes with this quick video:\nEight in 10 people claim to reuse their passwords across different websites. While this may be convenient for a user to remember, it creates a single point of failure for a victim should a cyber criminal compromise an account with this common password. The attacker will then attempt to gain access to all other popular sites and apps and will likely be successful in doing so.\nThe security of crypto platforms, including ours, and personal cybersecurity hygiene will be vital for cryptoassets to move into mainstream adoption. If you’re interested in learning more about our security approach, click here for more details.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken will not undertake efforts to increase the value of any cryptoasset that you buy. Crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-11-06T18:49:14+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/asset-listings/usdt-deposits-and-withdrawals-now-available-on-optimism","web_url":"https://blog.kraken.com/","type":"article","description":"We’re thrilled to announce that Kraken now supports deposits and withdrawals of Tether (USDT) on Optimism! Funding USDT funding via Optimism is already live. You can transfer Tether (USDT) to your Kraken account by navigating to Funding, selecting USDT and choosing the desired deposit method (network) from the drop-down box: Optimism. Got USDT on Optimism? […]","title":"USDT deposits and withdrawals now available on Optimism!","content":" We’re thrilled to announce that Kraken now supports deposits and withdrawals of Tether (USDT) on Optimism!\nUSDT funding via Optimism is already live. You can transfer Tether (USDT) to your Kraken account by navigating to Funding, selecting USDT and choosing the desired deposit method (network) from the drop-down box: Optimism.\nGot USDT on Optimism? ⤵️\nTether (USDT) was created in 2014 as the first stablecoin – a digital asset that aims to retain a consistent value. Tether is designed to be used as a means of converting cash to digital currency, and claims that all Tethers in circulation reflect the amount of their reserves in US dollars. By keeping reserves of cash and cash-equivalents in order to back the value of the stablecoin, Tether aims to keep a value close to 1 dollar at all times. Learn how to add USDT to your crypto portfolio with our Learn Center article How to Buy Tether (USDT).\nOptimism (OP) is a Layer 2 scaling solution implemented on the Ethereum network. It employs a technology known as optimistic rollups to aggregate multiple transactions, thereby alleviating congestion and lowering transaction fees on the Ethereum mainnet. OP is Optimism’s native governance token, which allows OP token holders to participate in decisions regarding the protocol’s future direction, upgrades and parameters.\nReady to deposit but don’t have a Kraken account yet? Sign up today!\nThere is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Kraken does not and will not work to increase or decrease the price of any particular cryptoasset it makes available. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply.\n","create_date":"2023-12-07T15:47:44+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/news/12-years-of-kraken-ceo-dave-ripley-on-empowering-the-next-billion-crypto-users","web_url":"https://blog.kraken.com/","type":"article","description":"Twelve years ago, we began our pioneering mission to become one of the first and most successful digital asset exchanges. We started by trading only four cryptocurrencies, but now support over 220 assets on 67 blockchains – and over 700 markets. We’ve been at the forefront of the crypto revolution since 2011. As one of […]","title":"12 Years of Kraken: CEO Dave Ripley on empowering the next billion crypto users","content":" Twelve years ago, we began our pioneering mission to become one of the first and most successful digital asset exchanges. We started by trading only four cryptocurrencies, but now support over 220 assets on 67 blockchains – and over 700 markets. We’ve been at the forefront of the crypto revolution since 2011.\nAs one of the longest-lived crypto exchanges in the world, Kraken’s 12th anniversary is a celebration of consistency amid massive yet volatile growth. It is a time to reflect on the importance of bearing down and focusing on fundamentals, day in and day out – especially when panic is the prevailing market sentiment, as it was for much of 2022.\nConstancy is the key to longevity. This is no secret – in crypto or anywhere else. Good sequential decisions yield positive results. Making those decisions for 12 years running – regardless of whether bitcoin was trading for $13.94 (as it was the day Kraken was founded) or $68,789.63 (as it was in 2021) – built a culture that’s resilient and obsessively focused on our mission.\nIt’s one reason Kraken was recently named the 16th most loved workplace in the world. It’s why we are stronger now than we were a year ago. Since then:\nMore people are using crypto every day – to send money to family abroad, to receive and make microloans, to combat hyperinflation. The benefits and utility of cryptocurrency are becoming more evident to more people all the time.\nCrypto removes expensive intermediaries. People use crypto in repressive regimes where fiat currency is difficult to access or rapidly losing value. Payments settle on-chain, quickly and with reduced risk. Transaction fees – especially high in traditional finance for cross-border transactions – are slashed.\nOur mission is to accelerate the adoption of cryptocurrency so that everyone can achieve financial freedom and inclusion. We believe everything can be improved, including money. Crypto is what money can be, and we are proud to play our part in its larger ecosystem, supporting the community that will empower the next billion crypto users.\n","create_date":"2023-08-02T12:00:18+00:00","tag":"","author":"KrakenFX"},
{"url":"https://blog.kraken.com/product/promotions/announcing-the-kraken-pro-battlestation-contest","web_url":"https://blog.kraken.com/","type":"article","description":"The Kraken Pro Battlestation Contest is upon us! The participant who submits the most impressive battlestation trading setup on X/Twitter will win a $1,000 gift card from Secretlab chairs.  We’re excited to see your submissions and offer you a chance to win $1,000 toward a new gaming chair from Secretlab. Entries must be completed during […]","title":"Announcing the Kraken Pro Battlestation Contest","content":" The Kraken Pro Battlestation Contest is upon us! The participant who submits the most impressive battlestation trading setup on X/Twitter will win a $1,000 gift card from Secretlab chairs.\nWe’re excited to see your submissions and offer you a chance to win $1,000 toward a new gaming chair from Secretlab.\nEntries must be completed during the Campaign Period: Oct. 6, 2023 00:00 UTC – Oct. 13, 2023 06:00 UTC.\nNotes:\n","create_date":"2023-10-03T17:13:21+00:00","tag":"","author":"KrakenFX"}
]