[{"url":"https://en.ethereumworldnews.com/sam-bankman-fried-approved-extradition/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Sam Bankman-Fried will be extradited to the United States to stand trial for defrauding FTX customers and investors.","title":"Judge Authorizes Sam Bankman-Fried Extradition To U.S. - Ethereum World News","content":" Summary:\nSam Bankman-Fried will be extradited to the United States to stand trial on fraud and money laundering charges over FTX’s crash, per reports from the New York Times and Wall Street Journal.\nBankman-Fried could be arraigned in a Manhattan Federal District Court as early as Wednesday afternoon, NYT said. SBF was held at the Bahamas Fox Hill prison after his arrest earlier in December. However, no official timeline was disclosed.\nBankman-Fried was held in custody ahead of an extradition hearing after a judge denied his bail request. SBF seemingly planned to contest U.S. extradition pending a review of the Justice Department’s criminal indictment. Prosecutors from the Southern District of New York charged Bankman-Fried on eight counts including fraud and campaign finance violations.\nThe FTX founder waived his right to contest extradition during a hearing on Wednesday. SBF’s counsel Jerone Roberts submitted an affidavit with the decision and Bankman-Fried affirmed to the court saying “Yes, I do wish to waive my right to formal extradition proceedings.”\nU.S. Attorneys charged Bankman-Fried with fraud over the collapse of FTX, a cryptocurrency exchange comingled with trading giant Alameda research, another piece of SBF’s crippled crypto empire.\nProsecutors also accused the FTX Founder of violating campaign finance laws. Bankman-Fried reportedly donated tens of millions to bipartisan U.S. lawmakers. The CFTC and SEC also charged SBF with defrauding customers, lenders, and investors.\nIn short, Sam Bankman-Fried stands accused of stealing customers’ assets on FTX to finance Alameda’s debts and trading capital. The charges argue that Bankman-Fried also instructed FTX employees to mask Alameda’s billions in liabilities on the crypto exchanges.\nBankruptcy CEO John Ray testified to congress that FTX crashed due to a lack of corporate controls and risk management at the company. SBF admitted to loose control at the FTX but denied any criminal liability or intent\n","create_date":"2022-12-21T18:28:47+00:00","tag":"FTX","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/germany-binance-license-withdraw-czhao/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Germany's financial regulator reportedly advised Binance to withdraw its crypto license application, which prompted the exchange to pause its German expansion.","title":"German Regulator Advised Binance To Withdraw License Application Due To CZ - Ethereum World News","content":" BaFin, Germany’s top financial regulator, reportedly advised Binance to withdraw its crypto license application prior to the crypto exchange’s announcement about pausing its German expansion, which came earlier this week. The regulator’s advice stemmed from concerns over the exchange’s founder and Chief Executive, Changpeng Zhao, along with other regulatory concerns.\nWhen Binance stated on July 26 that it was withdrawing its application for a crypto custody license from German regulators, it cited the changing regulatory landscape and the global market situation for its decision to pause its expansion amid regulatory scrutiny.\nHowever, the Wall Street Journal reported today that Germany’s Federal Financial Supervisory Authority (BaFin) advised the crypto exchange to withdraw the application, citing concerns over the firm’s structure and its founder Changpeng Zhao.\nBaFin was of the opinion that Changpeng Zhao wouldn’t pass a “fit and proper” test, people familiar with the matter told WSJ. The test is reportedly used to assess an individual’s reputation and professional ability to run a business it supervises. An internal Binance document viewed by WSJ further revealed that the German regulator also expressed concerns over the crypto exchange’s complicated structure.\nThe internal document, which detailed key elements of Binance’s global expansion campaign, stated that BaFin had an issue with the exchange’s structure, particularly its potential to hinder regulatory supervision. In light of the concerns, the regulator advised the crypto exchange to withdraw its crypto license application.\nA spokesperson for Binance previously told WSJ that the decision to withdraw the crypto license application was motivated by multiple factors, including efforts to secure a new European Union crypto license. The spokesperson added that the exchange intended to reapply for a German license in the future, after making appropriate changes to the application.\n","create_date":"2023-07-28T20:09:09+01:00","tag":"BaFin","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/coinbase-calls-out-apple-blocking-nft-ios/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Coinbase has revealed that Apple blocked its latest app release due to the in-app NFT trading feature. Apple has levied a 30% tax on gas fees.","title":"Coinbase Calls Out Apple For Blocking NFT Transactions On iOS - Ethereum World News","content":" Coinbase, the largest crypto exchange in the United States, has called out tech giant Apple Inc. for its monopolistic policies on commissions on NFT transactions. In a lengthy Twitter thread earlier today, Coinbase Wallet revealed that Apple had blocked its latest app release. The reason for this restriction is the gas fees associated with NFTs. Apple has reportedly claimed that the gas fees required to send NFTs need to be paid through their In-App Purchase system so that they can collect 30% on the fees.\nThe crypto wallet provider has clarified that the demands made by Apple are not possible to meet. The company has further alleged that Apple’s new policies are aimed at protecting their profits at the expense of consumer investment in NFTs. Additionally, this move also creates a hindrance in developer innovation across the crypto ecosystem.\nFor anyone who understands how NFTs and blockchains work, this is clearly not possible. Apple’s proprietary In-App Purchase system does not support crypto so we couldn’t comply even if we tried.”\nAccording to Coinbase, iPhone users that own NFTs stand to lose the most from Apple’s policy change. The policy will make it difficult for users to transfer NFTs. Coinbase has indicated that it is willing to work with the tech giant to find a solution.\nWe hope this is an oversight on Apple’s behalf and an inflection point for further conversations with the ecosystem. @apple – we’re here and want to help\nApple has ignored repeated calls to exempt NFTs from its notorious 30% cut, which has been dubbed the “Apple Tax”. On 24 October 2022, the firm updated its App Store policy, which included guidelines for NFTs as well. This was the official nod from Apple for iOS apps offering in-app NFT buying and selling as well as minting, as long as the “Apple Tax” is paid.\nPer a report by The Information, Apple’s app store policies have had a direct impact on NFT startups. Due to these policies, NFT marketplaces don’t even consider selling through mobile apps, leaving a large portion of potential buyers untapped. According to Magic Eden’s co-founder and Chief Technology Officer Sidney Zhang, Apple’s commissions are the reason why her NFT startup has never offered buy and sell functions on its app.\n","create_date":"2022-12-01T19:17:18+00:00","tag":"apple","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/futuresai-the-jigsaw-puzzle-of-your-crypto-trading%ef%bf%bc/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"However, putting it all together for a winning trade can feel overwhelming. Luckily for you, that's where FuturesAI comes in, the missing piece you've been","title":"FuturesAI: the Jigsaw Puzzle of Your Crypto Trading￼ - Ethereum World News","content":" However, putting it all together for a winning trade can feel overwhelming. Luckily for you, that’s where FuturesAI comes in, the missing piece you’ve been searching for to complete your crypto trading success story.\nImagine an AI assistant by your side, constantly scanning the market and whispering trade suggestions in your ear. That’s the power of FuturesAI’s AI engine.\nIt acts like those essential corner pieces in a jigsaw puzzle, providing a solid foundation for your trading strategy. Also, FuturesAI goes beyond essential guidance, as it offers a variety of available futures trading options and access to even the most volatile assets to give you more control over your trades.\nNo need to worry if you’re a beginner puzzler, as FuturesAI’s user-friendly interface makes navigating the platform a breeze and helps you complete the puzzle.\nAnd you’re not alone on your trading journey, as FuturesAI fosters a supportive community, just like having fellow puzzlers to consult. Their partnership program and revenue share model provide valuable grounds to help you become a master crypto trader.\nWith FuturesAI as your partner, you’ll finally be able to assemble all the pieces for successful trades!\nFuturesAI offers a 25% welcome bonus to jumpstart your success, like that bonus picture motivating you to finish the puzzle. It’s the perfect incentive to dive into crypto futures trading with confidence.\nThe FuturesAI Partnership Program isn’t a one-way street designed to create a mutually beneficial ecosystem, just like a perfectly interlocking puzzle piece.\nSo, as a referrer, you’ll earn a 5% – 20% commission on your referrals’ trades based on your network’s growth. Also, you’ll gain access to a comprehensive dashboard to track your earnings and network activity to have transparency and peace of mind.\nFurthermore, those you refer can enjoy a 25% discount on trading fees, making it easier for them to jump into the crypto futures game. On top of that, they’ll receive a 20% bonus on their first deposit, giving them additional capital to explore the platform.\nThe FuturesAI platform isn’t just about providing advanced tools and a smooth trading experience. It’s about empowering its users financially through the $FAI token, another crucial piece of the puzzle in our ecosystem.\nThe $FAI token goes beyond simply buying and selling, and through its innovative revenue-sharing model, it redefines investors’ participation within the crypto trading landscape.\nBy staking their $FAI tokens, holders can share the platform’s profits from trading fees.\nThis feature embodies our commitment to a decentralized and community-driven future where every stakeholder benefits directly from the platform’s success, fostering a collaborative and rewarding environment for all.\nAs the FuturesAI puzzle still needs to be completed, with a dedication to bringing users the most advanced tools and features for a seamless crypto trading experience, this relentless pursuit of progress sets FuturesAI apart.\nThe FuturesAI team is working on developing and launching exciting new features and complementary products that add real value to the FuturesAI ecosystem.\nCurious about what the future holds for FuturesAI? The platform’s Development Runway offers a glimpse into upcoming ventures and strategic direction.\nDon’t miss a single piece! Check the official website to find them, and follow them on social media channels like Telegram and X (Twitter) to be the first to discover more clues.\n","create_date":"2024-05-02T10:02:16+01:00","tag":"","author":"Guest Post"},
{"url":"https://en.ethereumworldnews.com/binances-changpeng-zhao-says-he-will-continue-to-financially-back-musks-twitter-buyout-deal-bloomberg/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Per a Bloomberg report, Binance's CEO, Changpeng Zhao, has stated that he will continue to back Musk's $44 billion Twitter buyout deal amidst \"rising concerns","title":"Binance's Changpeng Zhao Says He Will Continue To Back Musk's Twitter Buyout Deal: Bloomberg - Ethereum World News","content":" Per a Bloomberg report, Binance’s CEO, Changpeng Zhao, has stated that he will continue to back Musk’s $44 billion Twitter buyout deal amidst “rising concerns from Washington about foreign investors supporting the bid offer.”\nBinance’s CEO, CZ, Has Committed $500 Million To Musk’s Twitter Deal.\nThe CEO of leading cryptocurrency exchange Binance, Changpeng Zhao, has said that he will continue supporting Musk’s Twitter buyout deal.\nWhile attending the Kingdom’s Future Investment Initiative Conference in Riyadh, Saudi Arabia, Zhao was asked whether he would stand true to his financial commitment made to Musk concerning his Twitter bid offer, to which Zhao candidly responded, “I think so.”\nThe Bloomberg report further outlines how Biden administration officials are currently holding discussions on whether the US should intervene and subject some of Musk’s ventures, including Starlink and his Twitter deal, to national security reviews.\nPer the report, some US officials are especially concerned about the array of foreign investors that are backing Musk’s Twitter deal at the moment. As stated by Gregory Lafitte, head of merger arbitrage trading at Tradition Securities and Future, Musk’s bid offer is currently backed by Prince Alwaleed Bin Talal of Saudi Arabia, Binance’s CEO Changpeng Zhao, and Qatar’s sovereign wealth fund.\nBinance’s CZ had earlier announced his decision to commit $500 million to Musk’s Twitter deal. The official announcement was uploaded on Binance’s website, where CZ had made comments on how the company is “excited to help Elon realise his new vision for Twitter.”\n“We hope to be able to play a role in bringing social media and web3 together and broadening the use and adoption of crypto and blockchain technology.” Binance’s Changpeng Zhao\nSouth Korea’s Mirae Asset Group May Commit 300 Billion Won To Musk’s Twitter Bid: Reuters\nSouth Korea’s Mirae Asset Group has joined the Twitter bid race and is planning to commit $208 million to Musk’s bid offer, a person familiar with the matter told Reuters.\nMirae Asset is known to have forged several entrepreneurial ties with Tesla’s CEO, Elon Musk, including investing in Musk’s rocket and satellite company, SpaceX.\nPer the new report, the offer with Mirae will reportedly be finalised in the next few days before the closing of the Twitter bid deal this Friday, October 28.\n","create_date":"2022-10-25T17:09:29+01:00","tag":"","author":"Juhi Mirza"},
{"url":"https://en.ethereumworldnews.com/mastercard-ends-binance-debit-card-tie-up/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Fintech giant Mastercard has announced that it will end its co-branded crypto debit card partnership with Binance in the Middle East and Latin America.","title":"More Banking Trouble For Binance As Mastercard Ends Partnership - Ethereum World News","content":" Payment processing giant Mastercard has decided to end its crypto debit card program with Binance in the Middle East and South America. The crypto exchange’s users in Bahrain, Brazil, Colombia, and Argentina will no longer be able to use their Binance co-branded Mastercard crypto debit card to make payments in fiat currencies.\nA Mastercard spokesperson said in an email that the company is set to end its co-branded debit card program with Binance, Bloomberg reported earlier today. It is unclear why the payment processing giant decided to end its partnership with the world’s largest crypto exchange.\nStarting September 22, 2023, the crypto debit card users in the four countries mentioned above will not be able to spend the crypto holdings on their exchange accounts through the Mastercard crypto debit card. Binance Customer Support on X (formerly Twitter) stated that less than 1% of the users in Latin America and the Middle East will be affected by Mastercard’s move.\nBinance accounts around the world are not affected. Where available, users can also shop with crypto and send crypto using Binance Pay, a contactless, borderless, and secure cryptocurrency payment technology designed by Binance.”\nThe latest development comes amid mounting legal and regulatory trouble for Binance. The crypto exchange became the subject of enforcement actions earlier this year, leading to complications with banking partners. Mastercard clarified that the decision will not affect its other crypto card programs. The company has similar co-branded card tie-ups with crypto exchanges Gemini and Nexo.\nMastercard’s decision to end a high-profile crypto partnership comes nearly four months after it announced that it was looking to expand its crypto card tie-ups. The company’s head of crypto and blockchain, Raj Dhamodharan, stated in April 2023 that his company was seeking more partnerships with crypto firms despite the sector-wide crackdown by regulators.\n","create_date":"2023-08-24T20:00:16+01:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/mica-officially-signed-eu-policymakers/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The Markets in Crypto Assets (MiCA) bill developed to create standard rules for crypto businesses operating in EU states was officially signed on Wednesday,","title":"Landmark MiCA Law Officially Signed By EU Policymakers - Ethereum World News","content":" Summary:\nThe Markets in Crypto Assets (MiCA) bill developed to create standard rules for crypto businesses operating in EU states was officially signed on Wednesday, May 31, and marks a watershed moment for the broader crypto industry.\nMiCA’s policies which introduce a licensing framework are accompanied by new anti-money laundering rules that require exchanges and crypto providers to verify users’ identities. The bill was first proposed in 2020, surviving endless parliamentary debates and revisions.\nControversy threatened to tarnish the bloc’s crypto rules when lawmakers mulled what was essentially a ban on Proof-of-Work blockchains like Bitcoin due to environmental concerns. Policymakers ultimately binned the idea, giving room for Bitcoin and other PoW-powered assets in European markets.\nNearly three years after its debut, MiCA is now officially into law by the European Parliament President Roberta Metsola and Sweden’s Rural Affairs Minister Peter Kullgren.\nMiCA will be published in the EU’s Official Journal now that officials have signed. It will take weeks after this publication for MiCA to be recognized and impact the bloc’s regulatory landscape. However, the rules will not take full effect till 12-18 months after appearing in the Official Journal. This will give policymakers and crypto business time to adjust to the new status quo.\nThe bill requires trading venues and wallet providers to secure a license before offering their services to EU users. Stablecoin issuers like Tether and Circle must also hold sufficient reserves if they wish to operate in any of the bloc’s 27-member states.\n","create_date":"2023-05-31T18:50:43+01:00","tag":"Crypto Regulations","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/ftx-ryan-salame-plea-deal-prosecutors/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Former FTX executive Ryan Salame is reportedly negotiating a olea deal with federal prosecutors in relation to the charges stemming from FTXs collapse.","title":"FTX’s Ryan Salame Explores Plea Deal A Month After Campaign Finance Violation Probe - Ethereum World News","content":" Ryan Salame, the former Co-Chief Executive of FTX Digital Markets, has reportedly held talks with federal prosecutors regarding a plea deal in connection with the charges stemming from the crypto exchange’s collapse. News of the plea deal negotiation comes more than three months after the Federal Bureau of Investigation (FBI) raided Salame’s house in Potomac, Maryland.\nPeople familiar with the matter revealed that Ryan Salame could plead guilty to charges related to FTX as soon as next month, Bloomberg reported earlier today. The charges will likely include criminal offenses in relation to the bankrupt crypto exchange and campaign finance law violations. Salame is one of the few executives who haven’t faced any charges following FTX’s collapse in November last year.\nIt is unclear if the former FTX executive’s plea deal with the Department of Justice would require him to testify against his former boss Sam Bankman-Fried, who is facing multiple charges, including wire fraud, securities fraud, bribery allegations, campaign finance laws violations, etc. Salame’s former co-workers, including ex-Alameda Research CEO Caroline Ellison and FTX co-founder Gary Wang, have already entered plea agreements with the Justice Department and will testify in the lawsuit against Bankman-Fried.\nSalame was known to be a prolific political donor and previously made headlines for donating as much as $24 million to Republican candidates in the United States. His political campaign contributions came under scrutiny last month after federal prosecutors initiated an investigation over potential campaign finance laws violations in relation to the political campaign of his girlfriend, Michelle Bond, who was a congressional candidate in 2022.\n","create_date":"2023-08-09T03:15:42+01:00","tag":"Caroline Ellison","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/binance-sell-500-million-ftt-stockpile/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance CEO Changpeng Zhao took to Twitter earlier today to announce that his exchange will be getting rid of its FTX Token (FTT) holdings. The announcement","title":"Binance To Sell Off $500M $FTT Holdings Following Insolvency Rumors, CEO Of Alameda Fights Back - Ethereum World News","content":" Binance CEO Changpeng Zhao took to Twitter earlier today to announce that his exchange will be getting rid of its FTX Token (FTT) holdings. The announcement comes after days of speculation and FUD about FTT.\nAs for the timeline of this sale, CZ stated that it will be spread out over a period of several months in order to limit the impact on the market.\nWe will try to do so in a way that minimizes market impact. Due to market conditions and limited liquidity, we expect this will take a few months to complete”\nCZ cited “recent revelations” concerning the token which incited the sale. These revelations are likely to be the financial health of Alameda Research. Alameda is Sam Bankman-Fried’s quantitative trading firm. Alameda also happens to be the largest holder of FTT, along with its sister firm FTX. Alameda and FTX hold a total of 245 million FTT, which is roughly 74.5% of the token’s total supply.\nAt present time FTT is trading at $22.6, down more than 7% over the past 24 hours. The token’s price saw a sharp decline following the FUD around Alameda’s finances. This can be traced back to an article that was published by CoinDesk earlier this week, which cast a shadow of doubt over the company’s financial health. The fact that the majority of Alameda’s assets are a token created by FTX, has caused speculation regarding the future of FTT.\nA few notes on the balance sheet info that has been circulating recently: – that specific balance sheet is for a subset of our corporate entities, we have > $10b of assets that aren’t reflected there\nCaroline Ellison, CEO of Alameda Research, responded to CZ’s tweet with an offer to buy the exchange’s FTT stock at $22 per token. Ellison also addressed the speculation about her company’s finances and clarified that the balance sheet in question was that of a subset of Alameda’s corporate entities.\n","create_date":"2022-11-06T18:49:04+00:00","tag":"Alameda Research","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/michael-saylor-new-yorks-bitcoin-law-damaging-to-the-environment-reputation-economy-of-the-state/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Microstrategy CEO Michael Saylor has chimed in on the proposed law by legislators in the State of New York to ban proof-of-work mining operations on the","title":"Michael Saylor: New York's Proposed Bitcoin Law is Damaging to the Environment, Reputation and Economy of the State - Ethereum World News","content":" Quick summary:\nMicrostrategy CEO Michael Saylor has chimed in on the proposed law by legislators in the State of New York to ban proof-of-work mining operations on the premise that such activities are detrimental to the environment.\nAccording to Mr. Saylor, the proposed regulation ‘is damaging to the environment, reputation and economy of the state of New York. Furthermore, the proposed legislation demonstrates how ‘the law can be manipulated maliciously to harm a competitor.’\nThe proposed regulation of #Bitcoin energy use in New York is damaging to the environment, reputation & economy of NY and demonstrates that the law can be manipulated maliciously to harm a competitor. If this disturbs you, please let the NY Senate know.https://t.co/h4gec4qOVX\n— Michael Saylor⚡️ (@saylor) May 4, 2022\n\nMr. Saylor shared his insights into the situation of the proposed bill to ban proof-of-work mining in New York through Twitter. He also urged his social media followers on the platform to let the New York Senate know that the bill was not a good idea.\nHe shared a link to an online petition by the Chamber of Digital Commerce that reiterated that if the bill went through, it would set a dangerous president for other states to follow. Consequently, it would have many adverse effects on the entire digital asset space and America’s standing as a leader in the industry.\nThe petition said:\nThe New York State Assembly recently passed legislation (A.7389-C / S. 6486-C) that would create a moratorium on proof-of-work mining operations in the state and establish a dangerous precedent for other states across the country to follow.\nThe proposed moratorium would have many negative consequences for the digital asset industry and its future. Not only would it significantly hinder New York’s innovation economy, but also it would eliminate important green jobs, many of which are filled by Union employees.\nFurther, it threatens America’s standing as a leader in the global digital asset marketplace at a critical juncture for our industry.\nThe petition outlines the following ways in which the crypto community can help.\nSenate Majority Leader Andrea Stewart-Cousins: (518) 455-2585, [email protected] Senate Deputy Majority Leader Michael Gianaris: (518) 455-3486, [email protected] Senate Finance Committee Chair, Senator Liz Krueger: (212) 490-9535, [email protected] Economic Environmental Conversation Committee Chair, Senator Todd Kaminsky: (516) 766-8383, [email protected]\n","create_date":"2022-05-04T18:58:15+01:00","tag":"Bitcoin (BTC)","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/2billion-ethereum-rewards-unlock-shapella/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"$2 billion in Ethereum rewards will unlock to validators within 5 days of the Shapella upgrade scheduled for later today.","title":"$2 Billion In Ethereum Validator Rewards To Unlock Following Shapella Upgrade - Ethereum World News","content":" Summary:\nValidators on the Ethereum network will finally have the option to withdraw accumulated rewards worth $2 billion at current prices after ETH developers ship the Shapella upgrade later today.\nThe Shanghai-Capella update will also unlock 18 million ETH stock-piled by validators, regular depositors, and other entities since late 2020 when crypto’s largest altcoin blockchain introduced its staking smart contract on the beacon chain layer.\nOn-chain data suggests that validators have 1.1 million ETH in rewards to withdraw from after waiting for over two years. After Shapella unlocks nearly $35 billion in staked ETH, two withdrawal options will go live for network rewards – complete and partial withdrawals.\nPartial withdrawals will be paid out to validators automatically if they possess the ‘0x01’ withdrawal credential. A Glassnode report noted that only 44% out of over half a million validators have registered to claim automatic partial withdrawals.\nThese automatic withdrawals will disburse every 12 seconds to as many as 16 validators with each block that Ethereum produces. The withdrawals could take five days to complete and will help maintain the set validator balance of 32 ETH.\nComplete or full withdrawal involves total exit from Shapella and Ethereum’s proof-of-stake network. Such withdrawals are capped at 57,600 ETH per day and can only be withdrawn by 1,800 validators daily. This comes to about $109 million per day in unstaked ETH. Developers set this limit to curtail a validator exodus and cushion the effects of mass unstaking.\nSo far, almost 4,000 validators are waiting to fully exit Shapella with about 141,000 ETH. Altogether roughly $2.6 billion in 1.4 million ETH should become accessible days after Shapella ships to Ethereum’s mainnet.\n","create_date":"2023-04-12T16:12:40+01:00","tag":"Ethereum (ETH)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/opensea-optional-creator-fees-royalties/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Leading NFT marketplace OpenSea has announced that it will disable its royalty enforcement tool and make creator fees on secondary sales optional.","title":"OpenSea Shuts Down Royalty Enforcement, Makes Creator Fees Optional - Ethereum World News","content":" OpenSea has reversed its policy on royalties for NFT artists by making creator fees optional, citing competition from rival marketplaces, including Blur, LooksRare, and Dew. The leading NFT marketplace announced earlier today that the changes would go into effect on August 31, 2023. Post this date, NFT artists who sell digital art on the platform will receive royalties on secondary sales only if the buyer chooses to pay it.\nIn addition to making royalties optional, the OpenSea Operator Filter will also be shut down, the NFT marketplace stated in a blog post. Operator Filter, which was launched in November last year, is a tool used by NFT artists to restrict the sale of their collections to marketplaces that don’t enforce creator fees in secondary sales.\nThe objective of the Operator Filter was to empower NFT creators by giving them control over their artwork and web3 business models. But OpenSea claimed that the tool required the participation of everyone in the web3 ecosystem, which did not happen, prompting the change in the royalty policy.\nAccording to OpenSea, the option creator fees would be more in line with the choice and ownership in the DeFi space. Starting August 31, the Operator Filter will not block any web3 marketplaces, making it easier for potential NFT buyers to identify secondary listings. This would include the creator’s preferred fees, as well as the option for buyers to modify the creator fees payment.\nHowever, for NFT creators who enable the OpenSea Operator Filter for their collection before August 31, the NFT marketplace will enforce the creator’s preferred royalty on all secondary sales till February 29, 2024. This option will also be extended to existing collections on all non-Ethereum blockchains.\nCraziest thing Opensea ever did was make creator royalties optional. Shortsighted knee jerk reaction to compete with Blur, which will end up dying anyway. pic.twitter.com/G4aPWmrwJx\nThe NFT community on X (formerly Twitter) expressed frustration with OpenSea’s decision to make creator fees optional. NFT artists questioned the incentive to stay with OpenSea instead of going to rival marketplaces like Blur.\n","create_date":"2023-08-18T02:58:15+01:00","tag":"Blur","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/sam-bankman-fried-tried-to-influence-witness-testimony/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The U.S Attorney's Office has asked for Sam Bankman-Fried's bond terms to be altered after the latter contacted employees of FTX in an attempt to influence their testimony.","title":"Prosecutors Claim Sam Bankman-Fried Tried To Influence Witness’ Testimony - Ethereum World News","content":" The U.S. Department of Justice has taken issue with Sam Bankman-Fried’s attempts to reach out to employees of FTX. According to a letter to Judge Lewis Kaplan, who is overseeing the criminal case against the former FTX CEO, the U.S. Attorney’s office is seeking a modification of SBF’s pretrial release in order to address the inappropriate communications he engaged in.\nDamian Williams, the U.S. Attorney for the Southern District of New York, informed Judge Kaplan that SBF reached out to Ryne Miller, the General Counsel of FTX US, on 15 January. Several messages were sent using email and Signal, an encrypted messaging application.\n\n“I would really love to reconnect and see if there’s a way for us to have a constructive relationship, use each other as resources when possible, or at least vet things with each other,”\nFederal prosecutors believe that SBF’s messages are suggestive of an effort to influence Miller’s potential testimony and that the appeal for a “constructive relationship” implies that Miller should align with his former boss. The prosecutors claimed that SBF is aware that Miller has information that can potentially “inculpate” him.\nSam Bankman-Fried reached out to other current and former employees of FTX. These communications have become a matter of concern for the Department of Justice. The U.S. Attorney’s Office has asked the court to impose two conditions on SBF’s bond. The first is that he shall not contact any employees of FTX, former or currently employed. The second condition is that he shall not use any encrypted or ephemeral call or messaging application, including but not limited to Signal.\n","create_date":"2023-01-28T12:43:19+00:00","tag":"FTX","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/trx-expands-ethereum-bittorrent-bridge/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"TRX, the native asset on the Tron blockchain founded by crypto mogul Justin Sun, is expanding on crypto's largest altcoin network Ethereum.","title":"Justin Sun's TRX Expands To Ethereum Via BitTorrent Bridge - Ethereum World News","content":" Summary:\nTRX, the native asset on the Tron blockchain founded by crypto mogul Justin Sun, is expanding on crypto’s largest altcoin network Ethereum.\nSun tweeted that Tron’s token “is now fully accessible within the Ethereum ecosystem”. The asset will use BitTorrent Bridge to expand its reach and boost Tron liquidity on Ethereum. Friday’s announcement provided a contract address for Tron users utilizing TRX on Ethereum’s blockchain.\nTron’s native token is ranked in the top 100 cryptocurrencies at #12, per CoinMarketCap. The token’s market cap was above $8 billion as of the time of writing and boasted over $162 million in 24-hour trading volume. TRX’s price jumped 2% after Sun shared the news.\nData also shows that Tron is somewhat of an authority in DeFi with the second-largest total value locked (TVL) worth $5.6 billion and over $45 billion in stablecoins. Only Ethereum $27 billion in TVL and $69 billion in stables ranks higher, DeFiLlama shows.\nDeveloper activity on Tron seems to move at a modest pace compared to other top networks like Ethereum and Binance Smart Chain (BSC). 22 protocols run atop Tron’s network and JustLend dominates the TRX ecosystem accounting for over half of Tron’s TVL.\nJustin Sun said he would trade memecoins and donate the profits to charity amid a frenzy led by tokens like Pepe, a memecoin inspired by the popular “Pepe The Frog”. At the time, fees on marquee networks like Bitcoin and Ethereum hit ATHs as speculative traders aped into these memecoins.\nThough obviously risky, the trading trend may spotlight the gambling nature or “degenerate/degen” side of the crypto community.\n","create_date":"2023-06-02T13:13:59+01:00","tag":"cryptocurrency","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/blockfi-objects-to-ftx-and-3ac-clawbacks/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Bankrupt crypto lender BlockFi has stated that it will block attempts by FTX and Three Arrows Capital to claw back billions of dollars exchanges last year.","title":"BlockFi Pushes Back On Repayment Sought By FTX & Three Arrows Capital - Ethereum World News","content":" BlockFi has stated that it is ready to stop attempts by FTX and Three Arrows Capital (3AC) to claw back billions of dollars in an attempt to repay their own stranded creditors. The defunct crypto lender has argued that its bankruptcy was the result of the fraud perpetrated by fellow bankrupt crypto firms.\nAccording to a recent filing in the U.S. Bankruptcy Court for the District of New Jersey, BlockFi claims that its clients and creditors are the “ultimate victims” of FTX’s fraud. The bankrupt crypto lender added that FTX’s attempts to recover claims worth $5 billion from its bankruptcy estate would do injustice to its creditors.\nBlockFi pointed out that it was a victim of FTX and urged the bankruptcy court to reject the bankrupt crypto exchange’s claims under the doctrine of unclean hands. FTX previously stated that it would actively pursue the amount repaid to crypto lender before it collapsed in November last year.\nThe $5 billion in question refers to the amount lent to FTX, which it allegedly misappropriated. FTX attempted to remedy the situation by paying $400 million to BlockFi in June 2022, apart from acquiring equity in the troubled crypto lender via a loan agreement.\nJust because FTX’s fraudulent actions caused FTX’s bet to fail does not mean BlockFi’s creditors are now somehow liable to refund the purchase price.”\nSimilarly, the bankrupt crypto lender argued that Three Arrows Capital was not entitled to repayment, claiming that the crypto hedge fund used fraud to borrow the funds in question. 3AC previously took out loans from the crypto lender in June last year, which were subsequently defaulted. This prompted the foreclosure on the collateral, leading to what 3AC’s liquidators described as a $220 million “preferential payment to BlockFi.\nBlockFi also informed the bankruptcy court that litigation with FTX and 3AC would reduce the payout to its stranded customers by as much as $1 billion. The bankrupt lender owes between $1 billion and $10 billion to its creditors.\n","create_date":"2023-08-23T03:43:00+01:00","tag":"3AC","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/sam-bankman-fried-fraud-ftx-customers/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The U.S. Securities and Exchange Commission charged FTX founder Sam Bankman-Fried with defrauding equity investors and customers of the bankruptcy","title":"Sam Bankman-Fried Charged With Defrauding FTX Customers And Investors: SEC - Ethereum World News","content":" Summary:\nThe U.S. Securities and Exchange Commission charged FTX founder Sam Bankman-Fried with defrauding equity investors and customers of the bankruptcy cryptocurrency exchange. SBF was also arrested in the Bahamas after authorities received formal confirmation of criminal charges against Bankman-Fried in the United States.\nSouthern District of New York prosecutors charged Sam Bankman-Fried with wire fraud, securities fraud, and money laundering, per the New York Times.\nUSA Damian Williams: Earlier this evening, Bahamian authorities arrested Samuel Bankman-Fried at the request of the U.S. Government, based on a sealed indictment filed by the SDNY. We expect to move to unseal the indictment in the morning and will have more to say at that time.\nAccording to the SECs filing, SBF deceived equity investors of FTX Trading Ltd while also defrauding retail customers as well. The commission noted that Bankman-Fried raised over $1.8 billion from around 90 U.S.-based investors between May 2019 and November 2022.\nThe SEC said SBF branded himself as a “responsible leader of the crypto community” while “orchestrating a massive, years-long fraud”.\nCustomers around the world believed his lies, and sent billions of dollars to FTX, believing their assets were secure on the FTX trading platform. But from the start, Bankman-Fried improperly diverted customer assets to his privately-held crypto hedge fund, Alameda Research LLC (“Alameda”), and then used those customer funds to make undisclosed venture investments, lavish real estate purchases, and large political donations.\nTuesday’s filing noted that Bankman-Fried continued funding Alameda with FTX customer deposits when his trading giant was unable to meet loan obligations after the crypto crash in May 2022.\nThe SECs filing argued that Alameda was bolstered with FTX customer assets in order to keep up appearances and maintain access to cash injections from investors and lenders. Also, the charges confirmed that company assets were used to fund personal loans to SBF and other top FTX executives.\nBut Bankman-Fried did not stop there. Even as it was increasingly clear that Alameda and FTX could not make customers whole, Bankman-Fried continued to misappropriate FTX customer funds. Through the summer of 2022, he directed hundreds of millions more in FTX customer funds to Alameda, which he then used for additional venture investments and for “loans” to himself and other FTX executives.\nSEC prosecutors further opined that Sam Bankman-Fried remained active in decision-making at Alameda despite appointing Caroline Ellison and Sam Trabucco as joint heads of the company. The allegations threw more doubt on claims from SBF that he had little knowledge of day-to-day operations at Alameda.\nBankman-Fried remained the ultimate decision-maker at Alameda, even after Ellison and Trabucco became co-CEOs in or around October 2021. Bankman-Fried directed investment and operational decisions, frequently communicated with Alameda employees, and had full access to Alameda’s records and databases.\nSam Bankman-Fried was the first to face charges following FTX’s collapse in November 2022. The fallen crypto tycoon was in custody and awaiting possible extradition to the U.S. at press time.\n","create_date":"2022-12-13T12:12:13+00:00","tag":"Alameda Research","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/prosecutors-fraud-charges-binance-cz/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Prosecutors have not reached a consensus on whether to indict Binance and its executives on fraud and money laundering charges.","title":"Federal Prosecutors Mull Charges Against Binance and CEO Changpeng Zhao: Reuters - Ethereum World News","content":" Summary:\nReuters reported that a “split” between prosecutors in the U.S. Department of Justice impeded a decision on whether criminal charges should be brought against crypto exchange Binance and its CEO Changpeng Zhao.\nFederal prosecutors previously opened investigations into Binance and several executives at the company in 2018, including CZ. Reports said that Zhao and his company were under probe due to suspicions of “unlicensed money transmission, money laundering conspiracy, and criminal sanctions violations”.\nAround a dozen prosecutors on the case proposed “aggressively moving” against Zhao’s company, Reuters reported on Monday. The U.S. Justice Department was unable to reach a consensus on the matter as other lawyers said more time was needed to review evidence.\nFurthermore, Reuters claims that lawyers from Gibson Dunn met with Justice Department officials to discuss possible plea deals. Gibson Dunn represents the cryptocurrency exchange as a U.S. law firm.\nFriction between Binance and Reuters erupted following a series of reports from the media company that accused CZ’s exchange of violating U.S. sanctions and laundering $10 billion for criminal organizations. Binance said the reports leveraged outdated information and contested the claims.\nOn Monday, Reuters quoted a company spokesperson who said the crypto exchange had no “into the inner workings of the US Justice Department, nor would it be appropriate for us to comment if we did.”\nShortly after the story broke, Binance called out Reuters for cherry-picking their words in Monday’s report. The company published its full statement on the matter, claiming to have a good relationship with law enforcement and prosecutors.\nWhile the response cites a blog post on a so-called law enforcement team started in 2021, the statement did not address claims of plea talks between CZ’s company and with the Department of Justice.\nReuters has it wrong again. Now they're attacking our incredible law enforcement team. A team that we're incredibly proud of – they've made crypto more secure for all of us. Here’s the full statement we sent the reporter and a blog about our remarkable law enforcement team.\nThe news comes on the heels of FUD around CZ’s company in the wake of FTX’s collapse. Users expressed skepticism about the company’s proof-of-reserves and proof-of-liabilities audit which was recently attested by Mazars.\nIndeed, scrutiny of industry players and crypto companies surged after consecutive meltdowns in the crypto markets where entities like BlockFi, Celsius, FTX, Terra, and Three Arrows Capital wiped out billions in retail investments.\n","create_date":"2022-12-12T13:46:53+00:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/sam-bankman-fried-lost-50-million-joked/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"A report published by the new management of FTX highlighted the corporate failures that took place under the leadership of Sam Bankman-Fried.","title":"Sam Bankman-Fried Lost Track Of $50 Million, Then Joked About It - Ethereum World News","content":" The new management of FTX recently published a report which took a closer look at the control failures at the now-defunct crypto exchange under the leadership of founder and former CEO Sam Bankman-Fried. The report was compiled after interviewing several former employees of the exchange as well as a comprehensive review of the electronic data, communications, and documents related to the platform.\nAccording to the report, which was filed in the U.S Bankruptcy Court for the District of Delaware, the shortcomings in FTX’s management and their governance were attributed to Sam Bankman-Fried and his top management team for the exchange which included former Chief Technology Officer Gary Wang and head of Engineering Nishad Singh. The trio reportedly operated in a tight-knit group. Current CEO John Ray stated that “hubris, incompetence, and greed” led to the collapse of FTX.\n“We are releasing the first report in the spirit of transparency that we promised since the beginning of the Chapter 11 process. In this report, we provide details on our findings that FTX Group failed to implement appropriate controls in areas that were critical for safeguarding cash and crypto assets.”\nThe lack of record keeping at the exchange reportedly led to a considerable amount of chaos on the day that FTX filed for Chapter 11 bankruptcy when the crypto exchange couldn’t even come up with a complete record of its employees. The 45-page report highlighted several cases of gross negligence on the part of the former CEO. This included the 56 entities within the FTX Group, which allegedly didn’t provide financial statements of any kind. Internal communications revealed that Sam Bankman-Fried once joked about losing track of $50 million worth of crypto assets at sister firm Alameda Research.\n\n","create_date":"2023-04-10T19:54:47+01:00","tag":"Alameda Research","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/alamedas-caroline-ellison-says-sbf-ftx-execs-received-secret-loans-worth-billions/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Caroline Ellison, the former CEO of Alameda Research, told a Manhattan judge that Sam Bankman-Fried and other FTX executives received secret loans worth billions of dollars from the quant trading firm.","title":"Alameda’s Caroline Ellison Says SBF, FTX Execs Received Secret Loans Worth Billions - Ethereum World News","content":" Caroline Ellison, the former CEO of Sam Bankman-Fried’s quantitative trading firm Alameda Research, made sensational claims during her plea hearing on 19 December. A transcript of the said hearing was unsealed earlier today. According to a report by Reuters, Ellison has confessed that FTX executives including former CEO Sam Bankman-Fried, received secret loans worth billions of dollars from Alameda.\nThe former Alameda chief revealed that the trading firm could borrow unlimited funds from the now-bankrupt crypto exchange FTX. The transcript further revealed that Ellison and Bankman-Fried conspired to hide this crucial information from FTX’s investors, customers, and creditors.\nWe prepared certain quarterly balance sheets that concealed the extent of Alameda’s borrowing and the billions of dollars in loans that Alameda had made to FTX executives and to related parties,”\nThe United States Department of Justice put out a press release yesterday which revealed that Caroline Ellison had reached a plea deal and will be cooperating with prosecutors in the investigation. FTX co-founder Gary Wang also pleaded guilty and secured a similar deal with the prosecutors.\nWang revealed during his plea hearing, which was also held on 19 December, that he was directed to alter FTX’s code to give Alameda exclusive access to the exchange. At the time, investors and customers of the exchange were being told that Alameda had no such privileges. Wang did not name the people who issued these directions.\nBoth Ellison and Wang will likely be called upon to testify against former associate Sam Bankman-Fried whose next hearing is scheduled for 3 January 2023. SBF was released into the custody of his parents in Palo Alto, California yesterday after he posted a bail bond of $250 million.\n","create_date":"2022-12-23T20:40:32+00:00","tag":"Alameda Research","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ex-opensea-exec-guilty-insider-trading/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Ex-Opensea Product Manager Nate Chastain has been convicted in the insider trading case filed against him last year. Chastain faces upto 40 years in prison after being found guilty of wire fraud and money laundering.","title":"Former OpenSea Executive Convicted In Insider Trading Case - Ethereum World News","content":" Nate Chastain, the former Product Manager at NFT marketplace OpenSea, has been convicted by a federal grand jury in New York in the first-ever NFT insider trading case. Chastain’s conviction comes less than two weeks after the first hearing in his case was held in the District Court for the Southern District of New York.\nAccording to a report by Reuters, the federal jury found Chastain guilty of money laundering and wire fraud for his role in the NFT insider trading scheme. He faces up to 40 years in prison. The charges were filed against him in June last year by the U.S. Attorney’s Office in Manhattan. As the head of product, Chastain was responsible for picking the digital artworks that would be featured on the NFT marketplace’s homepage.\nFederal prosecutors accused the former OpenSea executive of abusing his position at the firm to illegally trade NFTs. He reportedly made more than $50,000 between June 2021 and September 2021 by purchasing NFTs that were about to be listed, and then offloading them after their prices surged. Chastain reportedly tried to cover his tracks by using multiple wallets and accounts to route his funds.\nNathaniel Chastain exploited his advanced knowledge of which NFTs would be featured on OpenSea’s website to make profitable trades for himself. Although this case involved trades in novel crypto assets, there was nothing particularly innovative about his conduct — it was fraud.”\nNate Chastain’s guilty verdict comes more than six months after his lawyers filed a motion to get the case dismissed on procedural grounds. He pleaded not guilty as his lawyers argued that OpenSea did not treat the insider knowledge as confidential information during his tenure at the company. “Nobody told Nate that he couldn’t use or share that information,” the former executive’s lawyers stated during the closing arguments earlier this week.\n","create_date":"2023-05-04T00:05:14+01:00","tag":"Insider trading","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ftxs-sam-bankman-fried-to-be-released-after-posting-250-million-bail/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Sam Bankman-Fried will walk free following a $250 million bail set by a federal judge in New York. The former FTX CEO was extradited to the U.S earlier today.","title":"FTX’s Sam Bankman-Fried To Be Released After Posting $250 Million Bail - Ethereum World News","content":" Sam Bankman-Fried, the former chief of bankrupt crypto exchange FTX, is set to walk free following his extradition to the United States. A federal magistrate judge in New York has ruled that the disgraced CEO is to be released on a $250 million bail designed by federal prosecutors and SBF’s attorneys. Nicholas Roos, the prosecutor, in this case, has described it as the “largest pre-trial bond ever”.\nPer a report by Reuters, Judge Gabriel Gorenstein has set strict terms for the release. SBF will be released into the custody of his parents, who are reportedly putting up the equity in their home to partially satisfy the bail conditions. Additionally, he will also be required to surrender his passport and undergo regular mental health treatment and evaluation.\nUsers on Twitter were infuriated with the judge’s ruling. Despite his parents putting up the equity in their $25 million California house, the general sentiment was that Sam Bankman-Fried would use customer funds to fund his bail. The former FTX CEO had previously stated that he was down to his last $100,000.\nCaroline Ellison, the former Chief Executive of SBF’s quantitative trading firm Alameda Research, has secured a plea deal with the prosecutors. According to a press release put out by the U.S. Department of Justice, Ellison, along with FTX co-founder Gary Wang, plead guilty to the fraud charges brought by the DOJ.\nAccording to an unsealed plea agreement with the Office of the U.S. Attorney for the Southern District of New York, Ellison will have to post a $250,000 personal recognizance bond. Terms of the agreement also include the clearing of any charges against Caroline Ellison except criminal tax violations, provided she fully cooperates with the U.S. Attorney’s office.\n","create_date":"2022-12-22T19:57:05+00:00","tag":"Alameda Research","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/curve-finance-egorov-sells-72-million-crv/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Curve Finance founder Michael Egorov has offloaded 72 million CRV since last week's exploit, and brought down his CRV-backed debts by 21%.","title":"Curve Finance Founder Sells 72 Million CRV, Brings Down CRV-Backed Debt By 21% - Ethereum World News","content":" Michael Egorov, the man behind the automated market maker Curve Finance, has offloaded roughly 72 million Curve DAO tokens (CRV) in over-the-counter (OTC) trades since last week’s exploits on the DeFi protocol. Egorov’s recent sales came as he attempted to minimize his CRV-backed debts of over $100 million, which risk getting liquidated with CRV’s tanking price.\nIn a summary of Michael Egorov’s recent OTC sales, on-chain analytics firm Lookonchain reported that the Curve Finance founder had sold CRV to 15 different institutions and investors at an average price of $0.4, raising over $28 million in the process.\nLast week’s exploit on Curve, which drained over $47 million from the DeFi protocol, put a spotlight on Egorov’s hefty loans totaling $100 million that was backed by more than 427 million CRV, which accounted for 47% of the token’s total circulating supply.\nThe largest debt was on Aave, where the Curve founder had posted a collateral of 305 million CRV for a loan of 63.2 million USDT. This debt is eligible for liquidation as soon as CRV’s price sinks to $0.37, given that it has a liquidation threshold of 55%. The riskiest debt was on Frax Finance, where Egorove had pledged 59 million CRV for 15.8 million FRAX. Fraxlend’s time-weighted variable interest rate made it so that the interest rate would double every 12 hours if the credit utilization reached 100%.\nSo far, Michael Egorov has repaid 12 million USDT to Aave and 6.6 million FRAX to Frax Finance, which left an outstanding debt of 51 million USDT and 9.1 million FRAX, respectively. The Curve Finance founder still owes 12 million MIM on Abracadabra, 9.4 million DOLA on Inverse, 740,000 XAI on Silo, reducing his total debt obligations by 21%.\nEarlier today, Curve’s crvUSD stablecoin lost its peg to the US Dollar and sank as much as 0.35% amid uncertainty surrounding the DeFi protocol. Since the exploit, several players in the crypto industry, including Justin Sun and Huobi, have stepped in to prevent a dramatic decline in CRV’s price in order to avoid a DeFi catastrophe.\n","create_date":"2023-08-03T21:41:24+01:00","tag":"Aave (AAVE)","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/curve-finance-warns-arbitrum-exploit/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"DeFi platform Curve Finance warned of a potential exploit on Arbitrum’s tricrypto liquidity pool following last weekend's multi-billion hack due to issues","title":"Curve Finance Warns Of Potential Arbitrum Pool Exploit - Ethereum World News","content":" DeFi platform Curve Finance warned of a potential exploit on Arbitrum’s tricrypto liquidity pool following last weekend’s multi-billion hack due to issues with the Vyper smart contract language.\nWhile developers could not identify a profitable exploit on this Arbitrum LP, Curve’s team advised users to withdraw to avoid possible losses.\nThe decentralized exchange also confirmed successful attacks on four LP denominated in Ether pairs – CRV/ETH, alETH/ETH, msETH/ETH, and pETH/ETH.\nCurve suffered exploits on factory pools provided by decentralized finance protocols Alchemix, Metronome, and JPEGd due to a malfunctioning reentrancy vulnerability in Vyper, a compiler programming language.\nAccording to one Vyper contributor, the hacker exploited an obscure attack vector. “they dug *deep* in our release history to find an exploitable issue for a large protocol with many millions at stake” said @fubuloubu on Twitter.\nI think it’s on the order of weeks to months to find. The execution was fairly coordinated, perhaps by a small group or team. We might find more information soon, but I think it’s reasonable to suspect that state-sponsored hackers could be involved, due to the resources invested\nOver the weekend, exploiters and ethical hackers battled for Ethereum block space as Curve Finance experience outflows in the millions. One attacker lost their loot to an MEV bot operator seeking to safeguard Curve funds amid the incident.\nThe MEV bot operator identified by their ENS tag “c0ffeebabe.eth” returned 2,879 ETH worth $5.4 million to Curve’s deployer contract, per security outpost PeckShield.\n#PeckShieldAlert c0ffeebabe.eth has returned 2,879 $ETH (~$5.4m) to #Curve deployer https://t.co/33BJLaq12A pic.twitter.com/2Jq0JOsrhV\n","create_date":"2023-07-31T12:06:44+01:00","tag":"Curve Finance (CRV)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/google-coinbase-cloud-service-crypto-2023/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Coinbase will power crypto payments for users leveraging Google's cloud services. The news comes after Google teased crypto payments in May.","title":"Google Taps Coinbase To Allow Cloud Service Customers Pay In Crypto By 2023 - Ethereum World News","content":" Summary:\nTech giant Google announced a payment partnership with crypto exchange Coinbase to power cryptocurrency payments for cloud services users. The deal unveiled at Google’s Cloud Next conference will open up crypto payments to select users for starters.\nIn time, Google expects to expand access to this crypto payment option to more cloud services users, head of platform and general manager at Google Cloud Amit Zavery disclosed during an interview. The option to pay in crypto via Coinbase is expected to go live in early 2023, per CNBC’s report on Tuesday.\nNotably, the crypto exchange supports 10 cryptocurrencies via its e-commerce solution including Bitcoin (BTC), Bitcoin Cash (BCH), meme token Dogecoin, leading altcoin Ethereum (ETH), and Litecoin (LTC).\nGoogle’s parent company Alphabet opted for the San Francisco-based exchange ahead of other payment service providers like PayPal. Zavery confirmed that the tech giant looked at other companies but the exchange was the most suited for the job.\nCoinbase will leverage Google’s cloud infrastructure as part of the deal. The exchange’s president of business development Jim Migdal said that the platform will migrate data-related apps from Amazon’s Web Services Cloud to Google cloud solution.\nIn addition, Google is considering tapping Coinbase prime, a custodial service that allows companies to hold digital assets and deploy hefty trade orders. The same custody solution was onboarded by asset management behemoth BlackRock to provide customers with Bitcoin exposure.\n#BlackRock And #Coinbase Team Up For Institutional Crypto Investment Offering Amid Bear Market https://t.co/1MxsRlWDjc\nThe deals come after speculations broke out in May that Google could add support for crypto payments. At press time, no other cloud services provider boasts digital assets payments, setting Google apart from competitors like Amazon.\nGoogle could also explore adding cryptocurrencies like BTC or ETH to its balance sheet, similar to other tech giants like MicroStrategy and Tesla who bought Bitcoin. However, the company has not officially announced any crypto purchases at press time.\n","create_date":"2022-10-11T14:18:27+01:00","tag":"coinbase","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/terms-services-privacy-policy/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Ethereumworldnews strives to ensure that all information contained on pages hosted by Ethereumworldnews .com is correct and up to date. We cannot, however,","title":"Terms of services and Privacy policy - Ethereum World News","content":" Ethereumworldnews strives to ensure that all information contained on pages hosted by Ethereumworldnews .com is correct and up to date. We cannot, however, accept responsibility for the content of external websites linked to through en.ethereumworldnews.com. Third party content is accessed at the user’s own risk.\nen.ethereumworldnews.com cannot accept responsibility for any loss or inconvenience caused by reliance on any material contained in this site.\nPlease note that despite the nature of much of the material created and hosted on this website, en.ethereumworldnews.com is not a financial reference resource and the opinions of authors and other contributors are their own and should not be taken as financial advice. If you require advice of this sort, Cointelegraph strongly recommends contacting a qualified industry professional.\nAll materials on this site are for informational purposes only. None of the material should be interpreted as investment advice.\nBy using en.ethereumworldnews.com, you agree and consent to the policies contained in the above Terms of Service Agreement.\nSpecifically, you agree to hold Ethereumworldnews, its affiliates, officers, directors, employees, agents, and third party service providers harmless from and defend them against any claims, costs, damages, losses, expenses, and any other liabilities, including attorneys’ fees and costs, arising out of or related to your access to or use of Ethereumworldnews, your violation of this user agreement, and/or your violation of the rights of any third party or person.\nWe will not be liable for any special, consequential, indirect, incidental, punitive, reliance, or exemplary damages, whether in tort, contract, or any other legal theory, arising out of or in any way connected with this agreement or your use of or attempt to use Ethereumworldnews, including (but not limited to) damages for loss of profits, goodwill, use, or data. This limitation on liability shall not be affected even if we have been advised of the possibility of such damages. Some states do not allow for the exclusion of implied warranties or the limitation or exclusion of liability for incidental or consequential damages, so the above exclusions may not apply to you. You may have other rights that vary from state to state.\nYou agree to release us, our affiliates, and third-party service providers, and each associated director, employee, agents, and officers, from claims, demands and damages (actual and consequential), of every kind and nature, known and unknown, disclosed or undisclosed, arising out of or in any way connected to your use of Ethereumworldnews.\nAny claim or dispute between you and us arising out of or relating to this user agreement, in whole or in part, shall be governed by the laws of United Kingdom and city of London without respect to its conflict of laws provisions.\nBy visiting en.ethereumworldnews.com you agree with and consent to the content in this privacy policy.\nCertain areas of the Ethereumworldnews website involve personal data handling when this has been submitted by the user (including but not limited to competition forms and newsletter subscriptions). Data obtained via user submission is only ever used for the purpose(s) clearly stated at the point of submission and will not be forwarded, sold or otherwise distributed to third parties.\nInformation entered into competition or survey forms will not be published or communicated to third parties in any way; it will be used solely to communicate with the applicant regarding the results or otherwise of the specific campaign entered.\nPersonal information may also be obtained for analytical purposes such as traffic monitoring. Data obtained in this manner is used solely for statistical analysis and website usage monitoring.\nhttp://optout.networkadvertising.org/?c=1#!/\nEthereumworldnews is provided on “as is” basis and without any warranty whatsoever. We and our affiliates and third party service providers disclaim, to the maximum extent permitted by law, any and all warranties, express or implied, including (but not limited to) implied warranties of merchantability, fitness for a particular purpose, and non-infringement of proprietary rights, or any other warranty, condition, guarantee or representation, whether oral or electronic. You are solely responsible for any damage to your computer or mobile device, loss of use, or loss of your user content.\nAll the things you do and all the information you submit or post to Ethereumworldnews remain your responsibility. You will not hold us legally liable for any of your user content or actions that infringe the law or the rights of a third party or person in any way.\nOur goal is to serve both your and community interests, so if you have an issue or dispute, you agree to raise it and try to resolve it with us informally. You can contact us with feedback and concerns here or by emailing us at [email protected]\n","create_date":"2017-10-10T19:34:20+01:00","tag":"","author":"3 minutes"},
{"url":"https://en.ethereumworldnews.com/sec-files-motion-freeze-binance-us-assets/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The Securities and Exchange Commission has filed an emergency motion in the D.C. District Court seeking a temporary restraining order to freeze Binance US' assets.","title":"U.S. SEC Files Emergency Motion To Freeze Binance US’ Assets - Ethereum World News","content":" The Securities and Exchange Commission (SEC) has filed an emergency motion in the U.S. District Court for the District of Columbia, seeking a temporary restraining order to freeze the assets of Binance US. The filing comes just a day after the securities regulator sued the American arm of the world’s largest crypto exchange and its founder Changpeng Zhao for operating an unregistered securities exchange and misrepresenting trading controls and oversight, among eleven other charges.\nAccording to the filing made with the D.C. District Court, the SEC is seeking an order to freeze the assets of BAM Management and BAM Trading, the entities overseeing Binance and its affiliates. The emergency motion filed by the securities regulator also sought an order to show cause “why a preliminary injunction should not be granted”. The SEC sought six other court orders, including one requiring the sworn accounting of “certain assets” from Binance US.\nThe SEC respectfully submits that this relief is necessary on an expedited basis to ensure the safety of customer assets and prevent the dissipation of available assets for any judgment, given the Defendants’ years of violative conduct, disregard of the laws of the United States, evasion of regulatory oversight, and open questions about various financial transfers and the custody and control of Customer Assets”\nIf granted, the order would give Binance five days to make sure that the entity to have access to the exchange’s customer funds is Binance US. Within 30 days of granting the order, all customer funds would have to be transferred to new wallets. In its initial complaint against the crypto giant, the SEC indicated that it would seek the above-mentioned restraining order.\n","create_date":"2023-06-06T23:18:38+01:00","tag":"Binance US","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/mica-greenlight-eu-finance-ministers/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"27 member states in the European Union's council wholly supported the bloc's Markets in Crypto Assets regulation or MiCA during a vote on May 16. The","title":"MiCA Receives Greenlight From EU Finance Ministers  - Ethereum World News","content":" Summary:\n27 member states in the European Union’s council wholly supported the bloc’s Markets in Crypto Assets regulation or MiCA during a vote on May 16. The unanimous vote signals one of the final steps before MiCA passes into law and officially regulates crypto operators across Europe.\nToday’s vote unsurprisingly passed after growing support for the bill among EU ministers and lawmakers alike. The bill had to garner support and pass official votes from two sides of the bloc – the EU’s council and parliament which already backed the bill during a vote in April.\nIndeed, the bloc’s crypto rules won a 13-1 landslide after 517 EU policymakers voted “Yes” in favor of the watershed crypto rules.\nThe EU will now publish MiCA in its Official Journal following support from both parliamentary negotiators and EU council members. However, it will take 12-18 months for the policies to take full effect and begin standardizing the EU’s crypto market. Operators will be afforded this time to comply with the policies or risk being booted out of Europe.\nThe bloc’s members also made headway on new crypto tax laws and anti-money laundering systems. Crypto operators will be required to disclose customer holdings to tax agencies and new AML measures were agreed on to “prevent the misuse of the crypto industry for the purposes of money laundering and financing of terrorism”.\nSweden’s Finance Minister stressed that regulating the crypto-assets sector is in the best interest of Europeans who invested in these assets and the operators who offer them.\nToday’s vote means that the EU will become the first major jurisdiction in the world to implement crypto rules and install a standard licensing policy.\n","create_date":"2023-05-16T16:35:17+01:00","tag":"Crypto Regulations","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/crypto-exchange-coinbase-set-to-delist-xrp-from-its-platform/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Coinbase it set to delist XRP, ETX, XLM and BCH on 5 December 2022. Low usage has been cited as the reason for this move.","title":"Crypto Exchange Coinbase Set To Delist $XRP From Its Platform - Ethereum World News","content":" As of 5 December 2022, Coinbase will stop supporting XRP on its platform. The firm, which is arguably the most popular crypto exchange in the United States, has also included Bitcoin Cash, Ethereum Classic, and Stellar in the list of tokens that are set to be delisted in a week. The exchange has cited “low usage” as the reason for this move.\n“This does not mean your assets will be lost. Any unsupported asset that you hold will still be tied to your address(es) and accessible through your Coinbase Wallet recovery phrase.” the official website read.\nThe exchange has clarified that users will be able to transfer their assets even after 5 December, by importing their recovery phrase on another non-custodial wallet provider which supports the soon-to-be delisted networks.\nCoinbase suspended XRP trading in January 2021 following the lawsuit by the U.S Securities and Exchange Commission against Ripple Labs\nThis decision by Coinbase was rather strange, given that there was no official announcement. XRP is the 7th largest cryptocurrency in the world with a market cap of over $19 billion. Delisting such a token is a high-profile move with the potential to impact its trading.\nInterestingly, the news of being delisted by one of the most popular crypto exchanges in the world has had a relatively low impact on the prices of the tokens in question. Data from CoinMarketCap shows that XRP initially saw a slight decline, but soon recovered to the price that it was trading at prior to this news. The token is currently trading at $0.391. Bitcoin Cash fell by a little over 1% following the news of this move by Coinbase. The impact on the prices of Stellar and Ethereum Classic can be summed up in one word, negligible.\n","create_date":"2022-11-29T19:28:53+00:00","tag":"Bitcoin Cash (BCH)","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/mica-backed-by-senior-eu-lawmakers/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Several lawmakers from the European Union’s leading political groups voiced support for the Markets in Crypto Assets bill or MiCa ahead of a vote on Thursday","title":"MiCA Bill Backed By Senior EU Lawmakers Ahead Of Thursday Vote - Ethereum World News","content":" Summary:\nSeveral lawmakers from the European Union’s leading political groups voiced support for the Markets in Crypto Assets bill or MiCa ahead of a vote on Thursday that will decide whether the crypto regulation is passed into law or not.\nEU legislators debated the licensing law during a session on Wednesday. The outcome suggested that Thursday’s vote could back the MiCa policy and push the bill toward widespread implementation across markets in the European Union.\nThe watershed legislation would lay the groundwork for licensing digital asset service providers interested in offering their services across the EU in a regulated manner. Also, stablecoin issuers like Circle and Tether would have to hold large reserves to cover excess token redemptions.\nLawmakers from the European People’s Party, Socialists and Democrats, Renew Europe, and European Conservatives and Reformists – the bloc’s biggest political groups – hailed MiCa for supporting innovation while maintaining strict rules to prevent the sort of crashes that plagued 2022.\nSpanish MEP Ernest Urtasun opined that the policy should “mark the end of the wild west era for the unregulated world of crypto assets”. The European Commission’s Mairead McGuinness echoed Urtasun’s comments and added that “stringent rules and supervision are very much needed” after implosions in the industry in recent months.\nMica would “restore the trust that was damaged by the FTX case,” German lawmaker Stefan Berger said. Berger further noted that the bill would solidify the EU “at the forefront of the token economy”, a sentiment shared by the EPP’s Lídia Pereira who said, “Europe can be proud of the step we’re taking today”.\nBoth the EU’s council and parliamentary negotiators must greenlight the bill before MiCa can pass into law. Thursday’s vote is expected to put an end to months of administrative delays born out of disagreements about the bill’s final text and its interpretation.\nShould tomorrow’s vote pass the bill into law, the regulation will come into effect 12-18 months after lawmakers add MiCa to the EU’s Official journal.\n","create_date":"2023-04-19T16:22:39+01:00","tag":"Crypto Regulations","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/no-bitcoin-isnt-trading-at-premium-in-iran-due-to-soleimanis-killing-analysis/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Yesterday, it was revealed that U.S. President Trump ordered an airstrike against Qassem Soleimani, one of Iran's most powerful officials, that killed the","title":"No, Bitcoin Isn't Trading At Premium in Iran Due to Soleimani's Death: Analysis - Ethereum World News","content":" Yesterday, it was revealed that U.S. President Trump ordered an airstrike against Qassem Soleimani, one of Iran’s most powerful officials, that killed the military leader. This immediately led to some crypto analysts trying to connect Bitcoin to the event; for instance, some noted that according to Google’s official forex rate for the Iranian Rial, BTC was trading at an over 200% premium on LocalBitcoins, suggesting that Iranians were buying BTC to hedge their capital against potential conflict, which could lead to currency devaluation.\nAccording to an analysis by Bambou Club, however, the black market rate for Iranian Rial suggests a LocalBitcoins BTC price of around $7,300, which is at parity with American markets.\nhttps://twitter.com/BambouClub/status/1213106705380315137\nThe reports about the Iranian leader also led to speculation that it was a catalyst for the 5% Bitcoin pump that began some 18 hours ago, for it seemingly correlated with the news of his death.\nFrom a simple time perspective, it seems as though the Iran news had nothing to do with Bitcoin’s latest pump from the depths of sub-$7,000 prices.\nProminent cryptocurrency and macro analyst Alex Kruger, who has been known to debunk the “Bitcoin is a safe haven and hard money” narratives over the years (but is still somewhat of a BTC bull), recently posted the tweet below in an aim to debunk the Iran correlation:\nPeople all over talking about bitcoin as a safe haven. Seems they didn’t learn from the failed China narrative. Zoom in intraday. BTC moved up 3.30 hours after the Iran news, after first dropping 1.5%. Gold and crude instead pumped right away.\nIt's happening. People all over talking about bitcoin as a safe haven. Seems they didn't learn from the failed China narrative. Zoom in intraday. $BTC moved up 3.30 hours after the Iran news, after first dropping 1.5%. Gold and crude instead pumped right away. pic.twitter.com/IMJwj7OWt6\n— Alex Krüger (@krugermacro) January 3, 2020\n\nIn this tweet, Kruger is referencing one of two things in saying the “China narrative”: 1) the China-US trade war that was at its peak this summer, during which some analysts were saying that Bitcoin was showing an inverse correlation to the Yuan’s reference rate against the U.S. dollar; or 2) in October, China announced that is was looking to adopt blockchain as a core technology, leading to rampant speculation that cryptocurrency was on the verge of going mainstream, which itself resulted in a price surge of 40% then a correction back to pre-pump prices.\nRegardless of whether or not the Iran narrative holds its water, analysts say Bitcoin is starting to form a bullish trend, boding well for prices in the short term and medium term.\n","create_date":"2020-01-04T04:00:58+00:00","tag":"bitcoin","author":"Nick Chong"},
{"url":"https://en.ethereumworldnews.com/new-york-coinbase-users-can-now-trade-chainlink-link/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Earlier this year, Chainlink proponents were over the moon when Coinbase revealed that it would finally be responding to their requests by adding LINK.","title":"New York Coinbase Users Can Now Trade Chainlink (LINK) - Ethereum World News","content":" Earlier this year, Chainlink proponents were over the moon when Coinbase revealed that it would finally be responding to their requests by adding LINK. Proponents of the projects were so excited, in fact, that the cryptocurrency surged higher by some 30% on the day of the listing, proving that the so-called Coinbase Effect was still alive and well.\nHowever, there was one main caveat to the listing: users of Coinbase in New York state were unable to interact with LINK through the exchange. This location restriction was seemingly due to regulatory concerns, which are a byproduct of the very stringent laws and regulations regarding money and assets in the finance capital of the world — New York, New York.\nWhile the restriction of one state may not seem like a lot, New York has the highest GDP per capita out of all the States, sporting a massive investor audience, including members of the crypto crowd. In other words, a large potential market for LINK was locked out by regulatory restrictions.\nThis changed on Wednesday, however. Announced in a short but sweet tweet, Coinbase revealed that users of its services “who are New York residents […] can now log in to buy, sell, convert, send, receive, or store LINK on Coinbase.com or using our IOS and Android apps.”\nChainlink (LINK) is now available to Coinbase users who are New York residents. New Yorkers can now log in to buy, sell, convert, send, receive, or store LINK on https://t.co/bCG11KMQ6s or using our iOS and Android apps. https://t.co/v3lCq5I3im pic.twitter.com/qLovRSJhzr\n— Coinbase (@coinbase) September 25, 2019\n\nAlong with the addition of Chainlink for New York clients, Coinbase has also unlocked Stellar Lumens (XLM) for the Big Apple.\nThis is Chainlink’s latest positive news event.\nJust a day prior to this, San Francisco-based cryptocurrency exchange Kraken revealed that it would list LINK and MakerDAO’s DAI. The former cryptocurrency rallied in wake of the news, as it became one of the few altcoins added to the prominent platform.\nIn other positive news, Chainlink recently revealed that it has now enabled its oracles to connect Binance market data to smart contracts, which should help “the next generation of DeFi smart contracts”.\nYou can now connect your smart contracts to @binance data using #Chainlink. We’re excited to provide reliable data about $BTC, $BNB, $ETH and all the other price pairs on #Binance directly to the next generation of #DeFi smart contracts: https://t.co/pCY6zwME3r pic.twitter.com/05rdn3iJi6\n— Chainlink – Official Channel (@chainlink) September 24, 2019\n\n","create_date":"2019-09-26T09:21:34+01:00","tag":"ChainLink","author":"Nick Chong"},
{"url":"https://en.ethereumworldnews.com/coinbase-q3-report-revenue-estimates-miss/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Coinbase revealed in it's Q3 earnings call that net revenue has decline d by more than 28% QoQ. Missing its revenue estimates has costed the exchange more than 4% of its share price.","title":"Coinbase Q3 Report: Coin Stock Tanks 4% As Exchange Misses Revenue Estimates - Ethereum World News","content":" Coinbase has posted its numbers for the third quarter of 2023. The earnings call revealed some troubling metrics, including a 44% decline in transaction revenue as well as a 28.26% decline in net revenue compared to Q2.\nThe exchange has posted a net revenue of $576 million for the second quarter of 2022. This is made up of $377 million in transaction revenue and $211 million in subscription and services revenue. Additionally, the exchange’s monthly transacting users (MTU) and its trading volume fell by 5.5% and 26.7% respectively.\nThe transaction revenue took a major hit thanks to a decline in trading volume. The exchange blamed this decline on the deterioration in macroeconomic conditions and a pivot from trading to “hodl’ing” in retail customers. The decreased trading volume had a direct effect on the mining fees that the exchange collected. Additionally, the shifting revenue composition led to an increase in transaction expenses which ultimately made a dent in the company’s net revenue.\nCoinbase has identified the lack of regulatory clarity in the United States as one of the factors responsible for its poor Q3 performance. As per the earnings report, this has led to U.S based customers moving towards foreign exchanges.\nWhile the assets on the platform saw an overall growth of 5% in Q3, a closer look at the numbers reveals that retail participation on the platform has declined by over 56% YoY. Retail assets accounted for $116 billion in Q3 of 2021, as compared to $51 billion in Q3’22.\nInstitutional assets on the platform have also taken a hit, going from $139 billion in Q3’21 to $101 billion in Q3’22. This decline in market share has been attributed to price effects i.e. “larger price decreases for assets that have a higher concentration in Coinbase like BTC”.\nExperts had painted a grim picture for Coinbase’s stock much before the earnings report was published. The stock had dropped as much as 6% since the market opened, in anticipation of the Q3 report. Data from MarketWatch shows that the stock lost an additional 4% in after-hours trading.\nCoinbase revealed a few important updates in the earnings call by revealing a series of partnerships it had entered in recent months. The exchange highlighted a strategic partnership with Google Cloud that was announced last month. This joint venture will enable crypto payments for Google Cloud customers.\nThe company also mentioned the strategic partnership that it had inked with investment giant BlackRock in August. This arrangement will see the asset manager’s institutional clients gain exposure to cryptocurrencies through Coinbase Prime.\n","create_date":"2022-11-03T22:10:45+00:00","tag":"Blackrock","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/memecoin-frenzy-justin-sun-donate-profits/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Billionaire Justin Sun promised to donate all his memecoin trading profits to charity but stressed that his decisoin does not mean Huobi and Poloniex will list these meme coins.","title":"Memecoin Frenzy: Justin Sun Joins Speculative Trading, Promises To Donate Profits To Charity - Ethereum World News","content":" Summary:\nThe memecoin hysteria flooding crypto markets gained another catalyst as a crypto mogul and blockchain founder declared trading plans.\nTron’s Justin Sun tweeted Thursday plans to “begin actively trading meme coins” as tokens like the Pepe The Frog-theme PEPE lit up crypto trading volumes and on-chain activity across the biggest blockchains on the market.\n“Please note, I will personally bear all potential losses from these trades, and any profits made will be donated entirely to charity”, said Sun who commands billions in crypto and is a popular blockchain figure. He also serves as an advisor for a major Asian-based crypto exchange.\nSun reminded users that his personal decision is not an indicator that Huobi Global and Poloniex – two exchanges affiliated with Sun – will list these meme tokens.\nHowever, it's crucial to remember that my investments do not constitute financial advice, and there is no guarantee of listing these projects on any exchange, including @HuobiGlobal and @Poloniex. I am simply trading coins for fun. Always do your own research before investing!\nAlready, scammers are moving to leverage Sun’s public announcement by sending “shitcoins” and scam tokens to his wallet, Peckshield alerted users. This creates the false notion that Sun himself is buying these tokens. Scammers often try to ride these situations to deceive users and make off with their tokens or “rug” unsuspecting victims by pulling liquidity from these speculative coins.\n#PeckShieldAlert #JustinSun continues to receive multiple Shitcoins following his tweets. We have noticed that a scammer gang created a counterfeit $FOUR 4 days ago & used 0xac82…2a9 to pretend to be #JustinSun. The scammers pretend to be #JustinSun, buying tons of fake $FOUR… pic.twitter.com/L4axTLR6as\nMemecoin season is not an uber-rare period for crypto participants and observers. Over the years, tokens like Dogecoin and Shiba Inu have taken markets by storm, building billions in market cap and tempting “degenerate” traders or degens to chase the next 100x coin.\nWhile trading these tokens is obviously risky and heavy losses can happen, the allure of making substantial profits seems a motivating factor for some traders. PEPE coin on Ethereum for instance which trades for a fraction of a dollar peaked at a $1.5 billion market cap before dipping to around $600 million.\nCrypto’s two largest blockchains – Bitcoin and Ethereum – recorded increased on-chain activity in recent weeks amid this year’s memecoin mania. For both blockchains, transaction fees hit two-year highs.\n","create_date":"2023-05-11T13:08:05+01:00","tag":"justin sun","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/fbi-raids-former-ftx-ryan-salames-house/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The FBI has reportedly carried out a raid at the residence of former FTX executive Ryan Salame. The purpose of the raid is unclear at this time.","title":"FBI Raids Former FTX Executive Ryan Salame’s Residence - Ethereum World News","content":" The Federal Bureau of Investigation (FBI) has reportedly carried out a raid at the residence of former FTX executive Ryan Salame. Salame was a part of Sam Bankman-Fried’s inner circle and served as one of his top advisors before the collapse of his crypto exchange in November last year. The raid has become the latest development in the U.S. Justice Department’s investigation into FTX’s collapse.\n\nAccording to a report by the New York Times, FBI agents reached Salame’s house in Potomac, Maryland earlier today to carry out a search. People familiar with the matter revealed that Salame’s legal representative had handed over information related to his political campaign finance activity ahead of today’s raid. The purpose of the raid is unclear at this time. Salame, who served as Co-Chief Executive Officer of FTX Digital Markets, has not yet been charged or accused of any wrongdoing, unlike other former executives like Caroline Ellison and Gary Wang who were charged in connection with the collapse of Sam Bankman-Fried’s crypto empire.\nRyan Salame came under scrutiny last year after his firm filed for bankruptcy. Regulators and lawmakers paid particular attention to the millions of dollars he spent on political contributions during his stint at the crypto exchange. Salame reportedly spent more than $24 million during last year’s midterm elections. The majority of these funds were contributed to Republican candidates, unlike Bankman-Fried who spent well over $50 million to back Democratic candidates and PACs. Prosecutors have claimed the funds for these political contributions were misappropriated from customers of the crypto exchange.\n","create_date":"2023-04-27T23:49:57+01:00","tag":"FBI","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/spacecatch-public-beta-is-coming-on-22nd-april-2024-the-biggest-gamefi-event-of-this-month-is-here/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"SpaceCatch, one of the most professional and notable GameFi projects in Web3 this year, has announced its Public Beta launch. The most important day in GameFi","title":"SpaceCatch Public Beta is coming on 22nd April 2024. The biggest GameFi event of this month is here - Ethereum World News","content":" SpaceCatch, one of the most professional and notable GameFi projects in Web3 this year, has announced its Public Beta launch. The most important day in GameFi in April is the 22nd of April 2024.\nSpaceCatch, developed by the professional gaming studio Pixelfield, has been developed since 2022. The team provided great skill so far, so now, SpaceCatch is one of the most promising AR&Web3 games in the GameFi industry. Its CATCH token is already listed, hitting the ATH over x50 compared to its presale price. This all shows the great ability of the team to provide great, professional results.\nOne of the strongest marketing presences\nSpaceCatch entered a Crypto space with a solid marketing presence and professionalism, and 22nd April is going to be the first time the Public will have a chance to test the Public Beta version. The SpaceCatch beta will be accessible for iOS and Android users, and there is only a 20k beta testers limit.\nCertainly, SpaceCatch is going to launch a massive promotion of the Public Beta, so note to your calendar that 22nd April is a big day for the whole GameFi industry. Certainly, the promotion will be everywhere, so stay focused and catch your slot for Beta testing, as it is highly expected that 20k slots will quickly run out.\nProfessionals delivering results.\nAs a main Developer, Pixelfield, a professional gaming studio, is known for a great experience with AR gaming, SpaceCatch can be a game changer in GameFi. Multiple gaming projects are entering the market, but SpaceCatch is extraordinary with its results and massive community support. SpaceCatch entered the Web3 space with the highest industry standards, beating most of its competitors by excellent product delivery, promotion, and community culture and support.\nAs a great example of professionalism, we recommend checking the SpaceCatch News whitepaper section, where you can see all Devlogs, delivered by developers, showing a current stage of the development and giving an overview of the game itself.\nAbout SpaceCatch\nSpaceCatch is the first game of its kind, promising a revolution in the gaming space by integrating augmented reality, geolocation, AI, blockchain support, and NFTs. This blend allows for a completely new gaming experience, supporting not just a fully free-to-play model but also next-generation play-to-earn and move-to-earn concepts that are fully sustainable.\nCentered on AR and VR technology, SpaceCatch has crafted an immersive universe with an enthralling narrative. In this universe, players, known as Catchers, are tasked with restoring peace on Earth after an alien invasion. The aliens possess diverse powers, presenting a challenging obstacle for Catchers. However, players can enhance their abilities and skills to combat these extraterrestrial adversaries effectively.\nWith these features, SpaceCatch positions itself among the new generation of GameFi projects with the potential to outperform industry giants like Axie Infinity or Sandbox.\nLearn More\nKeep yourself informed about SpaceCatch’s latest developments, including game launches, projects, and company updates, by following them on their official website. Additionally, stay connected through various platforms such as Telegram, Discord, Twitter, YouTube, Instagram, Medium, CoinMarketCap or CoinGecko.\n","create_date":"2024-04-09T08:37:25+01:00","tag":"","author":"Adrian Mathieu"},
{"url":"https://en.ethereumworldnews.com/coinbase-decentralized-l2-network-base/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Base, the L2 Ethereum network backed and built by crypto exchange Coinbase, is officially open for public access.","title":"Coinbase Rolls Out Decentralized L2 Network Base - Ethereum World News","content":" Base, the L2 Ethereum network backed and built by crypto exchange Coinbase, is officially open for public access.\n100 decentralized apps and crypto service providers like Chainlink are available on the blockchain at launch. Moreover, Base features an official bridge to Ethereum’s mainnet allowing users to freely move ETH between both networks.\nThe launch of Base also coincides with the company’s “Onchain Summer” week-long event featuring commemorative NFTs and rewards for users.\nCoinbase is the first-ever publicly traded entity in the U.S. to launch its own decentralized network. The company does not plan to launch a token for its Base L2 blockchain.\nThe decentralized network developed using Optimism’s OP stack is part of “The Coinbase Secret Master Plan”, said CEO Brian Armstrong when Base was announced back in February.\nBy mid July, would-be early users trooped into Base despite the network being only accessible to developers at the time. Several “degens” bridged their Ether (ETH) tokens to the network through a portal proxy contract, a one-way door from Ethereum’s ecosystem to Base. The gateway allowed these users to make millions overnight aping into risky memecoins like BALD.\nBALD holders however soon found themselves rekt after the token’s developer withdrew liquidity in what turned out to be a rug pull. A number of other memecoins on Base also turned out to be scams as well. At the time, Base users only had access to a one-way bridge, leaving liquidity trapped in the budding ecosystem.\n","create_date":"2023-08-09T17:52:03+01:00","tag":"BALD","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/blur-solidifies-reign-in-nft-space-with-60-trading-volume-market-share/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Across Ethereum-native NFTs marketplaces, Blur remains dominant as the NFT marketplace and aggregator, accounting for nearly 60% of all trading volume on the","title":"Blur solidifies reign in NFT space with 60% trading volume market share - Ethereum World News","content":" Across Ethereum-native NFTs marketplaces, Blur remains dominant as the NFT marketplace and aggregator, accounting for nearly 60% of all trading volume on the chain, Messari found in a new report.\nBlur remains the dominant Ethereum NFT marketplace, with ~60% of total volume. pic.twitter.com/FpV7yDG1YN\n— Messari (@MessariCrypto) August 21, 2023\n\nBlur has gained significant traction since its launch in October 2022, overtaking industry leader OpenSea. Its popularity skyrocketed after its token airdrop event on 14 February.\nPrior to the airdrop, Blur held 48% of the NFT transfer volume in the market. However, its share jumped to 78% a few days after the airdrop. This caused OpenSea’s NFT transfer volume to drop by 21%.\nWhile NFT trading volume across Blur has declined since then due to the drop in the general market interest in NFTs, data from Dune Analytics revealed that the daily volume of NFT transactions completed on Blur still exceeds OpenSea.\nThe year so far has been marked by a general decline in interest in NFTs as a category of digital assets. On a year-to-date, interest peaked around February, and NFT market capitalization and sales volume have since trended downward.\nAccording to NFTGo, the sum of the market capitalization of all collections has fallen by 46% in the past seven months. Also, the daily total volume of NFT sales across all collections has dropped by 98% within the same period. For context, this was $420.48 million on 19 February. As of 19 August, the sales volume recorded was less than $5 million.\nAmid the waning interest, the values of blue-chip NFTs have also been affected. For example, as of this writing, the floor price of an NFT from the Bored Ape Yacht Club [BAYC] collection stood at 24 ETH. The last time the average price was this low was in August 2021, three months after it launched. This year alone, the collection’s floor price has plummeted by 64%.\nAnother leading blue-chip NFT collection affected by the whirlwind of disinterest in digital collectibles is CryptoPunks. At a floor price of 47.39 ETH, one CryptoPunk NFT currently trades at a price last recorded in June 2022.\n\n\n","create_date":"2023-08-22T12:25:42+01:00","tag":"Blur","author":"Nick Cannon"},
{"url":"https://en.ethereumworldnews.com/microstrategy-ceo-wars-create-inflation-making-btc-compelling/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The CEO of Microstrategy, Michael Saylor, has pointed out that wars create inflation and cripple commerce. According to Mr. Saylor, this in turn makes Bitcoin","title":"Microstrategy CEO: Wars Create Inflation Making BTC Compelling - Ethereum World News","content":" The CEO of Microstrategy, Michael Saylor, has pointed out that wars create inflation and cripple commerce. According to Mr. Saylor, this in turn makes Bitcoin (BTC) compelling as it serves as an alternative to hedge against the said inflation.\nMichael Saylor shared his insights on Bitcoin through the following tweet.\nWars create inflation, cripple commerce, and make #bitcoin compelling. pic.twitter.com/YksI21FcXS\n— Michael Saylor⚡️ (@saylor) February 24, 2022\n\nOne instance of Bitcoin being used as an alternative was documented when two Danish reporters used BTC to buy a vehicle that they used to drive out of Ukraine. The two reporters, Stefan Weichert and Emil Filtenborg, had to use Bitcoin (BTC) after ATM’s in Dnipro (central Ukraine) were no longer functional. The two gentlemen then decided to purchase a Mazda 3 for 0.059 Bitcoin (BTC).\nThey explained the situation on the ground as follows:\nYou can see that many people walk around the city to withdraw money. The ATMs are down. We have spent the day getting fuel and spare parts for the trip. But it was hard to get parts. There were no more gas cans left, they are hoarded.\nIn terms of assisting the country of Ukraine, the crypto community has donated over $4 million in digital assets since Russia invaded the country. This amount includes one single Bitcoin (BTC) donation worth $3 million. The donations have been directed towards NGOs and volunteer groups that are doing their best in helping those affected by the conflict.\nEarlier today, the CEO of Crypto.com, Kris Marszalek, announced a $1 million donation by the company to the red Cross. He also urged the crypto community ‘to do what they can to support humanitarian efforts.’\nEarly Friday, the CEO of FTX, Sam Bankman-Fried, also announced that the crypto-exchange had gifted $25 to each Ukrainian on the platform. He made the announcement of the gift to Ukrainians on the platform through the following tweet.\nwe just gave $25 to each Ukrainian on FTX\ndo what you gotta do\n— SBF (@SBF_FTX) February 24, 2022\n\n","create_date":"2022-02-26T09:43:40+00:00","tag":"Bitcoin (BTC) General News","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/binance-is-now-a-confirmed-equity-investor-in-musks-twitter-buyout-deal/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Crypto exchange Binance has finally confirmed the news of being a legitimate equity investor in Elon Musk's Twitter takeover deal.","title":"Binance Is Now A Confirmed Equity Investor In Musk's Twitter Buyout Deal  - Ethereum World News","content":" Crypto exchange Binance has finally confirmed the news of being a legitimate equity investor in Elon Musk’s Twitter takeover deal.\nBinance Confirms Its Participation In Musk’s Twitter Acquisition\nBinance confirmed on Friday that the exchange was part of Musk’s $44 billion Twitter takeover deal. The exchange had wired $500 million to Musk two days ago as per the commitment made by its CEO, Changpeng Zhao.\n“We’re excited to be able to help Elon realise a new vision for Twitter. We aim to play a role in bringing social media and Web3 together to broaden the use and adoption of crypto and blockchain technology. Binance’s CEO, Changpeng Zhao, added\nZhao has long supported Musk’s vision of operating Twitter. He recently tweeted how he has already started to feel more secure about his Twitter account now that Musk owns the microblogging site.\nI feel much more secure about my Twitter account now that Elon has sink'ed in there. Edit button No API/bot comments\nPer a statement uploaded in May, Binance had committed a $500 million investment to Musk’s Twitter deal. The exchange has long been a proponent of global crypto adoption and believes that Twitter can play a crucial role in making crypto accessible across the board.\nAccording to Bloomberg, Musk is now a legitimate owner of Twitter and reportedly closed his months-long Twitter acquisition deal on Thursday. Per the report, Musk is also planning to reverse lifetime bans on the social media platform and is also looking forward to introducing new elemental changes to transform Twitter into a global social hub.\n","create_date":"2022-10-28T09:09:55+01:00","tag":"","author":"Juhi Mirza"},
{"url":"https://en.ethereumworldnews.com/ethereums-vitalik-opposes-new-york-states-ban-on-pow-mining-suggests-carbon-pricing-as-an-alternative-solution/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The co-founder of Ethereum, Vitalik Buterin, has chimed in on the ongoing debate as to whether governments should ban proof-of-work mining activities based on","title":"Ethereum's Vitalik Opposes New York State's Ban on PoW Mining, Suggests Carbon Pricing as an Alternative Solution - Ethereum World News","content":" Summary:\nThe co-founder of Ethereum, Vitalik Buterin, has chimed in on the ongoing debate as to whether governments should ban proof-of-work mining activities based on the premise that such operations are energy-intensive.\nAccording to Mr. Buterin, it is a bad idea for governments to pick and choose which specific applications should use electricity or not. He also added that carbon pricing would be a better solution as it could provide additional revenue for governments to compensate low-income electricity users.\nCarbon pricing is the practice of regulating greenhouse gas emissions by charging a fee for emitting or offering an incentive for emitting less.\nVitalik’s insights on the drawbacks of banning proof-of-work operations and carbon pricing as an alternative were shared through the following tweet.\nUltimately I agree with this (that is, I oppose banning PoW). The government picking and choosing which specific applications are an okay use of electricity or not is a bad idea. Better to just implement carbon pricing, and use some of the revenues to compensate low-income users. https://t.co/NnBzmv5mYz\n— vitalik.eth (@VitalikButerin) June 4, 2022\n\nVitalik’s comments come on the backdrop of news that legislators in the State of New York have passed a bill that would essentially ban proof-of-work mining operations within the state that use carbon-based power sources.\nAccording to Bloomberg, ‘the New York bill calls for a two-year halt on new permits for miners that use carbon-based fuel and also, requires an environmental impact study with an eye on meeting climate goals established under a 2019 statute.’\nHowever, the Governor of New York, Kathy Hochul, is yet to sign the bill into law, thus providing some glimmer of hope for crypto enthusiasts who believe that such a bill in the United States would set unintended precedence for other states to follow suit.\nPerianne Boring, the founder, and president of the Chamber of Digital Commerce, explained to CNBC that the bill would be a significant setback for the state and stifle New York’s future as a leader in technology. She said:\nThis is a significant setback for the state and will stifle its future as a leader in technology and global financial services. More importantly, this decision will eliminate critical union jobs and further disenfranchise financial access to the many underbanked populations living in the Empire State.\n","create_date":"2022-06-04T19:49:15+01:00","tag":"Bitcoin (BTC)","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/ftx-eu-process-to-return-customer-funds/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX EU, the European arm of Sam Bankman-Fried's bankrupt crypto exchange, has initiated the process to return funds to its customers. A dedicated website will allow customers to view their balance ahead of withdrawals.","title":"FTX EU Commences Process To Return Customer Funds - Ethereum World News","content":" FTX EU, the European arm of Sam Bankman-Fried’s bankrupt crypto exchange, has commenced the process of returning funds to its customers. The crypto platform’s customers will now be able to inquire about their balance on the exchange, which will be followed by withdrawals.\nAccording to a press release from FTX, the crypto exchange’s European arm has set up a dedicated website for processing all withdrawal requests. Customers can use the website to request final balances ahead of the withdrawal of fiat currency funds remaining in their accounts. The customers will receive a statement of the funds that they are entitled to.\nAll withdrawal requests will be subject to know-your-customer (KYC) and anti-money laundering (AML) checks, along with customary verification of account details.\nIt is important to note that withdrawals will be available only to customers of the European crypto exchange who opened their accounts after 7 March 2022. The press release comes a day after Kroll Restructuring Administration, FTX’s liquidators, emailed the exchange notifying them of scheduled claim information related to the ongoing bankruptcy proceedings. The liquidator clarified that customers will only be entitled to the amount that will be communicated through the newly set up website, and not the amount laid out in the scheduled claim information\nAs clearly stated in the Kroll email, the scheduled claim information included in that email is not a statement by the Debtors of the amount or validity of any claim held by any person.”\nThe withdrawal process for the European arm will be similar to that of FTX Japan, which started returning funds to its customers in February. The Japanese subsidiary had also set up a dedicated website through which balances were communicated to customers ahead of withdrawals. The development in FTX EU’s withdrawal process prompted native token FTT to hike by 3% earlier today.\n","create_date":"2023-03-31T22:30:09+01:00","tag":"Bankruptcy","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ftx-bankrupt-sam-bankman-fried-resigns/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX admits bankruptcy and CEO Sam Bankman-Fried has stepped down.","title":"FTX Submits Chapter 11 Bankruptcy Filing, Sam Bankman-Fried Resigns - Ethereum World News","content":" Summary:\nCryptocurrency exchange FTX filed for chapter 11 bankruptcy under the United States Bankruptcy code after a botched bailout deal with Binance and a massive “liquidity crunch”.\nFTX.US, the American subsidiary of Sam Bankman-Fried’s crypto exchange giant, and his trading firm Alameda Research are included in the filing, per Friday’s official announcement. Over130 other affiliated companies are included in the proceedings as well.\nBankman-Fried has stepped down as CEO but will remain to “assist in an orderly transition”, Friday’s statement read. SBF’s $32 billion fortune evaporated following revelations about massive illiquid assets on Alameda’s balance sheets. A report from Reuters said Bankman-Fried sent billions in customer funds to his trading giant.\nThe chapter 11 filing affords Bankman’s entity an automatic global moratorium. In other words, creditors are legally restricted from claiming any debt or pursuing legal recovery. The crypto and trading entity also has 120 days to submit a recovery plan to the Delaware District court.\nIn place of Bankman, John J. Ray III will assume leadership as CEO. Entities like LedgerX, Express Pay, and the exchange’s Australia division were excluded from the filing.\n\n","create_date":"2022-11-11T14:43:53+00:00","tag":"","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/coinbase-manager-guilty-insider-trading/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Ishan Wahi, the former Coinbase product manager, has pleaded guilty to two counts of conspiracy to commit wire fraud in the first crypto insider trading case.","title":"Former Coinbase Manager Pleads Guilty To Insider Trading Charges - Ethereum World News","content":" Ishan Wahi, the former product manager at Coinbase Global Inc who was accused of insider trading last year, has pleaded guilty to two counts of conspiracy to commit wire fraud. The insider trading charges were filed by the U.S. Department of Justice after the first crypto insider trading case came to light in July 2022.\nAccording to a report by Reuters, prosecutors at the court hearing said that Wahi shared confidential information from the exchange with his brother Nikhil Wahi, and one Sameer Ramani. This information included details about upcoming token listings on Coinbase. Wahi’s brother, along with Ramani, would buy tokens ahead of their listing based on insider information from Ishan.\n\nI knew that Sameer Ramani and Nikhil Wahi would use that information to make trading decisions. It was wrong to misappropriate and disseminate Coinbase’s property.”\nAs per a complaint filed by the Securities and Exchange Commission (SEC) in July last year, Ishan Wahi regularly supplied insider information to his accomplices between June 2021 and April 2022. They used the confidential information to buy and store digital assets in Ethereum wallets ahead of at least 14 listing announcements by Coinbase. The trio netted $1.5 million from insider trading.\nNikhil Wahi previously pleaded guilty to a wire fraud conspiracy charge and was sentenced to 10 months in prison last month. Sameer Ramani remains at large. News of Ishan Wahi’s confession comes just a day after his attorneys filed a motion to dismiss the charge brought by the SEC against him. The attorneys argued that the SEC was “wrong” to describe the tokens involved in the case as “securities”, making the securities fraud charge against Wahi inapplicable.\n","create_date":"2023-02-07T17:38:22+00:00","tag":"Coinbase (COIN)","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/changpeng-zhao-takes-a-dig-kraken-kucoin/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Changpeng Zhao's latest tweet is drawing criticism for spreading FUD against rival exchanges Kraken and KuCoin.","title":"Binance CEO Changpeng Zhao Takes A Subtle Dig At Kraken And KuCoin - Ethereum World News","content":" Binance CEO Changpeng Zhao made a rather controversial tweet earlier today. The tweet, which is now deleted, appeared to take a subtle dig at two of Binance’s rival exchanges, Kraken and KuCoin. Zhao recommended people to stay away from platforms that offer a high annual percentage yield (APY) and/or have layoffs.\nIf you don’t do risk management now, don’t blame others for the consequences later” CZ’s tweet read.\n\nZhao was likely referring to rival exchanges KuCoin and Kraken. KuCoin became the topic of debate in the crypto community on Twitter earlier this week after users noticed the sky-high APYs being offered by the exchange. Crypto influencers shared screenshots that showed triple-digit returns on KuCoin’s earn program. The exchange’s official website is currently showing a 215% APY on Ethereum(ETH), 268% APY on Bitcoin (BTC) and 100% APY on Tether (USDT).\nKraken, the world’s third-largest exchange by volume, announced earlier today that it was laying off 30% of its staff. According to the exchange, the decision to cut 1,100 people from its global workforce was taken to weather the ongoing crypto winter. CEO Jesse Powell took to Twitter to clarify that the departing employees were given 4 months of severance pay and healthcare coverage.\nUsers on Twitter were quick to call out Zhao’s attempt to indirectly induce FUD about rival exchanges. One user pointed out that CZ’s warnings were ironically applicable on his own platform, given that Binance was offering similar APYs similar to that offered by KuCoin. Binance’s dual investment program is currently offering 123% APY on Bitcoin and 226% on Ethereum.\nWhen confronted by a popular crypto influencer, Changpeng Zhao defended his words, arguing that while layoffs weren’t necessarily a red flag, risk management was still important. He further clarified that his tweet was not meant against Kraken or any other exchange. The controversial tweet was taken down by CZ following criticism from crypto Twitter.\n","create_date":"2022-11-30T19:29:55+00:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/eu-member-states-could-agree-on-a-unified-crypto-law-by-the-end-of-june/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The European Union is close to coming up with a united agreement between its 27 member states on how to regulate cryptocurrencies within the region.","title":"EU Member States Could Agree on a Unified Crypto Law by the End of June - Ethereum World News","content":" Key takeaways:\nThe European Union is close to coming up with a united agreement between its 27 member states on how to regulate cryptocurrencies within the region.\nAccording to a report by Bloomberg, both France (who chairs the EU) and the European parliament are optimistic that the remaining issues of the Markets in Crypto-Assets (MiCA) proposed regulatory package will be resolved by the end of this month. Furthermore, representatives tasked with the matter will be meeting on June 14th and June 30th.\nMiCA was first introduced in 2020, and a unified agreement will usher in a new era of regulation in the European Union. However, the recent events surrounding the collapse of UST have accelerated the need to protect investors and assess crypto’s impact on the region’s financial stability. Consequently, the member states of the European Parliament are looking to agree on the following contentious issues moving forward.\nIn addition, according to sources familiar with the matter, EU legislators are looking to push for the new set of rules to factor in the environmental impact of crypto mining activities focused on digital assets that run on Proof-of-work algorithms.\n","create_date":"2022-06-11T12:18:22+01:00","tag":"Crypto Regulations","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/binance-japan-begin-august-sakura/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Major crypto exchange Binance said its Japanese division will begin full operation for local users by August this year, per a report from Bloomberg.","title":"Binance Japan Full Operations To Begin In August Via Sakura Takeover - Ethereum World News","content":" Major crypto exchange Binance said its Japanese division will begin full operation for local users by August this year, per a report from Bloomberg.\nThe company headed by CEO and founder Changpeng ‘CZ’ Zhao acquired Sakura Exchange BitCoin (SEBC), a locally regulated digital asset platform, last year in November.\nSakura’s acquisition was sealed by an undisclosed sum and opened a route for Binance to re-enter the Japanese market through a platform regulated by the country’s Financial Services Agency (FSA).\nThe move also marked Binance’s first foothold in Japan since 2018 after CZ’s company was shown the door due to regulatory compliance issues.\nPer today’s announcement, Binance Japan operating through SEBC would function as a fully compliant platform offering crypto and digital asset services to users in Japan.\nFurthermore, the development is buoyed by rhetoric from Japan’s Prime Minister Fumio Kishida who has hinted at pathways for crypto operators to set up shop in the country and expanding the local digital currency ecosystem.\nIn recent months, policymakers have revised token listing procedures to accommodate more coins and mulled rules to allow crypto businesses comply with financial rules.\nWhile Binance plans to resurface in the Japanese market, the company has lost some ground in Europe and the U.S. amid regulatory crackdowns.\nThe crypto exchange heavyweight exited Cyprus and saw its derivatives license revoked by Australia’s securities watchdog (ASIC). Binance France also experienced a raid on its Paris office after suspicions of money laundering activities.\nSeveral executives like CSO Patrick Hillmann left the company amid a lawsuit from the U.S. SEC, although departing leaders insisted that their exits had nothing to do with allegations against the crypto exchange or CEO Zhao.\n\n","create_date":"2023-07-25T11:08:38+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/a-beginners-guide-to-eip-5725-transferable-vesting-nfts/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Since the launch of the ERC-721 standard for non-fungible tokens in 2018, the crypto world has seen NFTs evolve in ways that would have been difficult to","title":"A Beginner’s Guide to EIP-5725: Transferable Vesting NFTs - Ethereum World News","content":" Since the launch of the ERC-721 standard for non-fungible tokens in 2018, the crypto world has seen NFTs evolve in ways that would have been difficult to imagine five years ago. New use cases and capabilities are fundamentally changing the way users interact with not only the NFTs themselves, but also with the projects and companies behind the NFTs.\nCore contributors to ApeSwap, a decentralized exchange and bonding protocol, and team members of Paladin, a blockchain security provider, collaborated to develop an extension to the ERC-721 standard that allows for exciting new functionality for NFTs. The EIP-5725: Transferable Vesting NFT standard is the result of careful consideration of what NFTs can and should be, as well as many rounds of real-world testing and iteration.\nWhat is EIP-5725?\nAn Ethereum Improvement Proposal, or EIP, is a document used to recommend and describe standards for the Ethereum community. There are multiple types of EIPs, but EIP-5725 is a ERC (Ethereum Requests for Comments) proposal, meaning that it affects application-level standards and specifications.\nThe EIP that ApeSwap and Paladin have worked together to create is called EIP-5725: Transferable Vesting NFT. This EIP provides an interface for transferable vesting NFTs which release underlying tokens over time.\nWhile time locks and vesting are both important mechanisms for controlling the distribution of ERC-20 tokens and have been around since the age of ICOs, the lack of standardization across the industry can be problematic. Without a standardized approach, it can be difficult for investors to understand how a particular token is being distributed and what the implications of that distribution might be.\nHow does EIP-5725 work?\nEIP-5725 allows for the implementation of a standard API for NFT based contracts to allow two primary functionalities: transferability, and vesting.\nProjects that implement EIP-5725 are able to use their NFTs to represent unvested tokens that belong to the holder of the NFT. In other words, this standard allows projects to either integrate with an existing NFT marketplace, or create their own, to be used as a secondary market for vesting tokens.\nAlso, using EIP-5725, projects can hold and represent the vested and locked properties of any underlying token (ERC-20 or otherwise) that is emitted to the NFT holder. This standard is an extension of the ERC-721 token that provides basic functionality for creating vesting NFTs, claiming the tokens and reading vesting curve properties.\nWhy is EIP-5725 important?\nEIP-5725 allows projects to implement several new capabilities to create value for users and projects:\nHow are projects using EIP-5725 right now?\nApeSwap has used the EIP-5725 standard to create a category of products called ApeSwap Bonds. ApeSwap Bonds allow crypto projects to create transferable NFTs that users purchase with liquidity provider tokens. Holders of the NFTs then receive tokens at a discount, which is set by a variety of factors, linearly over the course of a vesting period set by the project.\nThis approach is superior to the traditional yield farming model in that the capital that a project puts forth as discounted tokens generates a return in the form of project-owned liquidity, as opposed to rented liquidity where reward tokens spent generate no return for the project.\nTo date, ApeSwap has created $1M worth of protocol-owned liquidity for itself and over $1.5M worth of liquidity owned by its partners through the sale of ApeSwap Bonds.\nWhy should users educate themselves on EIP-5725?\nApeSwap and Paladin are excited to promote the EIP-5725 standard to the crypto community at large to enable users to take advantage of the many opportunities that it creates. Users who are interested should learn more about ApeSwap Bonds in the documentation and stay tuned for new Bonds partners and capabilities launching soon.\nIf you have a favorite crypto project that might be a good fit for Bonds, have them reach out to ApeSwap.\nAdditionally, users and project contributors are encouraged to add to the ongoing discussion at the Ethereum Magicians forum.\n","create_date":"2023-04-14T13:12:16+01:00","tag":"apeswap","author":"Guest Post"},
{"url":"https://en.ethereumworldnews.com/new-york-regulator-slaps-50-million-fine-on-coinbase-for-improper-background-checks/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Coinbase will pay a $50 million fine to the New York State Department of Financial Services to settle charges related to improper background checks.","title":"New York Regulator Slaps $50 Million Fine On Coinbase For Improper Background Checks - Ethereum World News","content":" Coinbase has reached a settlement with the New York State Department of Financial Services (NYDFS) over charges related to improper background checks during the opening of new accounts. The American crypto exchange will pay a $50 million fine to the New York regulator to settle the charges.\nAccording to a press release from the NYDFS, Coinbase’s compliance program had significant failures which led to the violation of NY Banking Law and the NYDFS’s transaction monitoring and cybersecurity regulations among other things. These violations exposed the crypto platform to serious criminal conduct including fraud, possible money laundering, and potential narcotics trafficking.\n\n“It is critical that all financial institutions safeguard their systems from bad actors, and the Department’s expectations with respect to consumer protection, cybersecurity, and anti-money laundering programs are just as stringent for cryptocurrency companies as they are for traditional financial services institutions,”\nAs part of the settlement, Coinbase will be required to pour in an additional $50 million in its compliance program over the next two years. This investment will go towards ensuring that the platform’s compliance procedures are in line with the NYDFS’s standards, in addition to addressing the present concerns.\nPaul Grewal, the Chief Legal Officer at Coinbase, acknowledged the settlement on Twitter earlier today. “We’re proud of our commitment to compliance, but we are also willing to acknowledge where we have fallen short” Grewal tweeted.\nWe’re grateful for today’s resolution – we’ve never shied away from working with regulators on making the industry a safer, more compliant space, and we share NYDFS’s commitment to protecting customers.\nThe settlement has sent Coinbase’s share price soaring. At the time of writing, the stock was trading at $38.18, up more than 13% since market open.\n","create_date":"2023-01-04T18:18:58+00:00","tag":"AML","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ethereum-validators-500000-post-merge/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"According to BeaconScan data, the number of validators on Ethereum surpassed 500,000 on Tuesday. The news marked a landmark moment for the leading altcoin","title":"Ethereum Validators Cross 500,000 Post-Merge - Ethereum World News","content":" Summary:\nAccording to BeaconScan data, the number of validators on Ethereum surpassed 500,000 on Tuesday. The news marked a landmark moment for the leading altcoin blockchain as anticipation for staked Ether (ETH) withdrawals grows.\nValidators are a key component of Ethereum’s network after the Merge which switched ETH’s chain from a proof-of-work (PoW) consensus to a proof-of-stake (PoS). Similar to miners on a PoW blockchain, validators are responsible for confirming transactions and maintaining network security among other crucial PoS blockchain needs.\nEthereum core developers said the withdrawal function for staked ETH should roll out with a post-merge update dubbed Shanghai slated for March 2023. ETH engineers released a testing area called “devnet 2” to allow client and validator teams to test the withdrawal process before the feature goes live in a few weeks.\nInterested clients were required to deposit a minimum of 32 ETH before becoming Ethereum Validators. The deposit worth approximately $50,000 at today’s prices was then locked up in a staking contract, allowing clients to earn rewards and other perks when withdrawals become possible.\nThe staked ETH contract which launched in 2020 held over 16 million Ether on Tuesday, per data from EtherScan. ETH traded around $1500, pegging the massive locked ETH at a valuation north of $25 billion. The 16 million staked ETH also accounts for about 13.28% of the leading altcoin’s total supply.\nNansen data highlighted over 92,000 unique staking depositors as of January 12. Furthermore, liquid staking protocol Lido Finance was the top depositor with around 4.6 million ETH staked via the platform.\nMajor crypto exchanges Coinbase, Kraken, and Binance also featured on the top five staked ETH depositors, per Nansen.\n","create_date":"2023-01-17T14:05:33+00:00","tag":"Ethereum (ETH)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/tyler-winklevoss-the-fed-has-set-the-stage-for-bitcoin-btc-to-rise/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"In order to cushion the US economy against the economic effects of the Coronavirus, the Federal Reserve has continued to institute monetary policies that have","title":"Tyler Winklevoss: the Fed Has Set the Stage for Bitcoin (BTC) to Rise - Ethereum World News","content":" In brief:\nIn order to cushion the US economy against the economic effects of the Coronavirus, the Federal Reserve has continued to institute monetary policies that have left many economists, analysts, and crypto enthusiasts predicting that investors will flock to Bitcoin (BTC) to avoid inflation with respect to the United States Dollar.\nIn a recent tweet, the Co-Founder and CEO of the Gemini exchange, Tyler Winklevoss, explained that the recent actions by the Federal Reserve bank to combat a Coronavirus induced recession have set the stage for the rise of Bitcoin (BTC). Additionally, he cautioned that the COVID19 pandemic will lead to more surveillance activities by governments on their citizens to monitor the spread of the disease. His tweet can be found below.\nThe Fed has set the stage for the rise of bitcoin; the pandemic has set the stage for the rise of Big Brother. 💸🎭\n— Tyler Winklevoss (@tyler) April 23, 2020\n\nEarlier today, Mr. Winklevoss commented on the news by Bloomberg pointing at the possibility of the Fed taking US interest rates below zero. In the tweet, he compared the United States Dollar to the price of Oil that saw negative values last week. He stated:\nFirst it was oil. Then it was…the U.S. dollar?\nThe Bloomberg article Mr. Winklevoss was commenting on predicts that the Fed will continue to cut interest rates to stimulate economic growth to slow down the pending recession. The Federal Reserve has already cut interest rates to a range of 0 – 0.25% and there is currently no more room to maneuver. The only option left on the table is to institute negative interest rates. According to Bloomberg, such a rate cut would not be as shocking given the current economic environment. The team at Bloomberg further elaborates on this as follows.\nA decade ago, the answer would have been that it was impossible to go below zero: Banks would simply avoid the charges by withdrawing their reserve deposits and holding the funds in paper currency, which pays zero interest.\nBut economists now recognize that doesn’t happen, because it’s costly to store billions (or trillions) of dollars of paper currency safely. Several European central banks, as well as the Bank of Japan, have successfully taken interest rates below zero.\nThis stimulates consumer demand in the usual ways: by incentivizing banks to make loans at lower interest rates, to bid up the prices of financial assets, and to charge higher fees for deposits.\n(Image courtesy of SpaceX on Unsplash.com)\n","create_date":"2020-04-25T18:03:31+01:00","tag":"Bitcoin (BTC) General News","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/ftx-users-175-million-genesis-settlement/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX's stranded customers have expressed frustration with the $175 million settlement agreement that the bankrupt exchange reached with Genesis earlier today.","title":"FTX Victims Upset Over $175 Million Bankruptcy Claim Settlement With Genesis - Ethereum World News","content":" FTX has settled its bankruptcy claims against fellow bankrupt crypto Genesis. The agreement will allow the defunct crypto exchange’s sister firm Alameda Research to claim $175 million from the bankruptcy estate of Genesis. However, the claim amount is significantly less than the original claim of nearly $4 billion, which has caused considerable outrage among FTX’s stranded customers.\nIn a filing earlier today, Genesis’ lawyers requested Judge Sean Lane of the U.S. Bankruptcy Court for the Southern District of New York to approve the proposed settlement. Genesis stated in the filing that the settlement would help speed up its Chapter 11 proceedings, which begin in early 2023.\nIn addition to paying $175 million to FTX’s bankruptcy estate, the proposed settlement would also waive Genesis’ claims of more than $226 million against the bankrupt crypto exchange. Genesis Global Capital previously revealed that the Bahamas-based exchange was its largest unsecured creditor.\nFTX made a parallel filing where it’s current CEO John Ray III endorsed the latest deal with Genesis. Ray added that the settlement agreement saved both parties from a long and expensive legal process that would be harmful to their respective stakeholders.\nIt is my view that the Settlement Agreement is the result of these good faith arm’s-length negotiations between the Parties and that such negotiations were free of any collusion.”\nFTX’s stranded customers took issue with the deal, given that it was significantly less than the original $3.9 billion claim. FTX 2.0 Coalition, a community of the exchange’s users working to restart the platform, described it as “the worst deal to date.” Other users alleged collusion between John Ray and Genesis’ executives and urged the Unsecured Creditors Committee to oppose the said deal.\nFTX asks court to settle Genesis dispute for a $175 million Genesis claim, the release of a $175 million customer claim and (near worthless) Alameda claims. Down from first $3.9 billion to $2 billion asserted, this must be the worst deal to date, especially in light of the new… pic.twitter.com/ipxHuWMU4A\nNews of the $175 million settlement comes less than a month after both parties reached an in-principle agreement to resolve the claims they made amid their ongoing dispute. On July 28, legal representatives of FTX and Genesis informed Judge Lane that they had found common ground regarding a settlement and intended to proceed with documentation shortly.\n","create_date":"2023-08-17T17:03:09+01:00","tag":"Bankruptcy","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/binance-australia-probed-derivatives/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The local office of Binance Australia was probed by the Australian Securities and Investments Commission (ASIC) as part of the regulator's investigation into","title":"Binance Australia's Office Searched In Derivatives Investigation - Ethereum World News","content":" Summary:\nThe local office of Binance Australia was probed by the Australian Securities and Investments Commission (ASIC) as part of the regulator’s investigation into crypto’s largest centralized exchange.\nAccording to people familiar with the matter, ASIC’s search of Binance’s premises is part of a probe into client classification on the platform and its local derivatives business. Bloomberg reported that the trading venue is cooperating with local authorities.\nToday’s search comes after 500 derivatives positions were liquidated on the platform in February. The issue also reportedly affected user accounts, and some accounts were mysteriously closed down.\nBinance Australia announced plans to shut down its local business later in April amid regulatory scrutiny from ASIC and issues with local banking partners. The regulator also revoked the platform’s derivatives license and launched a “targeted review” of Binance Australia’s business. ASIC officials disclosed that the probe was partly to determine how Binance classifies wholesale and retail clients.\nBinance is also under heavy scrutiny in jurisdictions across the U.S. and Europe. The company’s office in Paris was stormed by officials investigating allegedly “aggravated money laundering”. Crypto’s leading CEX also pulled back from the U.K. and Cyprus.\nGerman regulators denied the company’s custody license application around the same time that major Euro payment partner Paysafe decided to cut support for bank transactions by September.\nIn the U.S., the company and CEO Chanpgeng Zhao stand accused of violating federal laws by offering unregistered securities trading to American investors. Zhao or CZ as he’s known by the media, is said to have commingled funds in private entities like Merit Peak.\nThe company and CZ denied the claims made by the SEC in its June lawsuit.\n","create_date":"2023-07-05T15:16:24+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/chirpley-takes-flight-to-ethereum-chain-expanding-chrp-horizons-in-the-crypto-cosmos/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Amsterdam, 15th January — Chirpley, the dynamic influencer marketplace, has embarked on a transformative journey by spreading its wings to the Ethereum chain.","title":"Chirpley Takes Flight to Ethereum Chain: Expanding CHRP Horizons in the Crypto Cosmos - Ethereum World News","content":" Amsterdam, 15th January — Chirpley, the dynamic influencer marketplace, has embarked on a transformative journey by spreading its wings to the Ethereum chain. This strategic move aligns with Chirpley’s vision to broaden the reach of CHRP holders within the vibrant crypto community. While the Chirpley platform remains rooted in the Binance Smart Chain (BSC) as its primary hub, CHRP is now accessible and tradable on the Ethereum chain.\nEthereum Integration: Elevating CHRP Accessibility\nChirpley has officially gone live on the Ethereum chain, marking a significant milestone in the platform’s evolution. As part of its strategic expansion, CHRP holders can now acquire and trade CHRP tokens seamlessly on the Ethereum chain, providing a broader avenue for engagement within the crypto ecosystem.\nPrivate Sale Success: $100K Infused for Liquidity\nTo fortify liquidity and fuel further growth, Chirpley recently concluded a successful private sale, raising $100,000. These funds have been strategically allocated to the liquidity pool (LP) on Uniswap, enhancing the platform’s stability and reinforcing its position in the decentralized finance (DeFi) space.\nAxelar Partnership Paves the Way for Cross-Chain Innovation\nIn a groundbreaking collaboration, Chirpley has partnered with Axelar, a pioneer in cross-chain solutions, to facilitate its seamless integration with the Ethereum chain. Leveraging Axelar’s innovative Interchain Token Service (ITS), Chirpley has bridged the gap between BSC and Ethereum, offering users a versatile and efficient cross-chain experience. The collaboration also introduces the Squid Router, opening doors to cross-chain swaps that further enrich the CHRP trading experience. Chirpley believes that this partnership, coupled with its expansion to the Ethereum chain, lays the foundation for enduring success and investment growth.\nChirpley’s Perspective: A Strategic Investment for the Future\nThis strategic move to the Ethereum chain reflects Chirpley’s commitment to innovation and adaptability in the ever-evolving crypto landscape. By providing access to CHRP on both BSC and Ethereum, Chirpley aims to enhance user convenience and foster a broader, interconnected community of CHRP holders.\nWebsite: https://chirpley.ai/ Twitter: https://twitter.com/chirpley Telegram Announcements: https://t.me/chirpley Discord: https://discord.gg/vcsb7utD3J YouTube: https://www.youtube.com/c/chirpley Instagram: https://www.instagram.com/chirpley/ TikTok: https://www.tiktok.com/@chirpley Reddit: https://www.reddit.com/user/chirpley/ Facebook: https://www.facebook.com/chirpley/ Medium: https://chirpley.medium.com/ GitHub: https://github.com/chirpley\n","create_date":"2024-01-15T11:40:28+00:00","tag":"","author":"Adrian Mathieu"},
{"url":"https://en.ethereumworldnews.com/binance-europe-paysafe-german-regulator/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance continues to face hurdles in European markets following a decision from its banking partner to end support for Euro transactions and BaFin's rejection","title":"Noose Tightens Around Binance In Europe As Paysafe Cuts Euro Transfers, German Regulator Denies Custody License - Ethereum World News","content":" Summary:\nBinance continues to face hurdles in European markets following a decision from its banking partner to end support for Euro transactions and BaFin’s rejection of the company’s custody license.\nAccording to Bloomberg, banking partner Paysafe will no longer facilitate Euro deposits and withdrawals to and from the crypto exchange from September 2023. The decision will take effect from September 25 and will see Binance cut off from Paysafe’s Single Euro Payments Area (SEPA) network, a spokesperson for the trading venue said.\nIn the meantime, all methods of depositing and withdrawing other fiat currencies as well as buying and selling crypto on Binance.com remain unaffected, including bank transfer using one of the other fiat currencies supported by Binance, and buying and selling crypto directly via credit or debit card\nBinance’s license to offer custody services in Germany was rejected by the country’s top financial regulator BaFin, FinanceFWD reported. The report cited people familiar with the saying, saying that it’s yet unclear if BaFin’s move constitutes an official decision or an intention to turn down the application for a custody license.\nThe two latest setbacks for Binance come amid a string of blows for the world’s largest centralized crypto exchange across European jurisdictions and trouble in the U.S.\nChangpeng Zhao’s company withdrew its license applications in Cyprus and the UK ahead of MiCA’s implementation by 2024. The company also requested to terminate its derivatives license in Australia amid a de-banking crisis with local banking partners.\nBelgium’s Financial Services and Markets Authority (FSMA) issued a cease and desist order for all crypto services offered to Belgian clients.\nIn the U.S. the company is accused of violating securities laws alongside exchange rival Coinbase. However, both entities have denied the allegations and attempted to throw out their respective lawsuits.\n","create_date":"2023-06-29T15:28:32+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/ethereum-defi-tvl-down-curve-crisis/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Total value locked on across Ethereum DeFi protocols dipped by $3.55 billion since Sunday following exploits on Curve Finance factory pools, on-chain","title":"Ethereum DeFi TVL Down $3.55B Since Curve Crisis - Ethereum World News","content":" Total value locked on across Ethereum DeFi protocols dipped by $3.55 billion since Sunday following exploits on Curve Finance factory pools, on-chain analytics provider IntoTheBlock said on Tuesday.\nThe 8% decline in TVL comes at a time when founder Michael Egorov is selling discounted CRV tokens for USDT in a bid to stave off liquidation of his collateralized loan on Aave, a major DeFi lender.\nPer DeFi analysts LookOnChain, Curve founder Michael Egorov has sold 39.25 million CRV in exchange for $15.8 million USDT. The transactions were reportedly part of OTC deals with investors like Tron founder Justin Sun, market maker DWF Labs, crypto trader DCFGod, and DeFi platform Cream Finance.\nMore and more institutions and investors bought $CRV via OTC! Machi Big Brother bought 3.75M $CRV. DWF Labs bought 2.5M $CRV.https://t.co/MQg382LigF bought 2.5M $CRV. … Michael Egorov has sold a total of 39.25M $CRV via OTC and received 15.8M $USDT.https://t.co/hQBlW5WG6J pic.twitter.com/NMIQ2p05ZL\nAccording to reports, Egorov and the buyers agreed on lock-up periods ranging from three to six months. These investors can also sell their CRV should the price rise to $0.80.\nEgorov’s flurry of OTC deals is purportedly a move to cushion his $60 million on Aave collateralized by $175 million in CRV tokens. Liquidation of the founder’s Aave loan could trigger a domino effect of bad debt across several DeFi lending services, potentially plunging the decentralized lending ecosystem into disarray.\nThis scenario only plays out should CRV’s price plunge significantly below $0.3 thus liquidating Egorov’s massive Aave loan. Concerns regarding the possibility were raised after factory exploits on Curve Finance liquidity pools and the ensuing CRV price decline.\n","create_date":"2023-08-01T15:07:49+01:00","tag":"Curve Finance (CRV)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/ftx-japan-resume-withdrawals-21-february/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX Japan has announced that it will begin returning customer funds on 21 February 2023. Users will be able to withdraw from a platform called Liquid Japan.","title":"FTX Japan Set To Resume Withdrawals On 21 February - Ethereum World News","content":" FTX Japan, the Japanese arm of Sam Bankman-Fried’s failed crypto exchange, is set to resume withdrawals on 21 February. Thousands of customers with funds stranded on the platform will be able to withdraw fiat currencies and crypto assets starting 12:00 pm JST tomorrow.\nAccording to a report by FTX Japan regarding their latest crypto assets holdings, as of today, the exchange holds more than 71 million XRP, 19,288 ETH, 3,992 BTC, 347,955 FTT, 2.2 million DOGE, 182,920 SOL, among several other crypto assets. As per the conversion rate at the time of writing, the value of the exchange’s latest crypto holdings in its cold wallet comes out to be more than $165 million. This figure does not include the surplus interest.\nThe company clarified that U.S Dollar deposits made by customers are managed separately. Other than the crypto assets mentioned above, the exchange held 4.3 million USDC and $15.8 million in cash as of 20 February 2023. These funds are held in trust accounts within Japan.\nWe would like to express our deepest apologies for the great concern and inconvenience caused to our customers due to the long-term suspension of our services.”\nAs reported earlier, all withdrawals will be processed through Liquid Japan, a platform owned by FTX. Customers will have to confirm their balances on the exchange’s website and subsequently register with Liquid to be able to withdraw their funds. The company has informed users that the withdrawal procedure may be lengthy due to the sheer number of customers that are expected to line up to withdraw their funds.\nNews of the resumption of withdrawals sent FTX’s native token FTT soaring. The token gained more than 18% within an hour of the announcement. FTT is currently trading at $1.88. Opportunistic traders scrambled to capitalize on this bullish announcement, leading to a 237% increase in the token’s trading volume.\n","create_date":"2023-02-20T16:16:00+00:00","tag":"FTX Japan","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/binance-changpeng-zhao-summoned-dc-court/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The D.C. District Court has summoned Binance CEO Changpeng Zhao in relation with the lawsuit filed against him by the SEC. Zhao has 21 days to respond to the complaint, failing which a default judgement will be entered against him.","title":"Binance CEO Changpeng Zhao Summoned By D.C District Court - Ethereum World News","content":" Changpeng Zhao, the man at the helm of the world’s largest crypto exchange, has been summoned by the D.C. District Court in relation to the lawsuit filed by the Securities and Exchange Commission. The summons comes two days after Zhao and Binance were sued by the securities regulator for allegedly breaking securities laws and commingling billions of customers’ funds in a U.S. entity controlled by Zhao.\nAccording to the summons issued by the U.S. District Court for the District of Columbia, Changpeng Zhao has 21 days to respond to the complaint filed by the SEC. The news was shared by Fox Business Journalist Eleanor Terrett on Twitter earlier today. If Zhao fails to respond within 21 days, a default judgment will be entered against him. The court document showed Malta as the Binance CEO’s country of residence. Zhao was born in China but has been a citizen of Canada for decades.\nI was told this is just part of the SEC compliant process. Nothing new. No need to FUD”\nChangpeng Zhao responded to Terrett’s tweet about the summons served to him and clarified that the court order did not require him to appear in person. Zhao stated that the summons was part of the SEC’s initial complaint and was not new information. He disapproved of the fear, uncertainty, and doubt (FUD) associated with the tweet. A subsequent tweet by the Binance CEO stated that Terrett’s tweet was accurate and that the FUD he highlighted was meant for other rumors on crypto Twitter.\n","create_date":"2023-06-07T21:29:17+01:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/curve-finance-exploits-46-million-crv-18/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Curve Finance's CRV token lost 19% of its value after a series of exploits on Curve's stable pools led to a loss of over $46 million.","title":"CRV Tanks 19% After Curve Finance Loses $46 Million In Exploits - Ethereum World News","content":" Leading DeFi protocol Curve Finance became the target of multiple exploits earlier today where attackers hit three stable pools resulting in an outflow of more than $40 million. The initial attack targeted the factory pools of Alchemix, Metronome, and JPEGd, all of which suffered from a security flaw called a reentrancy vulnerability.\nAccording to data compiled by blockchain security firm Ancilia, the affected stable pools, namely alETH, msETH, and pETH, all utilized a Pythonic Smart Contract Language called Vyper. Versions 0.2.15, 0.2.16, and 0.3.0 of Vyper were reportedly vulnerable to malfunctioning reentrancy locks, which allowed the hacker to repeatedly withdraw funds from the smart contract.\nThe attacker managed to exploit Alchemix to the tune of $13.6 million, while NFT lending protocol JPEGd lost $11.4 million. $1.6 million were drained from Metronome DAO’s sETH-ETH-f pool. The tokens associated with all three projects witnessed a significant downtrend following the exploits.\nA white rescue operation was announced soon after reports of the exploits started taking over the crypto community on Twitter. Curve Finance assured the community that crvUSD contracts and associated pools were not affected by the attacks. The DeFi protocol further directed all affected parties to coordinate with the white hat efforts.\ncrv/eth pool drained minutes before a whitehack operation :(https://t.co/rhALBzkTEi\nHowever before the white hat operation could ensure the safety of the funds, another attack was mounted on the crv/eth pool. Data from Etherscan showed that the attacker drained 7 million Curve DAO Tokens (CRV) and $14 million worth of wrapped Ether (wETH) in the exploit. The wallet used in this exploit was reportedly funded from Binance. The latest exploit brought the total loss to over $46 million.\nThe barrage of exploits had a significant impact on the tokens of the affected projects. CRV lost more than 19% of its value, reaching a four-week low of $0.61. At the time of writing, the token was trading at $0.63.\n","create_date":"2023-07-30T22:44:15+01:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/pricey-ethereum-gas-galvanizes-evm-chains/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Ethereum Virtual Machine (EVM)-compatible network saw an uptick in user activity as Ethereum maintained its infamously high gas fees.","title":"Pricey Ethereum Gas Fees Galvanizes Activity On EVM-Chains - Ethereum World News","content":" Summary:\nEthereum Virtual Machine (EVM)-compatible network saw an uptick in user activity as Ethereum maintained its infamously high gas fees.\nAccording to on-chain data from The Block, EVM chains set a new all-time high for daily unique addresses. The number of these unique addresses hit culminated last week on Wednesday, April 25. Daily unique addresses hit 6.77 million for the first time on EVM-compatible chains like BNB Chain, Polygon, and Fantom.\nEthereum’s network enjoyed an additional surge in interest after the Shanghai upgrade as traders and crypto users were once again spurred by meme coin mania. This increased trading activity on ETH’s chain caused a consistent rise in transaction costs, the main reason why users are opting for EVM-compatible chains instead.\nTransaction costs on EVM-compatible chains like BNB Chain and Polygon are a fraction of gas fees on Ethereum. These networks are also able to provide cheaper gas fees while leveraging security infrastructure from Ethereum’s base layer.\nResearch analyst Kevin Pang noted a steady increase in transaction costs on ETH’s network since early 2023. Pang opined that this consistent rise powered growth in EVM chain usage. Data showed a 250% increase as gas fees jumped from around $2.5 per transaction late last year to $9 in May 2023.\nSpeculative traders and memecoin mania are not new narratives in the crypto industry. Indeed, the rise in gas fees comes at a time when rising meme coin Pepe has stormed the market and grown in popularity.\nThe memecoin based on ‘Pepe the frog’ recorded over 2100% in returns for holders since its debut in April. Pepe’s PEPE-WETH contract has been the most active liquidity pool on Uniswap V2 and V3 for the past week. Pepe is also a top trending crypto on aggregators like Coingecko and CoinMarketCap.\n","create_date":"2023-05-03T17:02:45+01:00","tag":"BNB Chain","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/belgium-binance-cease-all-crypto-services/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Belgium's Financial Services and Markets Authority (FSMA) has ordered Binance to cease all operations and crypto services. The exchange has been ordered to return all crypto assets belonging to Belgian clients.","title":"Belgian Regulator Orders Binance To Cease All Crypto Services - Ethereum World News","content":" The Financial Services and Markets Authority of Belgium has ordered Binance to immediately cease its operations in the country and stop offering crypto and custody services to Belgian customers. The order comes amid mounting legal troubles for the crypto exchange, which was sued by the U.S. Securities and Exchange Commission earlier this month for illegally operating a securities exchange in the country.\nAccording to a press release by Belgium’s Financial Services and Markets Authority (FSMA), Binance has been ordered to take immediate measures to return crypto assets belonging to Belgian clients. The regulator directed the crypto exchange to contact their clients and entertain any instructions related to the return of their assets. The FSMA accused Binance of violating a law that prevents firms from non-European Economic Area countries from offering services in Belgium.\nPersons or firms governed by the law of a country that is not a member of the European Economic Area are prohibited from offering or providing, within Belgium, by way of a professional activity – even if supplementary or ancillary – exchange services between virtual currencies and legal currencies or custody wallet services.\nAs per the FSMA, several requests were made to Binance for information related to its operations from an EEA member country. The exchange reportedly failed to demonstrate that the crypto services being provided in Belgium were carried out from a legal entity governed by an EEA country. The regulator further stated that the Crown Prosecutor of Brussels had been informed of Binance’s acts which are liable to constitute a criminal offense.\n1, 2, 3…\nThere was no official response from Binance at the time of writing. However, CEO Changpeng Zhao took to Twitter to share his famous “4” tweet, which he uses to convey to his followers any ongoing FUD against his crypto firm. “1, 2, 3…..” Zhao tweeted.\n","create_date":"2023-06-23T21:26:59+01:00","tag":"Belgium","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/mica-wins-vote-crypto-licensing-europe/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"MiCA, the crypto licensing regime first proposed by the European Commission in 2020, grabbed a 13-1 landslide victory during a parliamentary vote today, moving one step closer to becoming law.","title":"MiCA Bill Wins Landslide Vote To Install Crypto Licensing Rules Across Europe - Ethereum World News","content":" Summary:\nOn Thursday, Legislators from the European Union voted in support of the Markets in Crypto Assets regulation or MiCA , a crypto licensing policy first introduced in 2020 by the European Commission.\n517 EU lawmakers threw their voting power behind the MiCA bill, pushing the bill into law. The bill will be actively implemented 12-18 months after lawmakers publish the regulations in the EU’s Official Journal. This is only possible after the EU’s council and the parliament both approve MiCA.\nThursday’s vote followed a Wednesday parliamentary debate where several legislators voiced support for the bill ahead of the vote on Thursday. Rhetoric from lawmakers like EPP’s Lídia Pereira, MEP Ernest Urtasun, and lawmaker Stefan Berger stressed the benefits of allowing crypto exchanges and wallet providers to operate under a regulated licensing framework.\nLawmakers also backed requiring stablecoin issuers to maintain sufficient reserves for their tokens.\nMiCA faced opposition from 38 lawmakers during today’s vote. 18 legislators abstained from declaring support as Europe becomes the first “major” jurisdiction to publish crypto regulations.\n“We’re protecting consumers and safeguarding financial stability and market integrity,” the European Commission’s Mairead McGuinness said, saluting the decision as a “world first”.\n✅ I welcome the European Parliament’s vote today to approve comprehensive EU rules on crypto: a world first. The rules will start applying from next year. We’re protecting consumers and safeguarding financial stability and market integrity. pic.twitter.com/cdn58rb9FA\nLawmakers in the European Parliament voted for a separate law aimed at beefing up anti-money laundering systems. Under the Transfer of Funds regulation, crypto businesses must implement thorough know-your-customer checks. 529 lawmakers voted for the bill while 29 voted against the policy. 14 legislators abstained.\n","create_date":"2023-04-20T17:25:06+01:00","tag":"Crypto Regulations","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/binances-cz-bank-acquisition-1-billion/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Armed with a $1 billion war chest, Binance's Changpeng Zhao has indicated that the exchange is looking to acquire a bank.","title":"Binance’s Changpeng Zhao Mulls Over Bank Acquisition With $1 Billion War Chest - Ethereum World News","content":" \nChangpeng Zhao, the man at the helm of the world’s largest crypto exchange by market capitalization, has expressed his intentions to get into traditional finance or TradFi. Backed by 1 billion dollars in his war chest, Zhao has indicated that a bank acquisition may be likely in the near future. As per a report by Bloomberg, Zhao revealed his TradFi ambitions while speaking at the Web Summit conference in Lisbon.\n“There are people who hold certain types of local licenses, traditional banking, payment-service providers, even banks. We’re looking at those things, We want to be the bridge between crypto and the traditional, financial world.” Zhao said.\nThe Binance chief has clarified that apart from a full-fledged acquisition, an investment involving a minority stake is also on the table. Zhao cited the potential increase in a bank’s share price upon entering into a business agreement as one of the factors for considering such an option.\n“What we have found is when banks work with us, we drive so many users to them, so the bank’s valuation goes up exponentially, like why don’t we just invest in them as well, so that we capture some of the equity upside,” Zhao stated.\nBinance announced a $1 billion growth fund last month which was aimed at talent development and crypto investments, among other things. A whopping $500 million from this fund has been set aside for investment into financial services, decentralized computing, gaming, metaverse, virtual reality, etc.\nThe traditional banking model will most likely enable users to interact with web3 and crypto as a whole, by acting as a gateway between traditional finance and decentralized finance.\nChangpeng Zhao’s TradFi push comes at a time when institutions from traditional finance are actively exploring ways to foray into the exciting world of crypto. Earlier today, Polygon co-founder Sandeep Nailwal revealed that the world’s largest bank, J.P Morgan, had concluded its first live DeFi trade in association with the Monetary Authority of Singapore. This is a major milestone for crypto adoption, given that the industry has experienced a wide-scale selloff thanks to the on-going crypto winter.\n","create_date":"2022-11-02T19:17:26+00:00","tag":"Banks","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ftx-japan-resume-withdrawals-this-month/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The Japanese subsidiary of FTX plans to begin returning customer funds as early as February. The company's COO is confident about adhering to the timeline.","title":"FTX’ Japanese Unit May Resume Withdrawals This Month - Ethereum World News","content":" The Japanese subsidiary of bankrupt crypto exchange FTX plans to begin returning customer funds by the end of this month. If successful, the Japanese unit would become the first of Sam Bankman-Fried’s failed crypto empire to return funds to its customers.\nAccording to a report by Bloomberg, the Japanese unit plans to facilitate the return of funds through a platform called Liquid, which is owned by the bankrupt exchange. The company’s Chief Operating Officer Seth Melamed said in an interview that the customers have been asked to confirm their account balances and transfer their funds from FTX Japan to Liquid Japan. The COO said that withdrawals would begin “very soon.”\n\n“Re-enabling withdrawals at FTX Japan in a transparent, fair, and accurate manner has been a shared goal for our entire team. We are confident we will adhere to the timeline”\nMelamed revealed that his team was working around the clock on this plan. The company plans to resume withdrawals once it has sufficient data on the balance migration to Liquid Japan and relevant approvals. The bankrupt exchange has reportedly been beta testing and optimizing the process since the beginning of this month. The process involved collecting feedback to ensure seamless withdrawals for its remaining 35,000 users.\nIn a roadmap released by Liquid Japan in December last year, February was announced as the target month to begin processing withdrawals for customers. The timeline was subject to change depending on the progress of ongoing external security audits at the time. The exchange had suspended withdrawals in November 2022 due to the liquidity issues at its parent firm. As part of the U.S bankruptcy proceedings, FTX Japan was put up for sale. The exchange had announced in December that customer funds would not be included in the company’s estate, in line with Japanese regulations.\n","create_date":"2023-02-17T22:24:44+00:00","tag":"Bankruptcy","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/bitcoin-nfts-added-to-binance-marketplace/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance, one of the world's largest cryptocurrency exchanges, has added Bitcoin NFTs to its marketplace, just one day after the U.S. Securities and Exchange","title":"Bitcoin NFTs Added To Binance Marketplace Post-SEC Crackdown - Ethereum World News","content":" Summary:\nBinance, one of the world’s largest cryptocurrency exchanges, has added Bitcoin NFTs to its marketplace, just one day after the U.S. Securities and Exchange Commission (SEC) filed a lawsuit against the company.\nThe crypto exchange’s NFT marketplace will now support over 25 Bitcoin NFT collections including BTC DeGods, Bitcoin Bandits, Bitcoin Frogs, Bitcoin Pizzas, and Bitcoin Punks.\nNFTs on Bitcoin are a hot new narrative capturing attention within BTC’s community and the broader crypto market narrative. These digital collectibles became possible thanks to the Ordinals Protocol.\nUsers can leverage Ordinals to embed data like texts and images on the smallest unit of Bitcoin known as Satoshi through a process called “Inscription”. Inscriptions have boomed since they first debuted and now number over 1 million, per Dune Analytics data. NFTs on Bitcoin also picked up steam along with BRC-20 hype, a token standard for creating tokens akin to ERC-20 on Ethereum.\nBitcoin NFTs on Binance NFT Marketplace rolled out less than 48 hours after the U.S. Securities and Exchange sued the crypto exchange for operating an unregistered securities exchange. CEO Chanpgeng Zhao or CZ was also sued for commingling funds, a similar accusation levied against FTX Founder Sam Bankman-Fried.\nBinance responded by denying the allegations while chastizing the securities regulators for its misguided refusal to create clear and fair guidance for the nascent digital asset industry.\nSimilar to Binance, Coinbase was sued by the SEC for unregistered securities trading and other securities violations. Indeed, the federal regulator has dropped the hammer on crypto companies in recent months.\nThe lawsuits also allege that cryptocurrencies like Solana’s SOL and Polygon’s MATIC are securities and therefore should fall under the purview of securities laws. Notably, none of the lawsuits against Binance, CZ, or Coinbase claim that ETH is a security.\n","create_date":"2023-06-06T16:37:10+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/paypal-ceo-silicon-valley-loving-bitcoin/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Some of the world's most prominent people have publicly came out to bash Bitcoin (BTC); Donald Trump, President of the United States, for instance, earlier","title":"PayPal Chief Joins Squad of Silicon Valley Execs Loving Bitcoin (BTC) - Ethereum World News","content":" Some of the world’s most prominent people have publicly came out to bash Bitcoin (BTC); Donald Trump, President of the United States, for instance, earlier this year issued an out-of-the-blue tweet storm about cryptocurrencies, seemingly in response to Libra. Let’s just say he wasn’t so pleased, noting that digital assets can be used for crime.\nTrump is not alone in bashing cryptocurrencies. Jean-Claude Trichet, who led the ECB from 2003 to 2011 after heading the Bank of France, said that investing cryptocurrencies is “in many respects pure speculation.” Trichet added that this speculation isn’t healthy, looking to the fact that he sees little fundamental value in Bitcoin — something he called “not real” and noted is sans “the characteristics that a currency must have.”\nWhat’s weird, though, is that those in Silicon Valley and the bankers that are more knowledgable about technology and financial disruption have begun to embrace Bitcoin, not cast it aside as a joke or fad.\nFortune writer Polina Marinova, who is notably engaged to prominent Bitcoin bull Anthony Pompliano, recently sat down with PayPal CEO Dan Schulman to talk cryptocurrency, specifically Libra. Readers likely remember that earlier this year, the prominent fintech company dropped out of Facebook’s Libra association, citing regulatory and compliance concerns.\nOf course, the conversation eventually took a brief tangent to Bitcoin. Asking the question that would’ve been on the mind of readers, Marinova asked the PayPal chief executive if he “personally owns cryptocurrencies,” to which he replied “only Bitcoin.” That was all he said, though the statement from Schulman quickly blew up on Twitter, with Pompliano posting the tweet below, for instance.\n\nPayPal CEO owns Bitcoin. That’s it. No other crypto. Only Bitcoin. 🔥https://t.co/HHXhaHjcMO\n\nIt isn’t clear why Schulman owns Bitcoin — prominent gold proponent and cryptocurrency bear Peter Schiff holds the cryptocurrency because it was given to him as a gift and as donations — though many took this as a sign that he is bullish on it.\nAnd if he is, he isn’t alone. Far from. Former PayPal executives across the board have become enamored with the cryptocurrency over the years, including Elon Musk. The Tesla and SpaceX chief executive, formerly of PayPal, was quoted as saying during an ARK Invest podcast last year that he thinks that paper money is inferior to cryptocurrency, citing its ability to be used by individuals in places like Venezuela, where fiat has become unsustainable. Facebook’s blockchain chief David Marcus, who used to head PayPal, owns a stash of Bitcoin, and has since delved into cryptocurrency full time via Libra.\nAlso, Jack Dorsey, chief executive of Twitter, earlier this year implied that he is purchasing some $10,000 worth of BTC each and every week; this assertion came shortly after he told Joe Rogan in a podcast that he thinks that the cryptocurrency will become the Internet’s native currency with time.\nDorsey and the aforementioned are just the tips of the iceberg though. For some reason, Silicon Valley is seeing something in Bitcoin that Wall Street doesn’t.\n","create_date":"2019-11-21T13:00:14+00:00","tag":"bitcoin","author":"Nick Chong"},
{"url":"https://en.ethereumworldnews.com/binance-us-moonpay-fiat-on-ramp/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance US has tapped MoonPay to enable crypto purchases via USD. MoonPay's USD on-ramp will let the exchange's users to purchase USDT, which can subsequently be exchange for over 150 crypto assets.","title":"Binance US Partners With MoonPay Amid Debanking In The U.S - Ethereum World News","content":" Binance US recently partnered with crypto payments startup MoonPay to allow its customers to buy crypto assets on its trading platform. The American arm of the world’s largest crypto exchange, which transitioned to a “crypto-only” exchange earlier this year, is likely hoping to circumvent the payment disruptions that have prevented its customers from depositing or withdrawing US Dollars from the platform for more than two months.\nBinance US stated on its official website’s FAQ section that it had tapped MoonPay to enable efficient buying and selling of crypto assets for its users. The platform will continue to remain a crypto-only exchange for the time being but partnered with the crypto startup to make interacting with crypto easier for its customers.\nMoonPay’s USD is integrated into the crypto exchange’s buy & sell crypto feature, which will allow its users to purchase Tether (USDT) using conventional payment methods, including debit/credit cards, Apple Pay, Google Pay, etc. The USDT can subsequently be exchanged for the 150+ crypto assets listed on Binance US.\nBinance US suspended US Dollar deposits in early June after its banking partners ended support for fiat withdrawal channels. At the time, the payment disruption was blamed on the enforcement action initiated by the U.S. Securities and Exchange Commission (SEC).\nBinance US stated that the legal troubles and complications stemming from the securities regulator’s actions led to challenges with its banking partners. Citing consumer protection, the crypto exchange announced a transition to a crypto-only exchange and subsequently began delisting USD trading pairs from its trading platform.\nIn December 2022, decentralized exchange Uniswap partnered with MoonPay to enable crypto purchases through fiat channels. The “Direct to DeFi” feature allowed the DEX’s users to directly purchase crypto using bank cards and transfers.\n","create_date":"2023-08-22T20:58:36+01:00","tag":"Banks","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ftx-clawback-sbf-400-million-jp-morgan/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX's bankruptcy lawyers are negotiating to recover $400 million from an account at JPMorgan. The funds were used by Sam Bankman-Fried to invest in crypto hedge fund Modulo Capital last year.","title":"FTX Seeks To Clawback SBF’s $400 Million Sitting In JPMorgan Chase - Ethereum World News","content":" The downfall of the Bahamas-based crypto exchange FTX last November triggered a race among bankruptcy lawyers, forensic investigators, and federal prosecutors to track down billions of dollars that were lost following the exchange’s implosion, in addition to the funds invested and spent by the exchange’s top management. The objective was to claw back and recover the lost funds and make the customers and creditors whole.\nAccording to a report by the New York Times, FTX’s bankruptcy lawyers have been able to track down $400 million of Sam Bankman-Fried’s investment portfolio sitting in an interest-bearing account at JPMorgan Chase. Bankman-Fried had invested this money in Modulo Capital, a crypto hedge fund that operated out of the same Bahamian compound where the bankrupt exchange’s former founder lived.\nThe nearly half-billion-dollar investment caught the attention of investigators and prosecutors last month given the timing of the transaction. Modulo Capital reportedly received this investment shortly before FTX collapsed. Following FTX’s collapse in November last year, Modulo Capital’s holdings were converted into cash. That money has since been sitting in an account at JPMorgan, given that the bank was the trading firm’s primary broker.\nIt is unclear at this time if Duncan Rheingans-Yoo and Xiaoyun Zhang, the hedge fund’s founders, were involved in any wrongdoing. People familiar with the matter revealed that the founders are negotiating a clearance from certain legal liabilities in exchange for returning the investment.\n","create_date":"2023-02-15T15:30:58+00:00","tag":"FTX","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/52-million-recovered-curve-finance-heist/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"DeFi protocols affected in the $73.5 million reentrancy attack on decentralized exchange Curve Finance have recovered a substantial portion of the stolen","title":"$52.3 million Recovered From Curve Finance Heist - Ethereum World News","content":" DeFi protocols affected in the $73.5 million reentrancy attack on decentralized exchange Curve Finance have recovered a substantial portion of the stolen funds, PeckShield.\nThe Alchemix Finance exploiter returned 7,258 Ether (ETH) and 4,821 Alchemix Ether (alETH) worth $22 million. White hat hackers also rescued $13 million in crypto bringing Alchemix’s total to $35 million, the single largest recovery from Curve’s exploit.\nJPEGd received $11.5 million in 5,495.4 wrapped Ether (WETH), accounting for 90% of the funds drained from its pETH/ETH pool. The frontrunner hacker claimed 10% as a bounty.\nFurthermore, the Metronome Curve pool exploiter returned 886.55 ETH worth $1.6 million.\nThe Curve Finance CRV-ETH exploiter is yet to return $19.7 million worth of cryptocurrency stolen during the reentrancy attacks on July 30, although c0ffeebabe.eth rescued $5.3 million from the CRV pool.\nCurve initially offered the CRV/ETH exploiter 10% of stolen funds if they returned 90%. The bounty is now open to the public as the funds were not returned.\nCurrently, the bounty stands at $1.85 million for any information that could help secure a conviction in court.\nThe deadline for the voluntary return of funds in the Curve exploit passed at 0800 UTC. We now extend the bounty to the public and offer a reward valued at 10% of the remaining exploited funds (currently $1.85M USD) to the person who is able to identify the exploiter in a way that leads to a conviction in the courts.\n“If the exploiter chooses to return the funds in full, we will not pursue this further” added the Curve team.\n","create_date":"2023-08-07T12:53:38+01:00","tag":"Curve Finance (CRV)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/binance-us-suspend-usd-withdrawal-june-13/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance US' banking partners have expressed their intention to suspend fiat (USD) withdrawals as soon as June 13, 2023. The crypto exchange has decided to suspend USD deposits today.","title":"Binance US' Banking Partners To Suspend USD Withdrawals By June 13 - Ethereum World News","content":" Binance US is suspending USD deposits on its trading platform effective immediately. The crypto exchange has revealed that its banking partners are preparing to pause fiat (USD) withdrawal channels as early as June 13, 2023. The American arm of the world’s largest crypto exchange blamed the deposit and withdrawal suspension on the enforcement action initiated by the U.S. Securities and Exchange Commission.\nBinance US took to Twitter a little while ago to inform its customers about the latest developments regarding its online trading platform. The exchange accused the SEC of using extremely aggressive and intimidating tactics in pursuit of its “ideological campaign against the American digital asset industry.”. According to the crypto giant’s American arm, the legal troubles and complications stemming from the securities regulator’s actions have led to challenges with the banks that the exchange works with.\nThe crypto exchange stated that in the interest of consumer protection, it will suspend USD deposits today and transition to a “crypto-only” exchange. All customers are being encouraged to withdraw their fiat assets from the American exchange before June 13, 2023. The exchange warned that due to elevated volumes and weekend bank closures, the withdrawal process may take longer than usual.\nWhile we remain open to a productive compromise that enables a thriving digital asset marketplace in America, Binance.US will continue to vigorously defend ourselves, our customers, and industry against the meritless attacks of the SEC.”\nBinance US will start delisting USD trading pairs, including BTC/USD starting next week. Any USD balance remaining on the platform after June 13, 2023, will likely be converted to stablecoins. The crypto exchange has assured its customers that it will maintain 1:1 reserves for all customer assets.\n","create_date":"2023-06-09T04:20:30+01:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/polygon-suku-launch-nft-minted-on-twitter/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Polygon and web3 wallet Suku launched an open edition NFT collection, minted entirely on Twitter.","title":"Polygon And Web3 Firm Suku Launch NFT Collection Minted On Twitter - Ethereum World News","content":" Polygon, the popular Ethereum layer 2 scaling solution, recently partnered with Web3 payment services firm Suku to launch an unprecedented open edition NFT collection that was entirely minted on Twitter. Users on Twitter minted more than 50,000 NFTs during the 48-hour mint window by making a tweet tagging Polygon and Suku.\nThe free NFT collection from Suku was announced to celebrate the launch of Polygon 2.0. The NFT campaign led to Suku getting more than 48,000 wallet downloads, the web3 payments firm stated in a press release. Suku and Polygon received over 88,000 social mentions, 18 million users reached, and over 22 million impressions through the free NFT collection.\nFor managing the NFTs minted on Twitter, Suku offered NFT holders its web3 wallet, which can be accessed with their Twitter account. According to Suku, by eliminating the complex onboarding process associated with NFTs and the broader crypto space, it promoted blockchain inclusivity.\nBy integrating its tools with popular platforms like Twitter, where users already spend their time, Suku is pioneering a user-centric approach to blockchain technology.”\nSuku’s social web3 wallet also allows users to send and receive crypto instantly. Users who haven’t signed up for the wallet can access it by using their Twitter handle as a wallet address, essentially making it the crypto transfer service on Twitter.\nSuku stated that utilizing a fast and scalable blockchain like Polygon was a key element of its plan to foster crypto adoption and attract new users to the blockchain space, in addition to other incentives such as zero gas fees on minting NFTs and access to a web3 wallet that wouldn’t require seed phrases or private keys. The firm plans to expand to other social media platforms, including Face, Reddit, Instagram, and LinkedIn.\n","create_date":"2023-07-28T02:00:58+01:00","tag":"crypto wallet","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/binance-executives-quit-changpeng-zhao/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance's top executives including the Chief Strategy Officer and General Counsel, have quit the company. The executives blamed their departure at CEO Changpeng Zhao's handling of the investigation by the U.S. Department of Justice.","title":"Binance’s Senior Executives Quit Over Changpeng Zhao’s Handling Of Investigations - Ethereum World News","content":" After facing severed banking relationships, hostile regulators, and several instances of FUD, multiple senior executives at Binance have reportedly turned in their resignations. The executives blamed their decision to quit on CEO Changpeng Zhao’s handling of the regulatory inquiries and investigations into the exchange’s operations. Their departure comes amid mounting regulatory and legal troubles for the world’s largest crypto exchange.\nAccording to a report by Fortune, senior executives at Binance, including Chief Strategy Officer Patrick Hillmann, Senior Vice President for Compliance Steven Christie, and General Counsel Han Ng, informed the Chief Executive that they were quitting the company. A person familiar with the matter revealed that the executives blamed their departure on Changpeng Zhao’s handling of the investigation by the US Department of Justice. The Justice Department’s probe is just one of many filed by federal agencies in the United States.\nBinance or CEO Changpeng Zhao have not put out an official statement addressing the news of the recent departures. However, CSO Patrick Hillmann took to Twitter to inform everyone that he was leaving the company on good terms and would continue to respect and support Zhao. The BNB token took a visible hit following the latest development and was trading at $234 at the time of writing.\nApologies for any typos, but I was not expecting to be tweeting about this today. It’s true that I am leaving @Binance, but I’m doing so on good terms. I continue to respect and support @cz_binance and am grateful for having had the incredible opportunity to work under his…\nThe loss of key figures from legal and compliance departments will likely cause problems for the crypto giant, given that it is juggling several regulatory inquiries. The crypto exchange is currently facing probes from the Securities and Exchange Commission (SEC), and the Commodities and Futures Trading Commission (CFTC), among several other investigations. Matthew Price, Binance’s Chief of Global Investigations and Intelligence, also quit the company recently.\n","create_date":"2023-07-06T23:22:41+01:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/binance-cancels-german-crypto-license/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance officially withdrew its application with the German Federal Financial Supervisory Authority (BaFin) for a crypto license amid a retreat from multiple","title":"Binance Cancels German Crypto License Request - Ethereum World News","content":" Binance officially withdrew its application with the German Federal Financial Supervisory Authority (BaFin) for a crypto license amid a retreat from multiple European markets due to regulatory obstacles and ongoing lawsuits in the U.S.\nFinanceFWD previously reported that BaFin denied the company’s request for a custody license but it was unclear if the decision was official or simply intended at the time.\nToday, a spokesperson confirmed that the company has indeed pulled its license application with BaFin citing changes in the global regulatory atmosphere and market conditions.\nBinance confirms that it has proactively withdrawn its BaFin application. The situation, both in the global market and regulation has changed significantly. Binance still intends to apply for appropriate licensing in Germany, but it is essential that our submission accurately reflects these changes.\nBinance failed to register with Dutch regulators and announced its exit from the Netherlands. The company also plans to shut down operations in Cyprus and the United Kingdom.\nBelgian authorities issued a cease and desist order to the company while Australia’s securities regulator (ASIC) revoked the company’s derivatives license.\nFrench police raided Binance Paris in a money laundering investigation, although CEO Changpeng Zhao said the company fully corporated with authorities.\nAmid roadblocks in Europe, the company is setting up shop in the Asian market with a re-emergence in Japan. Binance Japan expects to kick off fully compliant crypto services on August 2 after purchasing Sakura Exchange BitCoin (SEBC), a locally regulated company, in November 2022.\n","create_date":"2023-07-26T15:18:39+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/sec-sues-coinbase-after-binance/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The U.S. Securities and Exchange Commission (SEC) alleges that Coinbase operates an unregistered securities exchange, brokerage service, and clearing agency.","title":"SEC Sues Coinbase After Binance - Ethereum World News","content":" Summary:\nThe U.S. Securities and Exchange Commission (SEC) alleges that Coinbase operates an unregistered securities exchange, brokerage service, and clearing agency. Gary Gensler’s SEC announced the lawsuit against Coinbase a day after suing industry competitor Binance and its CEO Changpeng Zhao for similar violations.\nThe Coinbase Platform merges three functions that are typically separated in traditional securities markets—those of brokers, exchanges, and clearing agencies. Yet, Coinbase has never registered with the SEC as a broker, national securities exchange, or clearing agency.\nAccording to the SEC, Coinbase generated billions in revenue while evading the disclosure regime overseeing the U.S. securities market. Similar to its suit against crypto exchange Binance, the SEC lists several tokens as unregistered crypto securities available for trading on Coinbase.\nThe Commission listed 13 tokens in today’s lawsuit with no mention of ETH, the same as the Binance lawsuit, although the court document states that the security label is not limited to the tokens mentioned.\nThe SEC named SOL, ADA, MATIC, FIL, SAND, AXS, CHZ, FLOW, ICP, NEAR, VGX, DASH, and NEXO in court documents. Violations tied to staking services offered by the publicly listed crypto exchange were filed 101-page document as well.\nCrypto prices slumped further following the SEC’s double-barrel enforcement action against crypto’s largest centralized exchanges. COIN dropped 15% during pre-trading hours on the back of the SEC’s lawsuit.\nCoinbase’s alleged failures deprive investors of critical protections, including rulebooks that prevent fraud and manipulation, proper disclosure, safeguards against conflicts of interest, and routine inspection by the SEC.\nThe San Francisco-based crypto exchange received a “show cause order” from 10 state securities regulators. This means the company has 28 days to convince state regulators not to serve a “cease and desist” order for unregistered securities sales. The multi-state action includes securities regulators from Alabama, California, Illinois, Kentucky, Maryland, New Jersey, South Carolina, Vermont, Washington, and Wisconsin.\nToday’s lawsuit comes hours after Binance was accused of similar violations. In Binance’s case, its CEO Changpeng Zhao was also sued. The SEC claimed Binance commingled corporate and client cash in a U.S. entity wholly controlled by CZ.\n“We intend to defend our platform vigorously,” Binance responded. CEO Zhao tweeted “4”, his popular code for FUD.\nBinance’s response echoed rhetoric from Brian Armstrong and his company arguing that the SEC would rather regulate the nascent industry through blunt misguided enforcement action than engage stakeholders toward developing fair guidance for crypto assets.\n","create_date":"2023-06-06T14:34:15+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/ethereums-shanghai-upgrade-brings-heat-to-liquid-staking-derivatives-lsd-with-ldo-seeing-71-increase-in-value/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The Shanghai upgrade of the Ethereum network, scheduled for March 2023, has generated excitement among some as they anticipate competition between LSD (Liquid","title":"Ethereum's Shanghai Upgrade Brings Heat To Liquid Staking Derivatives (LSD) with LDO Seeing 71% Increase In Value - Ethereum World News","content":" The Shanghai upgrade of the Ethereum network will focus on allowing users to withdraw their ether (ETH) from the network. This upgrade, set to launch in March, will enable users to access coins that have been staked on the network as part of the transition to proof-of-stake consensus, which occurred in September.\nIn order to meet the March deadline, the developers plan to release a public test network for the Shanghai upgrade by the end of February. During the recent core developers call, it was decided not to consider adding the Ethereum Virtual Machine Object Format (EOF) to the upgrade due to concerns that it may delay the rollout. The priority for the Shanghai upgrade is to ensure the smooth implementation of the withdrawals feature.\nThe Shanghai upgrade of the Ethereum network, scheduled for March 2023, has generated excitement among some as they anticipate competition between LSD (Liquid Staking Derivatives).\nThere are a few anticipated potential outcomes following the upgrade.\nPotential Sell Pressure: A possibility is that there could be increased sell pressure from large investors or those looking to sell their assets.\nStakers Will Not UnStake: Another possibility is that stakers may continue as per usual, with no change in their behavior.\nStakers Will move their unstaked ETH in LSDs: Another anticipated possibility is that investors may move their newly unstaked Ethereum to Liquid Staking Derivatives (LSDs) in order to benefit from higher returns and decentralized finance functionality. This could potentially result in new innovations and developments in the space.\nLiquid staking, also known as “soft staking,” is a way to earn rewards by locking up funds while still retaining access to them. This is in contrast to traditional staking on the Beacon Chain, which involves a larger investment of 32 ETH (around $40,000) and does not allow for funds to be withdrawn until the staking period is over. With liquid staking, any amount can be staked and the funds can be withdrawn at any time.\nOnce staked ETH becomes available for withdrawal, the revenue of liquid staking providers is expected to increase. Liquid staking derivatives allow for participation in decentralized finance without sacrificing staking yields. Examples of this include Lido, which offers stETH staking and LDO tokens that earn yields, though it does take a 10% cut of the staking rewards. Rocket Pool is another well-known provider that emphasizes decentralization and offers competitive returns. Other notable providers in this space include Stakewise and Frax Finance, both of which have seen rapid growth. Stader Labs is also planning to launch an Ethereum liquid staking derivative in the first quarter of the year, and it is possible that other companies may follow suit.\nThe LDO token, which is associated with the Lido DAO, has experienced strong performance recently, with a 71% increase in value over the past week according to CoinGecko.\n\n\n","create_date":"2023-01-08T16:30:25+00:00","tag":"","author":"Arba Halpin"},
{"url":"https://en.ethereumworldnews.com/alchemix-curve-exploiter-return-4keth/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The Alchemix/CurveFinance Exploiter returned nearly $9 million in funds drained from the DeFi protocol following on-chain negotiations spotted via Etherscan","title":"Alchemix Curve Exploiter Returns $9 Million In ETH - Ethereum World News","content":" The Alchemix/CurveFinance Exploiter returned nearly $9 million in funds drained from the DeFi protocol following on-chain negotiations spotted via Etherscan on Friday.\nAlchemix Finance received a blockchain transaction note asking the protocol to confirm its wallet address. The exploiter then transferred 4,820 ether over three transactions to Alchemix’s multi-sig wallet. At current prices, the assets are worth $8.9 million.\nFriday’s transaction represents a portion of around $61 million drained from decentralized exchange Curve Finance. The attacker reportedly exploited a code bug in Vyper’s compiler, a smart contract programming language used by Curve across its platform.\nThe code bug allowed malicious attackers to drain liquidity pools affecting Metronome, Alchemix, and JPEGd. So far, exploiters have returned some of the looted assets to Alchemix and JPEGd.\nCurve, Metronome, and Alchemix previously asked the exploiters to return 90% of the drained funds for a 10% bounty in return. CRV gained 5% in price on Friday following news of Alchemix’s recovery.\nCRV, Curve native token and a cryptocurrency widely used across Ethereum’s DeFi lending ecosystem dipped in price following exploits on the exchange’s in-house pools.\nThe drop in CRV’s price spelled danger for loans taken by founder Michael Egorov. Egorov deposited million of CRV tokens as collateral on DeFi lending protocols like Aave and Fraxlend. These loans risked liquidation if CRV’s price fell below $0.30.\nIn response to the CRV’s declining price amid last weekend’s exploit, Egorov spurred a deluge of over-the-counter (OTC) deals with some 13 investors including Tron founder Justin Sun.\nEgorov’s CRV sales from OTC trades total 106 million CRV tokens and he received $42 million USDT in return. This liquidity has seemingly gone into balancing debts on Aave and other lenders amid concerns of a DeFi implosion.\nDeFi analyst Ignas opined that a CRV nosedive looked unlikely due to an increase in Curve’s 3Crypto pool featuring crvUSD+ETH+CRV.\nSeems like CRV will survive. If the Curve hacker dumped all stolen $CRV, the price would drop to $0.41, well above Aave's liquidation price of $0.29. It's mostly thanks to the Curve 3Crypto pool of crvUSD+ETH+CRV, which increased from $2.4M to $3.9M in a day. Liquidity is… pic.twitter.com/QeLaiH1g8J\n","create_date":"2023-08-04T16:31:15+01:00","tag":"","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/binances-market-share-down-by-10-in-2023/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance has lost more than 10% of its spot market share in 2023. Meanwhile Binance US' market share has slipped below 1%. The recent regulatory crackdown and lawsuits by the CFTC and SEC have been blamed for the tanking market share.","title":"Binance’s Market Share Down By Double Digits In 2023 - Ethereum World News","content":" The crypto market share of the largest crypto exchange in the world has gone down by double digits since the beginning of 2023. Binance’s market share has taken a hit from recent regulatory crackdowns and the lawsuit filed by the U.S. Securities and Exchange Commission last month. Meanwhile, the crypto exchange’s American arm has also lost a significant share of the crypto market.\nAccording to a report by crypto analytics firm Kaiko, Binance’s market share of spot volumes has dropped from 64% to 53% since January 2023. The regulatory crackdown, as well as legal trouble associated with the SEC and the CFTC, has led to the shedding of more than 10% of the crypto giant’s market share. Rival crypto exchanges, including Bybit and OKX, have benefitted from Binance’s woes by soaking up the market share lost by the crypto giant.\nMeanwhile, Binance US’s market share slipped below 1% in the second quarter of 2023. The international exchange’s derivatives volume has also taken a hit this year. Following the lawsuit by CFTC, the exchange’s perpetual market share dropped from 66% to 56%. Kaiko reported that American crypto giant Coinbase also suffered a similar fate with its market share going from 8% to 5.4%.\nDespite the sinking market share and mounting regulatory and legal trouble, Binance CEO Changpeng Zhao remains optimistic about the future of his crypto exchange. In a recent ask-me-anything session hosted on Twitter, Zhao stated that the trading platform is undergoing a lot of preparation in order to ready the systems to sustain higher crypto trading volumes. Citing historical patterns, Zhao stated that he was expecting increased trading activity in the next 6 to 18 months.\n","create_date":"2023-07-05T22:11:23+01:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/binance-bitcoin-reserves-collateralized/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"An audit on Binance’s Bitcoin (BTC) reserves confirmed that the crypto exchange held fully collateralized assets. Mazars, a global financial advisory firm,","title":"Binance Bitcoin Reserves 101% Collateralized Says Mazars Audit - Ethereum World News","content":" Summary:\nAn audit on Binance’s Bitcoin (BTC) reserves confirmed that the crypto exchange held fully collateralized assets. Mazars, a global financial advisory firm, conducted the audit after taking a snapshot of the exchange’s BTC holdings on November 22. The snapshot covered Binance’s Bitcoin holdings across several blockchain networks.\nAccording to Mazars, the platform’s BTC reserves were overcollateralized at a 101% ratio. The auditor reported full collaboration after verifying the company’s proof-of-reserves and proof-of-liabilities. Mazars audit also included customer assets, per details from the report.\nAt the time of assessment, Mazars observed Binance controlled in-scope assets in excess of 100% of their total platform liabilities,” said Mazars in an announcement. The exact percentage was 101%.\nAs of November 3, 2022, on-chain data showed that the leading crypto exchange boasted the single largest BTC wallet with around 252,597 Bitcoin. The wallet held an estimated $5 billion in crypto, around 1.3% of BTC’s circulating supply.\nNotably, Kucoin also hired Mazars to verify its reserves in line with the trend among crypto exchanges. Mazars’ audit on Kucoin was not published at press time. Sam Bankman-Fried invested in Kucoin via FTX.\nAs the People's Exchange, we place the safety and security of users' funds as our top priority. And so, we are proud to announce that #KuCoin has partnered with Mazars, a leading international audit, tax and advisory firm to increase transparency!\nThird-party audits like these have become almost mandatory for crypto exchanges in particular following the FTX debacle. Sam Bankman-Fried’s exchange and his trading outfit Alameda allegedly defrauded users of their assets and filed for bankruptcy after incriminating evidence was leaked to the public.\nThe resulting fallout incentivized other centralized trading platforms like Binance, Kucoin, and Kraken to publish proof of their reserves, showing customer assets as well as liabilities. On-chain data aggregators like CoinMarketCap and Nansen also launched dashboards where users can view exchange reserves for themselves.\nNot every crypto exchange had published proof-of-reserves, proof-of-liabilities, and third-party audits. However, Binance and Kraken were quick to act in the wake of FTX’s crash. Users also pointed out that reserve audits and reports should be published regularly by exchanges and companies.\n\n","create_date":"2022-12-07T16:13:34+00:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/binances-cz-dispels-fud-around-exits/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Chief executive officer of crypto exchange Binance, Changpeng Zhao, rebuffed reports that senior leadership exits are a sign that the company is about to","title":"Binance’s CZ Dispels “FUD” Around Leadership Departures - Ethereum World News","content":" Summary:\nChief executive officer of crypto exchange Binance, Changpeng Zhao, rebuffed reports that senior leadership exits are a sign that the company is about to crumble like former rival FTX. Zhao tweeted that the news surrounding these exits is “FUD”.\n4. More FUD about some departures. Yes, there is turnover (at every company). But the reasons dreamed up by the “news” are completely wrong. As an organization that has grown from 30 to 8000 people in 6 years, from 0 to the world’s largest crypto exchange in less than 5 months…\nOn Thursday, Fortune and EthereumWorldNews reported that senior executives at Binance informed CZ of their decision to leave the company. Zhao’s response to lawsuits from the U.S. Department of Justice was named as the primary reason why these company leaders are exiting.\nChief strategy officer Patrick Hillmann, senior vice president for compliance Steven Christie, and general counsel Han Ng are among the executives that are leaving Binance. While Hillmann and his colleagues confirmed their individual exits, they noted that the reasons are not connected to any supposed turbulence at the company or the legal issues with the DOJ.\nApologies for any typos, but I was not expecting to be tweeting about this today. It’s true that I am leaving @Binance, but I’m doing so on good terms. I continue to respect and support @cz_binance and am grateful for having had the incredible opportunity to work under his…\nThe exits come at a time when the SEC and DOJ are lodging accusations against crypto’s largest centralized exchange. Last month, the Securities and Exchange Commission sued CZ for operating an unregistered securities exchange on American soil.\nZhao was also accused of knowingly commingling customer and corporate funds through several private entities like Merit Peak.\nReports claim that criminal charges from the U.S. Justice Department are imminent following a lawsuit from the SEC.\nThe company also faces regulatory hurdles in Europe particularly in Australia and France. French authorities raided the Binance office in Paris on suspicions of “aggravated money laundering”. Australia’s securities regulators pulled back its derivatives license and opened a “targetted review” of client classification at the exchange.\n","create_date":"2023-07-07T12:37:38+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/bitcoins-btc-biggest-test-will-be-a-coronavirus-induced-recession/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The first block of the Bitcoin network was mined in January 2009; only three months after the collapse of the Lehman Brothers and the Federal Government","title":"Bitcoin's (BTC) Ultimate Test Will be A Coronavirus Induced Recession - Ethereum World News","content":" In brief:\nNews of the Coronavirus outbreak first hit the media outlets in late December 2019 and was believed to be confined to Wuhan in China. However, due to its infectious nature and modern travel logistics, the Virus has been confirmed in 104 countries and territories. There are a total of 109,000 confirmed cases at the time of writing this. Majority of the global economic powerhouses have not been spared by the rapid spread of the disease. Cases have been confirmed in the United States, Japan, UK, Singapore, S. Korea, France, Germany and China where the virus was first detected.\nThe rapid spread of the disease has had a negative impact on the economies of the aforementioned countries by disrupting manufacturing and supply chain activites, stretching healthcare services and creating a general panic amongst investors and consumers. A recent report by Bloomberg has postulated that the longest-running bull market in US history might be coming to an end thanks to COVID-19. The report goes on to explain that February 2020 might just be the peak of the 128 month-long economic expansion that began in June 2009.\nThe first block of the Bitcoin network was mined in January 2009; only three months after the collapse of the Lehman Brothers and the Federal Government taking over Fannie Mae and Freddie Mac. This means BTC has never been tested by a complete period of financial uncertainty such as the one witnessed between 2007 and 2008.\nRead also: If This Happens, There’s a High Chance Bitcoin Bottomed at $8,200: Analyst\nWith the Dow and S&P 500 continually dropping with every confirmed case of the Coronavirus, the next few weeks and months will be BTC’s ultimate test. Many crypto traders and investors believe that Bitcoin will prove its worth as a store-of-value as witnessed during the Iran/US tensions earlier this year. Their analysis is further boosted by the pending Bitcoin halving event that is less than two months away. However, BTC has continued to perform like a risk asset. It continues to fall with the prospects of a recession on the horizon. Bitcoin analyst @MagicPoopCannon is of the latter opinion and concludes that BTC will not perform well if the current stock market atmosphere prevails. He made these comments via the following tweet:\nI will say this though, if stocks keep getting demolished like this, I would be very suspicious of a crypto recovery. Crypto is a risk on trade, and it isn't likely to perform well when Wall St is freaking out and trying to escape risk.\n— MAGIC (@MagicPoopCannon) March 5, 2020\n\nWill Bitcoin prove itself as a store of value or continue to react as a risk asset? Please let us know in the comment section below.\n(Image courtesy of Unsplash.com)\n","create_date":"2020-03-08T22:44:18+00:00","tag":"Bitcoin (BTC) General News","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/opensea-executive-3-month-insider-trading/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Former OpenSea executive Nathaniel Chastain has received a 3 month sentence in the NFT insider trading case.","title":"Former OpenSea Executive Sentenced To 3 Months In NFT Insider Trading - Ethereum World News","content":" A former OpenSea executive has been sentenced to three months in prison for perpetrating the first-ever insider trading scheme involving NFTs. Nathaniel Chastain, who worked as the Head of Product for the NFT marketplace, was found guilty of fraud and money laundering by a federal grand jury earlier this year. The former executive was convicted less than two weeks after his trial began in April this year.\nAccording to a press release by the U.S. Attorney’s Office for the Southern District of New York, Nathaniel Chastain’s three-month-long prison term will be followed by another three months of home confinement. The former OpenSea executive will then face three years of supervised release.\nToday’s sentence should serve as a warning to other corporate insiders that insider trading – in any marketplace – will not be tolerated.”\nFederal prosecutors sought a two-year sentence for Chastain, citing a similar insider trading case involving a Coinbase manager who was sentenced earlier this year. However, the judge overseeing the ex-OpenSea executive’s case gave a lenient sentence, stating that he was a first-time offender and the proceeds from his NFT insider trading were considerably less than the Coinbase case.\nChastain was indicted by federal prosecutors in June last year. He was accused of abusing his position at OpenSea to buy NFTs that were set to be featured on the marketplace’s homepage. The former executive made more than $50,000 between June 2021 and September 2021 through his insider trading scheme.\nChastain reportedly used multiple wallets to route his funds and cover his tracks. After the former OpenSea executive was formally charged, his lawyers entered a not-guilty plea and later argued that no one told him that he couldn’t use or share the insider information in question.\n","create_date":"2023-08-22T23:52:39+01:00","tag":"coinbase","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ethereum-gas-fees-1-year-high-memecoin/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Gas fees on Ethereum hit their highest point since 2022 amid a Pepe-led memecoin revival.","title":"Ethereum Gas Fees Hit 1-Year High Amid Memecoin Renaissance - Ethereum World News","content":" Summary:\nGas fees on Ethereum flew to their highest level since 2022 in the middle of a memecoin renaissance championed by the “Pepe the frog” themed altcoin, PEPE.\nThe cost of sending transactions rose as high as $15 on May 4, its highest point in over a year. Gas fees had previously stayed at lower levels in the months after Terra crashed and the crypto markets nosedived.\nEthereum’s ecosystem is no stranger to memecoin mania as tokens like Dogecoin and Shiba Inu have drawn speculative traders before. It’s unclear whether the PEPE token will last as long as these OG memecoins after hitting a $1 billion market cap, a topic that Binance weighed in on after listing PEPE for spot trading today.\nBinance paused PEPE deposits shortly after citing technical difficulties.\n#Binance has postponed the listing of $FLOKI and $PEPE until May 5, 2023, 18:00 UTC. Trading will start at 18:00 UTC, as opposed to the original start time of May 5, 16:00 UTC. Please note that deposits for both PEPE and FLOKI will resume at 15:30 UTC.https://t.co/pJieemoTyP\nThere are also indicators pointing to PEPE as the reason behind Ethereum’s pricey gas fees. PEPE holders traded $150 million in volume over the past 24 hours on the decentralized exchange Uniswap.\nIncreased interest in PEPE pushed the token into the top 100 cryptocurrencies by market cap. The token sits at #42 according to CoinMarketCap. Nansen data clocked several copycat tokens and increased trading activity tied to other memecoins on ETH’s chain.\nLayer 2 networks designed to reduce transaction costs experienced high gas fees as network demand shot up. Fees on layer 2 scaling solutions built using zero-knowledge proofs like Polygon zkEVM and zkSync Era were significantly higher than L2’s designed using optimistic rollups.\nPer L2 Fees data, the cost of a single transaction on zk rollups ranged between $2 to $11, rising as high as $30.\n$30 gas fee on Layer 2 $ZKS $ZKSYNC @zksync I don't understand, I thought layer 2 were made to reduce gas fees 😱😱 pic.twitter.com/Uz6k5p4bC5\nUsers also flocked to Ethereum Virtual Machine-compatible chains like BNB Chain as memecoin mania continued.\n","create_date":"2023-05-05T15:24:41+01:00","tag":"Ethereum (ETH)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/curve-defi-first-responder-telegram-bot/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The working solution - a telegram bot - arrives amid multi-million rescue missions for Curve Finance, one of DeFi's largest exchanges which was recently","title":"Curve Incident Spurs DeFi First Responder Telegram Bot - SEAL 911 - Ethereum World News","content":" Paradigm research partner and head of security, Sam (@samczsun), unveiled a joint effort between auditors, security professionals, and white hat hackers aimed at providing assistance during crypto hacks.\nThe working solution – a telegram bot – arrives amid multi-million rescue missions for Curve Finance, one of DeFi’s largest exchanges which was recently exploited for $73.5 million in cryptocurrencies.\nAccording to Sam, SEAL 911 allows anyone to contact a professional from a pool of veteran security experts in emergency situations. The list includes experts from MetaMask, ConsenSys, Peckshield, Polygon, Origin Protocol, Wintermute, Paradigm, and Yearn to name a few.\nOver the past few days I’ve been working with a group of whitehats, auditors, and other security leaders to try and solve the hardest part of responsible disclosure: finding the right person to talk to.\nThe initiative hopes to provide vetted assistance during hacks, and potentially mitigate losses from decentralized finance protocols.\nDeFi’s community remains watchful even as Curve Finance recovers almost 75% of exploited liquidity. CRV’s price dropped along with TVL on Ethereum’s DeFi scene after attackers leveraged a reentrancy vulnerability to steal millions from crypto pools on Curve’s decentralized exchange.\nOver a week later, the DEX recovered $52.3 million out of $73.5 million stolen in late July/early August. CRV’s price also buoyed back to 60 cents after dropping to 49 cents following the exploit.\nCurve is offering 10% of the outstanding funds – worth $1.8 million – as a bounty in return for information about the exploiter.\n\n","create_date":"2023-08-08T13:34:40+01:00","tag":"","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/magnate-finance-rugs-millions-base/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The team behind Magnate Finance pulled off an exit scam, rugging users of millions in crypto previously locked on the platform.","title":"Magnate Finance Rugs $6.4 Million From Base Users - Ethereum World News","content":" The team behind Magnate Finance pulled off an exit scam, rugging users of millions in crypto previously locked on the platform.\nBlockchain security provider Peckshield said the team stole funds by manipulating a price oracle. Magnate’s TVL stood at $6.4 million before the rug pull, DeFiLlama data showed. The compromised price oracle allows the scammer to steal all user deposits.\nMagnate Finance launched as a decentralized finance lender on Base, the first blockchain released by an American publicly traded company.\n🚨🚨🚨The @MagnateFi just performed a rugpull (w/ ~$6.5m loss) by directly manipulating the price oracle. Here is the related hack tx: https://t.co/vjFFSNY27W https://t.co/APJjRZAsCK pic.twitter.com/CHhxGqul83\nBase users of the DeFi lending service MagnateFi were alerted to a possible exit scam early on Friday by on-chain Sleuth ZachXBT. The blockchain Sherlock pointed to links between Magnate’s deployer address and another exit scam from January 2023, Solfire. Per reports, Solfire users lost at least $4 million in crypto.\nAt the time of writing, the team has scrubbed their digital presence from social media networks like X (formerly Twitter) and Telegram. The Magnate Finance website is also unavailable.\nNot long after Zach again warned users of the exit scam, the team responded in Bizzare fashion. As tweeted by the on-chain sleuth, the team changed their X bio to “contract breached by Zach”. The exit scammer also replied to Zach’s thread with “We stick to the plan? 50-50?”.\nUpdate: They replied to this thread and changed their bio pic.twitter.com/mY6XPV5Ucg\nThe X account was subsequently deactivated and the team has made no public contact since then. Magnate Finance is the latest rug pull – the term assigned to crypto projects that steal user assets and disappear – to happen on Base and the broader DeFi ecosystem.\nBase also suffered nearly half a million dollars after SwirLend vanished with user funds earlier in August.\n","create_date":"2023-08-25T11:19:21+01:00","tag":"Base","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/binance-cz-vigorously-litigate-sec/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The U.S. Securities and Exchange Commission is suing Binance and its CEO Changpeng Zhao for breaking securities laws and commingling billions of customers","title":"Binance Prepared To “Vigorously” Litigate After SEC Lawsuit - Ethereum World News","content":" Summary:\nThe U.S. Securities and Exchange Commission is suing Binance and its CEO Changpeng Zhao for breaking securities laws and commingling billions of customers funds in a U.S. entity controlled by Zhao.\nPer the lawsuit, Binance and its executives knowingly operated an unlicensed securities exchange in the U.S. The court documents filed at a federal court reference a quote from a former Chief Compliance Officer who allegedly admittedly in December 2018 to running an illegal securities exchange on American soil – “we are operating as a fking unlicensed securities exchange in the USA bro”.\nThe SEC’s suit against Binance also raises concerns for the classification of crypto assets in the future. Indeed, the suit issued the securities label for a basket of cryptocurrencies including BNB, BUSD, SOL, ADA, MATIC, FIL, ATOM, SAND, MANA, ALGO, AXS, and COTI.\nThe news follows speculations that CEO Zhao otherwise known by his initials CZ could step down as CEO. Cryptocurrency prices slid on the back of the news with Bitcoin (BTC) and the total crypto market cap both down over 5% in a matter of hours. BTC dipped below $25,000 and tokens like SOL recorded double-digit losses at press time.\nCZ tweeted “4” shortly after the news broke, essentially calling the lawsuit FUD and said that the Binance team was maintaining steady operations for users. Nansen data showed over $69 million in net outflows following news about the SEC’s lawsuit.\nThe official response from Binance said the suit serves as an example of the SEC’s “misguided and conscious refusal to provide much-needed clarity and guidance to the digital asset industry.” Binance denied that user assets have ever been at risk and said the company is ready to “defend our platform vigorously. “\nToday’s action is another in a line of examples where, as with other crypto projects facing similar suits, the Commission has determined to regulate with the blunt weapons of enforcement and litigation rather than the thoughtful, nuanced approach demanded by this dynamic and complex technology. Unilaterally labeling certain tokens and services as securities – even ones over which other U.S. authorities have asserted jurisdiction – only compounds these problems.\nThe SEC’s filing shadows a lawsuit from the U.S. Commodity Futures Trading Commission alleging that Binance violated American derivatives laws. Several crypto entities like Coinbase and Kraken have also been the subject of enforcement action from U.S. regulators across federal and state lines.\nPrevious reports also suggest that more enforcement actions against Binance, CZ, and other crypto players could be on the way as U.S. regulators tighten the noose around crypto.\n","create_date":"2023-06-05T18:16:30+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/why-analysts-are-bullish-cryptocurrency-bitcoin-11/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Today is January 3rd, 2020. And if you know anything about the history of Bitcoin, you know that this means the world's first cryptocurrency and its","title":"Why Analysts Are Bullish On Cryptocurrency As Bitcoin Turns 11 - Ethereum World News","content":" Today is January 3rd, 2020. And if you know anything about the history of Bitcoin, you know that this means the world’s first cryptocurrency and its respective blockchain has turned 11 years ago, with this being the date that Satoshi Nakamoto, the pseudonymous coder-hacker behind the project, mined the Genesis Block of Bitcoin.\nIn it, the creator encoded a headline regarding the Great Recession of 2008, cementing the idea that he launched the project to counteract banks and governments in the minds of many.\nHappy Birthday Bitcoin!\n— Andreas (BEWARE of giveaway scams!) (@aantonop) January 3, 2020\n\nSince then, Bitcoin has seemingly been on an unstoppable rise, with the price of the asset, which many say is the best measure of its success, rising by literal millions of percent, making it the best-performing asset, well, ever. That’s not to mention that the cryptocurrency has accomplished this all in a decade’s time, effectively irrelevant on a macro scale.\nThe project has also been successful on a transactional basis. Cryptocurrency research firm TradeBlock found that the cryptocurrency “has had a record 2019 with transaction count, transaction volume (USD equivalent basis), and hash rate reaching new all-time highs this past year.”\n#Bitcoin has had a record 2019 with transaction count, transaction volume (USD equivalent basis), and hash rate reaching new all time highs this past year. pic.twitter.com/hSGXyeq4JR\n— TradeBlock (@TradeBlock) December 26, 2019\n\nAll this has made some of the world’s most prominent people talk about it.\nIn February, Elon Musk — co-founder of PayPal, chief executive of SpaceX and Tesla, founder of the Boring Company, among other titles — said in a podcast that the cryptocurrency has an underlying structure that is “quite brilliant,” adding that he thinks maybe Ethereum and “maybe some of the others” might have technological merit. The renowned technologist concluded by stating that he thinks “without a doubt” that crypto is a “far better way to transfer value than pieces of paper.”\nWhile Bitcoin has done absolutely stellar in its 11-or-so years in existence as laid out earlier in this article, analysts and industry executives are optimistic that the following decade for the leading cryptocurrency and its ilk will just not good, if not better.\nAndy Bromberg told Bloomberg that “we are seeing a level of building that has happened in 2019 [which makes it feel like] we’re in the moment of everyone is putting on their jumpsuits, ready to take off.” Bromberg added we’re seeing crypto-related innovation hasn’t been seen since 2017, boding well for prices in the future.\nAnd Changpeng “CZ” Zhao, the prominent chief executive behind crypto’s top firm, Binance, was recently quoted as saying that he thinks that the long-term trajectory for the Bitcoin and crypto market remains decidedly positive:\n“Bitcoin is still a small market cap instrument so there will be high volatility in the short term. However, if you look at the fundamental technology, the longer-term view, about a 5-year or 10-year horizon, we’re very confident that bitcoin and cryptocurrencies are here to stay.”\n","create_date":"2020-01-03T21:58:23+00:00","tag":"bitcoin","author":"Nick Chong"},
{"url":"https://en.ethereumworldnews.com/blackrock-coinbase-crypto-investment/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"BlackRock, one of the world’s largest asset managers, has signed a deal to offer crypto investment exposure to institutional investors amid an ongoing bear","title":"BlackRock And Coinbase Team Up For Institutional Crypto Investment Offering Amid Bear Market - Ethereum World News","content":" Summary:\nBlackRock, one of the world’s largest asset managers, has signed a deal to offer crypto investment exposure to institutional investors amid an ongoing bear market where tokens like Bitcoin and Ethereum remain more than 50% from their all-time highs.\nThe asset management behemoth with over $10 trillion in assets under management (AUM) now has a partnership with Coinbase, a leading cryptocurrency exchange company based in San Francisco.\nBlackRock’s agreement with Coinbase will power cryptocurrency investment facilities for institutional investors through Coinbase prime. The service provides a secure custodial platform and advanced trading tools to over 13,000 institutional customers.\n.@BlackRock’s Aladdin clients now have direct access to crypto markets through Coinbase Prime. Read more about our partnership and mission to support growing institutional interest in digital assets. https://t.co/sxAJiXjkOm\nThe deal between both entities is set to kit BlackRock’s Aladin clients with direct access to cryptocurrencies. Thursday’s announcement mentioned Bitcoin as the asset customers would be exposed to.\nThis connectivity with Aladdin will allow clients to manage their bitcoin exposures directly in their existing portfolio management and trading workflows for a whole portfolio view of risk across asset classes.\nBlackRock CEO Larry Fink previously hinted in March 2022 that the asset management powerhouse could explore crypto trading. Fink noted at the time that demand for crypto exposure was growing rapidly.\nGlobal Head of Strategic Ecosystem Partnerships, Joseph Chalom, echoed similar remarks on the growing institutional appetite for digital assets.\nOur institutional clients are increasingly interested in gaining exposure to digital asset markets and are focused on how to efficiently manage the operational lifecycle of these assets.\nNotably, the news comes as crypto asset prices have experienced a drop in value and bears seem to have control over the market.\n","create_date":"2022-08-04T14:34:35+01:00","tag":"Bitcoin (BTC)","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/binance-under-investigation-in-france/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"According to Le Monde citing word from the Paris public prosecutors office, Binance is under investigation for illegally providing French investors with","title":"Binance Under Investigation In France, Company Exits Dutch Market After Cyprus Decision: Report - Ethereum World News","content":" Summary:\nAccording to Le Monde citing word from the Paris public prosecutors office, Binance is under investigation for illegally providing French investors with digital asset trading facilities and also supporting “acts of aggravated money laundering”.\nFrench authorities allege that the company offered these services to French customers through its local division and regulators have been investigating suspicions since February 2022. The local publication reported that documents and records seized will be analyzed for evidence as regulators build their case against crypto’s largest centralized exchange.\nIn other related news, the crypto exchange is pulling out of the Dutch market after failing to secure a crypto license and comply with the Netherlands’ anti-money laundering (AML) policies.\nBinance’s exit from the Netherlands comes shortly after the company announced plans to shut down its division in Cyprus. This decision was reportedly taken as a strategic move to comply with MiCA, the landmark crypto rule recently signed into law by EU policymakers.\nFriday’s developments about exiting the Dutch markets and investigations in France have emerged amid intense regulatory scrutiny in America.\nThe U.S. Securities and Exchange Commission sued Binance and CEO Changpeng Zhao for breaking securities law, commingling customers’ funds in a private entity, and denying investors of proper protection through necessary disclosure.\nBinance US, the company’s American affiliate, has seen its market share shrink to 1% following the news, per Kaiko data. The U.S. trading arm also announced staff cuts as it prepares for a lengthy and expensive litigation process with the SEC.\nCoinbase, another major crypto exchange and the largest digital asset trading venue in America was also sued by the SEC for similar rule-breaking.\nBoth firms have denied the allegations and promised to fight the SEC in court, claiming that the regulator has failed to provide clear rules or offer a path for registration.\n","create_date":"2023-06-16T12:51:06+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/google-play-supports-nfts-in-apps-games/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Google has updated its play store policy to enable native support for tokenized digital assets like NFTs in apps and games.","title":"Google Play Enables Support For NFTs In Apps & Games - Ethereum World News","content":" Google has rolled out native support for tokenized digital assets like non-fungible tokens for apps and games on its play store. In a major policy overhaul, the tech giant will allow developers to offer games and apps that would allow users to buy and sell or earn tokenized assets. Google’s change in stance towards NFTs came as a positive sign for investors, artists, and other stakeholders in the space.\nGoogle stated in a recent blog post that the decision to update the policy on tokenized digital assets was taken in order to support developers that wanted to offer a creative and immersive in-app experience to users. Google Play’s policy was accordingly updated to allow the transaction of blockchain-based assets within the applications and games. The move is expected to boost user loyalty via NFT rewards and reimagine traditional games with unique user-owned content.\nInterestingly, social networking giant Reddit and game developer Mythical Games lent a helping hand to Google to overhaul the policy on NFTs in order to offer transparent and responsible engagement with blockchain-based digital content. The companies collaborated to set clear guidelines to promote the safe usage of blockchain technology.\nWe think these new policies are steps forward for both players and developers alike and will positively impact the adoption of new technology while also protecting consumers.”\nJoseph Mills, a product manager at Google Play, stated that developers who decide to incorporate tokenized digital assets like NFTs on their apps and games would be required to declare the blockchain elements. Furthermore, Google Play will not allow NFT-enabled apps and games that include trading or gambling activities.\n","create_date":"2023-07-13T03:41:09+01:00","tag":"Digital Assets","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ex-central-bank-leader-bitcoin-not-real-currency/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"The Bitcoin (BTC) FUD train has continued to chug along. This time, the European Central Bank's former president Jean-Claude Trichet has cast doubt on","title":"Ex-Central Bank Leader Bashes Bitcoin as a \"Not Real\" Currency - Ethereum World News","content":" The Bitcoin (BTC) FUD train has continued to chug along. This time, the European Central Bank’s former president Jean-Claude Trichet has cast doubt on cryptocurrencies, bashing assets that many say have the potential to usurp the system he used to work for.\nSpeaking at Caixin’s 10th annual conference in Beijing, Trichet asserted that he is “strongly against Bitcoin,” adding that society is a “little complacent” in believing that cryptocurrencies have substance. “The [crypto]currency itself is not real, with the characteristics that a currency must have,” he asserted, echoing the sentiment pushed by billionaire investor Warren Buffet and others.\nHe added that buying cryptocurrencies is often a more of “pure speculation,” before quipping that the speculative nature of this market “is not healthy.”\nWhile this incumbent of traditional finance is bashing Bitcoin as a non-currency, the underlying need for the cryptocurrency is seemingly bigger than ever.\nThis week, Ray Dalio, the founder of Bridgewater Associates, released his latest views on the macro environment on LinkedIn. While Dalio has undoubtedly benefited from the growth of the traditional economy, he sees holes in it.\nThese include but aren’t limited to extremely low, and even negative interest rates for the creditworthy, large government deficits that he believes are almost certain to “increase substantially,” the impending collapse of “sound finance” in “reserve currency countries and their currencies,” massive liabilities in pensions, and a growing wealth gap. Dalio remarked that all these factors have led him to believe that the “system of making capitalism work well for most people is broken.”\nMy below piece “The World Has Gone Mad and the System is Broken” explains some of the crazy things that are happening, why they are happening and why I believe that they are unsustainable. I’d be interested in knowing what you think about them. https://t.co/daUdsw0XLy\n— Ray Dalio (@RayDalio) November 5, 2019\n\nSo, what’s the solution? Bitcoin, according to some industry executives anyway.\nThe libertarian chief executive of ShapeShift, Erik Voorhees, wrote that Dalio’s comments only show the need for something like Bitcoin. Voorhees cited one facet of the post, in which Dalio stated that the collapse of the current system is likely to see governments try and “trap” the “rich capitalists,” who may attempt to move their capital and operations to places “in which the wealth gaps and conflicts [resulting from those gaps] are less severe.”\nThis, of course, would validate the need for an uncensorable, unseizable, decentralized, and non-sovereign money like Bitcoin.\nAlso, the Bridgewater founder’s assertion that “sound finance” will be thrown out the window, especially in countries like the U.S. and Japan, implies impending rampant inflation, which should aid the disinflationary Bitcoin.\n","create_date":"2019-11-10T23:41:39+00:00","tag":"bitcoin","author":"Nick Chong"},
{"url":"https://en.ethereumworldnews.com/ftx-creditor-list-binance-coinbase-openai/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX's lawyers recently filed a creditor list in the bankruptcy court. The list revealed the vast network of companies and individuals who are owed by the bankrupt crypto exchange.","title":"FTX’s Creditor List Includes Federal Agencies, Crypto Firms And Celebrities - Ethereum World News","content":" Lawyers of FTX recently filed a creditor matrix in the U.S. Bankruptcy Court for the District of Delaware. The filing contains the highly anticipated list of creditors that are owed money by the bankrupt crypto exchange. The 116-page long document revealed the names of celebrities, airlines, federal agencies, and fellow crypto firms, all creditors of Sam Bankman-Fried’s bankrupt crypto exchange.\nThe list was put together by Alvarez & Marsal North America, the financial advisory firm hired by FTX. The creditor list shows the lavish lifestyle that Sam Bankman-Fried and his firm’s management engaged in. Not only does it prove the reckless spending of the firm’s management, but it also provides an insight into the severity and the reach of the impact of the crypto exchange’s collapse.\nFirms from various sectors including hospitality, airlines, IT, entertainment, and news can be found on the list. This includes luxury resorts like Hyatt, tech giants like Google and Apple, sports companies like the Miami Heat and Mercedes AMG F1, and fellow crypto firms like Coinbase, Huobi, and Binance among others. Funnily enough, names like DoorDash and UberEats on the creditor list point to the exchange’s unpaid food bills.\nThe list also contains the names of regulatory agencies from around the world including Japan’s Financial Services Agency, Canada’s Ontario Securities Commission, and the U.S Securities and Exchange Commission. Within the U.S., FTX owes money to more than a dozen federal agencies spread across the country. Kevin O’Leary, Tom Brady, and Naomi Osaka are some of the celebrities that are owed by the exchange. The creditors also include Open AI, a popular artificial intelligence startup that was in the news recently following a partnership with Microsoft, another one of FTX’s creditors.\n","create_date":"2023-01-26T18:09:47+00:00","tag":"Binance","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/ftx-ceo-says-exchange-may-be-restarted/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"FTX CEO John Ray III has revealed that restarting the FTX exchange is on the table. Sam Bankman-Fried has welcomed the possibility of reviving the exchange.","title":"New FTX CEO Says Exchange May Be Restarted, $FTT Jumps 30% - Ethereum World News","content":" John Ray III, the current CEO of FTX, has hinted at the possibility of restarting FTX.com, the international crypto exchange that lies at the center of Sam Banklam-Fried’s failed crypto empire. Mr. Ray, who was brought in last November to clean up the mess made by SBF and his team, has spent the past two months salvaging assets from the exchange in a bid to secure some value for the exchange’s investors and customers.\nIn an interview with the Wall Street Journal, new CEO John Ray III revealed that he has set up a task force to explore the possibility of restarting FTX. The CEO acknowledged that rebooting the exchange may be feasible. Shutting it down and returning available assets to customers would be the other available option. If reviving the exchange leads to more recovery than the liquidation of assets, then the exchange will be restarted.\nEverything is on the table…If there is a path forward on that, then we will not only explore that, we’ll do it.”\nMr. Ray told WSJ that recovering assets was particularly difficult in this case because there was no centralized register that listed the company’s cash and investments. Gary Wang, the exchange’s co-founder, and Alameda Research’s Caroline Ellison initially helped to locate the exchange’s funds. Both executives have pleaded guilty and secured deals with prosecutors.\nSam Bankmain-Fried, who has maintained that filing for chapter 11 bankruptcy was a mistake, welcomed the possibility of restarting FTX. John Ray took issue with comments made by SBF since the bankruptcy, calling them “unhelpful and self-serving.”\nThe FTX Token ($FTT) has gone up more than 30% since the news of a possible revival of the exchange came out.\n","create_date":"2023-01-19T18:04:46+00:00","tag":"FTX Crypto Exchange","author":"Aditya Anand"},
{"url":"https://en.ethereumworldnews.com/blackrock-is-studying-cryptocurrencies/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Blackrock Inc. is reportedly studying the crypto sector broadly. According to a report by the Wall Street Journal, the asset management firm is exploring","title":"Blackrock Is Reportedly Studying Cryptocurrencies as Client Interest Increases - Ethereum World News","content":" Quick take:\nBlackrock Inc. is reportedly studying the crypto sector broadly. According to a report by the Wall Street Journal, the asset management firm is exploring different facets of the crypto industry that best benefits its customers.\nBlackrock’s CEO, Larry Fink, told the Wall Street Journal in a conference call early Wednesday that the firm was looking into digital assets, stablecoins, permissioned blockchains, and tokenization. He cited that the firm’s clients had increased their interest in these technologies and related investment products, thus the need for Blackrock to familiarize itself with them.\nNews of Blackrock Inc. studying the crypto sector comes almost two weeks after the firm’s CEO predicted that Russia’s invasion of Ukraine could accelerate central banks’ adoption of digital assets.\nMr. Fink predicted the accelerated adoption of digital assets in his annual letter to shareholders, where he stated the following.\n…a less discussed aspect of the war is its potential impact on accelerating digital currencies. The war will prompt countries to re-evaluate their currency dependencies. Even before the war, several governments were looking to play a more active role in digital currencies and define the regulatory frameworks under which they operate…\nA global digital payment system, thoughtfully designed, can enhance the settlement of international transactions while reducing the risk of money laundering and corruption. Digital currencies can also help bring down costs of cross-border payments…As we see increasing interest from our clients, BlackRock is studying digital currencies, stablecoins and the underlying technologies to understand how they can help us serve our clients.\nFounded in 1988 and based in New York City, Blackrock Inc. is an American multinational investment management corporation. According to Wikipedia, Blackrock Inc. is the largest asset manager with $10 trillion in assets under management. The firm has offices in 36 countries and provides financial services to individuals, families, financial advisors, educational and nonprofit organizations, pension plans, insurance companies, and governments.\n","create_date":"2022-04-13T19:23:14+01:00","tag":"Bitcoin (BTC)","author":"John P. Njui"},
{"url":"https://en.ethereumworldnews.com/binance-invests-5-million-curve-daos-crv/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance Labs, the crypto exchange's venture capitalist and incubator arm, plans to invest $5 million in CRV, Curve DAO's token and a widely used crypto in","title":"Binance Labs To Invest $5 Million In Curve DAO Token CRV - Ethereum World News","content":" Binance Labs, the crypto exchange’s venture capitalist and incubator arm, plans to invest $5 million in CRV, Curve DAO’s token and a widely used crypto in Ethereum’s decentralized finance ecosystem. CRV will also deploy on BNB Chain as part of the agreement.\nWith $2.4 billion in total value locked (TVL) per DeFiLlama, Curve is comfortably DeFi’S second-largest exchange and the largest stableswap platform for decentralized participants. Binance said the commitment to CRV directly helps to shape DeFi’s future and propel growth within the industry, added Co-Founder of Binance and Head of Binance Labs Yi He.\nCurve is the largest stableswap, and as a key protocol in DeFi it has contributed to the steady growth of the space in 2023. Given the recent events that have impacted the protocol, Binance Labs has offered our full support to Curve through our investment and strategic collaboration.\nNearly two weeks after a reentrancy exploit, Curve Finance has recovered roughly three-quarters of ~ $70 million drained from liquidity pools on the platform. Affected protocols like Alchemix either had the stolen funds returned by exploiters or recovered by white hat hackers.\nCurve Finance is yet to recover assets from the CRV/ETH pools at the time of writing. The protocol put out a bounty of $1.8 million, around 10% of the outstanding funds, for any information on the exploiters’ identity.\nThe incident also galvanized a collaborative initiative comprised of white hat hackers, auditors, and security experts. SEAL 911, a telegram chatbot announced by Paradigm head of security Sam (@samczsun) connects any user to a pool of vetted professionals offering assistance in emergency cases like the hacks on CRV pools and Euler.\n","create_date":"2023-08-10T16:25:31+01:00","tag":"Binance","author":"Naga Avan-Nomayo"},
{"url":"https://en.ethereumworldnews.com/billions-transfered-binance-ftxs-collapse/","web_url":"https://en.ethereumworldnews.com/","type":"article","description":"Binance has moved around several billion since the collapse of FTX. The latest transfer, worth $2 billion came earlier today.","title":"Binance Makes Multi-Billion Dollar Transfers Following FTX’s Collapse - Ethereum World News","content":" The downfall of FTX has paved the way for the world’s largest crypto exchange to cement its position as the most popular exchange. Binance has been actively involved in the aftermath of FTX’s collapse, from indirectly triggering the bank run on the Bahamas-based exchange, to leading the way in establishing greater transparency in the industry by publishing proof of reserves.\nBlockchain intelligence firm Arkham Intelligence published a Twitter thread that took a closer look at the billions of dollars that Binance has moved around over the past few days. The report was prompted after on-chain whale watchers alerted crypto Twitter about a massive transfer by the exchange that involved 127,351 BTC worth a little over $2 billion.\nThe transfer was seen as a bad sign by many on Twitter given the current crypto climate. Binance had recently published its proof of reserve (PoR) and users on Twitter speculated that the transfer was actually the exchange reversing funds upon completion of the PoR. CEO Changpeng soon clarified that the massive transaction was in fact part of the PoR, but not how it was being perceived.\n“The auditor require us to send a specific amount to ourselves to show we control the wallet. And the rest goes to a Change Address, which is a new address. In this case, the Input tx is big, and so is the Change.” CZ tweeted.\nBinance previously published its PoR, but some still remain skeptical because the exchange has not provided any details about its liabilities, in addition to there being no evident segregation between its own assets and customers’ funds.\nArkham Intelligence also shed light on some of Binance’s other recent transfers. For instance, the $1 billion BUSD transfer by the exchange which was supposedly for the Industry Recovery Fund launched by CZ. Binance also received close to $1 billion from Tether as part of its chain swap from Solana to Ethereum.\n","create_date":"2022-11-28T19:08:21+00:00","tag":"bitcoin","author":"Aditya Anand"}
]