[{"url":"https://cryptocurrencynews.com/bitcoin-etfs-slow-blackrocks-ibit-streak-ends-fidelity-sees-outflows/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"This week witnessed a notable shift in the momentum of two of the most successful exchange-traded fund launches in history. BlackRock's (NYSE:BLK)spot Bitcoin","title":"Bitcoin ETFs Slow: BlackRock's IBIT Streak Ends, Fidelity Sees Outflows - CryptoCurrencyNews","content":" This week witnessed a notable shift in the momentum of two of the most successful exchange-traded fund launches in history. BlackRock’s (NYSE:BLK)spot Bitcoin ETF, IBIT, renowned for its remarkable performance, experienced zero inflows on Wednesday and Thursday, marking the end of its 71-day streak of fresh investments totaling approximately $17.24 billion in assets under management since its trading approval on January 11. Additionally, Fidelity’s FBTC, the current runner-up in the ETF race, reported losses of $22.6 million on Thursday, marking its first reported outflow and reducing its assets under management to around $9.9 billion, according to CoinGlass data.\nThe waning interest in the leading Bitcoin ETFs, excluding Grayscale’s GBTC, serves as a significant indicator of the cryptocurrency market’s recent cooling and suggests that the initial ETF frenzy, which propelled Bitcoin to new heights, has subsided. With Bitcoin currently trading around $63,500, down approximately 12% from its all-time high of $73,000 in March, only one of the 10 trading spot Bitcoin ETFs, Franklin Templeton’s EZBC, reported inflows on Thursday.\nDisappointing inflation data has tempered hopes for Federal Reserve interest rate cuts, and the prospect of higher borrowing costs typically diminishes the market’s appetite for riskier, more volatile investments like crypto. Meanwhile, Bitcoin has remained relatively stagnant since early March, partly reflecting ETF stagnation and the anticipation surrounding the network’s recent “halving” event on April 19, as investors adhered to the “buy the rumor, sell the news” strategy, liquidating their holdings.\nNate Geraci, president of the ETF Store, noted that ETF flows often mirror the performance of the underlying asset, suggesting that a pause in Bitcoin’s price may lead to a temporary hiatus in inflows. However, Geraci emphasized that these products are still in the early stages of adoption, with many large institutions yet to permit their brokers to solicit purchases of spot Bitcoin ETFs, and registered investment advisors cautiously entering the category.\nDespite the recent slowdown, these funds are widely regarded as a resounding success, accumulating over $54 billion in assets in just over three months of trading, thereby integrating Bitcoin-tracked assets into the portfolios of millions of mainstream investors.\nHighlighting their success, Hong Kong’s Securities and Futures Commission recently granted approvals for three spot Bitcoin and Ether ETFs, set to commence trading on Tuesday, with additional countries expected to follow suit. Issuer Harvest is waiving a management fee for its funds, sparking expectations of a fee war akin to the heated competition in the U.S., where Grayscale introduced a Bitcoin Mini Trust with ultra-low fees of 0.15% in an effort to capture some of the outflows from GBTC, which charges 1.5%.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-26T20:23:51+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoins-abrupt-decline-is-pulling-down-cryptocurrency-stocks-such-as-coinbase-and-even-tesla/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin's recent plunge has had a ripple effect, dragging down major crypto-related stocks, including Tesla and Coinbase. The cryptocurrency saw a sharp 7%","title":"Bitcoin's abrupt decline is pulling down crypto stocks such as Coinbase — and even Tesla - CryptoCurrencyNews","content":" Bitcoin’s recent plunge has had a ripple effect, dragging down major crypto-related stocks, including Tesla and Coinbase. The cryptocurrency saw a sharp 7% decline in its price, tumbling from $73,000 to around $63,000 in just under a week. This downward trend was exacerbated by a record daily outflow of $642.5 million from Grayscale’s spot Bitcoin ETF, GBTC, on Monday.\nMicroStrategy, a software company known for its Bitcoin maximalist stance, also took a hit, experiencing a nearly 7.5% loss and trading at $1,384 at the time of writing. The company recently completed another convertible note offering to boost its Bitcoin holdings, selling $604 million in notes to purchase 9,000 bitcoin. This move is part of MicroStrategy’s aggressive Bitcoin buying strategy, with the company now owning 214,246 bitcoin, which represents 1% of the total Bitcoin supply.\nTesla, another prominent player in the crypto space, saw its stock price plummet by 60% from its all-time high, currently trading at $171 with a 1.2% decrease in a day. The stock’s volatility was fueled by an interview in which Tesla CEO Elon Musk was questioned about his alleged drug use, following a story published by The Wall Street Journal. Despite the decline, Tesla holds over 10,500 bitcoin, valued at $336 million.\nCoinbase, the largest publicly traded crypto exchange, also faced a 3% decline, trading at $230 at the time of writing. The drop in its price is directly linked to Bitcoin’s sharp decline.\nOther stocks in the crypto space experienced similar declines. Square, led by Jack Dorsey, saw a nearly 2% drop, hovering around $80. Robinhood, a crypto-friendly company, witnessed a 5% decline in its shares, which fell to $17. Riot Platforms, a crypto mining company, suffered a more than 2% loss, dropping to $11.\nDespite the recent downturn, experts remain optimistic about Bitcoin’s future, believing that it will soon recover and reach new heights.\nFeatured image: depositphotos © nevarpp\nDisclaimer\n","create_date":"2024-03-19T19:16:03+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/block-enables-square-merchants-to-convert-sales-to-bitcoin/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Block, the parent company of Square and Cash App, unveiled a new initiative today enabling merchants utilizing Square's services to convert a portion of their","title":"Block Enables Square Merchants to Convert Sales to Bitcoin - CryptoCurrencyNews","content":" Block, the parent company of Square and Cash App, unveiled a new initiative today enabling merchants utilizing Square’s services to convert a portion of their daily sales into Bitcoin.\nRolling out initially in the U.S., the feature allows Square sellers to transfer 1-10% of their daily sales to their personal Cash App accounts, where the amount will automatically convert into Bitcoin by the day’s end. Merchants will receive confirmation of the conversion once the transaction is finalized.\nThis bitcoin conversion feature will gradually become available to all sole proprietors or single-member LLCs in the coming months. Block will levy a 1% fee on every conversion made by the seller. Furthermore, merchants have the flexibility to send Bitcoin to other wallets or sell them at their convenience directly from their Cash App accounts.\nIn a statement, Block emphasized its belief that Bitcoin serves as a tool for economic empowerment, offering individuals, including business owners, access to a global monetary system. The company highlighted that many Square sellers have expressed interest in bitcoin, viewing it as a means for long-term savings and diversification of their business assets.\nWhen questioned about sellers’ conversion habits and average returns, Block stated that it had recently piloted the Bitcoin conversion feature with a select group of merchants and lacked definitive data on this aspect.\nBlock has prioritized simplifying the process of purchasing Bitcoin across its platforms. For instance, the company integrated its self-custodial wallet Bitkey with Cash App and Coinbase, facilitating seamless Bitcoin trading for users.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T20:27:11+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/coinbase-reports-outage-assures-safety-of-funds/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Coinbase, a prominent cryptocurrency exchange, is currently grappling with a system-wide outage, prompting concerns among users. The exchange has swiftly","title":"Coinbase Reports Outage, Assures Safety of Funds - CryptoCurrencyNews","content":" Coinbase, a prominent cryptocurrency exchange, is currently grappling with a system-wide outage, prompting concerns among users. The exchange has swiftly responded to the situation, assuring customers that their funds remain secure while its team diligently works on resolving the issue.\nIn a recent announcement, Coinbase acknowledged the outage and disclosed that its team is actively investigating the underlying cause. Despite the disruption, the exchange emphasized that users’ funds are safe, aiming to alleviate any potential concerns regarding the security of their assets.\nAs of now, accessing Coinbase’s website results in a “503 Service Temporarily Unavailable” alert, indicating the extent of the technical difficulties being faced by the platform.\nThis isn’t the first instance of technical challenges for Coinbase. In March, the exchange encountered similar issues, including disruptions to its trading platform during periods of heightened activity. Some users even reported inaccuracies in their account balances, further underscoring the importance of swift and transparent communication from the exchange during such incidents.\nWhile system-wide outages can be disruptive, Coinbase’s proactive response and assurance regarding the safety of users’ funds reflect its commitment to maintaining trust and transparency within the cryptocurrency community. As the exchange works to resolve the current issue, users can expect updates from Coinbase regarding the restoration of services and any further developments.\nFeatured Image- Megapixl\nPlease See Disclaimer\n","create_date":"2024-05-14T19:17:45+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/dogecoin-approaches-golden-cross-sign-of-a-surge/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Dogecoin (DOGE), the leading meme cryptocurrency by market capitalization, is showing signs of entering another bullish phase reminiscent of its spectacular","title":"Dogecoin Approaches 'Golden Cross': Sign of a Surge? - CryptoCurrencyNews","content":" Dogecoin (DOGE), the leading meme cryptocurrency by market capitalization, is showing signs of entering another bullish phase reminiscent of its spectacular rise in early 2021. According to CoinDesk, Dogecoin’s market cap currently stands at approximately $22 billion, with a remarkable year-to-date price increase of over 70%, significantly outstripping Bitcoin’s (BTC) near 50% gain.\nA critical technical indicator, the ‘golden cross’, is nearing confirmation for Dogecoin. This occurs when the 50-week simple moving average (SMA) crosses above the 200-week SMA, signaling potential long-term upward momentum. Such crossovers are often used by momentum traders to pinpoint optimal market entry and exit points.\nHistorically, Dogecoin experienced a golden cross in early January 2021, which preceded a four-month rally leading to an unprecedented 8,000% increase in its price, peaking at 76 cents on Binance. However, it’s crucial to approach such indicators with caution as past performance is not always indicative of future results, and moving average crossovers can sometimes lag behind actual market movements.\nMoreover, the dynamics around meme cryptocurrencies like Dogecoin differ significantly from more traditional investments. Lacking substantial real-world applications, their market movements are largely driven by speculative trading. This makes them particularly vulnerable to shifts in global financial conditions such as liquidity and interest rate changes.\nDuring Dogecoin’s 2021 rally, global interest rates were at or near zero, fostering an environment ripe for high-risk investments. Currently, however, with U.S. interest rates exceeding 5%, the economic backdrop is considerably different, potentially influencing the trajectory of speculative assets like Dogecoin.\nInvestors should remain vigilant, considering both the technical setup and broader economic factors when evaluating the potential for another major rally in Dogecoin’s price.\nFeatured Image:Freepik\nPlease See Disclaimer\n","create_date":"2024-05-10T18:31:38+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/surge-in-bitcoin-prices-boosts-demand-for-crypto-wallet-recovery-services/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"As bitcoin prices soar, crypto wallet recovery services are experiencing a sharp increase in demand from retail investors desperate to regain access to their","title":"Surge in Bitcoin Prices Boosts Demand for Crypto Wallet Recovery Services - CryptoCurrencyNews","content":" As bitcoin prices soar, crypto wallet recovery services are experiencing a sharp increase in demand from retail investors desperate to regain access to their accounts. Cryptocurrencies, stored on decentralized blockchain ledgers, can be accessed through software or hardware wallets, bypassing traditional exchanges. This method, while reducing certain risks, also presents challenges such as forgotten passwords and lost access to two-factor authentication devices, which can lock investors out of their holdings.\nThe recent bitcoin rally, reaching a high of $73,803.25 in March, has intensified the fear of missing out (FOMO) among investors. According to Reuters, several investors who lost access to their wallets have successfully regained entry through recovery services, driven by the higher stakes involved as bitcoin prices hover around $60,000.\nCompanies like ReWallet in Germany and U.S.-based Wallet Recovery Services have reported significant increases in service requests, with some fees reaching 20% of the wallet’s value, payable only upon successful recovery. The urgency for access is underscored by an estimated 20% of all bitcoins being inactive, translating to about $237 billion in potentially lost assets.\nAs the crypto market continues to fluctuate, wallet recovery services are becoming crucial for investors locked out of their digital fortunes, highlighting the ongoing challenges and opportunities within the cryptocurrency security sector.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-15T17:56:10+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/backed-raises-9-5m-led-by-gnosis-in-cryptos-asset-race/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Switzerland-based Backed has successfully closed a $9.5 million fundraising round, with Gnosis leading the investment charge.","title":"Backed Raises $9.5M Led by Gnosis in Crypto's Asset Race - CryptoCurrencyNews","content":" Switzerland-based Backed has successfully closed a $9.5 million fundraising round, with Gnosis leading the investment charge.\nAccording to one asset management company’s forecast, the tokenized real-world asset market could reach a staggering $10 trillion by the decade’s end.\nBacked, a tokenized asset issuer, announced on Tuesday that it secured $9.5 million in funding, with Gnosis at the helm of the investment. Other participants in the fundraising round included Exor Seeds, Cyber Fund, Mindset Ventures, Stake Capital Ventures, Blockchain Founders Fund, Blue Bay Capital, and Nonce Classic.\nThe company plans to utilize the investment to accelerate its private tokenization offering and onboard asset managers onto blockchain platforms, as stated in the press release.\nThe fundraising round comes at a time when the tokenization of real-world assets is emerging as a prominent trend in the digital asset industry. Crypto firms and global banking and asset management giants are actively vying to tokenize traditional financial instruments like bonds, funds, or credit on blockchains.\nTokenization offers several advantages over traditional financial systems, including enhanced trade settlement efficiency, broader investor access, and reduced administrative burdens. According to a report by asset manager 21.co, the market for RWAs could potentially reach $10 trillion by the end of the decade.\nBacked, headquartered and regulated in Switzerland, specializes in tokenization services and has already issued over $50 million worth of tokenized RWAs. These include ERC-20 compatible token versions of exchange-traded funds and individual stocks such as Coinbase (NASDAQ:COIN) and Tesla (NASDAQ:TSLA), as listed on its website.\n“Youbin Kang, CEO of Nonce Classic, one of the investors in the round, commented, “Global financial markets are fragmented, hindering accessibility and efficiency. Backed aims to solve these issues by bringing RWAs on-chain.”\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-30T17:38:26+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-etfs-see-continued-inflows-despite-pre-halving-turbulence/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Following a brief period of net outflows preceding Bitcoin's block-reward halving, spot bitcoin exchange-traded funds (ETFs) in the United States have","title":"Bitcoin ETFs See Continued Inflows Despite Pre-Halving Turbulence - CryptoCurrencyNews","content":" Following a brief period of net outflows preceding Bitcoin’s block-reward halving, spot bitcoin exchange-traded funds (ETFs) in the United States have returned to net inflows, with Fidelity’s Wise Origin Bitcoin Fund (FBTC) leading the way.\nOn Monday, spot Bitcoin ETFs collectively experienced net inflows exceeding $62 million, with FBTC securing the largest single-day net inflow of $34.83 million. The ARK 21Shares Bitcoin ETF and The iShares Bitcoin Trust also saw substantial net inflows of over $22.5 million and $19.65 million, respectively.\nIn contrast, the Grayscale Bitcoin Trust witnessed the largest single-day net outflow, with nearly $35 million exiting the product. However, since their inception, U.S.-traded spot bitcoin ETFs have amassed a cumulative total net inflow of $12.38 billion, indicating continued investor interest.\nBlackRock’s IBIT ETF, known for its consistent inflows, extended its streak for the 70th consecutive day on Monday, solidifying its position among the top 10 ETFs with the longest streaks of daily inflows. IBIT currently commands a market share of nearly 54% among spot bitcoin ETFs.\nDespite recent fluctuations, the price of Bitcoin remains resilient, hovering above $66,200 as reported by The Block’s Bitcoin Price Page. This stability in bitcoin’s price underscores ongoing investor confidence in the digital asset and its associated investment vehicles.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-23T20:21:37+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/coinpoker-adopts-zero-withdrawal-fees-trend/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"CoinPoker, a crypto betting app, has recently abolished all withdrawal fees on its platform, aligning itself with industry trends seen in online gambling","title":"CoinPoker Adopts Zero Withdrawal Fees Trend - CryptoCurrencyNews","content":" CoinPoker, a crypto betting app, has recently abolished all withdrawal fees on its platform, aligning itself with industry trends seen in online gambling sites like Rollbit.\nThis strategic move is expected to enhance CoinPoker’s competitiveness and potentially attract more users over time, especially as it offers similar features to Rollbit and introduces unique propositions such as poker games against human opponents.\nThe elimination of withdrawal fees, coupled with the recent success of gambling coins like Rollbit, could drive positive momentum for CoinPoker’s native CHP token.\nThe platform’s official announcement emphasized that only blockchain network fees will apply to withdrawals, highlighting a user-centric approach aimed at fostering growth and stability.\nPreviously, CoinPoker imposed nominal withdrawal fees to support site security and stability. However, advancements in security measures now allow the platform to waive these fees without compromising user experience or safety.\nCurrently ranked 90th globally in the poker category by SimilarWeb, CoinPoker has seen steady growth, rising 14 places between February and March. With its strong user experience and unique offerings, CoinPoker is poised to climb further in industry rankings.\nThe platform’s Crypto Series of Poker tournament, featuring a guaranteed prize pool of $1 million, has garnered significant attention, attracting renowned players like Tony G. who recently won over $300,000.\nAs CoinPoker solidifies its position as a leading destination for crypto-friendly poker, it stands to gain market share from competitors like Rollbit. This potential growth trajectory could also bolster the value of CoinPoker’s CHP token.\nDespite recent declines, CHP has shown resilience, prompting investor interest following the withdrawal fee announcement. With consistent platform expansion, CHP may mirror the success of Rollbit’s RLB token, which has surged by 670% over the past year.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T13:51:26+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-miners-record-earnings-with-runes-launch/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin miners experienced a windfall as they raked in a staggering $107 million in revenue on the fourth Bitcoin halving day, thanks to the introduction of","title":"Bitcoin Miners' Record Earnings with Runes Launch - CryptoCurrencyNews","content":" Bitcoin miners experienced a windfall as they raked in a staggering $107 million in revenue on the fourth Bitcoin halving day, thanks to the introduction of the Runes token on the blockchain.\nThe Runes protocol, which facilitates the creation of fungible tokens, played a pivotal role in boosting miners’ earnings despite the halving event slashing block rewards by 50%.\nOn April 20, coinciding with Bitcoin’s halving, the Runes token standard was unveiled, driving transaction fees to unprecedented heights, with an average of $128 and daily fees totaling $80 million, according to data from IntoTheBlock. However, this surge in fees was short-lived.\nBy the following day, fees dropped to around $34, still higher than the $18 recorded prior to the halving.\nThe launch of the Runes protocol, synchronized with the halving block, garnered significant attention from the cryptocurrency community, particularly memecoin and nonfungible token enthusiasts.\nThis heightened demand for block space resulted in some of Bitcoin’s most profitable blocks to date, with the first halving block alone accumulating $2.6 million in fees and rewards, as highlighted by community members on social media.\nDespite the spike in miner revenue and fees, the number of new Bitcoin addresses remained unchanged, indicating that the surge in activity was driven mainly by existing cryptocurrency users rather than new investors, noted Lucas Outumuro, head of research at IntoTheBlock.\n","create_date":"2024-04-22T15:09:57+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-traders-shrug-off-halving-eye-broader-market-risks/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin's much-anticipated \"halving\" event has left little impact on its price trajectory, as market observers point to broader economic factors and","title":"Bitcoin Traders Shrug Off 'Halving', Eye Broader Market Risks - CryptoCurrencyNews","content":" Bitcoin’s much-anticipated “halving” event has left little impact on its price trajectory, as market observers point to broader economic factors and geopolitical tensions shaping the cryptocurrency’s movements.\nThe halving, a fundamental shift in Bitcoin’s technology that reduces the rate of new bitcoin creation, occurred over the weekend. While some enthusiasts anticipated a price surge similar to past halving events, the market response has been muted.\nAs of Monday afternoon GMT, Bitcoin traded at $66,300, showing modest gains amidst a landscape dominated by geopolitical uncertainties. Mick Roche, a senior trader at Zodia Markets, noted that events like easing tensions between Iran and Israel have exerted more influence on Bitcoin’s price than the halving itself.\nEric Demuth, CEO of Bitpanda, emphasized Bitcoin’s increasing correlation with broader market sentiment, suggesting that retail trading patterns around the halving were not distinctive.\nBitcoin’s resilience is partly attributed to its evolving relationship with traditional markets. Regulatory developments, such as the potential approval of spot Bitcoin exchange-traded funds in the U.S., have bolstered investor confidence and contributed to its recovery from previous downturns.\nLooking ahead, Ben Laidler, global markets strategist at eToro, highlighted the trend towards institutional adoption of Bitcoin. While retail investors currently dominate the market, regulatory changes could pave the way for broader institutional involvement.\nDespite its growing prominence, cryptocurrencies remain a niche asset class, with regulatory scrutiny and limited real-world utility tempering their mainstream appeal. Market observers are also awaiting regulatory decisions on spot ETFs for Ethereum, though hopes for imminent approval are diminishing.\n","create_date":"2024-04-22T15:31:54+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/metamask-rolls-out-smart-transactions-to-tackle-ethereum-front-running/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"MetaMask, the leading Ethereum crypto wallet, is unveiling a new feature called Smart Transactions this week, aimed at mitigating the impact of maximal","title":"MetaMask Rolls Out 'Smart Transactions' to Tackle Ethereum Front-Running - CryptoCurrencyNews","content":" MetaMask, the leading Ethereum crypto wallet, is unveiling a new feature called Smart Transactions this week, aimed at mitigating the impact of maximal extractable value on users.\nSmart Transactions, an optional feature, enables users to submit transactions to a “virtual mempool” before they are officially recorded on the blockchain. Developed by ConsenSys, the company behind MetaMask, this virtual mempool defends against certain MEV strategies by simulating transactions behind the scenes to secure lower fees for users.\nMEV represents additional profit blockchain operators can extract by manipulating transactions before they are processed, similar to front-running in traditional financial markets. MEV significantly influences Ethereum’s functionality, inflating costs, slowing transaction speeds, and occasionally causing transactions to fail.\nJason Linehan, director of ConsenSys’ Special Mechanisms Group, highlighted the prevalence of wasted funds due to MEV-related issues, emphasizing the urgent need for solutions to enhance user experience.\nMetaMask’s virtual mempool initiative mirrors private mempools, which enhance transaction privacy and guard against MEV. This marks the platform’s initial step in an ambitious roadmap, aimed at revolutionizing MetaMask’s transaction routing methods on Ethereum.\nLinehan clarified that MetaMask’s virtual mempool is distinct from conventional private mempools and is essential for addressing Ethereum’s substantial hidden expenses.\nSmart Transactions operate by leveraging Ethereum’s existing infrastructure, with MetaMask’s virtual mempool financially penalizing builders and searchers if they deviate from quoted transaction prices. Linehan noted that the majority of Ethereum’s current operators have already opted into MetaMask’s virtual mempool program.\nIn addition to securing better prices for users, Smart Transactions simplify transaction tracking within MetaMask, eliminating the need for users to navigate external block explorer websites.\nLinehan described Smart Transactions as a foundational step towards MetaMask’s broader objectives, envisioning future developments such as intent-based architectures.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-06T16:24:12+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/new-us-bill-aims-to-clarify-taxation-of-staking-rewards/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Two bipartisan lawmakers, Reps. Wiley Nickel, D-N.C., and Drew Ferguson, R-Ga., have introduced the Providing Tax Clarity for Digital Assets Act. The bill","title":"New US Bill Aims to Clarify Taxation of Staking Rewards - CryptoCurrencyNews","content":" Two bipartisan lawmakers, Reps. Wiley Nickel, D-N.C., and Drew Ferguson, R-Ga., have introduced the Providing Tax Clarity for Digital Assets Act. The bill aims to clarify that staking rewards should only be taxed at the time of their sale to prevent double taxation.\nRep. Ferguson emphasized the need for clarity in the treatment of digital asset rewards, citing confusion among investors and businesses, as well as the risk of American businesses relocating overseas due to tax complexities. He highlighted that the bill would provide much-needed clarity, establish US leadership in digital asset tax treatment, and foster innovation and business within the country.\nThe bill comes in response to a ruling by the Internal Revenue Service last year, which stated that crypto investors earning rewards from staking services must include the value of those rewards in their gross income.\nAccording to Coin Center, the bill proposes that taxes on block rewards from proof-of-work or proof-of-stake networks should only be applied when they are spent or sold, rather than when they are acquired. This approach aims to resolve major issues with current cryptocurrency taxation and ensure fair treatment of the technology.\nThe Proof of Stake Alliance echoed similar sentiments, describing the bill as a “common-sense clarification of existing law” that promotes tax fairness and compliance. The alliance emphasized that the bill would prevent double taxation by taxing block rewards only at the time of their sale or exchange.\nRep. Nickel, a supporter of crypto, has previously advocated for digital asset legislation and pushed for the advancement of the Financial Innovation and Technology Act. Both Rep. Nickel and Rep. Ferguson have announced their retirement and will not seek reelection.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-01T20:11:08+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitcoin-steady-at-62k-pepe-peaks-as-gamestop-rallies/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Crypto markets showed minimal changes in the last 24 hours, with major cryptocurrencies like Bitcoin and Ether experiencing slight fluctuations, according to","title":"Bitcoin Steady at $62K, Pepe Peaks as GameStop Rallies - CryptoCurrencyNews","content":" Crypto markets showed minimal changes in the last 24 hours, with major cryptocurrencies like Bitcoin and Ether experiencing slight fluctuations, according to CoinGecko data. Bitcoin rose by just over 1%, while Ether dropped by 0.5%. Meanwhile, BNB from BNB Chain and Sol from Solana recorded a 3% decrease.\nThe crypto landscape saw significant activity among meme coins, which surged following a continued rally in GameStop’s (NYSE:GME) shares earlier in the week. Dog-themed Floki led the gains among major tokens, climbing 12%, while Pepe reached a new all-time high with a 5% increase.\nThe meme coin rally was partly fueled by a social media post from Keith Gill, a notable retail trader who previously influenced a major short squeeze on GameStop’s stock in 2021. His recent post led to a surge in meme stocks and tokens, drawing on his @TheRoaringKitty persona.\nAmid this, a joke GameStop token on the Solana blockchain reached a $100 million market capitalization, marking a 700% increase in just a week.\nDespite these gains among meme tokens, the broader crypto market appears weak, with no significant support from the bullish trends in equities or the weakening dollar, as noted by Alex Kuptsikevich, a senior market analyst at FxPro.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-15T17:43:04+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-hits-record-1-6m-confirmed-daily-transactions/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"On April 23, three days after the Bitcoin halving event, an impressive 1.6 million unique Bitcoin transactions were recorded, according to data from","title":"Bitcoin Hits Record 1.6M Confirmed Daily Transactions - CryptoCurrencyNews","content":" On April 23, three days after the Bitcoin halving event, an impressive 1.6 million unique Bitcoin transactions were recorded, according to data from Blockchain.com and Glassnode. This notable increase in transactions indicates a growing interest in using Bitcoin for everyday transactions, expanding its conventional role beyond being merely a store of value.\nAccording to Blockchain.com data, the launch of Bitcoin Runes, an alternative to Bitcoin Ordinals, directly correlates with the surge in daily Bitcoin payments. On April 23, Runes accounted for 68% of all Bitcoin transactions, showcasing rapid adoption within the community.\nBy April 29, BTC had reclaimed its dominance, representing 77.8% of Bitcoin transactions, while Runes maintained a strong second position with an 18.8% share. Other protocols, including Ordinals and BRC-20 tokens, also contributed to the network activity.\nThe ascent of Bitcoin Runes has resulted in over 1,200 BTC in transaction fees for miners since the Bitcoin halving event, offering a substantial incentive for miners and highlighting the economic feasibility of this emerging protocol.\nHowever, some experts caution against excessive optimism. On April 17, pseudonymous DeFi researcher Ignas, cautioned on X (formerly Twitter), suggesting that while Runes appear promising, they could face a similar fate to NFTs.\nBRC-20 and Runes tokens symbolize the emergence of a new standard known as Bitcoin DeFi (BTCFi). These fungible token standards aim to enhance Bitcoin’s utility beyond its existing capabilities, paving the way for DeFi applications built on the Bitcoin blockchain.\nThis evolution is poised to unlock fresh opportunities for Bitcoin holders and stimulate the growth of the BTCFi ecosystem. As developers delve into BTCFi’s potential, investors can anticipate further innovation and diversification in Bitcoin payments and applications.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-30T21:49:39+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/binance-faces-canadian-lawsuit-over-securities-law-allegations/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Binance, one of the world's largest cryptocurrency exchanges, is embroiled in a new legal battle in Canada as a class-action lawsuit alleges violations of","title":"Binance Faces Canadian Lawsuit Over Securities Law Allegations - CryptoCurrencyNews","content":" Binance, one of the world’s largest cryptocurrency exchanges, is embroiled in a new legal battle in Canada as a class-action lawsuit alleges violations of securities laws. Ontario’s Superior Court of Justice published a certification motion for the lawsuit on April 19, reigniting legal scrutiny against the exchange.\nThe lawsuit accuses Binance of selling cryptocurrency derivative products to retail investors without proper registration, in violation of Ontario Securities Act (OSA) and federal laws. Plaintiffs represented by Christopher Lochan and Jeremy Leeder seek damages and recissions of unlawful derivative trades for Canadian Binance users, numbering in the tens of thousands.\nThis legal action comes after Binance announced plans to cease operations in Ontario in response to regulatory warnings from the Ontario Securities Commission (OSC) in 2023. Despite this announcement, the OSC’s investigation into Binance remains ongoing, highlighting continued regulatory scrutiny.\nThe lawsuit further tarnishes Binance’s reputation, already marred by previous controversies, including former CEO Changpeng Zhao’s guilty plea to US anti-money laundering violations in 2021. Although current CEO Richard Teng has made efforts to steer Binance towards regulatory compliance, including securing a Dubai crypto license, the exchange’s past regulatory issues continue to overshadow its progress.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-23T19:49:48+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/robinhood-unveils-crypto-wallet-for-android-users-whats-new/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Robinhood has rolled out its crypto wallet for Android users globally, offering a secure way to manage various cryptocurrencies and stay informed about market","title":"Robinhood Unveils Crypto Wallet for Android Users: What's New? - CryptoCurrencyNews","content":" Robinhood has rolled out its crypto wallet for Android users globally, offering a secure way to manage various cryptocurrencies and stay informed about market trends directly from their Android devices.\nThe launch of the Robinhood Wallet for Android is a strategic move to accelerate the adoption of cryptocurrencies while enhancing Robinhood’s reputation as a trustworthy and user-friendly platform for crypto transactions.\nThis release is particularly significant given Android’s dominant 70% market share in the global mobile operating system market. Android users can now securely hold their private keys and take full control of their digital assets through the Robinhood Wallet.\nWith the Robinhood Wallet, users can store, manage, send, and receive a variety of cryptocurrencies, including Ethereum, Bitcoin, Dogecoin, Arbitrum, Polygon, Optimism, and Base.\nMoreover, the wallet offers features such as cryptocurrency swapping, direct funding from Robinhood balances or other wallets/exchanges, and access to trending tokens and crypto news.\nJohann Kerbrat, General Manager of Robinhood Crypto, highlighted the significance of this launch, stating:\n“Launching Robinhood Wallet on Android is a significant step forward in our commitment to making crypto more accessible and seamlessly integrated into daily life for millions of people around the world.”\nAndroid users can now enjoy the following features with the Robinhood Wallet:\nHold private keys and maintain control over digital assets.\nManage a diverse range of cryptocurrencies across multiple networks.\nSwap cryptocurrencies on Ethereum, Polygon, and Arbitrum networks.\nFund the wallet directly from Robinhood balances or other sources.\nStay updated on trending tokens and the latest crypto news within the app.\nIn December, Robinhood introduced its crypto product for Europe, allowing European customers to trade over 25 tokens, including popular cryptocurrencies like Bitcoin, Ethereum, XRP, Cardano, Solana, and Polkadot.\nLooking ahead, Robinhood plans to expand its token selection further and introduce features such as staking.\nResearch firm Bernstein recently issued an “outperform” rating for Robinhood Markets, with analyst Gautam Chhugani predicting a significant increase in cryptocurrency trade volume at the online brokerage over the next two years.\nFeatured Image: Freepik @ produtizebro\nPlease See Disclaimer\n","create_date":"2024-03-20T16:56:11+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/bitcoin-mining-difficulty-sees-major-drop-largest-since-crypto-winter/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The latest report from Bernstein reveals a notable 6% decline in Bitcoin (BTC) mining difficulty last week, marking the most substantial drop since the crypto","title":"Bitcoin Mining Difficulty Sees Major Drop, Largest Since Crypto Winter - CryptoCurrencyNews","content":" The latest report from Bernstein reveals a notable 6% decline in Bitcoin (BTC) mining difficulty last week, marking the most substantial drop since the crypto winter of December 2022. This downturn is seen as a beneficial shift for miners, particularly those with lower operational costs.\nAccording to analysts Gautam Chhugani and Mahika Sapra, this adjustment in mining difficulty reflects broader market dynamics post-Bitcoin halving, with higher-cost mining rigs being phased out due to escalating costs and lower Bitcoin prices. This has led to a decrease in the overall hashrate—the total computational power used in mining and processing transactions on Bitcoin’s proof-of-work blockchain.\nThe report highlights that the reduction in hashrate has allowed lower-cost miners to increase their market share by approximately 20 basis points since the halving. Companies like Riot Platforms (NASDAQ:RIOT) and CleanSpark (NASDAQ:CLSK), known for their low production costs and robust financial positions, are particularly well-placed to benefit. These companies are expected to continue consolidating their market share through both organic growth and mergers and acquisitions.\nBernstein also points out that a temporary stabilization in Bitcoin prices could advantage these efficient miners, allowing them to capitalize on their expansion strategies without the pressure of a rising hashrate. Furthermore, when Bitcoin prices eventually regain momentum, these miners are positioned to generate increased revenue due to higher production capabilities.\nDespite the current fluctuations, Bernstein does not foresee a significant downturn in Bitcoin prices. They predict that the cryptocurrency will remain range-bound in the short term, with the potential for an upward breakout as spot exchange-traded funds (ETFs) begin to receive allocations from registered investment advisors (RIAs), wealth platforms, and other institutional investors.\nBernstein maintains an ‘outperform’ rating for CleanSpark and Riot Platforms, indicating a favorable outlook for these firms, while Marathon Digital (NASDAQ:MARA) holds a ‘market-perform’ rating, suggesting a more neutral expectation.\nFeatured Image- Freepik\nPlease See Disclaimer\n","create_date":"2024-05-13T22:29:07+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/blackrock-foresees-influx-of-sovereign-wealth-funds-and-pensions-into-bitcoin-etfs/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Robert Mitchnick, BlackRock's(NYSE:BLK) head of digital assets, revealed that financial institutions are engaging in diligence and research discussions, with","title":"BlackRock Foresees Influx of Sovereign Wealth Funds and Pensions into Bitcoin ETFs - CryptoCurrencyNews","content":" Robert Mitchnick, BlackRock’s(NYSE:BLK) head of digital assets, revealed that financial institutions are engaging in diligence and research discussions, with BlackRock providing educational support. BlackRock has been actively discussing bitcoin with these institutions for several years.\nDespite the recent break in inflows into spot bitcoin exchange-traded funds, BlackRock anticipates a resurgence driven by a new wave of investors, including sovereign wealth funds, pension funds, and endowments. Mitchnick highlighted the renewed interest in bitcoin and the ongoing discussions surrounding portfolio allocation strategies.\nMitchnick emphasized that various institutions, including pensions, endowments, sovereign wealth funds, insurers, asset managers, and family offices, are conducting continuous due diligence and research. BlackRock’s role is to facilitate education in navigating the complexities of bitcoin investment.\nWhile attention has been drawn to the assets under management race between BlackRock’s IBIT ETF and Grayscale’s GBTC, Mitchnick stressed that BlackRock’s focus lies on client education rather than size competition. Despite IBIT’s impressive AUM of $17.2 billion compared to GBTC’s $24.3 billion, BlackRock prioritizes client understanding and adoption.\nBlackRock’s interest extends beyond bitcoin, as evidenced by its filing for an ether ETF. Mitchnick highlighted the potential benefits of digital assets across cryptoassets, stablecoins, and tokenization. While acknowledging the complexity of the Ethereum blockchain ecosystem, BlackRock remains committed to educating clients on the broader implications and opportunities within the digital asset space.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-02T20:15:54+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/tether-acquires-majority-stake-in-blackrock-neurotech/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Tether, the prominent issuer of stablecoin USDT, announced on Monday a significant investment of $200 million to acquire a majority stake in Blackrock","title":"Tether Acquires Majority Stake in Blackrock Neurotech - CryptoCurrencyNews","content":" Tether, the prominent issuer of stablecoin USDT, announced on Monday a significant investment of $200 million to acquire a majority stake in Blackrock Neurotech, a pioneering brain-computer interface company. Through its venture capital arm, Tether Evo, the company aims to support the development and commercialization of Blackrock Neurotech’s groundbreaking medical devices.\nBlackrock Neurotech specializes in the creation of medical devices driven by brain signals, with a focus on assisting individuals affected by paralysis and neurological disorders. It’s worth noting that the technology firm is distinct from the asset management giant BlackRock.\nThe infusion of capital from Tether will facilitate the deployment and market entry of these innovative medical devices. Additionally, funds will be allocated towards ongoing research and development initiatives to further enhance the company’s offerings, as highlighted in the press release.\nWith a market capitalization of $110 billion, Tether stands as a leader in the stablecoin market. In recent times, the company has diversified its interests by establishing four divisions beyond stablecoin issuance.\nPaolo Ardoino, CEO of Tether, expressed the company’s commitment to fostering emerging technologies with transformative potential. He emphasized the belief in the revolutionary capabilities of Blackrock Neurotech’s Brain-Computer Interfaces, which can revolutionize communication, rehabilitation, and cognitive enhancement.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T20:38:28+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/deribit-set-to-expire-6-3-billion-in-bitcoin-options-this-friday/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"This Friday, Deribit, a leading derivatives exchange, braces for a substantial expiration of cryptocurrency options, totaling over $9.4 billion, with bitcoin","title":"Deribit Set to Expire $6.3 Billion in Bitcoin Options This Friday - CryptoCurrencyNews","content":" This Friday, Deribit, a leading derivatives exchange, braces for a substantial expiration of cryptocurrency options, totaling over $9.4 billion, with bitcoin options comprising the majority at $6.35 billion.\nThe upcoming expiry has sparked notable activity in the options market, particularly for Bitcoin, where the put-call ratio stands at 0.68, signaling an increased interest in put options compared to calls. In contrast, ether options, valued at $3.08 billion, exhibit a lower put-call ratio of 0.49, suggesting a more bullish sentiment among traders.\nAmidst this activity, attention is drawn to the largest open interest in year-end expiry calls, notably at a $100,000 strike price for Bitcoin. This optimistic outlook reflects a belief among derivatives players in Bitcoin’s potential to surpass this milestone by December.\nQCP Capital analysts interpret this surge in options activity as investors positioning themselves for a post-halving resurgence in bitcoin’s value, anticipating a breakout from its two-month consolidation period.\nStandard Chartered’s recent analyst note aligns with this sentiment, projecting a year-end target price of $150,000 for bitcoin and $8,000 for ether.\nOptions, as derivative contracts, offer traders the right, but not the obligation, to buy or sell the underlying asset at a predetermined price within a specified timeframe. The distribution of put and call options is often used to gauge market sentiment, with put options typically indicating bearishness and call options suggesting bullishness.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T20:40:36+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/april-sees-yearly-low-of-38m-in-crypto-phishing/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Phishing attacks within the crypto industry decreased by 46% to $38 million in April, marking the lowest amount recorded this year, according to the security","title":"April Sees Yearly Low of $38M in Crypto Phishing - CryptoCurrencyNews","content":" Phishing attacks within the crypto industry decreased by 46% to $38 million in April, marking the lowest amount recorded this year, according to the security firm Scam Sniffer. Notably, this decline aligns with CertiK’s findings, indicating that crypto-related exploits and scams reached a historic low of $25.7 million in April.\nAccording to Scam Sniffer’s analysis, the Coinbase-backed Ethereum layer-2 network Base experienced a notable surge of 145% to $8.2 million in phishing incidents during the past month. Interestingly, two of the top 10 largest single thefts occurred on this chain, constituting 21% of the month’s total theft.\nERC-20 tokens faced the brunt of these attacks, with a staggering 88% of the stolen assets belonging to this class.\nScam Sniffer has pinpointed fake accounts on the social media platform X (previously known as Twitter) as the primary tool utilized by scammers. These attackers impersonated prominent projects like Renzo, Avail, Ether.fi, Wormhole, and Omni. These fake accounts often displayed counterfeit verification marks, giving them an appearance of authenticity that was exploited to lure unsuspecting users.\nUsing these fake accounts, the attackers posted deceptive comments on social media platforms to redirect unsuspecting individuals to malicious sites where their assets could be stolen.\nAdditionally, the attackers frequently utilized phishing signatures such as Permit, IncreaseAllowance, and Uniswap Permit2. These malicious signatures enabled the attackers to access their victim’s funds without their knowledge.\nScam Sniffer further added that despite wallets increasing phishing alerts for certain signatures, wallet drainers are actively finding ways to circumvent these alerts by using legitimate contracts like Disperse and Uniswap Multicall, along with variants of value normalization.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-06T17:02:24+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/factors-driving-ether-price-surge-today/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Ether's price surge today indicates a renewed focus on the Ethereum ecosystem, with multiple factors contributing to its upward trajectory.","title":"Factors Driving Ether Price Surge Today - CryptoCurrencyNews","content":" Ether’s price surge today indicates a renewed focus on the Ethereum ecosystem, with multiple factors contributing to its upward trajectory.\nSeveral key elements propel the recent surge in Ether’s price. Notably, heightened whale activity and a growing interest from institutional investors in Bitcoin have injected bullish sentiment into the wider crypto market, pushing Ether’s price up by over 5% on April 8. With Ether trading above $3,600, attention seems to be shifting towards the altcoin, which has seen a remarkable 96.2% increase in its price over the past year.\nEther’s current upward momentum against the U.S. dollar mirrors its robust gains against Bitcoin. The ETH/BTC pair recorded a notable 1.5% increase on April 8, surpassing the crucial 0.05 BTC level. This suggests a potential capital rotation in the short term, with investors diverting their attention towards Ether.\nFurthermore, Ether’s performance against other cryptocurrencies has notably improved in the last 24 hours, as evidenced by a nearly 2% rise in the Ethereum Dominance Index (ETH.D) from its recent low on April 7. This indicates a growing influx of capital into the Ether market, strengthening its value.\nThe recent surge in Ether’s price coincides with a period of accumulation among its wealthiest investors, commonly referred to as whales. Data from Glassnode reveals a consistent daily increase in Ether reserves among entities holding between 1,000 and 10,000 ETH since March 17. Historically, such accumulation patterns have often preceded significant price rallies, similar to the one Ether is experiencing presently.\nInterest from institutional traders in Ether has been on the rise since November 5, 2023, when the U.S. Securities and Exchange Commission (SEC) acknowledged Grayscale Investment’s application to convert its Ethereum trust into an ETF. Subsequently, on November 9, BlackRock, the world’s largest asset manager, filed for a spot Ether ETF, propelling Ether’s price to a six-month high at the time.\nAs of April 8, a total of seven spot Ether ETFs have been filed and are awaiting approval from the SEC. Moreover, the SEC’s recent call for comments on Fidelity, Grayscale, and Bitwise spot Ether ETFs on April 3 underscores the growing anticipation in the market.\nInstitutional investors have poured $13.8 billion into crypto investment products year-to-date in 2024, surpassing the record $10.6 billion inflow for the entire year of 2021. Despite recent outflows from institutional investors, Ether investment products have seen $52 million in inflows in 2024, bringing the total assets under management to $14.1 billion.\nWhile the current market conditions appear favorable, macroeconomic factors such as potential rate hikes and regulatory scrutiny in the U.S. could exert slight pressure on Ether’s price. However, the approval of a spot Ether ETF, positive regulatory developments, and a strong U.S. economy could serve as catalysts for further price growth.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-08T22:10:21+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/microstrategy-shares-plummet-17-amid-crypto-stock-selloff/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Major U.S. crypto stocks, including bitcoin stockpiler MicroStrategy and leading exchange Coinbase, experienced significant losses in Tuesday's trading","title":"MicroStrategy Shares Plummet 17% Amid Crypto Stock Selloff - CryptoCurrencyNews","content":" Major U.S. crypto stocks, including bitcoin stockpiler MicroStrategy and leading exchange Coinbase, experienced significant losses in Tuesday’s trading session. MicroStrategy reported a 5% year-over-year decrease in first-quarter revenue, contributing to a sharp decline in its share price.\nMicroStrategy’s shares plummeted by as much as 17% on Tuesday following news of its missed earnings and the downturn in the price of bitcoin. Although the shares recovered slightly, they were still down by 15.8% at $1,086 as of 1:45 p.m. ET. Last month, the company’s shares also experienced a notable decline of up to 16%.\nSimilarly, fellow U.S. crypto stocks such as Coinbase, Marathon Digital, and Riot Platforms faced losses in midday trading. Coinbase saw a drop of as much as 6%, while Marathon Digital and Riot Platforms experienced declines of 9% and 7%, respectively.\nThese mining stocks have witnessed fluctuations throughout the year, influenced by changes in bitcoin’s price. CleanSpark, Bitfarms, and Hut 8 also shed value, falling by 9%, 6%, and 5%, respectively.\nMicroStrategy’s first-quarter revenue of $115.2 million, representing a 5% decrease year-over-year, contributed to the negative sentiment surrounding the stock. As MicroStrategy’s primary strategy for creating long-term value involves accumulating bitcoin, its shares often act as a proxy for the cryptocurrency’s performance.\nBitcoin itself experienced a 4.5% decline, trading at $60,093 at the time of publication. The downturn in bitcoin’s price has led to corresponding drops in other crypto-related stocks, reflecting the interconnectedness of the cryptocurrency market.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-30T21:33:27+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/analysts-bitcoin-bulls-anticipate-halving-impact-in-two-months-or-more/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin's recent halving, completed on April 19, may not immediately impact market dynamics, with analysts suggesting a potential two-month wait for","title":"Analysts: Bitcoin Bulls Anticipate Halving Impact in Two Months or More - CryptoCurrencyNews","content":" Bitcoin’s recent halving, completed on April 19, may not immediately impact market dynamics, with analysts suggesting a potential two-month wait for significant effects. Despite an 8% increase in bitcoin’s spot price since the halving, experts anticipate a delay in supply and demand adjustments.\nAnalysts at QCP Capital suggest that historical patterns indicate a delay of around two to three months before the halving’s supply constraints translate into notable price movements. This suggests that bitcoin bulls may have additional time to build larger long positions.\nBitfinex analysts highlight the post-halving reduction in bitcoin supply issuance, which could stabilize prices and potentially lead to further appreciation. However, they caution that geopolitical turmoil, particularly in the Middle East, could impact Bitcoin’s long-term valuation.\nAdditionally, the Bitfinex Alpha report notes potential stabilization in demand from spot bitcoin ETFs, which have been a significant driver of market activity. However, recent outflows from ETFs suggest a possible slowdown in demand.\nMeanwhile, QCP Capital analysts anticipate a short squeeze in the altcoin and memecoin market in the short term. Persistent negative funding in these markets, coupled with potential fluctuations in demand, could lead to increased volatility.\nWhile the overall memecoin market has seen a slight uptick in market cap, top memecoins like dogecoin, shiba inu, and dogwifhat have experienced minor declines in the past 24 hours, reflecting ongoing market fluctuations.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-23T20:08:09+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/marathon-digital-misses-q1-revenue-cites-operational-challenges/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Marathon Digital Holdings, Inc. (NASDAQ:MARA), one of the leading bitcoin mining companies, experienced a slight downturn in its stock price, dropping about","title":"Marathon Digital Misses Q1 Revenue, Cites Operational Challenges - CryptoCurrencyNews","content":" Marathon Digital Holdings, Inc. (NASDAQ:MARA), one of the leading bitcoin mining companies, experienced a slight downturn in its stock price, dropping about 1.5% in after-hours trading on Thursday. This decline came in response to the company’s failure to meet revenue expectations for the first quarter, primarily due to several operational challenges.\nDuring the first three months of the year, Marathon Digital mined a total of 2,811 bitcoins, marking a significant 34% decrease from the previous quarter. The reduction in bitcoin production and subsequent revenues were attributed to a series of unforeseen issues, including equipment failures, maintenance of transmission lines, and higher-than-expected weather-related curtailments at its Garden City location and other sites, as stated in the company’s recent announcement.\nDespite these setbacks, Marathon Digital reported earnings per share of $1.26 for the quarter, which at first glance appears to surpass the Wall Street expectations of just $0.02 per share. However, this figure is not directly comparable to analyst forecasts due to the company’s adoption of the newly approved Financial Accounting Standards Board (FASB) fair value accounting rules, which included a beneficial mark-to-market adjustment prompted by the recent surge in bitcoin prices.\nLooking forward, Marathon remains committed to its 2024 operational goals, aiming to increase its mining capacity to 50 exahash per second (EH/s) and anticipating further growth into 2025.\nDespite these optimistic projections, Marathon’s stock has seen a 26% decline this year, in contrast to a steeper 40% drop in shares of its peer, Riot Platforms (NASDAQ:RIOT). This performance reflects the volatile nature of the cryptocurrency mining sector, influenced heavily by fluctuating bitcoin prices and operational challenges.\nFeatured Image:Megapixl\nPlease See Disclaimer\n","create_date":"2024-05-10T18:35:30+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitcoin-ownership-surges-as-small-addresses-hit-record-high/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"A recent report from Fidelity Digital Assets highlights a substantial increase in the number of Bitcoin addresses holding at least $1,000 worth of Bitcoin","title":"Bitcoin Ownership Surges as Small Addresses Hit Record High - CryptoCurrencyNews","content":" A recent report from Fidelity Digital Assets highlights a substantial increase in the number of Bitcoin addresses holding at least $1,000 worth of Bitcoin (BTC). Fidelity’s analysts reveal that this segment soared to an unprecedented 10.6 million wallets in mid-March, marking a doubling from the 5.3 million addresses recorded in 2023.\nThe surge in Bitcoin addresses with smaller holdings suggests a widening distribution of the cryptocurrency and its growing adoption among the general populace, according to Fidelity’s analysts. Despite escalating prices, the data indicates that small addresses persistently accumulate and store Bitcoin, a trend Fidelity describes as positive growth.\nFidelity’s analysts offer an optimistic outlook for Bitcoin in the short term, based on various long-term data points. Out of the 16 metrics tracked, half were deemed positive, while a quarter were categorized as negative or neutral.\nThe report also delves into the amount of Bitcoin held on cryptocurrency exchanges, which continued its downward trajectory in the first quarter of 2024. The total amount plummeted by 4.2% to 2.3 million Bitcoin, approximately 30% lower than the peak of over 3 million Bitcoin held in 2020. However, Fidelity underscores that this decline in exchange-held Bitcoin does not necessarily imply an uptick in self-custody. Custodians like Fidelity are actively developing solutions that empower customers to retain control of their private keys while engaging in trading activities through exchanges.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T22:03:52+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/microstrategys-saylor-profits-from-bitcoin-surge/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Michael Saylor's bold move to embrace Bitcoin in 2020 has yielded substantial gains for the co-founder and executive chairman of MicroStrategy Inc","title":"MicroStrategy’s Saylor Profits from Bitcoin Surge - CryptoCurrencyNews","content":" Michael Saylor’s bold move to embrace Bitcoin in 2020 has yielded substantial gains for the co-founder and executive chairman of MicroStrategy Inc (NASDAQ:MSTR). Saylor has reportedly earned around $400 million from pre-planned daily sales of approximately 5,000 shares of MicroStrategy since January, fueled by the stock’s remarkable surge.\nThe stock, which has doubled this year to approximately $1,280, has outpaced the gains of Bitcoin, the cryptocurrency Saylor embraced. MicroStrategy’s stock performance appears to allay investor concerns regarding Saylor’s selling activity, given his controlling stake in the company.\nDespite questions about MicroStrategy’s premium over Bitcoin, particularly after the introduction of US exchange-traded funds for the cryptocurrency, investor sentiment remains positive. However, some skeptics, like Kerrisdale Capital Management LLC, have taken short positions, citing the stock’s outpacing of Bitcoin’s price surge.\nThe anticipation now shifts to MicroStrategy’s first-quarter results, expected after regular trading hours on Monday. Analysts project flat revenue of around $122 million, with a forecasted net loss of 61 cents per share. MicroStrategy’s Bitcoin holdings, currently valued at approximately $14 billion, have been a key factor driving its investment strategy.\nInvestor focus also centers on MicroStrategy’s adoption of an accounting rule to value Bitcoin at market prices, with a deadline set for 2025. Despite past impairment charges, MicroStrategy continues to expand its Bitcoin holdings, having already spent over $1 billion on the cryptocurrency in the first quarter of 2024.\n“Saylor has a simple strategy for MSTR: sell equity/debt and buy BTC with proceeds,” noted Jeff Dorman, chief investment officer at Arca, highlighting MicroStrategy’s ongoing commitment to its Bitcoin-centric investment approach.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T17:42:01+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/hong-kong-bitcoin-and-ether-etfs-debut-with-low-activity/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The launch of crypto exchange-traded funds (ETFs) in Hong Kong fell short of expectations, with trading volumes significantly lower than anticipated.","title":"Hong Kong Bitcoin and Ether ETFs Debut with Low Activity - CryptoCurrencyNews","content":" The launch of crypto exchange-traded funds (ETFs) in Hong Kong fell short of expectations, with trading volumes significantly lower than anticipated.\nTrading volume for Hong Kong’s crypto ETFs totaled just over $11 million, with bitcoin ETFs accounting for $8.5 million and ether ETFs for $2.5 million. This figure paled in comparison to initial projections, which had suggested volumes exceeding $100 million, as reported by local media.\nWhile Hong Kong allows ether ETFs in its market, regulators in the Chinese territory do not share the same concerns about ether being classified as a security, unlike their counterparts in the U.S.\nIn contrast, the launch of a U.S. ether ETF faces delays due to regulatory uncertainty. The Securities and Exchange Commission (SEC) has not provided clarity on whether ether qualifies as a security, causing postponements in listing such ETFs.\nEther ETFs are already listed on the Toronto Stock Exchange through issuers like Evolve and Purpose Investments.\nOn the first day of trading in the U.S., the total volume for ether ETFs reached $655 million. Meanwhile, bitcoin prices experienced a slight decline of over 1%, trading near $62,100, according to CoinDesk Indices data.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-30T20:32:49+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/shiba-inu-faces-downturn-amidst-meme-coin-market-volatility/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The Shiba Inu (SHIB) price has significantly declined 8% today, dropping to $0.0000216, mirroring a broader 4.5% dip in the crypto market over the past 24","title":"Shiba Inu Faces Downturn Amidst Meme Coin Market Volatility - CryptoCurrencyNews","content":" The Shiba Inu (SHIB) price has significantly declined 8% today, dropping to $0.0000216, mirroring a broader 4.5% dip in the crypto market over the past 24 hours. Over the past week, SHIB has fallen by 24%, and in the last 30 days, it has experienced a 16% decline, although it still maintains an 85% gain over the past year. This downward trend coincides with the meme token segment’s first major decline in market cap since March, with tokens like SHIB and Dogecoin particularly affected by the recent loss in market confidence.\nDespite this, certain meme coins are defying the trend and showing signs of growth, notably newer tokens that are holding successful presales. However, SHIB remains in a medium-term downturn, with weak indicators and no clear signs of imminent recovery. Both its relative strength index and 30-day moving average continue to decline, indicating oversold territory for the token.\nAlthough a recovery may take a few days, SHIB’s elevated trading volume of approximately $1 billion suggests some market interest. Nevertheless, resistance and support levels continue to trend downwards, requiring patience from traders. Yet, signs of accumulating from at least one whale indicate anticipation of a near-future recovery, potentially boosted by broader market positivity.\nThe upcoming Bitcoin halving event could impact prices, potentially leading to short- and mid-term declines due to miners facing reduced incomes. However, with Bitcoin ETF volumes and interest rates stabilizing, steady gains are expected throughout the year, benefiting tokens like SHIB, which boasts strong fundamentals.\nDespite short-term challenges, SHIB remains poised for growth, with potential price targets of $0.00004 in the next couple of months and $0.00006 by the year’s end.\nWhile SHIB remains a prominent player, Slothana (SLOTH), a Solana-based coin, has emerged as another promising meme coin in the market. With a presale that has raised over $10 million, Slothana has garnered significant attention and is set to close in under 13 days before listing on exchanges. The coin’s popularity is attributed to its team’s successful track record with previous meme coin launches, particularly the Smog (SMOG) token, which saw substantial gains post-presale.\nSlothana’s choice of memes, particularly its mascot, the sloth, resonates with investors seeking financial freedom from traditional work obligations. The coin’s presale offers new investors an opportunity to get involved before its listing, which could trigger a significant rally in the coin’s value.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-16T19:32:55+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitcoin-bulls-bet-on-weaker-dollar-for-rally-extension/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"As the Dollar Index (DXY) experiences a recent pullback, crypto traders are banking on continued dollar weakness to fuel a resurgence in Bitcoin (BTC),","title":"Bitcoin Bulls Bet on Weaker Dollar for Rally Extension - CryptoCurrencyNews","content":" As the Dollar Index (DXY) experiences a recent pullback, crypto traders are banking on continued dollar weakness to fuel a resurgence in Bitcoin (BTC), although some banks hold a contrary view.\nRecent trends have seen Bitcoin trading within the $60,000 to $70,000 range since mid-March, with the dollar’s bounce on the DXY contributing to this stabilization. However, a reversal in the DXY’s trajectory, coupled with expectations of a weaker dollar, has reignited optimism among Bitcoin bulls.\nMike Alfred, a value investor and managing partner at Alpine Fox LP, anticipates a turnaround in the DXY, projecting a move back towards 102-103, which he believes will coincide with a bitcoin rally towards $90,000 in the short term. While some banks foresee continued dollar strength, others see signs of a potential peak, with projections ranging between 107 and 110 for the DXY.\nSociete Generale’s Cross Asset Research Team and Scotiabank are among those forecasting a resilient dollar, citing expectations of a prolonged hold on interest rates by the Federal Reserve. Additionally, the possibility of a U.S.-China trade war escalation, with proposed tariff hikes on Chinese imports, could further bolster the dollar, according to Barclays.\nDespite divergent opinions, crypto traders remain focused on the potential impact of a weaker dollar, which historically correlates with increased risk-taking and a favorable environment for Bitcoin and the broader crypto market. As such, traders are closely monitoring shifts in the DXY and geopolitical developments that could influence the dollar’s trajectory in the coming weeks.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T20:51:11+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/galaxy-digital-sees-revenue-and-profit-growth-on-record-mining-revenue/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Galaxy Digital Holdings disclosed robust growth in revenue and profits for the first quarter, propelled by its mining operation's exceptional performance","title":"Galaxy Digital Sees Revenue and Profit Growth on Record Mining Revenue - CryptoCurrencyNews","content":" Galaxy Digital Holdings disclosed robust growth in revenue and profits for the first quarter, propelled by its mining operation’s exceptional performance amidst the cryptocurrency price surge.\nThe financial services firm focused on digital assets revealed that its net income surged to $421.7 million ($1.23 per share) in the quarter ending March, marking a remarkable 214% increase compared to the same period last year. This significant bottom-line growth was underpinned by a surge in revenue, which reached $259.7 million, up from $146.7 million year-on-year. These impressive results signal Galaxy’s recovery trajectory following a $1 billion net loss in 2022.\nBreaking down the company’s business segments, Galaxy’s mining operation emerged as a key contributor, generating $31.5 million in revenue. This division’s robust performance was driven by a record hashrate of 5.7 exahash per second for mining transactions, demonstrating its resilience amidst market fluctuations. Notably, the mining operation’s revenue surge complemented similar increases recorded by Galaxy’s Global Markets and Asset Management divisions during the first quarter.\nIn April, Galaxy secured $125 million in funding, earmarked for expanding its trading operations and enhancing its mining infrastructure. This strategic move underscores Galaxy’s commitment to capitalizing on market opportunities and strengthening its position in the rapidly evolving digital assets landscape.\nFeatured Image- Freepik\nPlease See Disclaimer\n","create_date":"2024-05-14T19:11:32+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/kbw-predicts-robinhood-could-prevail-in-sec-legal-battle/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Robinhood (NASDAQ:HOOD) recently received a Wells Notice from the Securities and Exchange Commission, which was unexpected given the company's conservative","title":"KBW Predicts Robinhood Could Prevail in SEC Legal Battle - CryptoCurrencyNews","content":" Robinhood (NASDAQ:HOOD) recently received a Wells Notice from the Securities and Exchange Commission, which was unexpected given the company’s conservative approach to cryptocurrency listings, according to a KBW research report released on Monday.\nKBW highlighted that Robinhood offers a relatively modest selection of fifteen cryptocurrencies on its U.S. platform, in contrast to some competitors who list over two hundred digital assets. Analysts led by Kyle Voigt believe that Robinhood’s crypto operations in the U.S. will remain unchanged, and they anticipate the SEC will likely file a lawsuit in the coming months.\n“Our preliminary assessment suggests that Robinhood would opt to contest the SEC in court and stands a better chance of prevailing than many of its U.S. peers, should they face similar challenges. This is due in part to Robinhood’s stringent listing criteria,” the KBW report stated.\nCryptocurrency trading accounts for 12% of Robinhood’s total revenue. KBW speculates that the SEC’s focus might be on a specific group of digital assets offered on the platform. From a revenue risk standpoint, the most critical scenario would be if the SEC decides to classify Ethereum as a security, since it represents approximately 25% of Robinhood’s crypto trading volume.\nThe brokerage maintains a market perform rating on Robinhood’s stock with a target price of $20. Following the news, Robinhood’s shares saw a slight increase, trading up by 1.3% early Tuesday, at around $18.\nAccording to KBW, Robinhood shareholders may not receive a definitive resolution on the potential legal case until late 2025 at the earliest, drawing parallels to the ongoing regulatory proceedings against Coinbase (NASDAQ:COIN).\nFeatured Image: Megapixl ©Malirvik\nPlease See Disclaimer\n","create_date":"2024-05-07T17:04:33+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/hong-kongs-spot-crypto-etfs-set-to-commence-trading-next-week/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Hong Kong is gearing up to debut its spot bitcoin and ether exchange traded funds (ETFs) on April 30, as announced by three asset managers on Wednesday.","title":"Hong Kong's Spot Crypto ETFs Set to Commence Trading Next Week - CryptoCurrencyNews","content":" Hong Kong is gearing up to debut its spot bitcoin and ether exchange traded funds (ETFs) on April 30, as announced by three asset managers on Wednesday.\nThis move positions Hong Kong as a trailblazer in Asia, becoming the first in the region to embrace cryptocurrency products as mainstream investment tools. The regulatory green light from the Securities and Futures Commission, as indicated on the Hong Kong markets watchdog’s website, underscores the city’s commitment to fostering a conducive environment for digital asset investment.\nWhile mainland China maintains a ban on cryptocurrency, Hong Kong is actively positioning itself as a global digital asset hub, a strategic move aimed at enhancing its status as a financial epicenter. Over the past decade, Hong Kong has seen the presence of several leading international crypto exchanges and funds, although regulatory requirements have sometimes led to fluctuations in their operations.\nThe approval of these new products in Hong Kong follows closely on the heels of the United States’ introduction of its inaugural ETFs tracking spot bitcoin just three months ago. The U.S. ETFs have already witnessed significant traction, with approximately $12 billion in net inflows, contributing to a notable surge in bitcoin’s value earlier this year.crypto\nChina Asset Management, Harvest Fund Management, and Bosera Asset Management, alongside local cryptocurrency firm Hashkey, are spearheading the launch of these ETFs in Hong Kong, with a target date of April 30. Against the backdrop of bitcoin’s impressive 50% year-to-date appreciation and its record-breaking high of $73,803 in March, the cryptocurrency was trading around $65,000 on Wednesday.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T18:49:13+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/jpmorgan-attributes-crypto-market-sell-off-to-retail-investors/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"JPMorgan, a prominent financial institution on Wall Street, maintains a cautious outlook on cryptocurrency markets in the short term due to several factors,","title":"JPMorgan Attributes Crypto Market Sell-Off to Retail Investors - CryptoCurrencyNews","content":" JPMorgan, a prominent financial institution on Wall Street, maintains a cautious outlook on cryptocurrency markets in the short term due to several factors, including the fading retail impulse and the absence of positive catalysts.\nAccording to the bank’s analysis, retail investors were significant contributors to the recent sell-off in both crypto and equity assets during April. Moreover, spot bitcoin exchange-traded funds (ETFs) experienced outflows, indicating a decline in retail interest. The bank identifies three main challenges persisting in the market: high positioning levels, elevated bitcoin prices compared to gold and production costs, and subdued crypto venture capital (VC) funding.\nThe recent profit-taking in cryptocurrency markets has been notably driven by retail investors, overshadowing the involvement of institutional investors. Bitcoin, for instance, witnessed a 16% decline in April, marking its largest monthly drop since June 2022.\nIn a notable development, U.S.-based spot bitcoin ETFs recorded their highest-ever net outflows on Wednesday, totaling $563.7 million across 11 ETFs. This significant withdrawal occurred despite these funds only commencing trading on January 11.\nJPMorgan’s analysis suggests that institutional investors, particularly momentum traders like commodity trading advisors (CTAs), have been capitalizing on previous extensive positions in bitcoin and gold. However, the reduction in positions by other institutional investors outside of quantitative funds and CTAs appears to be more limited, as indicated by futures market data.\nIn summary, while retail investors have played a prominent role in the recent crypto market sell-off, institutional investors, particularly momentum traders, have also been active in adjusting their positions. JPMorgan’s cautious stance reflects the ongoing challenges and uncertainties prevailing in the cryptocurrency landscape.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-02T18:24:24+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/bitwise-cio-forecasts-50-drop-in-bitcoin-volatility-with-growing-institutional-adoption/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitwise Chief Investment Officer Matt Hougan recently shared insights in an investor note, envisioning a significant drop of 50% in Bitcoin's volatility","title":"Bitwise CIO Forecasts 50% Drop in Bitcoin Volatility with Growing Institutional Adoption - CryptoCurrencyNews","content":" Bitwise Chief Investment Officer Matt Hougan recently shared insights in an investor note, envisioning a significant drop of 50% in Bitcoin’s volatility alongside increasing institutional involvement leading up to the 2028 halving.\nHougan’s analysis points to Bitcoin’s historical patterns, notably its surge to a new all-time high just weeks before the 2024 halving. He anticipates this trend to persist post-halving, propelling Bitcoin’s value upward, much like its ascent from a modest $13 valuation during its initial halving in 2012.\nReaffirming previous forecasts, Hougan remains confident in Bitcoin’s trajectory toward a $250,000 valuation in the years ahead.\nHe attributes this sustained growth to Bitcoin’s growing recognition within the financial landscape, particularly following the debut of spot Bitcoin ETFs, which have witnessed remarkable performance since their launch.\nHighlighting the transformative effect of spot Bitcoin ETFs, Hougan underscores their role in attracting a fresh wave of institutional investors. These entities, including financial advisors and large financial institutions, are known for their disciplined approach to trading, which contrasts with the speculative behavior of retail investors that has historically characterized Bitcoin markets.\nHougan predicts that the influx of institutional capital through Bitcoin ETFs will contribute significantly to the projected 50% reduction in Bitcoin’s volatility by the next halving.\nHe envisions a future where Bitcoin becomes a standard component in diversified investment portfolios, potentially constituting 5% or more of allocations. This projection reflects a growing confidence in Bitcoin’s maturation and reduced price fluctuations.\nHougan anticipates that institutional investments in Bitcoin ETFs could surpass $200 billion, driven by increased market accessibility and deeper financial integration. This influx of capital is expected to enhance market stability and cement Bitcoin’s status as a mainstream financial asset.\nWhile acknowledging the inherent risks associated with cryptocurrency investments, including market volatility and regulatory uncertainties, Hougan paints a picture of a future where Bitcoin achieves widespread institutional adoption and emerges as a staple in investment portfolios, fundamentally reshaping market dynamics by the 2028 halving.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T19:05:08+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/circle-moves-legal-home-to-u-s-for-ipo-bloomberg/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Circle (CIRC) recently submitted court documents to transfer its legal domicile to the United States from Ireland, as reported by a spokesperson for the","title":"Circle Moves Legal Home to U.S. for IPO: Bloomberg - CryptoCurrencyNews","content":" Circle (CIRC) recently submitted court documents to transfer its legal domicile to the United States from Ireland, as reported by a spokesperson for the company.\nCircle (CIRC) initiated the relocation of its legal headquarters to the United States from Ireland. The company, which is the issuer of the second-largest stablecoin, announced its intention to go public in the United States back in January.\nAccording to Bloomberg’s report on Wednesday, Circle (CIRC), the issuer of the USDC stablecoin, aims to establish the United States as its new legal base in anticipation of an upcoming initial public offering in the country. The spokesperson, mentioned in the report, refrained from providing detailed explanations for the move.\nCircle (CIRC), which formally applied for a public listing with the U.S. Securities and Exchange Commission (SEC) earlier this year, is currently headquartered in the Republic of Ireland.\nWith a market capitalization of approximately $33 billion, Circle’s (CIRC) USDC holds the position of the second-largest stablecoin in the cryptocurrency market, as per CoinMarketCap’s data. Tether’s USDT, valued at $100 billion, occupies the top spot.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-15T19:03:31+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/injective-expands-with-layer-3-blockchain-launch-on-arbitrum/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Injective, a blockchain platform originally built on Cosmos technology, experienced a meteoric rise with its INJ token escalating thirty-three times in value","title":"Injective Expands with Layer-3 Blockchain Launch on Arbitrum - CryptoCurrencyNews","content":" Injective, a blockchain platform originally built on Cosmos technology, experienced a meteoric rise with its INJ token escalating thirty-three times in value during 2023, only to face a sharp decline this year. In a strategic pivot, Injective is now set to broaden its scope by launching a layer-3 network within the Ethereum ecosystem, leveraging Arbitrum’s technology.\nThe new layer, named “inEVM,” is designed to be compatible with the Ethereum Virtual Machine and aims to bridge three major blockchain networks: Ethereum, Cosmos, and Solana. The inEVM will utilize Arbitrum’s Orbit toolkit, which enables developers to create customizable chains while ensuring interoperability across different ecosystems.\nThis expansion could potentially rejuvenate interest in the INJ token, which outshone most of its peers last year, achieving a peak market capitalization exceeding $4 billion. Despite the general uptick in the crypto markets in 2024, with the CoinDesk 20 index climbing 25%, INJ has seen a nearly 30% decrease in its value.\nAccording to Injective Labs, this initiative will not only facilitate the development within the Ethereum layer-2 space but also maintain Injective’s attributes of high speed and low transaction costs. Additionally, operations on the inEVM network will support the Injective ecosystem’s tokenomics through a mechanism that regularly burns a portion of all protocol fees.\nEric Chen, co-founder of Injective Labs, emphasized in a press release that the integration with Arbitrum is pivotal for enhancing blockchain networks and infrastructure. He highlighted the importance of interoperability in bridging the gaps among leading layer-1 platforms, thereby enabling a more fluid exchange of assets and liquidity across various blockchain ecosystems.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-08T20:16:03+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-miners-eye-ai-amid-post-halving-shift/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"In the wake of the recent Bitcoin halving, miners are contemplating a transition towards artificial intelligence (AI) to potentially boost their revenue","title":"Bitcoin Miners Eye AI Amid Post-Halving Shift - CryptoCurrencyNews","content":" In the wake of the recent Bitcoin halving, miners are contemplating a transition towards artificial intelligence (AI) to potentially boost their revenue streams, according to a report by CoinShares.\nThe halving event, which occurred recently, is expected to significantly increase costs for miners, with electricity and overall production expenses nearly doubling.\nTo counter these rising costs, mining companies are exploring the potential of AI operations, leveraging energy-secure locations for potential higher returns. BitDigital (BTBT), Hive (HIVE), Hut 8 (HUT), TeraWulf (WULF), and Core Scientific (CORZ) are among the companies mentioned by CoinShares that are either already generating income from AI or have plans to do so.\nThe report suggests a trend where Bitcoin mining operations may migrate to stranded energy sites while investment in AI expands in more stable locations.\nPre-halving, the weighted average cash cost of production was approximately $29,500 per Bitcoin. Post-halving, this is projected to rise to about $53,000. Similarly, the average electricity cost of production per Bitcoin is expected to increase from around $16,300 to approximately $34,900.\nCoinShares forecasts a potential rise in hash rate to 700 exahash by 2025. However, immediately after the halving, a 10% drop in hashrate is anticipated as miners shut down unprofitable machines. Hash prices are also expected to decline post-halving to $53 per hash/day.\nDespite these challenges, miners are actively managing financial liabilities and using excess cash to pay down debt, indicating strategic financial planning amidst changing market dynamics.\nFeatured Image: Freepik @ zasabe\nPlease See Disclaimer\n","create_date":"2024-04-22T18:41:31+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/turnkey-raises-15m-led-by-lightspeed-faction-galaxy-ventures/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Turnkey, a company specializing in building wallet infrastructure for blockchain developers, announced a successful $15 million Series A funding round led by","title":"Turnkey Raises $15M Led by Lightspeed Faction & Galaxy Ventures - CryptoCurrencyNews","content":" Turnkey, a company specializing in building wallet infrastructure for blockchain developers, announced a successful $15 million Series A funding round led by Lightspeed Faction and Galaxy Ventures.\nFounded by former Coinbase (NASDAQ:COIN) employees who contributed to the development of the U.S. crypto exchange’s custody service, Turnkey aims to assist application developers in constructing user-friendly blockchain wallets. The funding round, disclosed on Tuesday, saw participation from notable investors including Sequoia, Coinbase Ventures, Alchemy, Figment Capital, and Mirana Ventures. This round, finalized last October, follows a $7.5 million seed round in 2022.\nCEO Bryce Ferguson explained, “At its simplest level, Turnkey provides secure, flexible, and scalable wallet infrastructure, offering developers a comprehensive toolkit for wallet-related tasks and cryptographic transactions.”\nFerguson highlighted the inspiration behind Turnkey’s inception, stemming from the realization at Coinbase that many crypto custodians treated cryptocurrency solely as a “buy-and-hold investment,” lacking the flexibility for users to actively utilize their assets. Turnkey’s objective is to empower custodians with tools enabling end-users to exercise greater control over their assets securely.\nReleased to the public in August, Turnkey’s product suite caters to various needs, serving as the backbone for applications requiring wallets and transaction signing, both for individual users and businesses. Notable clients include Alchemy, utilizing Turnkey to power its “wallet-as-a-service” offering, and enterprise-focused wallets like Mural, facilitating user-friendly invoicing and global payments.\nTurnkey also caters to financial firms, with trading terminals embedding Turnkey’s wallets for transactional purposes. Additionally, individual users leverage Turnkey for broad transaction signing.\nFerguson emphasized Turnkey’s comprehensive approach, stating, “We built all of the wallet infrastructure from the ground up,” highlighting the platform’s ability to generate cryptographic key pairs and provide extensive tooling for accessing and managing these keys.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-23T18:13:49+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/securitize-raises-47m-led-by-blackrock-for-rwa-tokenization/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Securitize, a leading player in RWA tokenization, has closed a significant $47 million funding round, with BlackRock spearheading the investment. This","title":"Securitize Raises $47M Led by BlackRock for RWA Tokenization - CryptoCurrencyNews","content":" Securitize, a leading player in RWA tokenization, has closed a significant $47 million funding round, with BlackRock spearheading the investment. This collaboration underscores the growing momentum and promise within the RWA tokenization landscape.\nThe investment round, announced on May 1, saw participation from key financial institutions including Hamilton Lane, ParaFi Capital, and Tradeweb Markets. The infusion of capital will enable Securitize to further its mission of harnessing blockchain technology to digitize capital markets, thereby simplifying processes and expanding accessibility.\nCarlos Domingo, Co-Founder and CEO of Securitize, expressed gratitude for the support from esteemed investors, emphasizing the transformative potential of blockchain in reshaping finance and tokenization specifically.\nBlackRock’s involvement marks a strategic move, particularly following their collaboration with Securitize on the BlackRock USD Institutional Digital Liquidity Fund. This partnership underscores BlackRock’s commitment to RWA tokenization, a process involving the digitization of real-world assets like equities and bonds for trading on a blockchain.\nJoseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, has been appointed to Securitize’s Board of Directors, signaling deeper collaboration and strategic alignment.\nAccording to Chalom, BlackRock sees tokenization as a catalyst for significant transformation in capital markets infrastructure. The investment in Securitize reflects BlackRock’s commitment to driving innovation to meet the evolving needs of its clients.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-01T19:55:02+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/crypto-frenzy-ignited-by-roaring-kittys-return-to-social-media/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The cryptocurrency world has experienced a surge in activity following the reappearance of Keith Gill, better known as \"Roaring Kitty,\" on social media. Gill,","title":"Crypto Frenzy Ignited by ‘Roaring Kitty’s’ Return to Social Media - CryptoCurrencyNews","content":" The cryptocurrency world has experienced a surge in activity following the reappearance of Keith Gill, better known as “Roaring Kitty,” on social media. Gill, famous for catalyzing the memestock phenomenon in 2021, influenced another financial sector with his latest move. A cryptocurrency branded with GameStop Corp.’s (NYSE:GME) name, logo, and ticker soared over 1,400% on Monday, as per CoinGecko data, despite lacking any official connection to the video game retailer.\nGill, who played a pivotal role in rallying day traders on Reddit to challenge GameStop’s short sellers, posted on the social media platform X after a silence since June 2021. His post depicted a man poised actively with a game controller, which speculators interpreted as a hint of his potential return to active trading.\nThe rise in this GameStop-themed cryptocurrency, trading at just $0.008212, highlights the distinct nature of memecoins, which are heavily influenced by their popularity on social platforms and can be launched quickly, often leading to significant short-term gains due to their small market size and limited liquidity.\nThe surge in memecoin interest parallels the broader enthusiasm in the crypto market, driven by substantial gains in major cryptocurrencies like Bitcoin and Ethereum. Other notable memecoins, including Dogwifhat’s WIF, Pepe, and Bonk, have also seen significant upticks.\nThis event echoes the broader trend seen in 2021, when traders shifted their focus from stocks to cryptocurrencies like Dogecoin, which spiked up to 15,444%, reaching 73 cents in May 2021 after starting the year at $0.0047, largely fueled by endorsements from high-profile figures such as Elon Musk.\n","create_date":"2024-05-13T18:43:16+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/ethereum-eth-investors-assess-potential-for-4000-rally-or-3000-dip/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Amidst a broader market crash, Ethereum experiences a 2.50% decline, fueling concerns of a potential drop to $3,000. Despite this setback, some investors","title":"Ethereum (ETH) Investors Assess Potential for $4,000 Rally or $3,000 Dip - CryptoCurrencyNews","content":" Amidst a broader market crash, Ethereum experiences a 2.50% decline, fueling concerns of a potential drop to $3,000. Despite this setback, some investors maintain optimism for long-term gains, pointing to the possibility of a bullish trend triggered by Bitcoin Halving. However, ETH faces resistance even as it finds support at $2,850, with conflicting signals from technical indicators adding to market uncertainty.\nEthereum, the leading altcoin by market capitalization, has not escaped the recent market downturn, witnessing a 2.50% decline in price. Worries about a potential descent to $3,000 have emerged following this setback and amid broader concerns of a significant market correction.\nNevertheless, despite the current downturn, certain investors remain hopeful about Ethereum’s long-term trajectory. The historical precedent of Bitcoin Halving sparking an altcoin season hints at the potential for a future uptrend.\nWith a market capitalization of $382 billion, Ethereum has experienced an 18% drop over recent weeks. However, the ETH price has found support around the 50% Fibonacci level, approximately $2,850.\nThe consolidation on the weekly chart between the 50% and 61.80% Fibonacci levels has been prolonged by the latest downturn. The smaller rejection from the 50% Fib level suggests a possible bullish breakout, potentially leading to sustained levels above $3,000.\nAt its current trading price of $3,140, Ethereum displays an intraday Doji candle, highlighting the altcoin’s volatile nature. The resumption of an upward trend for Ethereum may occur if the market manages to avoid further losses.\nTechnical indicators offer a mixed outlook for Ethereum. The bearish crossover in the MACD and signal lines on the weekly chart reflects the recent pullback phase. However, a rebound from the 50% Fib level in ETH price could reignite positive momentum.\nA potential breakout above the $3,265 resistance level may signal an entry opportunity for a bull run continuation. Such a scenario could test the formidable $4,000 resistance level, potentially resulting in a 25% increase.\nHowever, while the likelihood of a drop to $3,000 remains minimal, it still concerns investors amidst the current market conditions. The prevailing uncertainty prompts investors to carefully evaluate the potential outcomes for Ethereum’s price movement.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T19:40:09+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/binance-faces-class-action-lawsuit-in-canada-cz-potentially-facing-36-months-in-prison/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Cryptocurrency exchange Binance finds itself entangled in a fresh legal battle as a new class-action lawsuit unfolds in Canada. Plaintiffs allege that Binance","title":"Binance Faces Class-Action Lawsuit in Canada, CZ Potentially Facing 36 Months in Prison - CryptoCurrencyNews","content":" Cryptocurrency exchange Binance finds itself entangled in a fresh legal battle as a new class-action lawsuit unfolds in Canada. Plaintiffs allege that Binance has run afoul of local securities regulations.\nThe Ontario Superior Court of Justice has initiated a certification motion for a class-action lawsuit against Binance. The core accusation revolves around the sale of crypto derivative products to retail investors without proper registration, according to the plaintiffs.\nThe lawsuit is seeking damages and the rescission of illicit derivative trades. Plaintiffs argue that tens of thousands of Canadian users engaged in Binance’s cryptocurrency derivatives offerings through its platform.\nFurther complicating matters, the Philippines Securities and Exchange Commission (SEC) has directed both Google and Apple to remove the Binance app from their respective app stores for users in the Philippines.\nEmilio Aquino, chair of the SEC, emphasized that selling or offering unregistered securities to locals and operating as an unregistered broker breaches the country’s securities regulations. Removing Binance’s applications from digital app marketplaces, according to Aquino, is crucial to curb the proliferation of its illicit activities in the Philippines, which could otherwise have detrimental effects on the local economy.\nMeanwhile, in the United States, prosecutors have recommended a 36-month prison sentence for Binance founder Changpeng “CZ” Zhao. This recommendation comes after Zhao pleaded guilty to charges related to money laundering.\nIn their filing to the U.S. District Court for the Western District of Washington, prosecutors underscored the gravity of Zhao’s deliberate violation of U.S. law and its repercussions. They argue that the proposed 36-month sentence, coupled with a $50 million fine, strikes an appropriate balance in addressing the pertinent legal factors and achieving the objectives of sentencing.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T20:08:33+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/ethereum-validator-queue-reaches-peak-levels-since-september-2023/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"EigenLayer recently unveiled its presence on the Ethereum mainnet, marking a significant development in the Ethereum ecosystem. One of the primary avenues to","title":"Ethereum Validator Queue Reaches Peak Levels since September 2023 - CryptoCurrencyNews","content":" EigenLayer recently unveiled its presence on the Ethereum mainnet, marking a significant development in the Ethereum ecosystem. One of the primary avenues to participate in EigenLayer involves contributing to the security of Ethereum and amplifying interest in staking activities. Staking on Ethereum has gained considerable momentum, particularly with the surge in popularity of restaking methods, as discussed in recent discussions.\nIn a noteworthy update, EigenLayer made its debut on the Ethereum mainnet, introducing its EigenDA data availability layer. Notable operators such as Coinbase Cloud and Google Cloud have joined as the protocol’s initial participants. Additionally, EigenLayer revealed six actively validated services that would benefit from its restaking mechanism, reinforcing its position in the ecosystem.\nThis launch enables restakers on the platform to earn an additional yield on their staked ETH, a feature previously unavailable. Many users had initially deposited ETH into the protocol in anticipation of higher yields and speculated on potential airdrops as EigenLayer allocated restaking points.\nAccessing EigenLayer necessitates staking ETH, either by setting up a validator or utilizing a liquid staking protocol to acquire staking derivative tokens. Liquid staking tokens (LST) offer holders liquidity and can be obtained by depositing into designated protocols or through direct purchase.\nThe surge in new validators underscores the increasing interest in contributing to Ethereum’s security through EigenLayer. Notably, Ethereum transitioned to Proof-of-Stake with The Merge in September 2022, allowing individuals to operate validators on the Beaconchain alongside the mainnet. Staking gained substantial traction following the Shapella upgrade in April 2023, which introduced the ability to withdraw staked ETH, enhancing user confidence in the security of their funds.\nAt its peak in June 2023, the validator queue reached 96,000, prompting measures to maintain network stability. However, the queue gradually subsided, remaining below 10,000 from October 2023 to March of the following year. The resurgence of interest in restaking has propelled the validator entry queue to 20,000, reflecting robust demand to fortify the Ethereum network.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-15T21:20:25+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/ftcs-non-compete-ban-victory-for-crypto/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"When news broke about the U.S. Federal Trade Commission's decision to prohibit non-compete agreements, it brought back memories of my own experience leaving a","title":"FTC's Non-Compete Ban: Victory for Crypto - CryptoCurrencyNews","content":" When news broke about the U.S. Federal Trade Commission’s decision to prohibit non-compete agreements, it brought back memories of my own experience leaving a blockchain startup to join another early-stage company. Upon my departure, my former employer sent a cease-and-desist letter alleging a breach of a non-compete clause in my employment contract.\nDespite the weak legal grounds of their claim, I found myself entangled in a lengthy dispute, facing financial losses, emotional strain, and months of unemployment. My story is not unique. Nearly one in five Americans is bound by non-compete agreements, leading to unnecessary hurdles for both employees and employers.\nThe FTC’s move to ban non-compete agreements is a significant step forward, with Chair Lina M. Khan estimating it could spur the creation of 8,500 new startups through increased competition. As someone working in the blockchain and digital assets sector, I see this decision as aligning with the open-source ethos fundamental to our industry’s innovation.\nIt’s ironic that a blockchain startup, built on principles of decentralization and collaboration, would resort to enforcing restrictive non-compete clauses. Furthermore, the contrast between my experience and California’s long-standing ban on non-competes highlights the potential impact of such regulations on fostering innovation and entrepreneurship.\nThe FTC’s action signals a positive shift, not only for individual employees like myself but also for the broader crypto industry, where talent mobility and innovation thrive in an environment free from unnecessary constraints.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T20:31:34+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-investor-roger-ver-arrested-for-alleged-tax-fraud/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Roger Ver, an early investor in Bitcoin, has been arrested and charged with mail fraud, tax evasion, and filing false tax returns. The U.S. Department of","title":"Bitcoin Investor Roger Ver Arrested for Alleged Tax Fraud - CryptoCurrencyNews","content":" Roger Ver, an early investor in Bitcoin, has been arrested and charged with mail fraud, tax evasion, and filing false tax returns. The U.S. Department of Justice announced the charges, revealing that Ver allegedly concealed Bitcoin ownership from the U.S. Internal Revenue Service (IRS), leading to an estimated loss of $48 million.\nThe indictment, recently unsealed, outlines three charges against Ver, who was arrested in Spain over the weekend with potential extradition to the United States. According to the DOJ statement, Ver’s alleged actions include concealing Bitcoin ownership and profiting from the sale of tens of thousands of Bitcoins on cryptocurrency exchanges for approximately $240 million in cash in November 2017.\nDespite not being a U.S. citizen at the time, Ver was legally obligated to report certain distributions, such as dividends from U.S. corporations MemoryDealers and Agilestar, where he held ownership interests. However, he allegedly failed to disclose these distributions to the IRS, resulting in his 2017 tax return not reporting any gain or paying tax related to the distributions.\nFurthermore, Ver is accused of using legal services to prepare and file false tax returns, undervaluing the two companies, concealing their Bitcoin holdings of 73,000 BTC, and omitting his personal Bitcoin ownership.\nVer, who renounced his U.S. citizenship in 2014 after reportedly gaining citizenship in St. Kitts and Nevis, had previously been a resident of Santa Clara, California. Known online as “Bitcoin Jesus,” Ver was the former CEO of Bitcoin.com, a digital wallet developer.\nThe arrest and charges against Roger Ver underscore the increasing scrutiny faced by individuals in the cryptocurrency space regarding tax compliance and financial transparency.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-30T21:10:39+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitcoin-halving-sparks-layer-2-surge/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Welcome to “Epoch V” of Bitcoin. The fourth successful halving of Bitcoin occurred on April 20, marking a programmed reduction in the amount of new bitcoin","title":"Bitcoin Halving Sparks Layer 2 Surge - CryptoCurrencyNews","content":" Welcome to “Epoch V” of Bitcoin. The fourth successful halving of Bitcoin occurred on April 20, marking a programmed reduction in the amount of new bitcoin entering circulation through mining. As celebrations ensue worldwide, attention turns to what lies ahead.\nCoinciding with the halving was the launch of Runes, a protocol facilitating the creation of meme coins on Bitcoin. This launch saw hundreds of tokens introduced, contributing over $80 million in fees to bitcoin miners. This surge in trading activity has driven transaction costs on Bitcoin to over $70 on average, a staggering 1,395.8% increase over the trailing 30-day average, according to TokenTerminal.\nSome foresee “Epoch V,” leading up to the next halving in 2028, as the period when Bitcoin layer 2 solutions like the Lightning Network will gain traction. Bitcoin fees hit an all-time high of $128 on April 20, prompting many to explore alternative solutions. Bitcoin Core developer Ava Chow stated, “High fee environments will prompt people to look into them,” referring to Lightning and other layer 2 options.\nA recent Messari report emphasized the necessity of layer-2 solutions for Bitcoin amidst rising on-chain activity, signaling a shift from Bitcoin as merely “digital gold” to a platform for innovation.\nThe launch of the Ordinals protocol last year, enabling new data storage methods on Bitcoin’s smallest units (satoshis), has catalyzed this shift. BitVM allows off-chain computation, Babylon facilitates staking and earning yield on BTC, while layer 2s like Stacks and Merlin host decentralized apps and meme coins.\nPost-halving, tokens associated with Bitcoin layer 2s have outperformed BTC. For instance, Elastos rose 11%, SatoshiVM climbed 5%, and Stacks gained nearly 20% to $2.87, partly driven by the anticipated Nakamoto upgrade.\nWhile market dynamics may drive action to Bitcoin’s secondary layers, challenges persist. Higher BTC fees may price out users with low balances from platforms like Lightning, necessitating workarounds such as custodial services. Concerns arise over the erosion of sovereignty and anonymity with custodial Lightning solutions.\nThis landscape reflects the legacy of the Blocksize Wars, where the decision to prioritize layer 2 scaling over block size increases set Bitcoin’s current trajectory.\nAs Chow remarks, the choice between block size and transaction size adjustments represents a fundamental divide in Bitcoin’s scaling debate, shaping its evolution to date.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-22T21:31:45+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/crypto-market-witnesses-over-400-million-in-liquidations-as-bitcoin-drops-below-67000/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Volatility in the cryptocurrency market has triggered liquidations surpassing $400 million in the past 24 hours. Bitcoin positions alone accounted for $130","title":"Crypto Market Witnesses Over $400 Million in Liquidations as Bitcoin Drops Below $67,000 - CryptoCurrencyNews","content":" Volatility in the cryptocurrency market has triggered liquidations surpassing $400 million in the past 24 hours. Bitcoin positions alone accounted for $130 million in liquidations, predominantly affecting long positions.\nThe recent volatility in the crypto market led to a surge in liquidations on centralized exchanges, coinciding with Bitcoin’s decline below the $67,000 mark, followed by a broader downturn across the crypto space.\nAccording to data from CoinGlass, liquidations totaling over $427 million were recorded across various centralized crypto exchanges in the past day, with the majority, approximately $342 million, stemming from long positions.\nBitcoin bore the brunt of the liquidations, with over $130 million in liquidations within the same period, of which $90 million represented long positions.\nLiquidations occur when a trader’s position is forcibly closed due to insufficient funds to cover losses, typically resulting from adverse market movements depleting initial margin or collateral.\nThe cascade of liquidations coincided with Bitcoin’s drop below $67,000, having traded above $71,000 the previous day. The largest cryptocurrency by market capitalization has seen a decrease of over 4.2% in the last 24 hours, currently hovering around $66,500.\nMeanwhile, the GMCI 30 index, reflecting the top 30 cryptocurrencies, experienced a 6.8% decline to 143.40 over the past day, with the second-largest cryptocurrency, ether, plunging by 6.5% to $3,319.\nFollowing the market downturn, analysts at crypto trading firm QCP Capital highlighted signals from the options market, indicating the liquidation spree led by large retail-heavy exchanges.\nQCP analysts noted, “Once again, the options market provided an early signal to a sharp downside move, particularly the downside skew in risk reversals.” They further emphasized the rapidity of the downturn, attributing it to significant liquidations on retail-heavy platforms like Binance, resulting in flat perp funding rates after reaching as high as 77%.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-02T21:45:59+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/moonpay-teams-up-with-paypal-to-simplify-crypto-purchases-for-us-users/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"MoonPay, a popular cryptocurrency purchasing app, has forged a partnership with financial services behemoth PayPal to offer American users a streamlined","title":"MoonPay Teams Up with PayPal to Simplify Crypto Purchases for US Users - CryptoCurrencyNews","content":" MoonPay, a popular cryptocurrency purchasing app, has forged a partnership with financial services behemoth PayPal to offer American users a streamlined method for buying cryptocurrencies using their PayPal accounts.\nThis collaboration aims to streamline the process of purchasing cryptocurrencies for millions of Americans. It enables users to conduct wallet transfers, bank transfers, and debit card transactions directly within the MoonPay app, as reported by Coindesk.\nThe integration represents a strategic expansion for PayPal, which currently provides a limited range of major cryptocurrencies. Through MoonPay’s infrastructure, PayPal users gain access to a broader array of popular tokens.\nIvan Soto-Wright, the co-founder and CEO of MoonPay, described the partnership as “symbiotic,” emphasizing its benefits for both MoonPay users and PayPal’s cryptocurrency offerings.\n“This is not merely an integration; it involves embedding PayPal within MoonPay’s framework,” Soto-Wright explained.\nHe underscored the significance of this collaboration, highlighting the extensive process required to align with PayPal’s operational standards.\n“We are the first company to achieve this with PayPal, and it involved a lengthy process to gain their confidence,” he added.\nMoonPay, which handles billions of dollars in cryptocurrency transactions via debit and credit cards, views this partnership as a crucial advancement in reaching a broader customer base. It particularly benefits users who may have encountered banking restrictions or card declines when attempting to purchase cryptocurrencies.\nAs digital assets gain momentum, such collaborations become increasingly pivotal. They not only enhance the user experience by offering more flexible payment options but also signify the growing acceptance of cryptocurrencies within mainstream financial services.\nFeatured Image: Megapixl\nPlease See Disclaimer\n","create_date":"2024-05-02T18:33:02+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/tether-vows-to-freeze-sanction-linked-addresses-amid-usdt-scrutiny/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"As scrutiny over the misuse of Tether's USDT stablecoin intensifies, the company pledges to take decisive action against addresses linked to sanctions","title":"Tether Vows to Freeze Sanction-Linked Addresses Amid USDT Scrutiny - CryptoCurrencyNews","content":" As scrutiny over the misuse of Tether’s USDT stablecoin intensifies, the company pledges to take decisive action against addresses linked to sanctions violations.\nTether, the issuer of the popular USDT stablecoin, has announced its commitment to freezing any addresses associated with sanctioned entities. This proactive stance follows reports indicating the exploitation of USDT tokens by certain state actors to evade US sanctions.\nA spokesperson for Tether stated, “Tether respects the Office of Foreign Assets Control (OFAC) SDN list and is committed to working to ensure sanction addresses are frozen promptly.”\nIn the past year, Tether has actively frozen addresses holding substantial amounts of its digital assets involved in illicit activities. For example, the company froze 32 addresses containing $873,118.34 linked to unlawful activities in Israel and Ukraine.\nTether’s CEO, Paolo Ardoino, emphasized that these actions underscore the company’s dedication to establishing robust safety standards within the emerging cryptocurrency industry.\nDespite Tether’s compliance efforts, recent reports have highlighted ongoing exploitation of the USDT stablecoin by terrorist groups and sanctioned nations seeking to bypass restrictions. Venezuela’s state-owned oil giant, PDVSA, reportedly utilized USDT for crude oil and fuel exports amid renewed US sanctions. Additionally, Russia has increasingly turned to alternative payment avenues, including Tether’s USDT stablecoin, to evade economic sanctions, according to US Treasury Deputy Secretary Adewale Adeyemo.\nA United Nations report also revealed the prevalence of cryptocurrency-based money laundering, with Tether’s USDT on the TRON blockchain being a favored choice, particularly within illegal online gambling platforms.\nIn response to these developments, US Senator Elizabeth Warren has advocated for stringent regulatory measures, emphasizing the importance of including stablecoin issuers and other decentralized finance (DeFi) intermediaries under anti-money laundering (AML) and combating the financing of terrorism (CFT) requirements in any proposed stablecoin regulations. Excluding such entities, Warren argues, could enable bad actors to exploit the growing crypto trading activities facilitated by the legislation.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-23T19:10:38+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/over-50-of-pre-sold-solana-memecoins-abandoned-post-25m-raise/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"In the wake of the memecoin frenzy, over $25 million invested in pre-sold Solana memecoins has been left stranded, with more than half of the top projects","title":"Over 50% of Pre-Sold Solana Memecoins Abandoned Post $25M Raise - CryptoCurrencyNews","content":" In the wake of the memecoin frenzy, over $25 million invested in pre-sold Solana memecoins has been left stranded, with more than half of the top projects abandoned within just one month.\nZachXBT’s investigation identified 12 Solana memecoin projects that have been deserted by their founders, leaving investors in the lurch. Solana Co-Founder Anatoly Yakovenko expressed skepticism towards the trend, stating, “Pre-selling a meme doesn’t make any sense to begin with.” Yakovenko previously cautioned against investing in memecoin pre-sales, highlighting the riskiness of such endeavors.\nOf the 22 projects initially scrutinized, ZachXBT revealed that 12 have already been deserted within a month. Notable among these are LIKE, MOONKE, FROG, TEMPLE, and SORRY, which collectively raised over $2 million. Other projects, including those like @Jared_eth, raised substantial funds without even launching a token, with one account flagged as compromised by the web3 security platform Pocket Universe.\nThe memecoin frenzy has now shifted to the Coinbase-backed Base blockchain, indicating a lack of lessons learned from the Solana debacle, according to ZachXBT.\nMeanwhile, the price of SOL, Solana’s native token, has witnessed a significant decline since the memecoin boom. Although SOL surged to over $200 during the peak of the frenzy, largely fueled by memecoin speculation, it has since plummeted to $154 as of the latest data. This represents a 23% decrease, despite SOL having already bounced back approximately 30% from its recent low of $117 on April 13.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-23T19:27:31+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/empowering-crypto-adoption-introducing-a-secure-user-friendly-digital-wallet/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"In response to the ongoing challenges hindering crypto adoption, Web3 Freewallet has emerged as a solution, offering a secure and simplified platform","title":"Empowering Crypto Adoption: Introducing a Secure, User-Friendly Digital Wallet - CryptoCurrencyNews","content":" In response to the ongoing challenges hindering crypto adoption, Web3 Freewallet has emerged as a solution, offering a secure and simplified platform supporting over 1,000 cryptocurrencies.\nDespite the exponential growth of digital finance, many individuals remain hesitant to venture into cryptocurrencies. The complexity surrounding crypto technology often acts as a barrier, with 75% of US citizens who are aware of crypto expressing doubts about its safety and reliability.\nThis underscores the critical need for user-friendly tools that can alleviate these concerns, making it easier for newcomers to enter the world of digital currencies. Simplifying these technologies is pivotal for mainstream adoption and fostering trust among new users.\nWeb3 Freewallet, launched in February 2024, represents Freewallet’s foray into self-custody solutions. As a noncustodial wallet, it caters to the diverse needs of crypto users by supporting over 1,000 cryptocurrencies across 15 different blockchains, showcasing its versatility and broad compatibility.\nAccessible via a Google Chrome extension or mobile application for iOS and Android devices, Web3 Freewallet requires no personal information from users, ensuring privacy. The setup process is tailored to individuals with no prior crypto experience, guided by an intuitive interface aimed at facilitating seamless entry into the crypto market.\nThe platform seamlessly connects users with decentralized applications (DApps) through WalletConnect, enabling activities such as staking, token exchanging, and trading on third-party decentralized finance (DeFi) platforms. Moreover, it offers features for monitoring market trends, managing crypto portfolios, swapping tokens, and purchasing crypto directly within the app.\nWeb3 Freewallet places a strong emphasis on user security, refraining from collecting private keys and implementing robust security measures such as PIN codes, passcodes, biometric sign-in options, and spending limits to safeguard against unauthorized access and potential theft.\nAdditionally, users can import existing noncustodial wallets by entering their seed phrases, facilitating streamlined management of multiple wallets within a single interface and ensuring easy wallet recovery.\nEngineered to cater to both novice and experienced crypto users, Web3 Freewallet prioritizes ease of use, flexibility, and comprehensive security measures. With millions of users already onboard, the platform is committed to continuous improvement, with plans to introduce new features including a peer-to-peer (P2P) trading platform and a staking service, aimed at enhancing trading options and passive income opportunities.\nAs merchants increasingly embrace cryptocurrencies, the future holds promise for crypto wallets to evolve into versatile virtual cards, bridging the gap between digital and traditional fiat currencies. This evolution has the potential to significantly lower adoption barriers, making digital assets as accessible as conventional money.\nAs crypto usage expands, multifunctional wallets like Web3 Freewallet are expected to play a crucial role in driving broader adoption, seamlessly integrating digital assets into everyday financial activities worldwide.\nFeatured Image: Freepik @ produtizebro\nPlease See Disclaimer\n","create_date":"2024-04-22T18:32:03+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/microstrategy-reveals-plan-for-bitcoin-based-decentralized-identity-system-using-ordinals/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"MicroStrategy, known as the largest corporate holder of bitcoin, has announced its intention to develop a decentralized identity service utilizing Ordinals","title":"MicroStrategy Reveals Plan for Bitcoin-Based Decentralized Identity System Using Ordinals - CryptoCurrencyNews","content":" MicroStrategy, known as the largest corporate holder of bitcoin, has announced its intention to develop a decentralized identity service utilizing Ordinals inscriptions.\nEarlier this year, the software consulting firm rebranded itself as a “bitcoin development company,” emphasizing its commitment to advancing the Bitcoin network through various means such as financial markets, advocacy, and innovation. The unveiling of “MicroStrategy Orange” signifies the company’s dedication to realizing this objective.\nMicroStrategy Orange aims to offer decentralized identities that are “trustless, tamper-proof, and long-lived,” according to founder Michael Saylor. The service will enable users to issue decentralized identifiers (DIDs), ensuring pseudonymity similar to bitcoin transactions, which are not directly linked to real-world identities.\nLeveraging Bitcoin’s Ordinals Protocol, MicroStrategy Orange enables the storage and communication of information on individual satoshis, the smallest unit of bitcoin.\nMicroStrategy has already developed an application called “Orange For Outlook” using its decentralized identity service. This application integrates digital signatures into emails, allowing recipients to verify the identity of the sender securely.\nCurrently, MicroStrategy holds a substantial amount of bitcoin, totaling 214,400 BTC, which amounts to approximately $10 billion. This constitutes more than 1% of the total bitcoin supply that will ever exist.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-02T18:49:41+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/ether-gains-weekly-against-bitcoin-amid-btc-dominance-drop/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Ether has demonstrated strong performance against Bitcoin for two consecutive weeks, indicating a growing interest in altcoin gains following recent market","title":"Ether Gains Weekly Against Bitcoin Amid BTC Dominance Drop - CryptoCurrencyNews","content":" Ether has demonstrated strong performance against Bitcoin for two consecutive weeks, indicating a growing interest in altcoin gains following recent market developments, according to analysts at Bitfinex. Despite bitcoin’s halving event, ether recorded a notable 7.5% increase in its trading pair with BTC, marking its most significant weekly gain against bitcoin since early January.\nBitfinex’s Alpha report underscored ether’s resilience, even amidst regulatory challenges. Concerns regarding the potential SEC classification of ether as security and scrutiny over the Metamask software have raised uncertainties in the market. Nevertheless, ether’s ability to outpace bitcoin suggests a shifting sentiment among investors and market dynamics within the altcoin space.\nThe decline in bitcoin dominance further supports this narrative, with attention gradually shifting towards altcoins following the halving event. Historically, such events have prompted a surge in altcoin activity, leading to a decline in Bitcoin’s dominance. Currently, bitcoin’s dominance stands at 50.5%, while ether commands a dominance of 15.9%, according to Coingecko data.\nMeanwhile, early Monday trading saw a significant depreciation in the Japanese yen, prompting bitcoin to trade at a slight premium against the weakening currency. On the Japanese crypto exchange bitFlyer, the bitcoin-Japanese yen pair traded at a 0.2% premium to bitcoin’s dollar-denominated price on Coinbase. However, as the yen rebounded amidst speculation of intervention by the Bank of Japan, the BTC/JPY pair retreated to trade at 9,797,502 JPY at the time of reporting.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T21:31:06+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/elon-musk-expands-dogecoin-use-at-tesla-plans-x-platform-integration/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Elon Musk has been a vocal advocate of Dogecoin since his initial tweet in 2019, and his recent actions suggest he’s gearing up to expand DOGE’s utility","title":"Elon Musk Expands Dogecoin Use at Tesla, Plans X Platform Integration - CryptoCurrencyNews","content":" Elon Musk has been a vocal advocate of Dogecoin since his initial tweet in 2019, and his recent actions suggest he’s gearing up to expand DOGE’s utility further into his business ventures. Notably, Tesla, Inc. (NASDAQ:TSLA) has started accepting DOGE as payment for its merchandise, a move following Musk’s visit to the Berlin gigafactory where the idea gained traction. This quiet rollout on Tesla’s website saw the DOGE price surge over 20% shortly after enthusiasts noticed the update.\nIn parallel, Musk’s social media platform, X, previously known as Twitter, is also setting the stage for broader cryptocurrency use. X has been actively acquiring payment licenses across the U.S., now holding 25, with more expected. This development is crucial for facilitating peer-to-peer transactions akin to those on Venmo or Cash App, paving the way for potential DOGE integration.\nMusk’s interest in integrating DOGE into X was hinted at in a retweet he made, featuring a comparison of the old and current X.com logos and the caption “The Everything App.” This retweet, originally posted by a user associated with DOGE’s UX/UI design, suggests a full-circle vision for Musk’s involvement in online payments, tracing back to his early career at X.com, which later evolved into PayPal(NASDAQ:PYPL).\nWhile the roadmap towards DOGE integration on X appears promising, it faces regulatory challenges. Despite these hurdles, Musk’s efforts to acquire the necessary licenses indicate a strong commitment to transforming X into an ‘everything app’ and possibly making DOGE a key element of this transformation.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-09T20:40:19+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/us-bitcoin-etfs-daily-outflow-hits-120m/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Total net outflows from 11 U.S. spot bitcoin ETFs reached $120 million on Wednesday, with eight products recording zero flows, a trend deemed normal by","title":"US Bitcoin ETFs: Daily Outflow Hits $120M - CryptoCurrencyNews","content":" Total net outflows from 11 U.S. spot bitcoin ETFs reached $120 million on Wednesday, with eight products recording zero flows, a trend deemed normal by analysts.\nGrayscale’s GBTC witnessed $130.42 million exiting the converted bitcoin ETF, while Fidelity and Ark Invest’s funds were the sole recipients of inflows, totaling approximately $10 million. Among the eight funds with zero flows were BlackRock’s IBIT and Bitwise’s BITB, with IBIT ending its 71-day positive streak on Wednesday.\nAccording to Rachael Lucas, a crypto analyst at BTC Markets, days with zero inflows are typical and do not necessarily indicate product failure. She suggests that such occurrences often align with market performance and geopolitical tensions, underscoring the complexities beyond ETF flows.\nJoe Caselin, head of institutional marketing at BIT crypto exchange, echoes this sentiment, stating that zero flows in an ETF are not unusual but may signify a cooling down of ETF excitement. He emphasizes the gradual integration of fiat into the Bitcoin narrative, anticipating fresh inflows to occur intermittently as traditional finance gradually merges with crypto.\nBloomberg ETF Analyst James Seyffart previously explained that ETF shares are created or destroyed in units, a process triggered by significant disparities in supply and demand. This phenomenon explains why zero flows are commonly observed in such products.\nThe Block ETF data dashboard reports that the cumulative trading volume for all 11 spot Bitcoin ETFs is approaching $230 billion.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T22:09:34+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/sec-warns-robinhood-over-crypto-operations/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Robinhood Markets Inc. (NASDAQ:HOOD) disclosed in a regulatory filing on Monday that it has received a formal warning from regulators regarding potential","title":"SEC Warns Robinhood Over Crypto Operations - CryptoCurrencyNews","content":" Robinhood Markets Inc. (NASDAQ:HOOD) disclosed in a regulatory filing on Monday that it has received a formal warning from regulators regarding potential enforcement action related to its cryptocurrency operations.\nThe warning, known as a Wells notice from the US Securities and Exchange Commission, specifically pertains to Robinhood Crypto and various aspects of its cryptocurrency business, including listings, custody procedures, and platform operations.\nAccording to the filing, the SEC’s staff informed Robinhood that they have made a “preliminary determination” to recommend that the SEC pursue enforcement action against the company.\nPotential outcomes of this action could include an injunction, a cease-and-desist order, disgorgement of profits, and other penalties or restrictions on business activities.\nRobinhood stated that it had previously received a subpoena related to the investigation and has cooperated with the SEC throughout the process.\nIt’s important to note that a Wells Notice provides the company with an opportunity to respond to the SEC’s allegations, and the issuance of such a notice does not necessarily guarantee that enforcement action will ultimately be taken.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-06T15:36:32+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/polymarket-raises-45m-in-series-b-led-by-peter-thiel-and-vitalik-buterin/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Polymarket, a cryptocurrency-based prediction market platform, has successfully raised $45 million in a Series B funding round amid a surge in popularity","title":"Polymarket Raises $45M in Series B Led by Peter Thiel and Vitalik Buterin - CryptoCurrencyNews","content":" Polymarket, a cryptocurrency-based prediction market platform, has successfully raised $45 million in a Series B funding round amid a surge in popularity leading up to the U.S. presidential election. The round was led by Peter Thiel’s Founders Fund, with notable contributions from Ethereum’s creator Vitalik Buterin, 1confirmation, ParaFi, and Dragonfly Capital, according to Polymarket founder Shayne Coplan, who communicated with CoinDesk via Telegram. The company’s valuation in this round was not disclosed.\nThis latest investment follows a previously undisclosed $25 million Series A funding round led by General Catalyst and includes a $4 million seed round from 2020, bringing Polymarket’s total raised funds to over $70 million. To support its next growth phase, Polymarket has appointed Richard Jaycobs as the head of market expansion, who previously held executive roles at traditional finance firms, including President of Cantor Exchange and CEO of The Clearing Corporation.\nPolymarket is recognized as a leading platform for building prediction markets on cryptocurrency infrastructure. In these markets, participants place bets on the outcomes of real-world events within a specified timeframe, ranging from sports games to political events. For instance, a current market on Polymarket is gauging whether the U.S. Securities and Exchange Commission will approve a spot exchange-traded fund for Ethereum by May 31, with “Yes” shares trading at 16 cents, suggesting a 16% probability of approval.\nThese markets are touted not just as gambling venues but as tools for gaining a more accurate understanding of public sentiment and providing more reliable forecasts than traditional polls and punditry, a standpoint long advocated by economist Robin Hanson.\nDespite a regulatory setback in 2022 that barred Polymarket from serving U.S. residents under a Commodity Futures Trading Commission settlement, the platform continues to see significant betting activity. This year alone, $202 million has been wagered on various events, with over $125 million staked on the presidential election. This exclusion from the U.S. market contrasts with Kalshi, the only CFTC-regulated prediction market, which faces potential regulatory challenges from the CFTC’s recent proposals to ban election-related bets, a rule that would not affect Polymarket.\nFeatured Image: Wikipedia\nPlease See Disclaimer\n","create_date":"2024-05-14T17:12:04+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/block-expands-bitcoin-mining-with-3nm-chip/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Jack Dorsey's company Block(NYSE:SQ), formerly known as Square, has broadened its Bitcoin mining ambitions by transitioning from chip design to developing a","title":"Block Expands Bitcoin Mining with 3nm Chip - CryptoCurrencyNews","content":" Jack Dorsey’s company Block(NYSE:SQ), formerly known as Square, has broadened its Bitcoin mining ambitions by transitioning from chip design to developing a comprehensive mining system.\nIn a recent blog post, Block revealed its achievement in creating a standalone three-nanometer Bitcoin mining chip and announced collaboration with a prominent global semiconductor foundry to finalize the chip’s design.\nBeyond chip development, Block plans to extend its efforts to include system design, aiming to address challenges faced by Bitcoin miners and decentralize hardware supply and hashrate distribution.\nThe project seeks to overcome obstacles such as limited availability and high costs of mining rigs, while improving user experience and operational reliability.\nAlthough specific details about the mining system are limited, Dorsey had previously hinted at a “Bitcoin mining system based on custom silicon” and emphasized the importance of vertical integration and diversification in silicon design.\nThis development follows the recent Bitcoin halving, which reduced new Bitcoin issuance. Dorsey’s vision extends beyond Bitcoin generation, as Block’s venture arm supports Gridless, a company operating Bitcoin mines powered by renewable energy in Kenya, Malawi, and Zambia.\nGridless utilizes innovative methods, such as solar power and geothermal energy, to power its operations and provide electricity to rural areas. With six mines across multiple countries, Gridless demonstrates the potential for Bitcoin mining to drive renewable energy adoption and incentivize sustainable development.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T18:33:06+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/stablecoin-supply-surges-to-near-two-year-high-amid-usde-decline/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The total supply of USD-pegged stablecoins has soared to $165 billion, reaching its highest level in almost two years as new tokens flood the market,","title":"Stablecoin Supply Surges to Near Two-Year High Amid USDe Decline - CryptoCurrencyNews","content":" The total supply of USD-pegged stablecoins has soared to $165 billion, reaching its highest level in almost two years as new tokens flood the market, intensifying competition. Ethena’s USDe stablecoin, with a market cap of around $2.4 billion, has contributed to this growth, stabilizing the market at its current level.\nThis milestone, achieved last Thursday, reflects a significant uptick in stablecoin supply since late June 2022, nearing the previous all-time high of over $180 billion. While Tether’s USDT and Circle’s USDC remain dominant, the stablecoin market is diversifying with new entrants. USDT maintains a commanding 70% market share, according to DeFiLlama data.\nThe emergence of Ethena’s stablecoin launched just over two months ago, and PayPal’s collaboration with Paxos for its stablecoin introduction in August 2023, have contributed to the expanding stablecoin landscape. Ripple’s recent announcement of its plans to launch a USD-pegged stablecoin further underscores the market’s growth potential. Ripple forecasts the total stablecoin market to skyrocket to $2.8 trillion by 2028.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-22T19:10:41+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitcoin-mining-slows-down-after-halving-affecting-revenues/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin mining companies are reducing their operational scale as revenues have significantly decreased, following a recent industry adjustment known as the","title":"Bitcoin Mining Slows Down After Halving, Affecting Revenues - CryptoCurrencyNews","content":" Bitcoin mining companies are reducing their operational scale as revenues have significantly decreased, following a recent industry adjustment known as the “halving,” according to a May 13 Coinshares report. The Bitcoin network’s seven-day rolling average hash rate, which measures the computing power used to mine Bitcoin, showed a sharp decline from an all-time high of approximately 650 exahashes per second (EH/s) on April 19 to 586 EH/s by May 11.\nThe halving event, which occurred on April 19, cut the reward for mining a block of Bitcoin from 6.25 BTC to 3.125 BTC, effectively slashing the miners’ revenue by nearly half. This reduction has forced miners to adopt cost-cutting measures such as optimizing energy expenditures, enhancing mining efficiency, and securing better terms for hardware procurement.\nDespite these challenges, CoinShares’ analysis based on Q4 2023 figures suggests that publicly listed Bitcoin mining firms, like Marathon Digital Holdings Inc. (NASDAQ:MARA) and Riot Platforms Inc. (NASDAQ:RIOT), are still profitable, with the average production cost per Bitcoin estimated at $53,000, while Bitcoin traded at $63,000 on Monday. However, profitability has diminished compared to pre-halving levels.\nAdditionally, new Bitcoin applications such as Ordinals and Runes have increased on-chain activity and network transaction fees, offering another revenue stream for miners. According to Ki Young Ju, CEO of CryptoQuant, transaction fees now constitute 7% of miner revenue, a significant increase from 1% two years ago. This change reflects the evolving landscape and adaptation strategies within the Bitcoin mining industry.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-13T21:05:03+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/secs-postponement-of-spot-ether-etf-approval-hits-crypto-etfs-amid-market-decline/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The cryptocurrency market encountered challenges this week, particularly impacting crypto Exchange-Traded Funds (ETFs). The theme of cryptocurrency investment","title":"SEC's Postponement of Spot Ether ETF Approval Hits Crypto ETFs Amid Market Decline - CryptoCurrencyNews","content":" The cryptocurrency market encountered challenges this week, particularly impacting crypto Exchange-Traded Funds (ETFs). The theme of cryptocurrency investment witnessed an overall decline of 5.99%, reflecting setbacks in major cryptocurrencies. Bitcoin retreated by 2.25%, slipping below the $70,000 mark, while Ethereum faced an even steeper decline, plummeting by 6.5%.\nThe recent setback stemmed from actions by the U.S. Securities and Exchange Commission (SEC). The regulatory body initiated a three-week comment period regarding proposals for spot Ether ETFs, effectively postponing any possibility of approval until at least May. This delay subdued investor optimism, especially among those expecting prompt approvals for spot ETFs representing direct investments in cryptocurrencies, as opposed to derivatives.\nParticular crypto ETFs bore the brunt of these developments. The Ether Tracker Euro ETC (ETHEREUM XBTE) and the 21Shares Ethereum Staking ETP (AETH) experienced declines of 7.96% and 7.63%, respectively. These setbacks highlight the heightened sensitivity of crypto ETFs to regulatory decisions and market sentiment as investors navigate the uncertain landscape of cryptocurrency regulations and their implications for spot ETFs.\nThe SEC’s decision to postpone approvals for spot ETFs has cast a shadow over the future of Ether ETFs, temporarily halting the momentum that had been building in anticipation of broader institutional acceptance. While these ETFs offer a regulated avenue for investors to gain exposure to cryptocurrencies, the path forward appears to be mired in regulatory uncertainty, impacting both investor sentiment and ETF performance.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-09T15:16:23+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/dogecoin-co-founder-doubts-sec-approval-of-spot-ether-etf/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The US Securities and Exchange Commission has yet to decide on spot Ethereum exchange-traded funds. On May 16, Billy Markus, co-founder of Dogecoin, expressed","title":"Dogecoin Co-Founder Doubts SEC Approval of Spot Ether ETF - CryptoCurrencyNews","content":" The US Securities and Exchange Commission has yet to decide on spot Ethereum exchange-traded funds. On May 16, Billy Markus, co-founder of Dogecoin, expressed his doubts about their approval, suggesting that the SEC is “compromised” and may reject the ETFs.\nMarkus made his skeptical comment in response to a social media post discussing the importance of spot Ether ETFs for the ecosystem and the potential impact of a negative decision on Ethereum. He tweeted, “nothing good will come out” of the spot ETH ETF application.\nMarkus’ comment reflects a broader pessimism about the SEC’s ability to make fair and unbiased decisions regarding Ethereum and cryptocurrency. Despite his skepticism, he believes the regulator’s decision on spot Ether ETFs won’t negatively impact Ethereum’s trajectory or the cryptocurrency market as a whole. This sentiment echoes the prevalent skepticism surrounding spot Ethereum ETFs.\nRecently, finance lawyer Scott Johnsson suggested that Ethereum’s legal classification will play a crucial role in the upcoming ETF decisions, highlighting a key distinction in the SEC’s approach to Bitcoin and Ethereum. While Bitcoin’s security status wasn’t a major focus during spot ETF filings, Ethereum’s classification is receiving more regulatory scrutiny, indicating a shift in focus for digital assets.\nThe upcoming decision dates for VanEck and ARK Invest’s applications for Ethereum ETFs, scheduled for May 23 and May 24, respectively, have sparked intense speculation within the crypto industry. The potential approval of Ethereum ETFs carries symbolic importance, solidifying crypto’s legitimacy as an asset class and reaffirming its role in the evolving financial industry.\nThe SEC’s recognition of Ethereum’s non-security status, demonstrated by the approval of an Ethereum futures ETF for trading in October 2023, established a clear precedent for the approval of a spot Ethereum ETF. Experts believe any deviation from this path would create regulatory uncertainty and weaken market confidence.\nHong Kong’s approval of spot Bitcoin and Ethereum ETFs, as well as their trading, underscores the increasing global acceptance and recognition of the potential of Ethereum-based financial instruments.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-16T18:08:04+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/layerzero-begins-snapshot-for-airdrop-teases-future-drops/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"LayerZero has taken a snapshot as it gears up for its anticipated airdrop, scheduled for the first half of 2024. A snapshot typically precedes outflows as","title":"LayerZero Begins Snapshot for Airdrop, Teases Future Drops - CryptoCurrencyNews","content":" LayerZero has taken a snapshot as it gears up for its anticipated airdrop, scheduled for the first half of 2024. A snapshot typically precedes outflows as investors participating in airdrops often redistribute liquidity to other projects.\nDevelopers of the cross-chain interoperability protocol hinted at additional airdrops in the pipeline, signaling ongoing developments within the ecosystem. The recent snapshot, labeled as “snapshot #1,” marks the first step in a series of planned airdrops.\nLayerZero stands out as a protocol facilitating blockchain connectivity without relying on intermediaries. Currently utilized by platforms like Stargate and Radiant Capital, both experienced modest token gains following the confirmation of the snapshot.\nIn April, LayerZero secured $120 million in a Series B funding round, valuing the company at $3 billion. Notable investors in the round included Andreessen Horowitz and Sequoia Capital, indicating strong support for LayerZero’s vision.\nAs snapshots pave the way for potential outflows, investors utilizing protocols for airdrop allocations can strategically allocate liquidity to maximize their participation in various projects. Recent data from DefiLlama indicates a net outflow of $5 million from the Stargate bridge in the last 24 hours, with $43 million deposited and $48 million withdrawn.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-02T20:32:30+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/mpch-and-canopius-collaborate-to-boost-crypto-asset-insurance/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"MPCH, a provider of cryptographic storage solutions, has partnered with global specialty and property and casualty reinsurer Canopius to deliver enhanced","title":"MPCH and Canopius Collaborate to Boost Crypto Asset Insurance - CryptoCurrencyNews","content":" MPCH, a provider of cryptographic storage solutions, has partnered with global specialty and property and casualty reinsurer Canopius to deliver enhanced insurance coverage for digital assets held in custody. This new collaboration seeks to bolster the security framework for digital assets by offering specialized custody insurance, further protecting against potential losses or damages to crypto assets that could render them irrecoverable.\nMPCH utilizes advanced cryogenic cold storage solutions equipped with Sensitive Compartmented Information Facilities, custom Hardware Security Modules designed based on zero-trust and zero-knowledge principles, and Multi-Party Computation technology. Canopius brings its insurance expertise into the partnership, offering products that are tailored to address the unique risks associated with digital asset security.\nMiles Parry, CEO of MPCH, commented on the partnership, stating, “Our collaboration with Canopius is a significant milestone in the evolution of security within the tokenized ecosystem. By combining our advanced cryptographic storage capabilities with Canopius’s robust insurance solutions, we are better equipped to protect sensitive digital assets and provide our clients with the confidence they need to operate in the digital world. Our aim is to deliver scalable, customized insurance solutions that effectively address the challenges of protecting private keys.”\nThis announcement follows Canopius’s recent initiative to enhance its cyber insurance offerings in collaboration with Group-IB, and the launch of a new insurance facility by Marsh in March, which provides up to $825 million in coverage for digital asset custodians globally, covering various custody solutions including both cold storage and other methods.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-07T16:45:24+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-achieves-all-time-low-inflation-rate-post-halving/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin's inflation rate has plummeted to a historic low of approximately 1.74% following the recent Bitcoin halving. With 93.3% of Bitcoin already mined,","title":"Bitcoin Achieves All-Time Low Inflation Rate Post-Halving - CryptoCurrencyNews","content":" Bitcoin’s inflation rate has plummeted to a historic low of approximately 1.74% following the recent Bitcoin halving. With 93.3% of Bitcoin already mined, amounting to 19.6 million out of a possible 21 million BTC, the scarcity element is poised to escalate demand, potentially propelling the leading cryptocurrency’s price surge. In contrast, fiat currencies grapple with higher inflation rates due to governmental controls and economic policies. For instance, in 2023, countries like Argentina encountered exceptionally high inflation rates, hitting 161.0%, as per Inflation Data. The European Union reported more moderate levels, with the euro area’s annual inflation rate at 2.9% in December 2023.\nThe recent halving event is anticipated to further diminish Bitcoin’s inflation rate, impacting both its scarcity and investor sentiment. The trend suggests that each halving event, which halves the reward for mining new blocks, tends to bolster buyer interest due to reduced supply growth.\nAccording to a report from CoinGecko, historical data reveals a consistent trend of significant growth in Bitcoin prices following each halving event. Following the first halving in 2012, Bitcoin’s price surged by an impressive 8,858%. Subsequent halvings witnessed diminishing returns, with increases of 294% and 540% respectively, yet the pattern of price spikes post-halving remains discernible. These events not only affect Bitcoin but also resonate across other leading cryptocurrencies, such as Ethereum, albeit with varying impacts due to differing supply mechanisms.\nThe completion of the fourth halving has triggered speculation within the cryptocurrency community regarding short-term market dynamics. Recently, Bitwise noted that while the month immediately following the halving typically witnesses a modest price decline, the subsequent year often heralds exponential gains. After the 2012 halving, Bitcoin experienced a meager 9% increase in the month post-halving, only to soar by a staggering 8,839% over the following year. Similar patterns were observed after the 2016 and 2020 halvings, with Bitcoin’s price witnessing significant surges in the year following each event.\nBitcoin’s market cap fluctuations around halving events provide valuable insights into consumer behavior during these critical periods. Initially pegged at $123.3 million during the first halving, the market cap swiftly surged to $947.4 million shortly thereafter.\nSimilar patterns were observed in subsequent halvings, reflecting a tendency among Bitcoin holders to speculate around halving events, often opting to hold onto their assets in anticipation of value increases. The analysis of pre-and post-halving periods suggests a strong inclination toward holding Bitcoin, deemed to become more valuable as future supply constraints tighten post-halving.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T21:45:16+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitgert-coin-crypto-experts-anticipate-a-potential-500-price-surge/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"As the crypto market experienced a bearish correction, experts forecasted a subsequent bullish phase. Now, with the market correction underway, leading asset","title":"Bitgert Coin: Crypto Experts Anticipate a Potential +500% Price Surge - CryptoCurrencyNews","content":" As the crypto market experienced a bearish correction, experts forecasted a subsequent bullish phase. Now, with the market correction underway, leading asset Bitcoin has surpassed $63,000, signaling a resurgence in momentum for other coins.\nAmong these coins, Bitgert exchange has stood out, demonstrating resilience during bearish phases and steadily gaining traction. Leveraging its layer 1 technology, Bitgert has captured the attention of the crypto market, attracting a growing number of investors.\nSo, what factors are driving the potential price surge for Bitgert?\nBitgert distinguishes itself as a layer 1 chain crypto project with unparalleled transaction speed and cost-effective gas fee structures. Its innovative use of the Proof of Authority Model (POA) ensures seamless user experiences, scalability, and blockchain security, positioning it ahead of top cryptocurrencies like Ethereum, Tron, and Cardano.\nOperating on a dual network, Bitgert offers diverse capabilities, including a Bitgert exchange, trading fee CEX, payment gateway, p2p exchange, and startup studio. The startup studio initiative empowers new ventures, facilitating fundraising through public and private sales. Furthermore, Bitgert’s integration with the Ethereum virtual machine provides developers with opportunities to host projects and build dApps.\nWith a robust community of over 600,000 members, Bitgert has fostered widespread adoption and collaborations across social media platforms. Strategic marketing initiatives, promotions, and engagement efforts have sustained Bitgert’s growth, even during bearish market conditions.\nThe native token of Bitgert, BRISE coin, has demonstrated strong performance since its inception. With returns exceeding 40,000%, BRISE coin sets itself apart by implementing a burning model, where 12% of each transaction is burnt. This mechanism enhances scarcity and drives demand within the growing ecosystem.\nTechnical indicators for Bitgert coin are favorable, with RSI and moving convergence signaling potential growth of over 5000% in its price. This projected surge presents promising opportunities for new investors, entrepreneurs, and traders, marking a significant development in the crypto landscape.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-07T18:24:56+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/sharp-decline-in-bitcoin-rune-etchings-hits-miner-revenues/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The Bitcoin network witnessed a steep 99% drop in daily Rune etchings, plummeting to just 157 Runes on Monday from a high of 14,700 in late April, as reported","title":"Sharp Decline in Bitcoin Rune Etchings Hits Miner Revenues - CryptoCurrencyNews","content":" The Bitcoin network witnessed a steep 99% drop in daily Rune etchings, plummeting to just 157 Runes on Monday from a high of 14,700 in late April, as reported by Dune Analytics. This significant decline in the activity of the Rune etchings, which are part of a fungible token protocol, has dramatically decreased transaction fee income for Bitcoin miners.\nOn April 26, the network recorded a peak of 23,061 Rune etchings, but the recent slump has resulted in transaction fees from these etchings dropping to a mere US$3,835 on Monday. Despite this downturn, Rune transactions have remained a dominant force in Bitcoin network activity to date, with over 91,200 Runes etched on the Bitcoin blockchain.\nThe Runes protocol was launched on April 20, initially providing a substantial boost to miners’ earnings by generating significant transaction fees. This was particularly beneficial following the fourth Bitcoin halving event, which reduced the block subsidy to 3.125 BTC but was offset by increased transaction volumes from Rune etchings.\nDeveloped by Ordinals creator Casey Rodarmor, the Runes protocol aims to efficiently utilize block space for creating fungible tokens, adhering to Bitcoin’s unspent transaction output (UTXO) model, offering a more streamlined approach compared to BRC-20s. However, some Bitcoin core developers have expressed concerns, criticizing the Runes protocol for potentially exploiting vulnerabilities within the Bitcoin network.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-14T16:55:57+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/runes-dominate-68-of-post-halving-bitcoin-transactions/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Runes, resembling BRC-20s, emerge as a significant protocol utilizing the Bitcoin network, claiming a substantial 68% share in Bitcoin transactions since the","title":"Runes Dominate 68% of Post-Halving Bitcoin Transactions - CryptoCurrencyNews","content":" Runes, resembling BRC-20s, emerge as a significant protocol utilizing the Bitcoin network, claiming a substantial 68% share in Bitcoin transactions since the halving. However, Bitcoin miners face diminishing returns amidst this surge.\nSimilar to BRC-20s, Runes operates by compensating fees in Bitcoin to mint new tokens. Differing from Ordinals’ “inscription” account model, Runes utilizes the Unspent Transaction Output (UTXO) framework to imprint new tokens on the Bitcoin network. This methodology enables users to allocate unique identification numbers to individual satoshis, embedding them with diverse data directly into the Bitcoin blockchain.\nSince its inception on April 20th, Runes has processed over 2.38 million transactions, as per data from a Dune Analytics dashboard shared by Crypto Koryo, a blockchain research firm. Pitted against Ordinary peer-to-peer Bitcoin transactions, BRC-20s, and Ordinals, Runes accounts for a significant portion of the total Bitcoin transaction volume.\nOn April 23rd, Runes witnessed its peak transaction volume, exceeding 750,000 transactions. However, the subsequent day witnessed a notable decline, with transactions dwindling to 312,000.\nMuch of the initial fervor stemmed from the halving event at block 840,000, where users vied for prime digital real estate in Bitcoin’s history, utilizing the Runes protocol to imprint “rare satoshis” on the block. Consequently, Runes contributed over $2.4 million in miner fees, constituting over 70% of the total fees on halving day.\nAmidst declining mining rewards post-halving, from 6.25 BTC to 3.125 BTC, Runes Protocol was initially touted as a lifeline for struggling miners, offering a new avenue for income. Pseudonymous Ordinals developer Leonidas stated, “Runes degens have single-handedly offset the drop in miner rewards from the halving.” However, the sustainability of this assertion has been questioned, given the fluctuating daily total fees post-halving, ranging between 33% and 69%.\nCommunity sentiment remains divided regarding whether Runes can provide a stable revenue stream for Bitcoin miners. Notably, the Bitcoin Miners’ Position Index (MPI) fluctuated between -1 to -0.15 post-halving, suggesting no significant movement in miners’ Bitcoin holdings and indicating no imminent sell-off.\nWhile Runes may face challenges in sustaining its momentum, recent groundbreaking developments offer potential alternative revenue streams to mitigate the impact of the halving on miners.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T21:36:08+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/wisconsin-investment-board-discloses-163m-in-bitcoin-etfs/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"In a recent 13F filing with the Securities and Exchange Commission, the State of Wisconsin Investment Board disclosed substantial investments in various","title":"Wisconsin Investment Board Discloses $163M in Bitcoin ETFs - CryptoCurrencyNews","content":" In a recent 13F filing with the Securities and Exchange Commission, the State of Wisconsin Investment Board disclosed substantial investments in various crypto entities, marking a significant foray into the digital asset space.\nThe Board revealed ownership of 2,450,400 shares of the iShares Bitcoin Trust (IBIT), a spot bitcoin exchange-traded fund managed by BlackRock, valued at approximately $99.2 million by the end of the first quarter of 2024. Additionally, the Board disclosed ownership of 1,013,000 shares of the Grayscale Bitcoin Trust (GBTC), valued at around $63.7 million.\nAside from bitcoin trusts, the Board’s crypto portfolio includes investments in leading cryptocurrency firms such as Coinbase, Marathon Digital, Riot Platforms, Block, Cipher Mining, Cleanspark, and MicroStrategy.\nThis significant move by the State of Wisconsin Investment Board underscores the growing institutional interest in digital assets. The Board, tasked with managing investments for public retirement and other trust funds in Wisconsin, has joined the ranks of institutional investors embracing cryptocurrencies as part of their diversified investment strategies.\nBlackRock’s IBIT and Grayscale’s GBTC are prominent players in the spot bitcoin ETF market, commanding significant market share. The Board’s substantial investment in these ETFs reflects its confidence in the long-term potential of cryptocurrencies as an asset class.\nCommentary from Bloomberg’s ETF analyst highlights the swift adoption of spot bitcoin ETFs by institutional investors. The Board’s quick entry into IBIT signals a departure from the usual timeline for institutional adoption, indicating growing confidence in the maturity and liquidity of crypto ETFs.\nIBIT’s rapid growth and surpassing of previous ETF records underscore its significance in the evolving investment landscape. As institutional investors continue to explore opportunities in digital assets, the trajectory of spot bitcoin ETFs like IBIT will likely shape the future of crypto investment strategies.\nFeatured Image- Freepik\nPlease See Disclaimer\n","create_date":"2024-05-14T19:15:06+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/coinbase-q1-earnings-surge-to-1-6-billion/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Coinbase announced a remarkable first quarter, with revenue reaching $1.6 billion, marking a substantial 72% increase from the previous quarter and a","title":"Coinbase Q1 Earnings Surge to $1.6 Billion - CryptoCurrencyNews","content":" Coinbase announced a remarkable first quarter, with revenue reaching $1.6 billion, marking a substantial 72% increase from the previous quarter and a significant rise from $736 million in the same period last year. The company also reported a notable swing in net income, posting $1.18 billion for the quarter compared to a loss of $79 million in the previous year’s corresponding period. Additionally, Coinbase generated $1.01 billion in EBITDA, surpassing expectations with earnings of $4.04 per share, exceeding the consensus estimate of $1.15 per share.\nThe surge in revenue reflects Coinbase’s strategic investments in product expansion, operational discipline, and favorable market conditions, according to the company’s earnings statement. Notably, the company observed increased market share in US spot and derivatives, achieving all-time highs on Coinbase Prime, and witnessing growth in USDC market capitalization.\nTransaction revenue for both consumer and institutional clients experienced a substantial uptick, totaling $1.08 billion for the quarter. Institutional transaction revenue notably grew by 113% from the previous quarter to $85 million. Coinbase’s consumer-facing business remained its primary revenue stream, generating $935.2 million from consumer transactions. The company also reported growth in user numbers alongside revenues collected from its subscription service.\nLooking ahead, Coinbase anticipates continued growth, stating that it generated over $300 million of total transaction revenue in April, with expectations for Q2 subscription and services revenue to fall within a range of $525-$600 million.\nDespite surging nearly 9% in regular trading, Coinbase shares dipped about 3% in after-hours trading to $222 as of 4:32 p.m. ET. Nonetheless, Coinbase shares have seen a remarkable increase of nearly 50% over the past year.\nFeatured Image: Megapixl\nPlease See Disclaimer\n","create_date":"2024-05-02T22:32:45+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/blackrocks-bitcoin-etf-sees-inflow-boom-end/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"For 71 consecutive days, BlackRock Inc.'s Bitcoin fund experienced an impressive streak, accumulating nearly $18 billion in one of the most significant","title":"BlackRock's Bitcoin ETF Sees Inflow Boom End - CryptoCurrencyNews","content":" For 71 consecutive days, BlackRock Inc.’s Bitcoin fund experienced an impressive streak, accumulating nearly $18 billion in one of the most significant exchange-traded fund launches in history. However, investor interest has waned as the fervor surrounding cryptocurrencies subsided.\nData compiled by Bloomberg reveals that daily inflows into the ETF, identified by the ticker IBIT, dwindled to virtually zero on Wednesday. Throughout April, IBIT has garnered a net inflow of $1.5 billion.\nIBIT’s achievement marks a notable shift in the crypto market sentiment, following the ETF-induced excitement that propelled Bitcoin to an all-time high of nearly $74,000 in March. Since then, the original cryptocurrency has declined by nearly 15%, and the much-anticipated “halving” event on April 20 failed to deliver an immediate boost.\nNevertheless, these new investment vehicles have left a significant mark on the crypto landscape. Collectively, they have attracted approximately $54 billion, introducing Bitcoin into the portfolios of potentially millions of investors. Hong Kong, positioning itself as a crypto-friendly jurisdiction, is preparing to debut its first listings of Bitcoin and Ether ETFs, with other markets likely to follow suit.\nDespite the halt in net inflows, IBIT is swiftly closing the gap on Grayscale Bitcoin Trust, the current market leader. On Wednesday alone, approximately $130 million flowed out of GBTC, bringing total outflows for the year to $17 billion, according to Bloomberg data.\nGBTC, identified by the ticker GBTC, imposes a management fee of 1.5%, the highest among the cohort of funds launched in early January. The launch of ETFs in Hong Kong may intensify the fee competition that has exerted pressure on GBTC.\nRebecca Sin, an ETF analyst at Bloomberg Intelligence, suggested that the launch of spot Bitcoin ETFs in Hong Kong, coupled with issuers waiving management fees, might lead to additional outflows, potentially indicating further changes in market dynamics.\nFeatured Image: Megapixl\nPlease See Disclaimer\n","create_date":"2024-04-25T21:57:01+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/vodafone-utilizes-sim-card-tech-for-mobile-crypto-surge/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Vodafone (NASDAQ:VOD)is gearing up to address the anticipated surge in cryptocurrency demand on mobile phones by leveraging SIM card technology. David Palmer,","title":"Vodafone Utilizes SIM Card Tech for Mobile Crypto Surge - CryptoCurrencyNews","content":" Vodafone (NASDAQ:VOD)is gearing up to address the anticipated surge in cryptocurrency demand on mobile phones by leveraging SIM card technology. David Palmer, the telecom giant’s blockchain lead, discussed with Yahoo Finance Future Focus how Vodafone is spearheading blockchain utilization on mobile devices to streamline crypto transactions.\nPalmer emphasized the integration of mobile phone SIM cards with digital wallets, identity management, and blockchains, utilizing the cryptography embedded in SIM cards for seamless blockchain integration.\nAnticipating a significant increase in blockchain-based digital wallets, Palmer projected that by 2030, there could be as many as 5.6 billion such wallets worldwide. He underscored their pivotal role as gateways to financial services.\nPalmer highlighted the adoption of public blockchains like ethereum, noting their enhanced speed and security. However, he acknowledged regulatory challenges, particularly in mainstream financial services due to sanctions.\nVodafone’s innovation in this realm includes the PairPoint Digital Asset Broker platform. This platform facilitates transactions between public and private blockchains, enabling seamless integration through smart contracts.\nThe PairPoint platform builds on Vodafone’s earlier experiments with peer-to-peer micro-payment transactions and the integration of SIM card technology with blockchain, introducing interoperable ‘digital identity passports’. These passports, anchored on the blockchain, securely store private keys to digital wallets within the SIM card’s hardware module.\nThis evolution led to the development of Vodafone’s Pairpoint platform, empowering internet of things devices with decentralized digital identities, enabling them to transcend organizational and system boundaries.\nPalmer illustrated potential scenarios where devices equipped with hardware wallets could autonomously authenticate and execute transactions, such as electric autonomous vehicles paying for charging at a station.\nDespite the promise of these advancements, Palmer cautioned about the imperative of securing these wallets against cyber threats, recognizing them as prime targets for hackers.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-03T16:11:07+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/paystands-defi-driven-acquisition-transforming-b2b-payments/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Paystand (NASDAQ:PAYS) has made a strategic move by acquiring spend management software startup Teampay, aiming to establish a \"no-fee B2B digital payment and","title":"Paystand's DeFi-Driven Acquisition: Transforming B2B Payments - CryptoCurrencyNews","content":" Paystand (NASDAQ:PAYS) has made a strategic move by acquiring spend management software startup Teampay, aiming to establish a “no-fee B2B digital payment and spend powerhouse.”\nWhile the financial terms of the deal were not disclosed, Teampay has successfully raised $65 million since its inception in 2016.\nThe merger brings together two entities servicing over 1 million businesses on a commercial blockchain, with a transaction volume exceeding $10 billion to date, representing close to 2% of annual U.S. business-to-business payments.\nJeremy Almond, CEO of Paystand, shared with TechCrunch that Teampay represents a new breed of fintech companies, offering innovative products to CFOs seeking to modernize their workflows. The acquisition aligns with Paystand’s vision of providing next-gen experiences to its customers amidst a significant modernization wave.\nMaintaining the Teampay brand is a strategic decision due to its established reputation in the market, according to Almond.\nThe acquisition of Teampay marks Paystand’s second in two years, following the purchase of payment platform Yaydoo in 2022. With a valuation surpassing $1 billion and $98 million in venture capital funding since its inception in 2014, Paystand aims to leverage Teampay’s capabilities to enhance both accounts receivable and accounts payable processes.\nAlmond emphasizes the trend of consumerization in the enterprise space, aiming to replicate the seamless payment experiences seen in consumer finance apps like Venmo and CashApp within the B2B realm.\nDespite fintech’s recent growth, the banking industry grapples with outdated payment rails, resulting in higher fees, increased intermediaries, and delays. Paystand addresses these issues by leveraging decentralized financial infrastructure powered by the Ethereum blockchain, offering zero-fee business-to-business payments through its Paystand Bank Network.\nAlmond believes that blockchain technology represents a paradigm shift away from traditional central banking systems, offering real value to businesses and finance teams. He asserts that the readiness of blockchain and decentralized finance networks lies in their ability to create tangible benefits for users.\nIn conclusion, Paystand’s acquisition of Teampay signifies a strategic move towards revolutionizing B2B payments within the decentralized finance landscape, offering businesses enhanced efficiency, reduced costs, and streamlined processes.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T20:14:41+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-transaction-fees-plummet-after-halving-event/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Bitcoin transaction fees have experienced a significant decline following the recent halving event, providing relief to users and miners alike.","title":"Bitcoin Transaction Fees Plummet After Halving Event - CryptoCurrencyNews","content":" Bitcoin transaction fees have experienced a significant decline following the recent halving event, providing relief to users and miners alike.\nInitially, after the halving, fees soared to unprecedented levels, reaching as high as $146 for medium-priority transactions and $170 for high-priority transactions.\nHowever, recent data from Mempool.space indicates a remarkable reduction in fees, with medium-priority transactions now costing $8.48 and high-priority transactions priced at $9.32.\nThis substantial decrease in transaction fees comes as a relief to Bitcoin users, who were facing exorbitant costs in the immediate aftermath of the halving.\nAdditionally, the hash price index, a metric reflecting miners’ potential earnings from a given amount of hash rate, has also declined significantly post-halving. This drop from $182.98 per hash/day to $81 indicates a substantial decrease in mining profitability.\nWhile miners had hoped that the introduction of the Runes protocol, designed to create fungible tokens on the Bitcoin blockchain, would offset revenue losses post-halving, initial results suggest otherwise.\nDespite expectations, floor prices for the Runes NFT collection have plummeted by nearly 50% in the last 24 hours, indicating a lack of significant activity and revenue generation from the protocol.\nIn contrast, ordinal collections like Bitcoin Puppets and NodeMonkes have seen increases in floor prices, highlighting the uncertainty surrounding the revenue potential of different NFT projects in the post-halving landscape.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-22T18:25:15+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/ftx-to-repay-most-clients-post-11-2-billion-debt-resolution/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"FTX has announced that almost all its customers will be reimbursed, just under two years after the cryptocurrency exchange's dramatic failure. In a recent","title":"FTX to Repay Most Clients Post $11.2 Billion Debt Resolution - CryptoCurrencyNews","content":" FTX has announced that almost all its customers will be reimbursed, just under two years after the cryptocurrency exchange’s dramatic failure. In a recent court filing, FTX disclosed it owes creditors approximately $11.2 billion, but has between $14.5 billion and $16.3 billion available for distribution.\nAccording to the documents submitted to the U.S. Bankruptcy Court for the District of Delaware, the plan not only covers full claims but also includes supplemental interest payments at a rate of 9%, assuming residual funds are available. This partial compensation might offer little solace to investors who suffered significant losses during the exchange’s collapse. When FTX filed for bankruptcy in November 2022, Bitcoin was valued at around $16,080. Since then, the price of Bitcoin has escalated to approximately $62,675, representing a substantial potential loss for those who might have retained their cryptocurrency investments.\nUnder the proposed plan, customers and creditors with claims up to $50,000 are set to receive about 118% of their claim value, covering nearly 98% of FTX customers. The ability to settle these claims comes from the successful liquidation of assets primarily associated with Alameda Research or FTX Ventures, as well as through litigation claims.\nAt its peak, FTX was the third-largest global cryptocurrency exchange. Its rapid downfall began with a financial crisis akin to a bank run, leading to bankruptcy filings in November 2022. Following the collapse, FTX’s founder and CEO Sam Bankman-Fried stepped down and was later sentenced to 25 years in prison in March for his role in the massive fraud at FTX.\nThe aftermath of the scandal also brought down several high-profile endorsements, including those from celebrities like Tom Brady and Stephen Curry. John Ray III, known for his work in the Enron bankruptcy, has since taken over as CEO of FTX, announcing plans to potentially revive the FTX.com exchange amidst exploring other strategic options.\nDespite the controversy, FTX’s new management remains optimistic, with Ray expressing satisfaction over the proposed chapter 11 plan that would fully satisfy non-governmental creditor claims with additional interest.\nMeanwhile, the saga of crypto mismanagement extends to Binance, the largest cryptocurrency exchange, whose former CEO Changpeng Zhao was recently sentenced to prison for allowing illicit activities through the platform. Binance had considered purchasing FTX just before its 2022 collapse but withdrew amid emerging financial issues.\nThe bankruptcy court is scheduled to review the FTX asset distribution plan on June 25, potentially turning a new page for the beleaguered exchange.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-08T17:14:52+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/block-leads-with-bitcoin-acquisition-program/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Led by CEO Jack Dorsey, payments firm Block (NYSE:SQ) has commenced a dollar cost averaging initiative to expand its substantial bitcoin reserves. Starting in","title":"Block Leads with Bitcoin Acquisition Program - CryptoCurrencyNews","content":" Led by CEO Jack Dorsey, payments firm Block (NYSE:SQ) has commenced a dollar cost averaging initiative to expand its substantial bitcoin reserves. Starting in April, the company allocated 10% of its monthly bitcoin-related gross profit to purchase additional bitcoin, intending to continue this practice throughout 2024.\nDuring the first quarter, Block reported $80 million in bitcoin gross profit. If this level persists for the remainder of the year, the company will accumulate approximately $24 million worth of bitcoin under this program, further bolstering its balance sheet.\nBlock already holds a significant amount of bitcoin, having acquired 4,709 bitcoins in October 2020 and an additional 3,318 tokens in early 2021. With bitcoin’s current price hovering around $59,000, these holdings are valued at approximately $4.7 billion.\nIn addition to this initiative, Block has released its Bitcoin Blueprint For Corporate Balance Sheets. This blueprint outlines the methodology behind its large-scale crypto acquisitions, detailing how the company acquires significant amounts of cryptocurrency without causing significant market fluctuations. It also elucidates Block’s processes for custody, insurance, and accounting of these holdings.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-03T16:37:30+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/thailand-to-block-unauthorized-crypto-platforms-for-local-users/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Thai SEC aims to block access to unauthorized cryptocurrency platforms to curb criminal use, emphasizing the importance of investor caution.","title":"Thailand to Block Unauthorized Crypto Platforms for Local Users - CryptoCurrencyNews","content":" In a bid to prevent the illicit use of cryptocurrency for money laundering, Thailand’s Securities and Exchange Commission (SEC) announced plans to block local access to unauthorized crypto platforms. Investors are urged to withdraw funds from such platforms as authorities move to restrict their operations.\nFollowing a meeting with a government committee on technology-related crimes, the SEC was tasked with identifying and submitting information on unauthorized digital asset service providers to the Ministry of Digital Economy and Society. Once approved by the courts, access to these platforms will be prohibited.\nWhile specific criteria for disqualifying platforms were not disclosed, the SEC provided a verification website to help investors assess legitimacy. Blocking access aligns with efforts to combat criminal activity, drawing parallels with similar actions taken in India and the Philippines.\nPreviously, the SEC initiated legal proceedings against unauthorized exchanges of Binance and Bybit. The agency emphasizes the risks associated with unregulated operators, highlighting the lack of legal protection and the potential for fraud.\nThis crackdown follows recent crypto-friendly measures by Thai authorities, including the extension of VAT exemption on crypto trading gains and permission for local institutions to invest in U.S. spot bitcoin exchange-traded funds.\nFeatured Image:\nPlease See Disclaimer\n","create_date":"2024-04-22T20:36:17+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/crypto-market-turmoil-altcoins-plunge-as-bitcoin-dips-below-63k/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"In a tumultuous turn of events, the cryptocurrency market saw a significant correction as Bitcoin (BTC) plummeted below the $67,000 mark, hitting a low of","title":"Crypto Market Turmoil: Altcoins Plunge as Bitcoin Dips Below $63k - CryptoCurrencyNews","content":" In a tumultuous turn of events, the cryptocurrency market saw a significant correction as Bitcoin (BTC) plummeted below the $67,000 mark, hitting a low of $62,460. At present, bullish sentiment is waning, with bears eyeing the $62,000 support level, potentially pushing Bitcoin below the $60,000 threshold.\nAltcoins bore the brunt of the downturn, experiencing declines ranging from 20% to 40% from recent highs. Investors scrambled to secure profits amidst the market turbulence, awaiting a stabilization period.\nData from Coinglass reveals that long positions suffered the most during this pullback. The relentless ascent of Bitcoin over the past few weeks led many traders to believe in a one-way trajectory, only to be met with a significant correction.\nMonday witnessed negative flows into spot Bitcoin exchange-traded funds (ETFs) for the first time since March 1, primarily due to a staggering $642.5 million outflow from Grayscale’s GBTC, marking its largest single-day outflow on record.\nAccording to Farside data, GBTC has witnessed total outflows surpassing $12.4 billion, while BlackRocks IBIT recorded inflows reaching $12.96 billion. Combined, these ETFs have seen a net flow of $12 billion, currently holding 836.6k BTC valued at approximately $53.1 billion.\nDespite skepticism from some quarters regarding the current bull cycle’s longevity, the looming halving, still over 30 days away, suggests otherwise. Historical trends indicate that peak cycles typically occur six to nine months post-halving.\nWhile ETF inflows have been notable, many investment advisors have yet to advocate for Bitcoin allocations to their clients. Grant Engelbart, Vice President and Investment Strategist for Carson Group, notes that only a few advisors have allocated to Bitcoin ETFs, with an average allocation of 3.5%.\nAnalysts anticipate the halving to serve as the next significant catalyst for Bitcoin and the broader crypto market, foreseeing sideways price movements until then.\nHenry Robinson, Co-founder and Head of Crypto at Decimal Digital Currency emphasizes Bitcoin’s evolving role as a vital institutional asset, driven by substantial weekly net inflows into new Bitcoin ETFs. He predicts further price surges in 2024, attributing them to reduced monthly BTC supply post-halving.\nRobinson views the recent correction as an opportunity for leveraged traders to reassess their positions, cautioning against overconfidence amid bullish sentiments. He underscores the growing sophistication and liquidity in the BTC market, thanks to ETFs, which are also educating traditional asset managers about Bitcoin’s potential.\nAs the market navigates through accumulation phases and price adjustments, Rekt Capital, a market analyst, advises newcomers to brace themselves for the volatility inherent in cryptocurrency bull markets.\nFeatured Image: Freepik @ produtizebro\nPlease See Disclaimer\n","create_date":"2024-03-19T17:04:35+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/bitcoin-etfs-show-record-discounts-signaling-stress/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Spot-Bitcoin exchange-traded funds (ETFs) are exhibiting signs of stress as the cryptocurrency market endures a downturn, with prices of major ETFs tracking","title":"Bitcoin ETFs Show Record Discounts, Signaling Stress - CryptoCurrencyNews","content":" Spot-Bitcoin exchange-traded funds (ETFs) are exhibiting signs of stress as the cryptocurrency market endures a downturn, with prices of major ETFs tracking Bitcoin witnessing significant discounts to their underlying asset values.\nFollowing a roughly 5% decline in Bitcoin’s price, several leading ETFs recorded their largest discounts on the value of underlying assets in their short trading history on Tuesday. The trend persisted on Wednesday as Bitcoin continued to drop, experiencing a decline of up to 5.6%.\nThe $16 billion iShares Bitcoin Trust (IBIT) closed approximately 1.7% below its net asset value on Tuesday, marking the largest dislocation since its inception in January. Similarly, the $9 billion Fidelity Wise Origin Bitcoin Fund (FBTC) and the $2.5 billion ARK 21Shares Bitcoin ETF (ARKB) both saw discounts exceeding 1.4%, the highest on record for each ETF. The $2 billion Bitwise Bitcoin ETF (BITB) also closed with a notable discount.\nJames Seyffart, an ETF analyst at Bloomberg Intelligence, noted that while the discounts are significant, they are not unprecedented in the context of ETF trading dynamics. However, the deviations underscore the challenges of integrating the traditional market with Bitcoin, where shares in ETFs can only be created and redeemed for cash rather than Bitcoin itself.\nAlthough price discrepancies in ETFs tend to be temporary due to the creation-redemption mechanism, Bitcoin’s volatility presents greater risks for ETF investors compared to traditional financial assets. Despite this, specialized trading firms, known as authorized participants, capitalize on such volatility to profitably maintain ETF prices in line with their net asset values.\nVirtu Financial Inc. CEO Douglas A. Cifu expressed confidence in sustained opportunities in crypto ETFs, citing the inherent volatility of the asset class. However, the uncertain macroeconomic environment, potentially influenced by Federal Reserve policy decisions, poses challenges for speculative assets like digital tokens.\nWhile hopes persist for increased institutional adoption of spot-bitcoin ETFs, the performance of Bitcoin remains intertwined with broader economic factors. As the Federal Reserve concludes its policy meeting, the outlook for rate cuts may further impact Bitcoin’s price trajectory and ETF discounts.\nMohit Bajaj, director of ETFs at WallachBeth Capital, acknowledged the possibility of ETF discounts persisting if Bitcoin’s downward trend continues, highlighting the uncertainty surrounding the cryptocurrency market.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-01T18:15:12+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/yearly-low-ethereums-gas-fees-drive-eth-burn/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Ethereum (ETH) witnessed a significant decline in daily ETH burned, hitting a yearly low primarily due to decreased gas fees. Gas fees currently range between","title":"Yearly Low: Ethereum's Gas Fees Drive ETH Burn - CryptoCurrencyNews","content":" Ethereum (ETH) witnessed a significant decline in daily ETH burned, hitting a yearly low primarily due to decreased gas fees. Gas fees currently range between 5 and 10 gwei, marking one of the lowest levels observed this year.\nThe Ethereum network experiences a notable decrease in the daily volume of ETH burned, reaching its lowest point this year, largely influenced by a recent decline in average gas fees. Presently, gas fees fluctuate between 5 and 10 gwei, representing one of the lowest levels recorded year-to-date and impacting ETH issuance.\nThe reduction in network fees translates to a decrease in ETH burned. On Sunday, only 610 ETH were burned, marking a record low for the year, while Ethereum’s gas fees remained minimal. In contrast, the daily volume of ETH burned during the first four months of this year consistently exceeded 2,500–3,000 ETH.\nThe ongoing decline in gas fees is attributed partly to a shift in activity towards Layer 2 scaling solutions and the increasing adoption of blob transactions introduced with the Dencun upgrade in March, which helps alleviate transaction costs on Layer 2s.\nThe dynamics of gas fees and ETH burning are closely monitored aspects of the network’s economic model. While low fees benefit network users, the recent decrease in ETH burn impacts Ethereum’s deflationary characteristics.\nThe London hard fork, also known as EIP-1559, implemented in August 2021, fundamentally altered Ethereum’s fee structure. The upgrade introduced a base fee that is burned and a priority fee acting as a tip to validators. As the base fee correlates with network usage, higher fees result in a greater amount of ETH being removed from circulation through burning.\nIn the past week, Ethereum’s supply has turned inflationary, with a growth rate of 0.49%, contrasting its previous deflationary trend, as reported by ultrasound.money. If activity surges and more ETH is burned than issued, Ethereum will return to a deflationary state.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-06T17:07:00+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/roaring-kitty-boosts-gamestop-stock-on-x/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Keith Gill, known as @TheRoaringKitty on X (formerly Twitter), recently sparked a significant rally in both meme coins and stocks, notably GameStop","title":"'Roaring Kitty' Boosts GameStop Stock on X - CryptoCurrencyNews","content":" Keith Gill, known as @TheRoaringKitty on X (formerly Twitter), recently sparked a significant rally in both meme coins and stocks, notably GameStop (NYSE:GME), after making his first post since late 2021. The post, a meme suggestive of an intense focus period, inspired users to surge into trading, propelling GameStop shares up by 44% in pre-market trading and even doubling during market hours before a trading halt. Similarly, AMC Entertainment Holdings (NYSE:AMC) saw its shares jump as much as 30% after the market opened.\nThis activity extended into the cryptocurrency sector, particularly on the Solana blockchain where a GameStop-themed meme coin surged over 550%. Other meme tokens like AMC rose by 1200%, and smaller cat-themed coins like kitty (KITTY) saw increases in the thousands of percent. Larger-cap meme coins like Dogecoin (DOGE) and Shiba Inu (SHIB) also enjoyed gains.\nGill, whose bullish stance on GameStop started gaining serious attention on Reddit in 2019, became a key figure in the January 2021 short squeeze that saw the stock skyrocket from $4 to over $120 in just one month, making his initial $53,000 investment worth nearly $50 million at its peak. This dramatic event impacted major hedge funds, notably Melvin Capital, which suffered significant losses due to its short positions in meme stocks.\nFeatured Image: Unsplash\nPlease See Disclaimer\n","create_date":"2024-05-13T22:24:48+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/south-korea-establishing-crypto-investigative-unit-amid-crime-surge/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"South Korea is taking proactive measures to address the surge in cryptocurrency-related crimes by considering the transformation of its temporary crypto-crime","title":"South Korea Establishing Crypto Investigative Unit Amid Crime Surge - CryptoCurrencyNews","content":" South Korea is taking proactive measures to address the surge in cryptocurrency-related crimes by considering the transformation of its temporary crypto-crime investigative unit into a permanent department, as per a local report. The nation witnessed a substantial increase in suspicious transaction reports from crypto companies, prompting the government to enhance its efforts in combating fraudulent activities.\nAccording to a report by Segye Ilbo, the Justice Ministry and the Ministry of the Interior and Safety are set to begin discussions in early May regarding the elevation of the Joint Virtual Asset Crime Investigation Unit to an official department. By formalizing the unit’s status, which currently operates under the Seoul Southern District Prosecutor’s Office, South Korea aims to bolster its effectiveness through the appointment of additional prosecutors and budget allocation.\nEstablished in July 2023, the unit comprises approximately 30 experts from seven financial and tax regulatory authorities, marking South Korea’s first dedicated investigative body focused on digital asset crimes. According to a February report by South Korea’s Financial Intelligence Unit, the country has observed a significant increase in crypto-related criminal activities. Local crypto companies reported 16,076 suspicious transactions in 2023, marking a 49% surge from the previous year.\nMoreover, South Korea is set to implement its inaugural comprehensive crypto regulation on July 19, aimed at safeguarding investors. The new regulation imposes stricter penalties for market manipulation, including the possibility of life sentences in certain cases. These initiatives underscore South Korea’s commitment to curbing illicit activities in the cryptocurrency space and fostering a safer environment for investors and stakeholders.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T21:42:49+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/ethereum-developers-pave-the-way-for-user-friendly-crypto-wallets-with-eip-3074/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Ethereum's ongoing evolution takes a significant leap towards enhancing the accessibility of crypto wallets with the introduction of 'EIP-3074'. This Ethereum","title":"Ethereum Developers Pave the Way for User-Friendly Crypto Wallets with 'EIP-3074' - CryptoCurrencyNews","content":" Ethereum’s ongoing evolution takes a significant leap towards enhancing the accessibility of crypto wallets with the introduction of ‘EIP-3074’. This Ethereum Improvement Proposal is poised to streamline user experiences, marking a crucial stride in the quest for mainstream adoption.\nThe Ethereum community’s focus on improving wallet usability has intensified, with developers deliberating on key enhancements for the blockchain’s forthcoming hard fork, Pectra. Among the proposed changes, EIP-3074 stands out, aiming to elevate the functionality and ease of use for wallets on the Ethereum network.\nUnlike previous iterations, which aimed to enhance externally owned accounts through concepts like account abstraction, EIP-3074 takes a significant leap forward by empowering smart contracts to authorize EOAs. This shift promises to revolutionize wallet user experience, potentially offering a tenfold improvement, according to Paradigm Chief Technology Officer Georgios Konstatonopolous.\nThe proposal introduces innovative features, including the ability for users to batch transactions, delegate transaction capabilities to smart contracts, and enable third-party sponsorship for transaction fees. Additionally, it allows users to sign transactions submitted by other parties, offering enhanced flexibility and security.\nWhile EIP-3074 has garnered widespread support within the Ethereum community, it has also sparked concerns, particularly regarding security implications associated with batched transactions. Some members, including Safe co-founder Lukas Schor and Argent wallet co-founder Itamar Lesuisse, have expressed apprehension over potential security vulnerabilities and the risk of wallet exploitation.\nDespite these reservations, Ethereum developers remain committed to advancing wallet usability while addressing security concerns raised by the community. As Ethereum continues its journey towards greater accessibility and usability, EIP-3074 represents a significant milestone in achieving these objectives.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-06T21:26:11+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/coinbase-adds-lightning-network-support-with-lightspark/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Coinbase, the largest crypto exchange in the United States by trading volume, has initiated support for the Lightning Network starting today, marking a","title":"Coinbase Adds Lightning Network Support with Lightspark - CryptoCurrencyNews","content":" Coinbase, the largest crypto exchange in the United States by trading volume, has initiated support for the Lightning Network starting today, marking a significant step towards enabling faster and more cost-effective bitcoin transactions for its users. The integration follows seven months after Coinbase confirmed its decision to incorporate the Lightning Network protocol, aligning with competitors like Bitfinex, Kraken, and Binance.\nPreviously, bitcoin transfers on Coinbase were processed on-chain, leading to transaction times ranging from 10 minutes to two hours and incurring high fees during network congestion periods. The Lightning Network, introduced in 2017, operates as a Layer 2 protocol built atop the Bitcoin blockchain. It addresses scalability concerns through bi-directional payment channels, facilitating near-instant and low-fee transactions off-chain without immediate settlement on the base layer.\nViktor Bunin, the protocol specialist and Lightning integration lead at Coinbase, conveyed his excitement about the launch, noting that the increasing adoption of Bitcoin contributes to economic freedom globally. He expressed his satisfaction with the live implementation of the Lightning integration, emphasizing its role in enhancing the utility and accessibility of Bitcoin on a global scale.\nFees on the Lightning Network comprise a flat rate base fee as low as one satoshi (the smallest unit of bitcoin, equivalent to less than $0.01) and a liquidity provider fee or fee rate as a percentage charged on the payment value. Coinbase applies a 0.1% processing fee for Lightning transactions on sends only, with transactions expected to be processed within seconds. Initially, users will be limited to withdrawing a maximum of $2,000, resulting in a maximum withdrawal fee of $2, a conservative measure aimed at enhancing user experience.\nIn a statement, Coinbase asserted that its Lightning Network integration reduces the cost for users to send bitcoin globally, claiming it is 20 times lower than the average 2% charged on credit card transactions and a fraction of the $30 incurred for wire transfers.\nThe collaboration with Lightspark, a Lightning Network infrastructure firm led by CEO David Marcus, underscores Coinbase’s commitment to offering innovative solutions for internet payments. Marcus hailed the partnership as a pivotal milestone, enabling millions worldwide to access fast and affordable Bitcoin transactions.\nWhile the Lightning Network integration initially targets specific regions, Coinbase plans to expand support based on user feedback and network liquidity. Although Lightning support for Coinbase Wallet and other services is not currently planned, the team remains open to future integration opportunities as Lightning adoption grows.\nCoinbase’s decision to incorporate Lightning Network support follows a thorough evaluation of the protocol’s growth and maturity, emphasizing the company’s dedication to enhancing economic freedom through Bitcoin adoption. With Lightning Network adoption on the rise, the collaboration between Coinbase and Lightspark signals a significant advancement in the scalability and accessibility of Bitcoin transactions globally.\nFeatured Image: Unsplash\nPlease See Disclaimer\n","create_date":"2024-04-30T20:56:32+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/wasabi-wallet-and-phoenix-exit-us-amid-crypto-wallet-crackdown/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"In response to mounting regulatory pressure, Wasabi Wallet and Phoenix have ceased operations for customers in the United States. The companies behind these","title":"Wasabi Wallet and Phoenix Exit US Amid Crypto Wallet Crackdown - CryptoCurrencyNews","content":" In response to mounting regulatory pressure, Wasabi Wallet and Phoenix have ceased operations for customers in the United States. The companies behind these wallets, zkSNACKs and ACINQ respectively, announced the suspensions following recent actions taken by U.S. authorities against similar cryptocurrency services.\nzkSNACKs has taken proactive measures to block access to its services from U.S. IP addresses, including Wasabi Wallet. Meanwhile, ACINQ intends to remove Phoenix Wallet from U.S. application stores by May 3.\nThese decisions underscore the companies’ efforts to comply with potential regulations that could classify self-custody wallets as money services businesses, subjecting them to stringent regulatory oversight.\nThe regulatory crackdown on cryptocurrency services intensified following the arrest of two individuals associated with Samourai Wallet on charges of money laundering, including funds derived from illicit sources such as the Silk Road marketplace.\nThe U.S. government’s enforcement actions against Samourai Wallet led to the seizure of its web servers and domain, along with the removal of its app from the Google Play Store in the U.S.\nKeonne Rodriguez, co-founder of Samourai Wallet, was granted release on a US$1 million bond after pleading not guilty to charges of money laundering and operating an unlicensed money-transmitting business at the U.S. District Court for the Southern District of New York.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-30T17:01:02+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/industry-sources-anticipate-sec-denial-of-spot-ether-etfs-next-month/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Industry insiders anticipate the Securities and Exchange Commission (SEC) will reject proposals for exchange-traded funds (ETFs) linked to the price of ether","title":"Industry Sources Anticipate SEC Denial of Spot Ether ETFs Next Month - CryptoCurrencyNews","content":" Industry insiders anticipate the Securities and Exchange Commission (SEC) will reject proposals for exchange-traded funds (ETFs) linked to the price of ether in the coming month, according to sources familiar with the matter.\nSeveral firms, including VanEck and ARK Investment Management, have submitted applications to the SEC seeking approval for ETFs that would mirror the spot price movements of ether, the second-largest cryptocurrency by market capitalization. The SEC is slated to make decisions on VanEck’s and ARK’s applications by May 23 and May 24, respectively.\nMeetings between these firms and the SEC in recent weeks have reportedly been disheartening, with agency staff offering little insight into the concerns surrounding the proposed ETFs. This stands in stark contrast to the extensive deliberations that preceded the approval of bitcoin-based ETFs earlier this year.\nLed by crypto skeptic Gary Gensler, the SEC had historically rejected bitcoin ETFs due to concerns over market manipulation. However, pressure mounted after Grayscale Investments successfully challenged the SEC’s stance in court, leading to the recent approval of spot bitcoin ETFs. Despite arguments from ETF issuers citing precedents set by bitcoin ETFs and ether futures-based ETFs approved last year, the SEC appears poised to deny the current filings, signaling a setback for the cryptocurrency industry.\nWhile some issuers intend to submit additional documentation to the SEC to prolong discussions, expectations of a rejection have already impacted ether’s price. Although the cryptocurrency has seen a modest increase in value this year, it has lagged behind bitcoin, which reached new all-time highs recently.\nThe SEC’s scrutiny of ether ETFs has been limited thus far, with only a few meetings reported, including one with crypto exchange Coinbase. Coinbase argued that the rationale behind approving bitcoin ETFs should extend to ether products, given the correlation between ether futures and the spot market.\nIf the SEC rejects the ether ETFs, it may be due to concerns regarding the availability and reliability of statistical data on the ether market. Some observers speculate that the SEC may require more time to assess the impact of ether futures trading before greenlighting spot ETFs.\nDespite the anticipated rejection, some industry insiders believe that legal challenges could eventually pave the way for ether ETFs. However, for now, the prospect of approval remains uncertain, leaving the cryptocurrency market in a state of flux.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T19:06:56+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/kenya-to-extradite-binance-executive-linked-to-tax-evasion-to-nigeria/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Kenya is preparing to extradite Nadeem Anjarwalla, a Binance executive wanted by Nigerian authorities for alleged involvement in tax evasion and a dramatic","title":"Kenya to Extradite Binance Executive Linked to Tax Evasion to Nigeria - CryptoCurrencyNews","content":" Kenya is preparing to extradite Nadeem Anjarwalla, a Binance executive wanted by Nigerian authorities for alleged involvement in tax evasion and a dramatic escape from custody. Anjarwalla was apprehended in Kenya over the weekend in a joint operation involving several agencies, including the EFCC, Nigeria Police Force, Kenya Police Service, FBI, and INTERPOL, following weeks of search efforts. He is expected to be extradited to Nigeria within the week to face trial on tax evasion charges, with the possibility of additional charges related to illegal passport use and escape from custody.\nAnjarwalla, Binance Africa’s regional manager, along with another executive, Tigran Gambrayan, encountered legal issues in Nigeria in February due to their association with the crypto exchange. Anjarwalla evaded custody in March using a Kenyan passport and had been evading authorities until his recent capture.\nThis development adds to the ongoing tension between Binance and Nigerian authorities. Gambrayan, who has been detained since February, is currently facing trial for alleged tax evasion. However, the proceedings have faced delays, with the court adjourning the case twice due to issues with formally serving charges to the exchange. Binance CEO Richard Teng has expressed willingness to cooperate with Nigerian authorities, but specific efforts to secure the release of the detained executives remain undisclosed.\nSimilarly, Gambrayan’Kenya to Extradite Binance Executive Linked to Tax Evasion to Nigeria attempts to secure bail have encountered obstacles, with a federal high court in Abuja postponing his bail application hearing. He is presently held at the Kuje Correctional Center pending further legal proceedings.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-22T22:29:19+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/asset-tokenization-a-paradigm-shift-in-financial-markets/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Financial markets are experiencing a profound transformation with the rise of asset tokenization, signaling more than just a passing trend among technology","title":"Asset Tokenization: A Paradigm Shift in Financial Markets - CryptoCurrencyNews","content":" Financial markets are experiencing a profound transformation with the rise of asset tokenization, signaling more than just a passing trend among technology enthusiasts. It represents a fundamental evolution in the management and transaction of assets on a global scale.\nThe distinction between crypto-native tokens and tokenized real-world assets is paramount. While crypto-native tokens like bitcoin and ether exist purely in the digital realm and serve various purposes within their ecosystems, tokenized RWAs bridge the gap between digital and traditional finance. They enhance liquidity and fractionalization, making previously illiquid assets more accessible.\nThe recent launch of BlackRock’s BUIDL, a tokenized private short-term treasury fund, is a significant milestone in the realm of tokenization. BUIDL attracted nearly $300 million in assets within its first month, signaling BlackRock’s endorsement of tokenization as the future of markets. Tokenized government treasuries, exemplified by products like BENJI and USDY, have seen exponential growth, with the market surpassing $1.2 billion.\nCurrently, on-chain RWAs represent a $7.5 billion market, but the pace of growth and the widening array of tokenized assets, including treasuries, commodities, real estate, and more, suggest a tipping point. Forecasts indicate that the market for tokenized assets could reach $16 trillion by 2030, facilitating the development of new financial ecosystems across DeFi protocols.\nA new demographic of investors has emerged within the crypto-native space, accustomed to accessing financial products and services directly from their wallets. These investors have benefited from a decentralized ecosystem operating 24/7, with lower barriers to entry compared to traditional financial systems.\nGeopolitical events can have a significant impact on tokenized assets, as demonstrated by the trading behavior of PAXG during heightened tensions between Iran and Israel. This underscores the importance of asset safety, a principle that applies to both traditional and digital markets.\nThe concept of “Bring Your Own Wallet” represents a paradigm shift, empowering individual investors to manage and access their assets without relying on intermediaries. As more assets transition to blockchain, asset managers will adapt\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-25T18:41:56+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/tether-partners-with-chainalysis-amid-rising-regulations/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Tether announced on Thursday its collaboration with blockchain surveillance firm Chainalysis to monitor transactions involving its tokens on secondary","title":"Tether Partners with Chainalysis Amid Rising Regulations - CryptoCurrencyNews","content":" Tether announced on Thursday its collaboration with blockchain surveillance firm Chainalysis to monitor transactions involving its tokens on secondary markets. The move aims to enhance Tether’s ability to identify and address potential risks associated with illicit activities such as terrorist financing and sanctions evasion.\nThe monitoring system, which includes capabilities for international sanctions compliance and detection of illicit transfers, will enable Tether to identify crypto wallets that may pose risks or be linked to illicit and/or sanctioned addresses. Tether CEO Paolo Ardoino emphasized the significance of this collaboration in promoting transparency and security within the cryptocurrency industry.\nThis partnership comes amidst growing regulatory pressure on Tether globally, with concerns raised about USDT’s purported role in circumventing international sanctions and facilitating illicit finance. Reports have surfaced of Venezuela’s state-run oil company using USDT to bypass U.S. sanctions, while a United Nations report highlighted the stablecoin’s involvement in underground banking and money laundering in East Asia and Southeast Asia.\nUSDT, with a circulating supply exceeding $110 billion, maintains a peg to the US dollar and is primarily backed by U.S. Treasury bonds held in reserve, managed by Cantor Fitzgerald. Tether recently reported first-quarter earnings of $4.52 billion, underscoring its prominence in the cryptocurrency market despite regulatory challenges.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-02T22:07:11+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/shiba-inu-secures-12m-investment-for-privacy-focused-blockchain-development/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Shiba Inu, an Ethereum-based ecosystem featuring the second-largest token SHIB, has successfully raised $12 million in a recent token sale aimed at","title":"Shiba Inu Secures $12M Investment for Privacy-Focused Blockchain Development - CryptoCurrencyNews","content":" Shiba Inu, an Ethereum-based ecosystem featuring the second-largest token SHIB, has successfully raised $12 million in a recent token sale aimed at constructing a privacy-centric blockchain, as per a press release on Monday.\nThe investment round saw participation from notable investors including Comma 3 Ventures, Big Brain Holdings, Cypher Capital, Shima Capital, Hercules Ventures, Animoca Brands, Morningstar Ventures, Woodstock Fund, DWF Ventures, Polygon Ventures, Stake Capital, Illuminati Digital Capital, Primal Capital, Mechanism Capital, and Spirit Dao. These investors acquired the new network’s forthcoming utility and governance token, TREAT.\nThe token sale was conducted by Shiba Inu Mint S.A., an ecosystem development company registered in Panama, according to the press release.\nThe fundraising initiative follows a previous report by CoinDesk in February, revealing that Shiba Inu developers were collaborating with cryptography firm Zama to develop a privacy-focused network atop Shibarium, the ecosystem’s Ethereum-based layer-2 blockchain. This new network is set to utilize Fully Homomorphic Encryption (FHE), a privacy tool enabling developers to utilize data on untrusted domains without requiring decryption.\nSHIB, the associated token, experienced a 2.2% increase over the past 24 hours, mirroring the general uptrend of the CoinDesk 20 Index. With a market capitalization of nearly $16 billion, SHIB currently ranks as the 12th-largest cryptocurrency.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-22T18:22:30+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/revolut-unveils-revolut-x-crypto-platform-in-the-u-k/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"British fintech giant Revolut has introduced a new crypto trading platform called Revolut X, tailored for retail customers in the U.K., signaling a deeper","title":"Revolut Unveils Revolut X Crypto Platform in the U.K. - CryptoCurrencyNews","content":" British fintech giant Revolut has introduced a new crypto trading platform called Revolut X, tailored for retail customers in the U.K., signaling a deeper dive into digital assets. This move, highlighted in a recent blog post, solidifies Revolut’s commitment to the crypto industry, where it aims to cater to both novice and seasoned crypto investors.\nWith a user base of over 40 million, Revolut is among the world’s largest fintech firms and is now poised to compete with major crypto exchanges like Coinbase (NASDAQ:COIN) and Binance. The platform will offer trading options for over 100 tokens, with fees varying between zero to 0.09%. Trading on Revolut X requires having an existing Revolut account, allowing users to easily transfer funds between their Revolut X and standard Revolut retail accounts.\nThis development follows Revolut’s introduction of Revolut Ramp in March, a feature that enables direct crypto purchases through a partnership with MetaMask. According to Leonid Bashlykov, head of crypto exchange product at Revolut, the platform is designed to empower customers to expand their wealth across both fiat and crypto assets.\nFintech analyst Boaz Sobrado noted that Revolut’s profitability has closely aligned with its crypto operations, particularly during the crypto market’s bull run in 2021. He emphasized that the high margins in crypto trading are likely to continue boosting Revolut’s financial performance.\nThe launch aligns with recent regulations from the Financial Conduct Authority in the U.K., which introduced a mandatory 24-hour cooling-off period for crypto transactions, setting a barrier that favors larger, established companies like Revolut and Kraken over smaller or offshore entities.\nThe optimism surrounding Revolut X also ties into broader market dynamics. Since the U.S. approval of 10 spot Bitcoin exchange-traded funds on January 11, which now manage over $53 billion in assets, the crypto market has seen significant growth. Companies like BlackRock(NYSE:BLK) and Fidelity issuing crypto products have further expanded the investor base, enhancing market potential.\nHowever, Revolut’s strengthening in the U.K. market contrasts with its recent retreat from the U.S. crypto market in August 2023 due to regulatory uncertainties, impacting only 1% of its users. Meanwhile, other fintech players like Robinhood (NASDAQ:HOOD)have also faced regulatory challenges in the U.S., with Robinhood receiving a Wells Notice from the SEC regarding its crypto operations.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-07T21:00:05+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/bitcoin-testnet-experiences-disruption-due-to-griefing-attack/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"A recent griefing attack on the Bitcoin testnet has caused significant disruption, leading to the generation of three years' worth of blocks in just one week.","title":"Bitcoin Testnet Experiences Disruption Due to Griefing Attack - CryptoCurrencyNews","content":" A recent griefing attack on the Bitcoin testnet has caused significant disruption, leading to the generation of three years’ worth of blocks in just one week. Griefing attacks involve intentionally spamming transactions on a network, increasing its workload, and disrupting its normal operations. Jameson Lopp, co-founder and Chief Security Officer of Casa, publicly claimed responsibility for the attack, generating over 165,000 blocks within the past week.\nLopp explained that the purpose of the attack was to advocate for a reset of Bitcoin’s test network, ensuring that testnet coins have no value and developers can test their software without incurring costs. He also highlighted a bug in the testnet’s consensus code that allows for the creation of massive block amounts in a short time, urging developers to address this vulnerability.\nHashrate and difficulty data on the Bitcoin network testnet indicated a spike to 2,315 TH/s on April 19 before returning to 346 TH/s on April 28. The attack caused interruptions in node syncing, making it impossible to reach the tip due to the high volume of new blocks.\nLeo Weese, technical content lead at Lightning Labs, observed the disruption, expressing concerns about the future of permission-less testing networks. While the Bitcoin testnet didn’t suffer significant harm, it did disrupt the testing efforts of open-source Bitcoin application builders.\nDespite Lopp’s characterization of the incident as a “free stress test,” it faced backlash from the crypto community. Francis Pouliot, co-founder of Bull Bitcoin, emphasized the impact on legitimate testing efforts, highlighting the wasted time and resources of developers.\nWhile the Bitcoin testnet withstood the attack, the incident underscores the challenges of maintaining open and accessible testing environments in the crypto space amidst malicious activities.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T21:19:58+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/crypto-wallet-developer-exodus-granted-approval-for-nyse-american-listing/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Exodus, a leading developer of cryptocurrency wallets, has secured approval for listing its common stock on the NYSE American exchange, marking a significant","title":"Crypto Wallet Developer Exodus Granted Approval for NYSE American Listing - CryptoCurrencyNews","content":" Exodus, a leading developer of cryptocurrency wallets, has secured approval for listing its common stock on the NYSE American exchange, marking a significant milestone for the company. The stock, identified by the ticker symbol EXOD, is slated to commence trading on May 9.\nJP Richardson, CEO and Co-founder of Exodus, expressed enthusiasm about the listing, emphasizing its potential to enhance long-term value for shareholders by bolstering the company’s presence within the investor community and augmenting liquidity. The NYSE American, formerly known as the American Stock Exchange (AMEX), caters to companies with smaller market capitalization compared to its parent exchange, the NYSE.\nExodus’ EXOD stock is currently listed on the OTCQX market, and the approval for listing on the NYSE American represents an “uplisting” of its stocks. The company clarified that existing stockholders need not take any action prior to the listing.\nEstablished in 2015, Exodus Movement specializes in developing self-custodial wallet services for various cryptocurrencies, including bitcoin, ether, and others. Notably, the company’s EXOD security tokens, which serve as digital representations of Class A EXOD common shares, have been tokenized on the Algorand blockchain, offering users the ability to manage them on Exodus wallets. This initiative positions Exodus as the sole entity in the United States to have its common stock tokenized on the blockchain.\nIn its preliminary review for the first quarter of 2024, Exodus reported a revenue of $29.1 million, marking a remarkable 118% increase compared to the same period last year. Additionally, the company boasted approximately 1.69 million monthly active users during the first quarter, underscoring its growing market presence and user engagement.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-07T18:38:01+00:00","tag":"","author":"Stéphanie Bédard-Châteauneuf"},
{"url":"https://cryptocurrencynews.com/exploring-the-perks-and-risks-of-cryptos-influencer-economy/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"The landscape of cryptocurrency investment is witnessing a shift with the rise of Key Opinion Leaders, who are not only investing in crypto startups but also","title":"Exploring the Perks and Risks of Crypto's Influencer Economy - CryptoCurrencyNews","content":" The landscape of cryptocurrency investment is witnessing a shift with the rise of Key Opinion Leaders, who are not only investing in crypto startups but also promoting them, often with advantageous conditions. Recently, major social media figures have transformed into influencer-investors, receiving perks such as discounted valuations and early selling options, a trend becoming increasingly common in crypto’s evolving ‘KOL’ economy.\nKOL rounds have emerged as a cost-effective strategy for crypto startups to market their projects. This method contrasts sharply with traditional paid promotions, offering a way to leverage the KOLs’ extensive social media reach to attract investors and users. Platforms like YouTube and X (formerly Twitter) are popular stages for these promotions, influencing retail traders’ decisions.\nHowever, the transparency of these financial arrangements often remains murky. Several insiders, preferring to remain anonymous, have raised concerns about the disclosure of these agreements to the public, potentially breaching U.S. consumer protection laws. According to Ariel Givner, a lawyer specializing in crypto law, the failure to disclose these financial ties could mislead the audience, many of whom rely on such endorsements for investment decisions.\nMoreover, the structure of these deals frequently allows KOLs to sell their stakes soon after a token launches, potentially undermining the long-term stability of the project in favor of immediate gains. This practice, while lucrative for KOLs and beneficial for the initial marketing push of a project, might result in significant losses for retail investors who remain unaware of the behind-the-scenes arrangements.\nAs the creator economy continues to reshape online interactions, crypto startups are increasingly opting for influencer-led funding rounds, which promise wider exposure and potentially higher initial buy-in rates without the upfront costs of traditional marketing campaigns.\nWhile this model offers a modern twist on raising capital, it also introduces complexities and ethical considerations regarding investor protection and market transparency. The debate continues on the need for clearer regulations and disclosures to safeguard the interests of all parties involved in such transactions.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-09T20:22:21+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/ethereum-stablecoin-volume-skyrockets-in-april-fueled-by-dai/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"April witnessed a monumental surge in the total volume of stablecoins traded on Ethereum, with DAI emerging as the dominant contributor to this unprecedented","title":"Ethereum Stablecoin Volume Skyrockets in April, Fueled by DAI - CryptoCurrencyNews","content":" April witnessed a monumental surge in the total volume of stablecoins traded on Ethereum, with DAI emerging as the dominant contributor to this unprecedented growth. The rise in DAI volume can be attributed to its increasing involvement in complex Miner Extractable Value (MEV) transactions, often facilitated by flash loans.\nAfter several months of stagnant activity, Ethereum’s total monthly stablecoin volume has experienced a consistent uptick for the past three months, culminating in April’s historic milestone. It’s essential to note that flash loan activity is included in these figures, amplifying the overall volume significantly.\nDAI has emerged as the primary catalyst behind Ethereum’s soaring stablecoin volume, with its involvement in complex MEV transactions drawing significant attention. Notably, one transaction alone added nearly $1 billion in DAI volume, showcasing its pivotal role in Ethereum’s ecosystem.\nIn April, DAI’s volume surged to $636 billion, constituting the majority of Ethereum’s total on-chain stablecoin volume, which reached nearly $1.2 trillion for the month. DAI’s supply has also experienced substantial growth, adding approximately $1 billion worth of tokens since March 7, bringing the current supply to 5.44 billion.\nWhile DAI’s performance has been stellar, competitors like Ethena’s USDe and Ripple’s upcoming stablecoin pose potential challenges to its dominance. Nevertheless, DAI’s supply has continued to expand, with an additional $220 million added since May 1, as reported by MakerBurn.\nDespite the surge in DAI volumes, the price of Maker, the token associated with MakerDAO, experienced a decline throughout April. However, a slight uptick in early May hints at potential market resilience amid DAI’s growing prominence in the stablecoin landscape.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-06T18:52:45+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/trust-wallet-returns-to-google-play-store/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Trust Wallet has made a swift return to the Google Play Store after experiencing a temporary removal on Monday morning, causing concern among Android users","title":"Trust Wallet Returns to Google Play Store - CryptoCurrencyNews","content":" Trust Wallet has made a swift return to the Google Play Store after experiencing a temporary removal on Monday morning, causing concern among Android users relying on the crypto wallet service.\nThe company addressed the issue via its official channels, acknowledging Google’s decision to temporarily remove the app from the Play Store. Despite submitting an appeal weeks prior, Trust Wallet was taken down while awaiting a response from Google.\nDuring the removal period, Trust Wallet advised Android users to download an Android Package Kit (APK) from its website to access the wallet service. However, the company reassured existing Android users that their funds remained secure and unaffected by the app’s removal.\nFurthermore, Trust Wallet highlighted that users who had uninstalled the app would need to wait for Google to relist it before being able to download it again. While the iOS version and Google Chrome Browser Extension of Trust Wallet remained unaffected, the company expressed concerns about potential scams involving fraudulent applications impersonating the legitimate wallet service.\nFortunately, Trust Wallet’s hiatus from the Google Play Store was short-lived, with the company announcing its swift return by 7:30 a.m. EST. The Android version of the app was restored on the Play Store, much to the relief of users and the Trust Wallet team alike.\nIn the wake of Trust Wallet’s brief removal, the native coin of the wallet service, Trust Wallet Token (TWT), experienced a 5.2% decline in value as of Monday morning.\nThe incident with Trust Wallet’s removal raised concerns among users, especially in light of increased regulatory scrutiny in the U.S. surrounding self-custody crypto wallets. Notably, Wasabi Wallets recently announced a ban on U.S.-based users due to regulatory uncertainties, following money laundering charges against the founders of another self-custody wallet service, Samourai Wallet.\nAs regulatory pressures mount, the status of self-custody crypto wallets like Trust Wallet remains uncertain, with potential implications for their classification and regulatory oversight in the future.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-29T21:10:19+00:00","tag":"","author":"Faith Yakubu"},
{"url":"https://cryptocurrencynews.com/binance-registers-with-indias-fiu-aims-to-restart-operationsment/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"Binance, the world's largest cryptocurrency exchange, has taken significant steps toward resuming its operations in India by registering with the country's","title":"Binance Registers with India's FIU, Aims to Restart Operationsment - CryptoCurrencyNews","content":" Binance, the world’s largest cryptocurrency exchange, has taken significant steps toward resuming its operations in India by registering with the country’s Financial Intelligence Unit, as confirmed by a senior FIU official. The registration comes after Binance was suspended from operating in India this past December due to non-compliance with local regulations, amid a broader crackdown by the financial watchdog on offshore crypto exchanges operating without proper registration.\nTo operate legally, virtual digital asset service providers, such as cryptocurrency exchanges, are required to register with the FIU and adhere to the country’s anti-money laundering regulations. Although Binance has now registered, it must still resolve pending penalties for its prior non-compliance before it can restart operations, with the exact fines yet to be finalized, according to Vivek Aggarwal, director of the FIU.\nIn addition to Binance, the FIU issued show cause notices to nine other offshore cryptocurrency exchanges in December 2023 for similar compliance failures. Moreover, the FIU had requested the Ministry of Electronics and Information Technology to block online access to these platforms.\nAnother crypto exchange, KuCoin, has successfully navigated this process, having registered with the FIU and resumed operations after settling a fine of 3.45 million rupees (approximately $41,313). KuCoin made its registration public in March but had initially withheld details regarding the penalty.\nAs of now, representatives from Binance and KuCoin have not provided any comments regarding these developments.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-05-10T16:36:50+00:00","tag":"","author":"Michelle Lazo"},
{"url":"https://cryptocurrencynews.com/sp-proposed-u-s-rules-could-impact-tethers-stablecoin-dominance/","web_url":"https://cryptocurrencynews.com/","type":"article","description":"S&P Global Ratings has indicated that the proposed regulations in the United States may lead to a shift in the stablecoin landscape, potentially","title":"S&P: Proposed U.S. Rules Could Impact Tether's Stablecoin Dominance - CryptoCurrencyNews","content":" S&P Global Ratings has indicated that the proposed regulations in the United States may lead to a shift in the stablecoin landscape, potentially undermining the dominance of Tether’s USDT.\nThe regulatory framework, if approved, could grant banks a competitive advantage by capping stablecoin issuance for non-banking institutions at $10 billion, according to S&P’s report released on Wednesday.\nThe prospect of regulatory clarity is expected to incentivize traditional financial institutions to enter the stablecoin market, a development that could erode Tether’s market share, S&P stated.\nThe proposed stablecoin bill, introduced by U.S. Senators Cynthia Lummis and Kirsten Gillibrand, aims to establish guidelines for stablecoin operations within the country. Stablecoins, a form of cryptocurrency tied to fiat currencies such as the U.S. dollar, hold significant importance within crypto markets.\nWhile the U.S. dollar remains the preferred peg for stablecoins, the absence of specific U.S. regulations for most stablecoin issuers may change with the introduction of the Lummis-Gillibrand Payment Stablecoin Act.\nAnalyst Andrew O’Neill highlighted that the passage of the bill could expedite institutional blockchain innovation, particularly in areas like tokenization and digital bond issuances involving on-chain payments. This could create opportunities for banks as stablecoin issuers and potentially reduce Tether’s dominance in the global stablecoin market.\nS&P emphasized that Tether’s USDT, with a market capitalization of $110 billion, faces potential challenges under the proposed legislation, as it is issued by a non-U.S. entity and would not qualify as a permitted payment stablecoin. Consequently, U.S. entities may face restrictions on holding or transacting in USDT, potentially dampening its demand.\nAdditionally, the removal of the SEC’s requirement for custodians to report digital assets on their balance sheet could spur the emergence of new digital asset custody providers, fostering greater competition in the market.\nDespite Tether’s substantial market presence, S&P has previously criticized USDT for its perceived shortcomings in fulfilling its primary function of maintaining a stable value.\nFeatured Image: Freepik\nPlease See Disclaimer\n","create_date":"2024-04-24T20:35:17+00:00","tag":"","author":"Faith Yakubu"}
]