[{"url":"https://www.unlock-bc.com/123085/cardano-foundation-vision-dialogue-frederik-gregaard/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Cardano Foundation's global blockchain adoption efforts and regulatory navigation with Frederik Gregaard, including Cardano Explorer tool","title":"Cardano Foundation's Vision: A Dialogue with Frederik Gregaard","content":" The Cardano Foundation sets its sights beyond immediate gains, prioritizing lasting impact and sustainability. In an interview with Unlock Blockchain during WBS, Frederik Gregaard, underscores the Foundation’s dedication to shaping the future of the Cardano blockchain.\n“We are optimizing towards decisions which will impact Cardano in the next 10 to 20 years,” Gregaard affirms, highlighting their forward-thinking approach.\nAs a Swiss non-profit organization, the Foundation distinguishes itself by eschewing the traditional Initial Coin Offering (ICO) route. Gregaard underscores the significance of this choice, enabling the Foundation to collaborate closely with regulators, fostering an environment conducive to blockchain innovation.\n“Our mission is to champion blockchain adoption globally, ensuring equitable access to its transformative potential,” Gregaard emphasizes, echoing the Foundation’s inclusive vision. He stresses the importance of universal access to blockchain technology, stating, “No matter what country you are from, no matter what side of a border you are born on, or what culture, you should have access to this wonderful technology, as it will bring you economic opportunities wherever you are.”\n“In our collaboration with the Dubai Police, we pioneer the application of blockchain technology in crime-solving,” Gregaard reveals. “This pilot project exemplifies our commitment to leveraging blockchain for real-world impact while ensuring data privacy through innovative verification capabilities.”\nAddressing regulatory frameworks, Gregaard lauds the UAE’s transparent and principle-based approach, drawing inspiration from regulatory models in Singapore and Switzerland. “The UAE’s strategic positioning attracts the blockchain ecosystem, offering clarity and fostering growth,” Gregaard notes.\nIn navigating emerging regulatory landscapes, Gregaard recommends adopting models like the Digital Operational Resilience Act (DORA), which harmonizes rules for operational resilience in the financial sector. “A cornerstone of our approach lies in the adoption of token classification frameworks,” Gregaard explains. “By categorizing blockchain assets based on purpose and function, these frameworks offer clarity amidst regulatory complexities.”\n“It is a balancing act. Right now, we know there is a large appetite for different types of cryptocurrencies. I am actually a big believer in cryptocurrencies, and I do think that Bitcoin has paved the way for a new world society, where we potentially one day will have a new secondary reserve currency based on algorithms and not based on political power,” said Gregaard.\nThis brings a lot of advantages, especially in terms of the broader ecosystem, and developing specific use cases for the general industry. In terms of tools to navigate the Cardano blockchain specifically, Gregaard highlighted the Cardano Explorer, which provides information about the latest epochs, slots, blocks, and transactions on the Cardano network.\n","create_date":"2024-05-14T09:22:42+00:00","tag":"","author":"Henzie Healley"},
{"url":"https://www.unlock-bc.com/123187/mit-brothers-25-million-ethereum-fraud/","web_url":"https://www.unlock-bc.com/","type":"article","description":"MIT brothers face charges in $25M Ethereum fraud. Alleged scheme exploits blockchain integrity. Learn more","title":"MIT Brothers Arrested for $25 Million Ethereum Blockchain Fraud","content":" Two siblings with backgrounds in computer science and mathematics from the Massachusetts Institute of Technology (MIT) were apprehended yesterday on charges in the United States for orchestrating an advanced scheme targeting the integrity of the Ethereum blockchain, resulting in the theft of $25 million worth of cryptocurrency as reported by Reuters\nFederal prosecutors in Manhattan labeled the strategy conducted by Anton Peraire-Bueno, aged 24, and James Peraire-Bueno, aged 28, as “innovative,” marking the first instance of such fraudulent activity leading to criminal charges in the U.S. They allegedly executed the intricate theft in April 2023, siphoning $25 million from traders within a mere 12 seconds by illicitly gaining access to pending transactions and manipulating the movement of cryptocurrency.\nU.S. Attorney Damian Williams expressed, “As we allege, the defendants’ scheme raises serious concerns about the integrity of the blockchain.”\nThe indictment accuses them of conspiring to commit wire fraud, wire fraud, and conspiring to commit money laundering. Anton Peraire-Bueno was detained in Boston, while James Peraire-Bueno was apprehended in New York.\nBoth brothers had attended MIT in Cambridge, Massachusetts, where, according to prosecutors, they honed their expertise in computer science and mathematics, laying the groundwork for their fraudulent activities.\nThe indictment asserts that over several months, the Peraire-Bueno brothers schemed to manipulate and interfere with the protocols governing transaction validation for inclusion on the Ethereum blockchain, a public ledger documenting each cryptocurrency transaction. Prosecutors claim they accomplished this by exploiting a vulnerability in the code of the MEV-boost software, widely utilized by Ethereum network validators tasked with verifying transaction validity before adding them to the blockchain.\nFollowing the heist, prosecutors allege the brothers rebuffed requests for returning the funds and instead took measures to launder and conceal the stolen cryptocurrency.\n","create_date":"2024-05-16T06:28:40+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123348/adaverse-invests-in-sorbet-saudi-web3-freelance/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Adaverse invests in Sorbet to transform Saudi Arabia's Web3 and freelance market, driving innovation and economic growth.","title":"Adaverse Invests in Sorbet: Pioneering Web3 and Freelance Innovation in Saudi Arabia","content":" Adaverse, Saudi Arabia’s premier Web3 and blockchain fund, has made headlines with a strategic investment in Sorbet, an innovative Web3 platform set to revolutionize the future of work in the MENA region. This groundbreaking investment is part of a $10 million initiative aimed at fostering venture-building and aligns seamlessly with the region’s projected digital economic growth.\nSorbet’s mission is to streamline the digital freelance market, which, despite being valued at $4 billion, faces significant challenges due to inefficient payment systems. Sorbet’s platform utilizes blockchain technology and stablecoins to offer a seamless payment solution, particularly benefiting the approximately 40 million self-employed workers in the region, including those who are unbanked. By removing technical barriers traditionally associated with decentralized applications (dApps), Sorbet aims to onboard all creatives onto Web3.\nRami Djebari, co-founder of Sorbet, expressed his enthusiasm about the partnership: “Receiving support from an experienced partner like Adaverse will accelerate our development and enhance our market strategy. This collaboration is a milestone in breaking down financial barriers and enabling limitless growth opportunities for professionals in the region.”\nSorbet is more than just a freelancing platform; it represents a movement towards a more equitable and efficient working environment. By eliminating freelancer fees and intermediaries, Sorbet ensures direct and fair exchanges between creatives and their clients. The upcoming Sorbet Beta aims to further refine the freelancing experience by integrating project management tools and streamlined payment processes.\nVincent Li, founding partner at Adaverse, commented on the investment, saying, “Sorbet exemplifies the potential of blockchain to enrich and enhance economic systems. We are excited about the potential Sorbet holds for economic upliftment in line with Saudi Vision 2030.”\nThis investment not only aligns with Saudi Arabia’s Vision 2030 but actively contributes to its realization. By fostering a thriving digital economy and empowering professionals in the region, Sorbet supports the nation’s ambitions for economic diversification and social development.\nAdaverse, the first Web3 and blockchain fund in Saudi Arabia, was launched as part of the Cardano Investment Vehicle. With a mission to nurture early-stage startups in the MENA region, Adaverse has already supported over 54 startups, driving the integration of blockchain technology into regional economic activities.\n","create_date":"2024-05-20T07:37:58+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123009/ripple-tether-rivalry-market-tension/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The latest tensions between Ripple & Tether. Is it just competition or more? Explore the Ripple-Tether rivalry shaping the stablecoin market.","title":"Growing Rivalry Sparks Tensions: Ripple CEO's Comments Ignite Debate with Tether Amid Regulatory Concerns","content":" Is it the growing rivalry between Ripple and Tether that has led to the recent comments by Ripple CEO Brad Garlinghouse, fueling tensions in the crypto industry, or is it a reality that no one wishes to see? As the stablecoin market, valued at $150 billion, continues to attract attention, questions arise about the future direction of Tether and its potential legal battles with US regulators.\nDuring a May 10 episode of the World Class podcast, Garlinghouse’s remarks hinted at regulatory scrutiny facing Tether, prompting a swift and robust response from Paolo Ardoino, CEO of Tether (USDT), on X. Ardoino’s response underscored the escalating tensions between the two firms and raised critical questions about stablecoin stability in the face of regulatory scrutiny.\nAn uniformed CEO, leading a company being investigated by the SEC, launching a competitive stablecoin (cui prodest), is being reported spreading fear about USDt. Let me give you an update on Tether USDt ecosystem safety. USDt is the most used stablecoin in the world, with…\nGarlinghouse’s comments, suggesting that the U.S. government may be targeting Tether, have added fuel to the fire, highlighting the competitive dynamics at play in the crypto industry. The stablecoin market, with Tether leading the charge and Circle following closely, has witnessed newcomers like PayPal and now Ripple entering the fray.\nArdoino’s response on X reflects Tether’s determination to defend its position in the market and push back against what it perceives as unwarranted criticism from Ripple. The exchange serves as a microcosm of the broader rivalry between the two firms, both vying for dominance in the cryptocurrency space.\nI wasn’t attacking Tether…the next words out of my mouth during the podcast were that I view Tether as a hugely important part of the ecosystem. My point was that the US govt has clearly indicated they want more control over USD-backed stablecoin issuers, and thus, Tether, as…\nHowever, amidst this intense competition, the stablecoin market faces regulatory uncertainties. The UAE is poised to enter the game soon, with the central bank expected to release stablecoin regulations. At least two applications are waiting with ADGM to be approved the moment the regulation is out, signaling further competition and potential disruption in the market.\n","create_date":"2024-05-13T10:04:28+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88304/midchains-brought-network-international-closer-to-the-crypto-space/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Midchains announced a partnership with Network International. this partnership will enable acceptance of fiat payments.","title":"Midchains brought Network International closer to the crypto space","content":" Abu Dhabi based MidChains, a retail and institutional cryptocurrency exchange and custodian based out of ADGM ( Abu Dhabi Global Market), announced in a linked in post a partnership with Network International, the leading enabler of digital commerce in the Middle East and Africa (MEA) region, with operation centers in the UAE, Egypt, Jordan, South Africa and Nigeria. The partnership will enable acceptance of fiat payments.\nAhmed Tarraf, Regional Managing Director, Acquiring – UAE at Network International, commented, “This strategic collaboration reinforces our commitment to bringing innovative payments solutions to the UAE market. As the leading enabler of digital commerce in the region, we are excited to embark on this journey with MidChains – a strong, regulated partner.” Basil Al Askari, Cofounder and CEO – MidChains said, “MidChains is excited to partner with the payments industry leader Network International. We are exploring collaboration around virtual asset adoption and acceptance in the financial ecosystem. Partnership is part of our DNA and this one further validates our ambitions and growth plans to enable established financial players regulated, secure access to digital currencies. We are constantly exploring ways to use digital currencies securely as an alternative asset to store and transfer value. Network International’s strong presence and wide reach across the region makes them a compelling partner for us.”\n","create_date":"2022-06-13T13:22:05+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123025/uae-stablecoin-adoption-risks-opportunities-financial-sector/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Explore risks & opportunities of stablecoin adoption in UAE's financial sector. Navigate the future with insights from industry experts.","title":"Exploring the Impact of Stablecoins and Cryptocurrencies on the Financial Landscape: Insights from a Discussion in the UAE","content":" In a recent closed-door roundtable discussion among industry experts in the United Arab Emirates (UAE), stakeholders engaged in a frank exchange of ideas regarding the implications of stablecoins and cryptocurrencies for the future of finance.\nConducted under the principles of Chatham House Rules to encourage open dialogue, participants delved deep into the transformative potential of these emerging technologies and the strategic role of the UAE in shaping their adoption and regulation.\nThe discussion commenced with a thorough examination of stablecoins, digital assets engineered to mitigate the price volatility commonly associated with cryptocurrencies. Various types of stablecoins, including fiat-backed, commodity-backed, and algorithmic variants, were scrutinized for their potential to facilitate secure and efficient transactions while addressing market volatility.\nConcerns surrounding regulatory compliance and collateralization mechanisms prompted in-depth deliberation, ultimately leading to consensus on the pivotal role of stablecoins in driving mainstream adoption of digital assets.\nCentral to the conversation was the regulatory framework concerning stablecoins and cryptocurrencies in the UAE. Participants acknowledged the critical necessity for clear and comprehensive regulations to foster innovation, safeguard investor interests, and maintain financial stability.\nDespite the UAE’s proactive stance on embracing blockchain technology and FinTech innovation, uncertainties persisted regarding specific regulatory requirements for stablecoin issuers and trading platforms.\nA significant development highlighted during the discussion was the proactive initiative undertaken by the UAE Central Bank. Stakeholders commended the Central Bank for releasing a consultation paper soliciting feedback from industry experts and stakeholders. This inclusive approach demonstrated the Central Bank’s commitment to gathering diverse perspectives and insights to inform the development of robust regulatory guidelines.\nThe engagement of stakeholders through the consultation process was perceived as a positive step towards achieving regulatory clarity in the crypto space. Participants eagerly awaited the release of finalized regulations by the Central Bank, anticipating a pivotal moment that would provide much-needed clarity and guidance for market participants.\nIn essence, the discussion highlighted the importance of regulatory clarity in fostering investor confidence and promoting sustainable growth in the crypto ecosystem. The proactive approach taken by the UAE Central Bank, coupled with ongoing engagement with stakeholders, signaled a promising trajectory towards achieving a well-defined regulatory framework conducive to innovation and responsible growth in the crypto sector.\nDespite regulatory uncertainty, the UAE has emerged as a leading hub for crypto innovation and blockchain adoption.\nParticipants lauded the UAE’s strategic vision and robust infrastructure, positioning it as a frontrunner in the global crypto landscape. From regulatory sandboxes to licenses for crypto exchanges and custodians, the UAE has demonstrated a commitment to fostering innovation while maintaining regulatory oversight.\nThe discussion highlighted the UAE’s potential to attract investment, talent, and innovation in the crypto space, thereby driving economic growth and diversification in the region.\nThe evolving role of traditional banks in the crypto space sparked lively debate among participants, revealing a nuanced sentiment towards embracing digital assets.\nWhile banks have traditionally approached cryptocurrencies with caution due to regulatory uncertainties and risk aversion, there was a consensus among participants regarding the necessity for banks to adapt to the changing financial landscape.\nHowever, the discussion also highlighted a prevailing sentiment of cautious optimism rather than outright enthusiasm among banks towards stablecoins and Central Bank Digital Currencies (CBDCs). This cautious approach stemmed from the perceived capital expenditure required by banks to venture into the crypto space, coupled with a lack of clear profitability figures.\nDespite recognizing the potential benefits of leveraging blockchain technology and stablecoins for streamlining cross-border payments, enhancing liquidity management, and driving operational efficiencies, banks remained apprehensive about the associated risks and regulatory compliance challenges.\nMoreover, participants acknowledged that while banks may currently exhibit reluctance towards embracing stablecoins and CBDCs, they possess inherent exposure to digital assets through their clients and customers. This exposure implies that banks may inevitably need to navigate the crypto landscape in the future, along a calculated approach.\nRegarding the potential risks posed by stablecoins to the financial system, participants emphasized the need for vigilance, particularly in scenarios where stablecoin sponsors represent a significant portion of bank deposits.\nWhile the current market capitalization of the global stablecoin industry remains limited, participants recognized the importance of closely monitoring stablecoin stability assessments and regulatory frameworks to mitigate potential risks to banks and the broader financial ecosystem.\nCentral Bank Digital Currencies (CBDCs) emerged as a focal point of discussion, with participants delving into their potential to revolutionize the monetary system.\nWhile acknowledging the benefits that CBDCs offer, such as enhanced monetary policy control, financial inclusion, and reduced transaction costs, participants raised significant questions regarding their design, implementation, and interoperability.\nOne prominent concern voiced during the discussion was the lack of clarity regarding the potential benefits for commercial banks in adopting CBDCs. Participants candidly discussed the ambiguity surrounding the benefit case, highlighting the importance of how CBDCs are structured. Moreover, there was recognition of the complexity arising from scenarios where central banks transition into roles traditionally held by private markets or service providers. This shift raises questions about the implications for existing financial infrastructure and market dynamics.\nDespite these challenges, participants emphasized the importance of international collaboration in advancing CBDC initiatives and fostering interoperability between different digital currencies. They underscored the need for central banks to strike a delicate balance between fostering innovation and ensuring robust regulatory frameworks. It was crucial to uphold principles of monetary stability, security, and privacy while navigating the complexities of CBDC implementation.\nIn conclusion, the roundtable discussion shed light on the transformative potential of stablecoins and cryptocurrencies in the UAE and beyond. While there is optimism about the opportunities these digital assets present, it’s crucial to acknowledge the reservations expressed by traditional banks.\nTraditional banks are approaching cryptocurrencies with caution due to uncertainties surrounding profitability and regulatory risks. Despite recognizing the potential benefits of stablecoins and CBDCs in improving efficiency, banks are hesitant to fully embrace these technologies.\nA notable concern raised during the discussion was the uncertain success of an AED-backed stablecoin, especially considering the preference of some individuals and entities to distance themselves from the US dollar. Moreover, the large-scale adoption of a UAE-issued stablecoin could pose systemic risks to the broader financial market if not carefully managed.\nWhile the UAE remains at the forefront of financial innovation, with its proactive policymaking and strategic vision, it’s imperative to address the concerns of traditional financial institutions. Continued collaboration, innovation, and regulatory clarity are essential to harnessing the benefits of blockchain technology and decentralized finance while mitigating associated risks.\nAs the global financial landscape evolves with the adoption of transformative technologies, the UAE has the opportunity to shape its trajectory. However, achieving this vision requires careful consideration of stakeholder concerns, robust regulatory frameworks, and a willingness to adapt to the changing needs of the financial ecosystem.\nSpecial thanks to the participants: Brian Byagaba, David Chaum, Tristan Brandt, Arpit Mehta, Arushi Goel, Dr. Mohamed Damak, David Kelly, Grant Niven, Mohammed AlKaff AlHashmi, Milon Veasey, Henzie Healley, Oscar Wendel and Walid Abou Zaki as the Moderator.\n","create_date":"2024-05-13T13:42:53+00:00","tag":"","author":"Anna K."},
{"url":"https://www.unlock-bc.com/118116/animoca-brands-and-param-labs-join-forces-to-innovate-gaming-industry-in-mena/","web_url":"https://www.unlock-bc.com/","type":"article","description":"With Animoca Brands' expertise, the collaboration seeks to enhance Param Labs' market strategy, particularly in launching Web3 products.","title":"Animoca Brands and Param Labs Join Forces to Innovate Gaming Industry in MENA","content":" Param Labs, a force in game and technology development based in Abu Dhabi, has forged a strategic partnership with Animoca Brands, a frontrunner in advancing digital property rights within gaming and the open metaverse.\nThe collaboration aims to harness Animoca Brands’ expertise to fortify Param Labs’ go-to-market strategy, particularly in the area of launching innovative Web3 products.\nAdditionally, the partnership seeks to refine Param Labs’ blockchain and token economy design, pushing both companies towards the forefront of the evolving gaming industry.\nParam Labs boasts a portfolio of several products, including Kiraverse, a Web3 TPS, and Pixel To Poly, a platform transforming 2D NFTs into dynamic 3D game assets. The latter, Pixel To Poly, is set to advance game asset creation by employing AI to seamlessly transition artwork into sophisticated 3D designs, compatible with popular gaming platforms like GTA V and Fortnite Creative Mode.\nAs part of the collaboration, Param Labs will introduce its Pixel To Poly platform to selected Animoca Brands’ projects and portfolio companies, providing them with access to cutting-edge technology for enhancing their game asset creation process.\nMoreover, other initiatives are on the horizon for Param Labs, including the launch of a free-mint NFT campaign and the publication of its litepaper, detailing the company’s game economy and infrastructure.\nWith a network of Layer 2 and Layer 3 solutions featuring parallelized VMs such as Move and SVM, Param Labs could transform the gaming landscape through its innovative Web3 framework and modular blockchain architecture.\nThis partnership signifies a significant step for Param Labs and the broader Web3 gaming ecosystem in the MENA region. With Animoca Brands’ support, Param Labs is primed to pioneer new frontiers in the Web3 and gaming sectors, driving innovation and fostering a more inclusive and immersive gaming experience for players worldwide.\nYat Siu, co-founder and executive chairman of Animoca Brands, emphasized the alignment of both companies’ visions to redefine the gaming landscape. “We’re excited to partner with Param Labs to advance digital property rights in gaming, bringing us a step closer to realizing the vision of the truly open metaverse,” Siu said. “Together, we’re working to transform the industry, emphasizing the value of gamer experiences and ownership.”\n","create_date":"2024-02-15T08:21:42+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123276/venom-foundation-adgm-ceases-operations-confusion/","web_url":"https://www.unlock-bc.com/","type":"article","description":"ADGM's RA issues notice on Venom Foundation's cessation; Foundation distances from unauthorized announcements.","title":"Venom Foundation in ADGM Ceases Operations Amidst Confusion Over New Announcements","content":" Recent developments involving the Venom Foundation have created confusion within the blockchain community. The Abu Dhabi Global Market (ADGM) Registration Authority (RA) has issued a statement clarifying that the Venom Foundation registered in ADGM has ceased all operations and is not connected to recent announcements about the launch of a new blockchain network.\nOn May 17, 2024, the ADGM RA released a public notice stating that the Venom Foundation, with registration number 000008382, has voluntarily cancelled its commercial license as of February 2024. This was followed by the appointment of Mahesha Shetty, an ADGM registered insolvency practitioner, as the liquidator to wind down the foundation’s activities from March 22, 2024.\n“The Registration Authority (RA) of Abu Dhabi Global Market (ADGM) wishes to inform members of the public that Venom Foundation, an ADGM registered foundation with registration number 000008382 (Venom Foundation ADGM), is no longer conducting any activities in ADGM having voluntarily cancelled its commercial licence in February 2024 and appointed a liquidator in March 2024 to wind down the foundation. In addition to Venom Foundation ADGM, associated ADGM companies Venom Blockchain Holding Limited with registration number 000007380 and Venom Blockchain Holding 2 Limited with registration number 000010061 also appointed a liquidator in March 2024 to wind down those companies. The RA wishes to alert members of the public that Venom Foundation ADGM and the associated ADGM companies are not associated with activities mentioned in recent social media announcements concerning the launch of Venom Blockchain. References in the recent social media to Venom Foundation are not to Venom Foundation ADGM.”\nThis statement was necessary due to the recent announcements made by another entity claiming to be the Venom Foundation, which has declared plans to launch its blockchain network from new jurisdictions, specifically the Cayman Islands. This has caused significant confusion, as the public struggled to differentiate between the two entities.\nOn May 16, 2024, the Venom Foundation in ADGM further clarified the situation with a detailed announcement. They reiterated that the foundation had ceased all operations and was no longer involved in blockchain activities or the issuance of utility tokens. The statement stressed the distinction between the ADGM-registered Venom Foundation and any other similarly named entities:\n“Because of the liquidation, the Venom Foundation is no longer operational and is not pursuing its registered objectives of blockchain activities and issuance of utility tokens any further. Venom Foundation emphasizes that this pertains to the entity registered under the laws of the Abu Dhabi Global Market. Venom Foundation issues this statement to distinguish it from any other entities with a similar name operating elsewhere, which could lead to confusion around a direct or indirect relationship to the Venom Foundation in Abu Dhabi or ADGM.”\nThe foundation also made it clear that it no longer has control over any Venom-related social media channels, including accounts linked to “Peter Kenz”, “Venom Network”, and others. This clarification is crucial to prevent the public from being misled by unauthorized statements made by these accounts.\nHaving launched with much enthusiasm in 2022, the Venom Foundation’s decision to dissolve on December 16, 2023, wasn’t unexpected for many, given the skepticism surrounding its activities.\nFor now, the Venom Foundation as registered in ADGM is officially in liquidation and no longer operational, having taken all necessary legal steps to wind down its activities. Any future references to the Venom Foundation should be carefully scrutinized to ensure they pertain to the correct entity, as the foundation in ADGM has no connection to any new ventures or announcements being made by entities in other jurisdictions.\n","create_date":"2024-05-17T14:03:57+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122807/ton-blockchain-super-app-pioneer/","web_url":"https://www.unlock-bc.com/","type":"article","description":"TON Blockchain revolutionizes as a super app, integrating seamlessly for diverse decentralized experiences #tether #Telegram","title":"TON Blockchain: A Resilient Journey Towards Becoming a Super App","content":" The journey of TON Blockchain is marked by resilience and adaptation in the face of adversity. Despite initial challenges and separation from its ties with Telegram, TON has evolved into a platform with immense potential, leveraging its association with Telegram’s 900 million users.\nThe recent partnership with Tether is a significant milestone, enhancing TON’s ecosystem with the integration of USD₮ and XAU₮ tokens, offering users seamless access to digital dollars and gold-backed tokens. Additionally, this partnership has significantly boosted TON Token, currently trading at $5.71 with a remarkable 185% increase in market value over the past year, reaching a market cap of $19.9 billion.\nTON Blockchain encountered significant challenges early on, including regulatory hurdles such as the SEC case after raising $1.8 billion in 2018 and the subsequent settlement in 2020. However, through the dedication of its community and leadership, TON persevered, forging its path forward independently. TON prides itself on being decentralized, based on an open-source codebase, with no single controlling authority.\nBehind it lies a non-profit foundation, registered in Zug, Switzerland. In 2023, TON underwent significant restructuring, which included the establishment of The Open Network Foundation. This non-profit organization, funded entirely by community contributions and based in Switzerland, embodies the ethos of decentralization and community-driven innovation. The Open Network Foundation serves as a catalyst for community-driven initiatives within the TON ecosystem, supporting projects that align with TON’s mission of fostering innovation and accessibility.\nThe separation from Telegram provided TON with the opportunity to chart a new course and redefine its vision. Rather than being tethered to a single platform, TON embraced its independence and focused on building a comprehensive ecosystem that extends beyond messaging to encompass a wide range of decentralized services. This shift in focus laid the foundation for TON to emerge as a potential super app with widespread adoption and utility.\nOne of TON’s greatest assets is its association with Telegram, boasting a user base of over 900 million individuals. By tapping into this vast network, TON gains access to a ready-made audience eager to explore decentralized applications and services. This integration not only enhances TON’s user base but also positions it as a frontrunner in the race to mainstream adoption of decentralized technologies.\nThe story of TON Blockchain is one of resilience, adaptation, and growth. While TON’s journey is impressive, questions remain about its integration into local ecosystems like UAE, where Pavel Durov has been based for the last 10 years. How TON will integrate into the local ecosystem remains an unanswered question, presenting an area for future exploration and development.\n","create_date":"2024-05-08T12:31:15+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88275/smartcrowd-mena-digital-real-estate-investment-platform-secures-funding/","web_url":"https://www.unlock-bc.com/","type":"article","description":"SmartCrowd closed a bridge round of USD $3 million. The funding will enable company to scale its operations products in KSA and Pakistan","title":"SmartCrowd, Mena digital real estate investment platform secures funding","content":" SmartCrowd closed a bridge round in excess of USD $ 3 million. The bridge funding will enable the rapidly growing company to scale its operations, products and establish a presence in new markets including Saudi Arabia and Pakistan.\nMad’a Investment Company, an influential Saudi firm, is the lead investor of the Bridge Round. TriCap Investment, a diversified investments group based in Dubai, made a follow-up investment in SmartCrowd and was joined by Amaana Capital, the venture capital arm of US-based NRD Capital., along with other prominent angel investors in the region.\nCommenting on the investment, Abdullah A. Al Othaim, CEO of Mad’a investment, said: “As part of our strategy to invest in companies that add exceptional value through their innovative ideas to the Kingdom and the region, SmartCrowd, MENA’s first regulated real estate investment platform, will open up new investment channels to individuals looking for relatively safe methods for passive income”\n“SmartCrowd is leading the charge in fractional ownership of real assets in the region by providing its customers with high-quality and pre-vetted investment opportunities. We couldn’t be more excited to partner with Siddiq and Musfique in their next stage of growth,” said Aziz Hashim, Managing Partner at Amaana Capital.\nSuleman Soorani, Director of Principal Investments at Tricap Investments, shared: “We are big believers in Smart Crowd’s digital investment platform and the value proposition it offers to all types of real estate investors and owners.\n“Smart Crowd’s user-friendly technology platform has made real estate investment accessible hassle-free for to all and we are excited to support the founders in making Smart Crowd not just a preferred way of investing in real estate but a preferred way of owning real estate.”\nAssets under management have grown more than 60% quarter-on-quarter, while the number of investors has doubled in the last quarter.\nSmartCrowd CEO and Co-Founder, Siddiq Farid, says: “The rapid growth we are experiencing is down to our innovative approach to property ownership, a market ripe for investment, and the strong economic outlook the UAE is experiencing. Dubai’s real estate transactions are at an all-time high – and that is translating into our growth.\n“Meanwhile, our latest bridge funding will help us rapidly scale to new heights and continue our mission on making alternative investment universally accessible to the masses. Average investor has been historically restricted to traditional asset classes such as shares and bonds and unable to diversify their wealth into alternative assets like the wealthy to preserve and accumulate wealth. Now more than ever it is prudent for people to construct investment portfolios that with stand market volatility.”\nIndividual investors in SmartCrowd take a ‘fractional’ share in a vetted rental property based on a 100-point proprietary screening tool, with investments on the crowdfunding platform starting at AED500. Investors then receive a share of rent, proportional to their investment. Once a property is funded, it is purchased via a special purpose vehicle (SPV) registered in the DIFC, ensuring a safe, secure investment opportunity.\n“For anyone looking to earn a decent return on a relatively small investment, SmartCrowd is a revolutionary offering,” adds SmartCrowd’s CEO, Siddiq Farid.\nAfter 18 months of solid growth – despite the global economic woes induced by the pandemic – SmartCrowd now has more than 30,000 users on the platform, 80% of which are UAE-based. The remaining 20% come from as far as New Zealand and Australia and are using SmartCrowd to take a beneficial slice of Dubai’s real estate market. SmartCrowd has now funded more than 70 properties and transacted over AED50 million\n","create_date":"2022-06-13T06:55:17+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122837/sec-digital-asset-custody-rules-defeated-house-vote/","web_url":"https://www.unlock-bc.com/","type":"article","description":"In a significant blow to SEC regulations, the House voted to overturn custody rules for digital assets, impacting banks and crypto firms alike","title":"SEC's Custody Rules for Digital Assets Dealt Another Blow in House Vote","content":" House lawmakers voted Wednesday evening (May 8, 2024) to nullify a Securities and Exchange Commission staff bulletin concerning the accounting of digital asset custody.\nThe bulletin, SAB 121, has stirred considerable debate, drawing both cryptocurrency firms and major banks into opposition against the SEC.\nIn essence, the contested Staff Accounting Bulletin (SAB) 121 requires custodians of digital assets to treat them as liabilities on their financial statements. Critics argue this could hinder banks from expanding into crypto due to increased capital requirements.\nThe situation gains prominence as traditional Wall Street banks confront the rise of 11 spot bitcoin funds. Industry groups have voiced concerns to SEC Chair Gary Gensler, citing challenges in serving as custodians for these funds at scale.\nThe pushback against SAB 121 culminated in a resolution introduced by Representatives Mike Flood and Wiley Nickel, contesting the SEC’s authority to establish such rules without proper public input.\nOn the other side, Gensler maintains support for SAB 121, citing a Government Accountability Office report that classified the bulletin as a rule, thus subject to oversight under the Congressional Review Act.\nThe resolution now advances to the Senate, where it is expected to garner substantial support from Republicans.\n","create_date":"2024-05-09T07:37:25+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123282/turkey-introduces-bill-to-regulate-crypto-assets-amid-fatf-review/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The proposed bill seeks to establish a licensing scheme for crypto firms, which will be managed by the Capital Markets Board (CMB).","title":"Turkey Introduces Bill to Regulate Crypto Assets Amid FATF Review","content":" Turkey has introduced a legislative proposal aimed at mitigating the risks associated with transacting with crypto assets within the country. This proposal, presented to parliament by ruling party chairman Abdullah Güler, encompasses various regulations concerning crypto assets and will be enforced by the Capital Markets Board (CMB). The bill sets forth crucial rules for crypto service providers and enhances the CMB’s oversight over them.\nA key aspect of the bill is the introduction of a licensing scheme for crypto firms, managed by the CMB, bringing these firms under the regulator’s purview. To safeguard customers, the bill also expands the scope of inspections for crypto providers. According to the draft regulations submitted by the AK Party, cryptocurrency trading platforms and other sector companies must obtain licenses from Turkey’s capital markets board.\n“The law regulates crypto asset service providers, activities of crypto asset platforms, storage of crypto assets, and crypto asset buying, selling, and transfer transactions that people residing in Turkey can make,” the draft states. Although the bill does not address taxation, it mandates that the CMB and TÜBİTAK, the Scientific and Technological Research Council of Turkey, receive 1% of revenues from crypto service providers.\nThe bill aims to align Turkey’s crypto asset regulations with international standards, address criticisms from the Financial Action Task Force (FATF), and enhance the safety of the country’s crypto ecosystem. In March, Turkey’s economy minister, Mehmet Şimşek, shared the government’s efforts to exit the FATF gray list, noting that an inspection delegation would visit in April-May and expressing confidence that Türkiye would be removed from the gray list.\nAlso in March, AK Party Deputy Chairman of Information and Communication Technologies Ömer İleri emphasized the importance of legal regulations in the crypto asset field, stating, “This legal regulation is primarily a study that will regulate the platforms, but beyond that, it will be a regulation that will protect our citizens and investors.”\nA team from FATF held meetings with Turkish authorities earlier this month in preparation for its highly anticipated report on the country in June, two sources told Reuters. One of the sources stated that the unpublicized “on-site” visit assessed Turkey’s progress in addressing the money laundering and terrorist financing concerns that led to the downgrade in 2021. The report from this visit will form the basis of the FATF’s decision at a June 28 plenary, which Finance Minister Mehmet Simsek has indicated will mark Turkey’s departure from the grey list of countries under special scrutiny.\n","create_date":"2024-05-18T06:49:37+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122967/blockdaemon-strengthens-uae-presence-establish-office-adgm-authority/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The company unveiled plans to establish a physical office and formal entity in Abu Dhabi, operating under the guidance of ADGM.","title":"Blockdaemon Strengthens UAE Presence, to Establish Office Under ADGM Authority","content":" Blockdaemon, a leading provider of institutional-grade blockchain infrastructure, has announced its further foray into the United Arab Emirates (UAE).\nThe company unveiled plans to establish a physical office and formal entity in Abu Dhabi, operating under the guidance of the Registration Authority of Abu Dhabi Global Market (ADGM).\nThe expansion into the UAE market signifies Blockdaemon’s initiative to offer its cutting-edge Web3 infrastructure solutions locally. This includes making available its node and validator infrastructure solutions, alongside its self-hosted Multi-Party Computation (MPC) wallet technology.\nAmor Sexton, the Chief Operating Officer of Blockdaemon, expressed enthusiasm about the company’s expansion efforts in the UAE. He emphasized the significance of this move, stating, “This marks a significant stride for Blockdaemon in boosting its presence in the UAE and deepening our partnership with local regulators and clients.”\nThe approval from the Registration Authority of ADGM not only solidifies Blockdaemon’s foothold in the region but also highlights its commitment to supporting institutions with reliable blockchain infrastructure. Sexton highlighted the importance of integrity and trustworthiness in their operations, reflecting Blockdaemon’s dedication to operating ethically and responsibly.\nKonstantin Richter, CEO and Founder of Blockdaemon, echoed similar sentiments, emphasizing the company’s mission to empower businesses with secure and scalable blockchain infrastructure solutions. He described the milestone as paving the way for greater collaboration and innovation within the UAE’s dynamic blockchain ecosystem.\nThe Chief of Market Development at ADGM, Arvind Ramamurthy, commended Blockdaemon on its licensing approval, recognizing the company’s decision to establish a presence in Abu Dhabi as a testament to the progressive regulatory environment offered by ADGM. Ramamurthy emphasized the significant potential and demand within the blockchain and Web3 sub-cluster, underscoring ADGM’s role as a pioneer in fostering an ecosystem conducive to the growth of companies like Blockdaemon.\nFounded in 2017 by Konstantin Richter, Blockdaemon has been at the forefront of providing institutional-grade infrastructure to blockchain protocols and financial institutions. The company’s expansion into the Asia-Pacific region in 2022 and subsequent ventures into the EMEA region demonstrate its commitment to global growth and innovation.\nThe recent announcement follows a series of geographic expansions and product innovations by Blockdaemon, including the introduction of the Builder Vault utilizing advanced MPC technology and the launch of Blockdaemon Wallet and Blockdaemon’s Indexed-Data Powered API Suite. These developments underscore Blockdaemon’s continued dedication to advancing blockchain infrastructure and driving industry innovation.\n","create_date":"2024-05-13T05:42:02+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88299/coinhouse-secures-40-million-euro-funding-and-true-global-ventures-4-plus-joins/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Coinhouse has secured 40 million euros worth of funding, and True Global Ventures 4 Plus is one of the new investors.","title":"Coinhouse Secures 40 Million Euro Funding and True Global Ventures 4 Plus Joins","content":" Coinhouse has secured 40 million euros worth of funding, which will accelerate its service offering development to individuals and businesses in Europe.\nTrue Global Ventures 4 Plus (TGV4 Plus) has also joined the 40 million euro fundraising round into Coinhouse, the French pioneer in investing in crypto-assets, together with bank ODDO BHF and other investment funds such as Tioga Capital, XAnge Siparex Innovation, Raise Ventures, CF Partners, ConsenSys, Expon Capital, as well as several renowned families and French business leaders.\nThis fundraising will accelerate Coinhouse’s service offering development to individuals and businesses in Europe.\nCoinhouse has quadrupled its workforce in less than 2 years and is positioning itself as the first support platform for individuals and companies, allowing them to simply invest in around fifty crypto-assets as well as in crypto saving management products.\nThrough its consumer mobile application and its unique Crypto Private Banking service in Europe, Coinhouse stands out by offering a transparent service offer adapted to everyone:\n1. A customer service composed of crypto experts, open to all, based in Paris, multilingual and accessible by email and telephone,\n2. A team of account managers and experts dedicated to corporate clients,\n3. Unique crypto savings management products, such as the Crypto Booklet and Piloted Management,\n4. A crypto custodian offer for institutional investors and Major accounts.\nAt the same time, Coinhouse is continuing its strong growth by diversifying its service offer to meet the needs of new customers in this still emerging market.\nSince the beginning of 2022, it has been opening up to the world of crypto payments, and to brands and merchants wishing to deal with Web3.\n“As a VC fund consisting of serial entrepreneurs, we invest in serial entrepreneurs’ companies which are growing rapidly. Given current market conditions, we are supporting Coinhouse to expand their proven business model, launch new products, address new customer segments, such as Family Offices, and expand activities across Europe”, said Valerie Hawley, Affiliate Founding Partner, Dubai.\n\nAs a Digital Asset Service Provider registered in France and Luxembourg, Coinhouse has supported more than 20 major French and international brands by enabling them to securely acquire and hold land in Metaverses, or to accept crypto payments converted immediately into euros, without having to manage the complexity of a portfolio or the accounting management of volatile assets.\nThis 40 million euro fundraising will allow Coinhouse to:\n● Develop its crypto asset management activity, beyond existing products,\n● Make payment in crypto accessible and intuitive for both individuals and businesses,\n● Accelerate its international expansion and tap on external growth opportunities,\n● Facilitate the development of Web3 by simplifying transactions and the management of digital assets.\n","create_date":"2022-06-13T13:09:27+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123251/animoca-brands-invests-7m-param-labs-uae-gaming/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Animoca Brands leads a $7M funding round for UAE-based Param Labs, driving the future of next-gen gaming infrastructure.","title":"Animoca Brands Leads $7 Million Funding Round for UAE-Based Param Labs","content":" In a significant stride towards advancing the future of gaming, Animoca Brands has spearheaded a $7 million funding round for Param Labs, a UAE-based gaming infrastructure developer. This funding round saw participation from an impressive roster of investment firms including Delphi Ventures, Cypher Capital, P2 Ventures, Mechanism Capital, Merit Circle, TRGC Capital, Double Peak Group and MH Ventures.\nParam Labs, which describes itself as “Pioneering the next generation of Gaming through United Creativity and Technological Advancement,” is poised to lay the groundwork for the future of gaming. The company’s mission is to push the boundaries of the gaming industry, leveraging cutting-edge technology and fostering a creative, innovative environment. On their X account, Param Labs expressed their excitement about being at the forefront of an industry brimming with untapped potential.\n“We’re excited to be building and continually executing at the forefront of an industry with so much potential yet to be fully unlocked,” the company stated, highlighting their ambition to drive the next wave of gaming evolution.\nThe funding round was notable not only for the amount raised but also for the caliber of angel investors who demonstrated high conviction in Param Labs’ vision. These include prominent figures in the crypto and gaming communities such as Yat Siu (@ysiu), Banks (@Banks), Gainzy (@gainzy222), Bagsy (@Bagsy), RookieXBT (@RookieXBT), IvanOnTech (@IvanOnTech), Dingaling (@Dingaling), TheCryptoDog (@TheCryptoDog), GiulioXdotEth (@GiulioXdotEth), and Ashcryptoreal (@Ashcryptoreal).\nAnimoca Brands, a global leader in digital entertainment, blockchain, and gamification, has a proven track record of supporting innovative ventures that shape the future of interactive entertainment. Their leadership in this funding round underscores their commitment to fostering next-generation gaming technologies and ecosystems.\nParam Labs will greatly benefit from being part of the Animoca ecosystem, which includes numerous companies that are pioneering advancements in digital entertainment. By being in Animoca’s orbit, Param Labs can leverage shared knowledge, resources, and networks, accelerating its growth and innovation potential.\nThe successful funding round for Param Labs also highlights the UAE’s growing status as a hub for technological innovation and investment. As Param Labs continues to develop groundbreaking gaming infrastructure, its success will contribute to the UAE’s reputation as a leader in Web3 gaming and blockchain innovation. With the backing of prominent investors and a clear vision for the future, Param Labs is set to make significant contributions to the gaming world, offering exciting new possibilities for gamers and developers alike.\n","create_date":"2024-05-17T08:16:54+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122935/crypto-nonprofit-launches-pac-to-back-pro-crypto-candidates-in-u-s-elections/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Stand With Crypto launched PAC, allowing around 440,000 members to support US Senate and House candidates favoring pro-crypto policies.","title":"Crypto Nonprofit Launches PAC to Back Pro-Crypto Candidates in U.S. Elections","content":" A crypto non-profit organization has initiated the establishment of a new political action committee (PAC) with the aim of raising funds from its 440,000 members to support politicians who are favorable towards cryptocurrency, as reported by Reuters. This PAC, known as Stand With Crypto, is endorsing a bipartisan selection of candidates contesting in both the House of Representatives and the Senate.\nStand With Crypto’s PAC is part of a larger effort within the cryptocurrency industry to back political candidates who advocate for the advancement of crypto and blockchain technology. Other prominent PACs in this endeavor, such as Fairshake, Defend American Jobs, and Protect Progress, have collectively amassed over $110 million in contributions for this election cycle, as reported by the Federal Election Commission.\nThe involvement of cryptocurrency entities in the current electoral process occurs amidst increased scrutiny following the conviction of FTX founder Sam Bankman-Fried for embezzlement last year. Allegations suggest that Bankman-Fried diverted funds to contribute more than $100 million to various U.S. political campaigns.\nWhile PACs like Stand With Crypto are established to pool resources for specific candidates or causes, they operate differently from super PACs, which can accept unrestricted donations but are prohibited from direct coordination with campaigns.\nAmong the endorsed candidates are Jim Banks, a Republican running for Senate in Indiana; Jim Justice, a Republican Senate candidate from West Virginia; Shomari Figures, a Democrat vying for Alabama’s Second District representation; Eddy Morales, a Democratic candidate for Oregon’s Third District; and Troy Downing, a Republican contender for Montana’s Second District seat.\nNick Carr, chief strategist at Stand With Crypto, said “The goal is to endorse candidates and support candidates that are protecting the rights of our advocates of Stand With Crypto throughout November.”\nThe cryptocurrency industry asserts its active participation in this electoral cycle. Crypto super PAC Defend American Jobs celebrated victories in Indiana primaries, where four endorsed candidates, including Jim Banks and Mark Messmer, a Republican running to represent the state’s Eighth District, secured their nominations.\n","create_date":"2024-05-11T06:14:52+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123068/biden-shuts-chinese-linked-crypto-mining-facility-over-national-security-concerns/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The president's order halts operations immediately, requiring equipment removal within 90 days and property sale or transfer within 120 days.","title":"Biden Shuts Chinese-Linked Crypto Mining Facility Over National Security Concerns","content":" President Biden has issued an executive order mandating the closure and divestment of a Wyoming-based cryptocurrency mine operated by a Chinese-affiliated company.\nThe move comes after investigations revealed potential risks associated with the facility’s proximity to a key Air Force base controlling nuclear-armed intercontinental ballistic missiles.\nThe cryptomining operation, situated near the F.E. Warren base in Cheyenne, faced scrutiny due to its utilization of high-powered computers in a data center, raising alarms about potential surveillance and espionage threats. The president’s order, citing national security concerns, directs the immediate cessation of operations and the removal of all equipment within 90 days, followed by the sale or transfer of the property within 120 days.\nThe decision underscores growing apprehensions surrounding Chinese-owned cryptocurrency mines operating in the United States. These facilities, which have proliferated following regulatory crackdowns in China, have drawn attention due to their massive electricity consumption and their potential implications for national security.\nIn recent years, Chinese-owned cryptomining operations have expanded across various states, with facilities collectively consuming electricity equivalent to 1.5 million homes. Concerns have been raised about the ties some of these operations have to the Chinese government or Communist Party, prompting calls for tighter regulations and restrictions on foreign ownership.\nBiden’s executive order reflects broader efforts to address national security risks posed by foreign-controlled critical infrastructure. It comes on the heels of bipartisan legislation targeting Chinese-owned companies, including a recent bill aimed at banning the social media app TikTok unless it undergoes a change in ownership.\nThe move also follows similar actions at the state level, such as Arkansas’s recent laws restricting foreign ownership of cryptomining operations. These legislative measures aim to safeguard against potential threats while addressing community concerns regarding noise pollution and property devaluation associated with cryptomining activities.\nIt is worth noting that the Biden Administration has previously initiated efforts to tighten regulations on the U.S. Bitcoin mining industry, citing China’s actions as a model to follow in its ongoing scrutiny of crypto.\nIn 2021, the Chinese government imposed stringent restrictions on crypto mining, prompting a mass migration of mining operations to the United States.\nThis recent directive from the White House coincides with the administration’s plans to escalate tariffs on various Chinese imports, including electric vehicles, scheduled to take effect the following day.\n","create_date":"2024-05-14T06:51:22+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123373/propelling-saudi-arabias-web3-leap/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Saudi Arabia cautiously explores Web3! Gaming, innovation & the BRICS influence shape their strategy. Is the kingdom the next Web3 hub?","title":"Saudi Arabia Poised for a Cautious Leap into Web3: Gaming, Innovation, and BRICS Influence","content":" Driven by its ambitious Vision 2030 plan for economic diversification, the kingdom of Saudi Arabia is strategically entering the Web3 space. This move extends beyond domestic ambitions, potentially impacting its role within the BRICS economic bloc. Here’s a breakdown of this evolving narrative.\nSaudi Arabia isn’t rushing into Web3. Ongoing discussions between Saudi officials and major cryptocurrency exchanges highlight their commitment to exploring crypto adoption within a well-defined regulatory framework. This balance between innovation and financial stability is a hallmark of their Web3 strategy.\nThe upcoming Esports World Cup showcases Saudi Arabia’s dedication to fostering a thriving gaming scene. This focus aligns perfectly with Web3’s potential for in-game ownership and innovative gameplay experiences. The EWC’s success could position Saudi Arabia as a leader in the rapidly growing Web3 gaming sector.\nWhile not directly competing with regional leaders like the UAE and Bahrain, Saudi Arabia can learn valuable lessons from their experiences navigating the Web3 landscape. Studying their successes and challenges can help them implement more effective strategies.\nThe increasing number of Saudi-based NFT projects exemplifies Saudi Arabia’s Web3 leap. This growing interest in exploring the potential of non-fungible tokens fosters a budding NFT ecosystem that could unlock new avenues for creators and collectors. Examples include the NFT collection featuring iconic landmarks like Mekkah and Madina available on OpenSea.\nFurthermore, the Saudi Arabian Public Investment Fund’s (PIF) increased investment in South Korea’s prominent Blockchain and NFT-enabled gaming company, NCSoft Corp, underlines Saudi Arabia’s Web3 leap. This strategic move strengthens the kingdom’s position within the global Web3 landscape.\nInstitutions like King Abdulaziz City for Science and Technology (KACST) are actively collaborating with industry leaders to propel Saudi Arabia’s Web3 leap forward. KACST, in partnership with Animoca Brands’ technology hub The Garage, plans to establish a physical Web3 hub in Riyadh. This hub aims to enhance research and development efforts within the fields of Web3, blockchain, gaming, and AI. It will also provide bespoke educational programs, fostering a skilled workforce within the kingdom. These initiatives highlight Saudi Arabia’s commitment to building a robust Web3 ecosystem that caters to creators, businesses, and researchers alike, solidifying its position as a key player in the global Web3 arena.\nFurther exemplifying Saudi Arabia’s commitment to building a robust Web3 ecosystem is the recent strategic partnership memorandum of understanding (MOU) between NEOM Company, a key player in realizing the Saudi Vision 2030 plan, and Animoca Brands Corporation Limited, a prominent leader in digital property rights within the open metaverse. This partnership is bolstered by a US$50 million investment proposal from the NEOM Investment Fund into Animoca Brands.\nThis collaboration signifies a commitment to building world-class Web3 enterprise service capabilities. One of the key focuses will be establishing a Web3 hub within NEOM, leveraging Animoca Brands’ expertise and fostering innovation within the local Web3 ecosystem. This initiative aligns perfectly with Saudi Arabia’s ambitions to become a major player in the global Web3 landscape.\nA YouGov survey revealed a fascinating trend in Saudi Arabia (December 2023): easy accessibility is the primary driver for residents considering crypto investments. With 77% of Saudis aware of cryptocurrencies and nearly half (49%) citing accessibility as a key motivator, a surge in public interest underscores the potential for wider crypto adoption once clear regulations and user-friendly platforms are established.\nThe winds of change aren’t just felt by consumers. Major investment firms and VCs from KSA are actively investing in blockchain and crypto projects. Saudi Aramco has already built a blockchain-based supply chain management system, demonstrating a practical application of the technology within a major state-owned company. These investments by leading players signal confidence in the potential of Web3 and its applications.\nAs a member of the BRICS economic bloc , Saudi Arabia’s Web3 embrace has a wider geopolitical context. BRICS nations are increasingly seeking ways to reduce dependence on the US dollar in international trade. Blockchain technology, with its potential for facilitating direct settlements between member states, aligns with this goal. There’s also speculation that some BRICS countries, including Saudi Arabia, might launch their own digital currencies in the future.\nThe exact timeline for comprehensive crypto asset regulations in Saudi Arabia remains unclear. While The Saudi Central Bank has indicated no plans for a CBDC, their interest in blockchain technology for cross-border payments suggests a willingness to embrace the underlying tech. This cautious approach ensures financial stability while fostering innovation. It’s important to note that currently, there are no legal penalties in place for trading in digital assets like crypto or NFTs.\nWith its strategic partnerships, a burgeoning gaming scene, a commitment to learning from regional experiences, and a young, tech-savvy population, Saudi Arabia is well-positioned to establish itself as a major player in the global Web3 arena. Additionally, its Web3 embrace could have a significant influence within the BRICS economic bloc, potentially paving the way for a future of collaboration and innovation in the digital asset space. The coming years will be crucial in determining the success of Saudi Arabia’s Web3 strategy. How effectively they navigate the regulatory landscape, foster a thriving ecosystem, and capitalize on the potential of blockchain technology will determine their ultimate impact on this rapidly evolving space. One thing is certain: Saudi Arabia’s cautious leap into Web3 is a story worth watching.\n","create_date":"2024-05-20T13:52:10+00:00","tag":"","author":"Walid Abou Zaki"},
{"url":"https://www.unlock-bc.com/122962/trumps-crypto-crusade-navigating-partisan-waters-in-presidential-politics/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Former President Trump rallied crypto investors at Mar-a-Lago, affirming his alignment with the crypto community and urging support.","title":"Trump's Crypto Crusade: Navigating Partisan Waters in Presidential Politics","content":" Donald Trump is once again making waves in presidential politics by positioning himself as the potential first major party nominee to actively court cryptocurrency traders, a move that has raised concerns among some Democrats.\nAt an event at Mar-a-Lago on March 8, Trump addressed crypto enthusiasts, urging their support while criticizing what he perceives as the Biden administration’s stringent regulatory approach to the industry. This overt appeal to the crypto community marks a significant departure from Trump’s earlier criticisms during his initial term but aligns with a broader GOP trend of embracing digital assets, contrasting with ongoing Democratic divisions over the legitimacy of the industry.\nKristin Smith, CEO of the Blockchain Association, said “President Trump’s remarks signal a sea change in the importance of digital assets this election cycle,”. His stance provides him with fresh ammunition in his critique of Biden’s administration, particularly regarding the Securities and Exchange Commission’s (SEC) enforcement actions against crypto firms. Despite Biden’s veto threat, twenty-one Democrats joined Republicans in supporting a resolution challenging SEC crypto guidance, indicating a growing partisan divide on the issue.\nWhile Trump’s outreach to digital asset traders could impact voter behavior, broader public sentiment on the safety and reliability of crypto remains mixed. Trump’s evolution from skepticism to support for digital assets, underscored by his recent engagement at Mar-a-Lago, where he hosted supporters who purchased his Digital Trading Cards “Mugshot Edition” NFTs, reflects a significant shift in his position. His remarks, captured and shared on X, marked a stark departure from his 2021 comments describing crypto as “a disaster waiting to happen.”\nIn his recent speech, Trump expressed a newfound support for cryptocurrency, acknowledging its diverse forms and signaling a willingness to embrace it, a stance reinforced by his endorsement of NFT projects and ownership of various digital assets.\n“The Democrats are very much against it [crypto]. And I say this, a lot of people are very much for it … and I’m fine with it. I want to make sure it’s good and solid … but I’m good with it. If you like crypto in any form, and it comes in a lot of different forms, you better vote for Trump,” Trump said in his speech.\nThis clarity on his stance has implications for investors, with both Bitcoin and Ethereum experiencing slight increases in response to the news, highlighting the growing intersection between politics and digital finance.\nTrump’s engagement with cryptocurrency goes beyond mere words, as demonstrated by his support for NFT projects featuring his likeness and his ownership of a diverse portfolio of digital assets. This portfolio includes over 700 ETH and a considerable investment in MAGA Coin (TRUMP), valued at more than $3 million. Some interpret this investment as a vote of confidence in Trump’s chances in the upcoming election, a sentiment reflected in the notable increase in value experienced by MAGA Coin following the spread of Trump’s speech.\n","create_date":"2024-05-11T12:09:38+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122957/crypto-bill-fit21-set-for-full-floor-vote-confirms-u-s-houses-mchenry/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The FIT21 legislation, aimed at governing U.S. crypto markets, is moving towards a House vote, possibly concluding this endeavor.","title":"Crypto Bill FIT21 Set for Full Floor Vote, Confirms U.S. House's McHenry","content":" Lawmakers from the United States House Financial Services Committee have revealed their preparations for a comprehensive floor vote on the Financial Innovation and Technology for the 21st Century Act, commonly referred to as FIT21.\nIn a statement on May 10th, Chairperson Patrick McHenry indicated that the entire chamber could be poised for a vote on the FIT21 legislation “later this month,” pending deliberations in the House Committee on Rules.\nInitially approved by the committee in July 2023, the bill aims to define the regulatory roles of the U.S. Commodity Futures Trading Commission (CFTC) and the Securities and Exchange Commission (SEC) in overseeing digital assets.\nRepresentative French Hill expressed satisfaction, stating, “After tirelessly working across the aisle and across the nation over the past year to craft a clear, pragmatic regulatory framework for digital assets, I am proud that this landmark legislation is coming to the House Floor.” Hill emphasized the necessity for robust consumer protections and a cohesive regulatory structure following the FTX collapse, underscoring the importance of safeguarding investors and consumers while fostering America’s prominence in blockchain innovation.\nRepublican legislators argue that the FIT21 bill would empower the CFTC with additional oversight of digital commodities and clarify the SEC’s jurisdiction over cryptocurrencies. This announcement followed a bipartisan House vote supporting a resolution to revoke an SEC accounting regulation concerning crypto, criticized for imposing constraints on banks.\nThe bill’s prospects for passage in the House remain uncertain. While Representative McHenry attributed the legislation’s progression to bipartisan collaboration, its journey entails approval from the Senate and eventual enactment by President Joe Biden.\nSheila Warren, CEO of the Crypto Council for Innovation, highlighted the significance of the updated bill language for stakeholders to evaluate changes made since its markup by the HFSC, Republicans, and Democrats last July. She acknowledged FIT21’s imperfections but hailed it as a pivotal milestone towards establishing a federal regulatory framework for digital assets in the U.S.\nWith the U.S. in an election year, many lawmakers prioritize regulating digital assets as a campaign agenda. Coinbase’s Stand With Crypto initiative recently launched a political action committee to endorse pro-crypto candidates in 2024. Representative McHenry, who announced he will not seek reelection in December, remains engaged in advancing crypto-related legislation.\n","create_date":"2024-05-11T08:47:19+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88280/arshad-khan-if-luna-wanted-to-be-listed-on-yoshi-we-would-not-have-accepted/","web_url":"https://www.unlock-bc.com/","type":"article","description":"In the interview, Khan said that the industry is not operating at 1% capacity, and the world is still in its early stages of adopting crypto","title":"Arshad Khan: if Luna wanted to be listed on Yoshi, we would not have accepted","content":" From businesses and financial institutions to everyday investors, the blockchain and crypto space is attracting new customers on the daily. Regardless of being in a bear market at the moment, the number of traders as well as exchanges is still increasing, and the UAE is witnessing an influx of exchanges, including giants like Binance, Kraken, Crypto.com, FTX and many more, thanks to its strict regulatory environment.\nYoshi Markets Limited, a Multilateral Trading Facility and Custodian based in Abu Dhabi Global Market (ADGM), has received FSP from Financial Services Regulatory Authority of ADGM. Its main aim is to be a preferred venue for virtual assets listing, trading, settlement and custody that will offer a fully integrated ecosystem to institutional, HNI and retail investors.\nIn an interview between Unlock Blockchain Founder & CEO, Walid Abou Zaki and CEO of Yoshi Markets, Arshad Khan, the latter mentioned that the project started a few years back, and the whole team has been very involved with ADGM, the pioneers of blockchain and cryptocurrency regulation.\nHe said, “It means a lot to us, as we spent years getting ourselves ready, by building a solid infrastructure, technology and team. And now, we finally got the approval and license”. He added, “This shows that one must have a very slow and steady approach in this industry. We gained a lot of experience because it is not about being the first in this space, but the most sustainable one. In fact, it takes a lot of planning and hard work to come up with a business model that sustains itself and gives a perpetual presence to the entity”.\nWhen asked about the surplus of exchanges in the market and the giants that have been dominating it, Mr. Khan made it clear that the industry is not even operating at 1% capacity, and the world is still in its early stages of adopting crypto and digital assets. However, it will evolve at a very fast pace in the next few years.\nKhan is not worried about competition from existing giants, for there will be enough space for everyone in the market once it grows to another level.\nIn the meantime, Yoshi Markets has sealed a deal with Tezos Gulf, while keeping its long-term plan in place. Not only does the company want to be a platform where clients buy and sell cryptocurrencies, but also one that is suitable for businesses that plan on raising capital.\nThis can be done by using security tokens where businesses can invest in projects of substantial value, all along keeping the process simple and low-priced. And this is what makes Yoshi Markets unique, as activities of this nature are highly regulated.\nIn addition to that, the company has now started on-boarding clients from all over the world. A KYC process, which is very rigorous yet simple, has been put in place, so that the client does not go through any sort of hassle. Nonetheless, a lot happens in the backend, as the team works hard to make sure they do not let militias or individuals with bad intentions in.\nMr. Khan acknowledged the huge responsibility that comes with listing on the market, which is why most unregulated exchanges fail and tokens like the Luna Classic crash.\nHe clarified, “Any listing project that comes to most unregulated platforms and pays listing fees, gets accepted. However, if Luna wanted to be listed on Yoshi, we would not have accepted because the algorithm is too complicated for anyone to understand. People must be aware of that because in just a few years, thousands of crypto currencies have emerged, but do we need them all? Not really. Nevertheless, we are always on the lookout for new projects, but one has to choose wisely when investing”.\nYoshi Markets is its own custodian and does not rely on third-part institutions.\nSetting up an exchange is simple but having custody is the main challenge. What happens post-trade is a very serious and challenging process. So, if the exchange can also offer that service to its customers, it would be creating an advantage for the marketplace.\nAs an exchange, there is an immense responsibility that comes with securing the client’s assets, and this should not involve a third party to do so, for if there is no tight relationship with this entity or the knowledge on how secure it is, then assets can be at high risk.\nFor this reason, Yoshi Markets has spent so much time strategizing to come up with an infrastructure that supports the best industry standards. Also, when an exchange is able to on-board, trade, and has custody all at once, fees are kept low.\nThere is no doubt that environmental activists as well as many governments have been trying to slow down the mining process, as it causes damage to the environment. However, Mr. Khan explained that mining has always been through ups and downs, whether in China, Europe and now the US, but the industry has outgrown itself so that it does not get affected by such decisions.\nHe said, “This industry is very fast moving, and I think the UAE will be the greatest benefiter from what is happening. Actually, the largest mining farm is now being set up in Abu Dhabi”.\nHe concluded, “I am not worried about this. It is affecting the market, but it won’t last long; this will be the last bump before moving forward once and for all”.\n","create_date":"2022-06-13T07:21:15+00:00","tag":"","author":"Anna K."},
{"url":"https://www.unlock-bc.com/122834/ftx-bankruptcy-cash-reimbursement-not-crypto/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Explore how FTX's bankruptcy plan prioritizes full CASH reimbursement for creditors over CRYPTO , without factoring in asset value gains","title":"FTX Bankruptcy Plan Offers Full Cash Reimbursement to Creditors, not crypto! The House Wins","content":" In a significant development following its bankruptcy filing, cryptocurrency exchange FTX is moving forward with a plan that could see some of its creditors fully reimbursed for their losses. However, the catch is that these reimbursements will be in cash, omitting any gains from the surge in digital asset prices since the exchange’s collapse in November 2022.\nThe proposed bankruptcy plan, detailed in a recent news release by FTX, outlines a path to provide relief to 98% of its creditors, including individual investors who had $50,000 or less with the company. If approved by both the court and creditors, these individuals can expect to receive the full amount of their lost funds within 60 days of the plan’s implementation.\nThe proposed Plan aims to distribute the majority of FTX’s assets, valued between $14.5 and $16.3 billion, to creditors and customers worldwide, surpassing the total debts owed to creditors, which are estimated at $11 billion.\nFTX’s rationale behind this decision lies in the massive shortfall it faced at the time of filing for bankruptcy, particularly in its holdings of bitcoin and Ethereum. With only a fraction of the digital assets that customers believed the platform possessed, FTX has had to explore alternative avenues to repay creditors, focusing on monetizing other assets to generate funds for reimbursement.\nJohn J. Ray III, Chief Executive Officer and Chief Restructuring Officer of FTX, expressed the company’s perspective on the plan, stating, “We are pleased to be in a position to propose a chapter 11 plan that contemplates the return of 100% of bankruptcy claim amounts plus interest for non-governmental creditors.”\nWhile the plan promises full repayment to non-governmental creditors based on the valuation of their claims as determined by the Bankruptcy Court, the exclusion of digital asset gains underscores the complexities of managing assets in the volatile cryptocurrency market, especially in the context of bankruptcy proceedings.\nInterestingly, FTX’s press release did not address the fate of FTT holders. FTT continues to circulate on major exchanges, currently trading at $1.85 per token, marking a 50% increase in value since last year. Notably, the current price of FTT mirrors its launch price in 2019, although it reached a peak of $77 in September 2021. The absence of any mention of FTT holders in the bankruptcy plan implies that their status may be viewed differently, potentially as part of the overall debts owed by FTX.\n","create_date":"2024-05-09T07:08:11+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123013/metaplanet-shifts-to-bitcoin-amid-japans-economic-challenges/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The company emphasized bitcoin's unique monetary policy, which is fixed until the year 2140, with a maximum supply of 21 million bitcoins.","title":"Metaplanet Shifts to Bitcoin Amid Japan’s Economic Challenges","content":" Metaplanet Inc., a crypto investment and consulting firm listed in Tokyo, has announced its adoption of bitcoin as a strategic treasury reserve asset, citing the ongoing economic difficulties faced by Japan.\nIn a statement released Monday, the company addressed the persistent economic pressures in Japan, including high government debt levels, extended periods of negative real interest rates, and the resulting weakening of the yen.\nAccording to data from the International Monetary Fund, Japan currently holds the highest government debt-to-GDP ratio among developed nations, standing at 254.6%. Despite the government’s decision in March to raise interest rates, the Japanese yen plummeted to its lowest level in 34 years last month, as reported by Reuters.\nMetaplanet highlighted bitcoin’s role as a “non-sovereign store of value,” noting its appreciation against fiat currencies. The company emphasized bitcoin’s unique monetary policy, which is fixed until the year 2140, with a maximum supply of 21 million bitcoins.\n“Bitcoin’s monetary policy is rigidly set in stone through 2140, setting it apart from both monetary metals and competing crypto projects operated at the whims of centralized developer teams,” stated Metaplanet.\nIn addition, Metaplanet revealed its intention to leverage the “entire range” of capital market instruments to expand its bitcoin reserves. As of May 10, the company reportedly owned 117.7 BTC, equivalent to approximately $7.2 million, according to data from Bitcointreasuries.net.\nThe decision by companies like Metaplanet Inc. to adopt bitcoin as a strategic treasury reserve asset holds significant implications for the validation of bitcoin’s value. As more businesses across diverse industries make the transition to incorporating bitcoin into their financial strategies, it underscores a broader acceptance and recognition of bitcoin’s legitimacy as a store of value and an investment asset.\nTraditionally, companies have relied on conventional assets like cash, stocks, and bonds to manage their treasury reserves. However, the growing economic uncertainties, particularly in regions like Japan with high government debt levels and negative interest rates, have prompted businesses to seek alternative options to safeguard their wealth and hedge against inflationary risks.\nBy embracing bitcoin, companies signal their confidence in the long-term viability and potential growth of the cryptocurrency. This validation from corporate entities not only enhances bitcoin’s credibility but also contributes to its increasing adoption and integration into mainstream financial systems.\nMoreover, the strategic shift towards bitcoin by companies like Metaplanet Inc. highlights the evolving landscape of the global economy, where digital assets play an increasingly significant role. As bitcoin gains traction as a reserve asset among corporations, it further solidifies its status as a legitimate asset class with intrinsic value and long-term investment potential.\nOverall, the growing trend of companies switching to bitcoin underscores a broader paradigm shift in the perception of cryptocurrencies, from speculative instruments to legitimate stores of value. This validation by corporate entities serves to reinforce confidence in bitcoin’s role as a resilient and viable asset in the modern financial ecosystem.\n","create_date":"2024-05-13T10:31:42+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88264/metacrafters-io-raises-4-5m-for-web3-developers/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Metacrafters.io,a learn-to-earn game, announced it has raised a $4.5M multichain grant from Solana, Flow, Avalanche, and Polygon Foundations.","title":"Metacrafters.io Raises $4.5M for Web3 Developers","content":" Metacrafters.io, a collaborative Web3 developer curriculum that lives within a multiplayer, learn-to-earn game, announced it has raised a $4.5M multichain grant from Solana, Flow, Avalanche, and Polygon Foundations.\nMetacrafters.io is the first project launched by Proof of Learn, Inc., a Web3 education platform with a mission to unlock accessible, high-quality education across the world through blockchain and a learn-to-earn protocol. Proof of Learn raised a seed round in Q1’2022 of approximately $17M, led by New Enterprise Associates (NEA) and joined by Animoca Brands, GoldenTree Asset Management, gumi Cryptos Capital, Infinity Ventures Crypto, Arca, Wavemaker Ventures, Learn Capital, and Rethink Education.\nMetacrafters students will pay tuition for courses in cryptocurrency, but upon completion will earn back their tuition plus additional rewards. The grant money will be used to fund cryptocurrency rewards and incentivize students to take developer courses and learn Web3 coding skills. Course completion will also be rewarded with a Proof of Learn NFT minted as a permanent, public credential on the blockchain as well as a Treasure NFT that can be used in the game world or sold to another player in the marketplace.\nWith multichain grants a rarity in Web3, Proof of Learn is thrilled in not only the size of the investment but also in the foundations’ commitment to joining the Metacrafter vision and mission to support the developers of the future. Metacrafters will use the grants to bring together a community of developers who want to expand their skills from Web2 into Web3 and to help support the learn-to-earn model. A majority of the grant will go toward funding financial rewards for over 12,000 Solana, Flow, Avalanche, and Polygon course completions.\n“There is an extreme shortage of blockchain and crypto developers in Web3. Proof of Learn’s Metacrafters won’t just educate developers in this new realm — we will also provide potential employers with on-chain, guaranteed credentials for our job-ready students. Companies and projects will be able to go to Metacrafters to access and verify student skills in real time, virtually instantly finding the exact talent they seek,” says Proof of Learn’s Sheila Lirio Marcelo.\n“The internet enabled anyone, anywhere to create a company that can change the world,” said Raj Gokal, Co-Founder of Solana. “Blockchain developers are in high demand, and projects like Metacrafters will not only teach developers to become fluent in the skills they need to build for blockchain, but also advance the overall growth and development of the Web3 ecosystem.”\nRyan Wyatt, CEO of Polygon Studios, said: “We’re immensely proud to be supporting Proof of Learn in their efforts to build a more robust and innovative Web3 environment. Merging gameplay and education within a ‘learn-to-earn’ framework promises to bridge blockchain’s vast talent gap and incentivize a new generation of native Web3 developers.”\n","create_date":"2022-06-12T16:59:05+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122402/binance-founder-cz-receives-four-month-prison-term/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Binance's CZ sentenced to 4 months, a significant departure from the recommended 36 months. Is this a win for him? How's Binance faring?","title":"Binance Founder CZ Receives Four-Month Prison Term Instead of 36 Months","content":" Changpeng Zhao (CZ), the founder of Binance, was handed a four-month prison sentence on Tuesday, April 30, 2024, following his admission of guilt to charges related to facilitating money laundering at his cryptocurrency exchange.\nThis verdict, issued in a Seattle federal court, came as a surprise departure from the three-year term initially sought by federal prosecutors. In contrast, the defense had proposed a mere five months of probation. Notably, the sentencing guidelines had originally recommended a term of 12 to 18 months behind bars.\n“I’m sorry” CZ told the judge before the sentencing, as reported by Reuters. “I believe the first step of taking responsibility is to fully recognize the mistakes. Here I failed to implement an adequate anti-money laundering program … I realize now the seriousness of that mistake.”\nThe sentencing recommendation for CZ, stemming from a plea agreement, underscores the gravity of his offenses and the urgent need for deterrence. Despite guidelines suggesting a 12 to 18-month term, the recommendation advocated for the maximum penalty: three years in prison and a substantial $50 million fine.\nAs the dust settles on this legal saga, the once-reigning figure in the crypto world appears to be relinquishing his throne. With his departure, the future of Binance now rests in the hands of his successor, Richard Teng, who has been steering the ship amid regulatory challenges. Recent developments, such as securing a Virtual Asset Service Provider (VASP) license from the UAE regulator VARA in Dubai, signal resilience and adaptation in the face of adversity.\n","create_date":"2024-04-30T20:01:06+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88359/revoland-raises-10-6-m-during-the-seed-and-pre-sale-rounds/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The $10.6 million fundraise was led by HashKey Capital and Polygon Ventures alongside 14 other crypto venture capital firms.","title":"Revoland raises $10.6 M during the seed and pre-sale rounds. ","content":" Revoland has raised $10.6 million during the seed and pre-sale rounds. The $10.6 million fundraise was led by HashKey Capital and Polygon Ventures alongside 14 other crypto venture capital firms. The list of backers includes Tian Ge Interactive, AKG Venture, LinkVC, Arcanum Capital, Atlas Capital, Crypto Nord, PlayPark, MX investment, One Block Capital, AW Capital, Phemex Venture, Winston International, Gene Vision and Yield Master.\nCEO Jimmy Zhao, believes, gaming will fast-track the adoption of Web3 solutions. “With Revoland, we’ve created a space where players will have full control over their in-game assets, take an active part in the construction of the game ecosystem, promote its development and act as its governors through leveraging REVO, our governance token”, Jimmy commented. Revoland calls on gamers to team up with colleagues, family, and friends to compete with other players for rewards in $LAND, another native token of the platform. The gameplay is a combination of personal skills and teamwork; while the lack of pause function adds a high degree of interactivity. This way, the project creates a truly social gaming experience with a high level of inclusivity, as the game also features a free-to-play version. Those wishing to commit and explore the game deeper can spend their $LAND on Mystery Boxes with characters and upgrades.\n","create_date":"2022-06-15T12:17:08+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88367/crypto-community-prays-for-celsius-to-stay-alive-in-hopes-of-resurrecting-the-space/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Celsius fights to stay alive as cryptocurrencies plunge in value and Federal Reserve intends to increase interest rate tonight.","title":"Crypto Community Prays for Celsius to Stay Alive in Hopes of Resurrecting the Space","content":" With the market entering its deepest and darkest phase, Celsius, the giant US DeFi lending platform, has been fighting to keep its feet on the ground after announcing the pause of its withdrawals, swaps and transfers between accounts, locking all its customers out of their money.\nBitcoin and other cryptocurrencies took a beating on the news, for the world’s biggest digital asset decreased by 15%, reaching $20,150, almost near the peak of 2018. Ether also dropped 17%, reaching $1,030, while Celsius’ cel token plunged more than 38%.\nIn addition to that, cryptocurrencies have also been tangled up in a market panic over rising inflation and higher interest rates, which has dulled the appetite for higher-risk assets, making the situation even worse.\nIn actual fact, the Federal Reserve will most probably raise rates by three quarters of a point tonight, according to Fed funds futures listed on the CME. This marks a huge unexpected change in sentiment from Monday, when just 40% of investors believed the Fed would raise rates that high. A week ago, expectations for an increase were just 3%. Does this mean we’re headed towards a recession? Only time will tell.\nNow, with $8 billion worth of cryptocurrencies tied up in Celsius accounts and loans, the platform remains a main threat to the space; if the latter starts liquidating assets, this will definitely cause a turmoil in the market. In fact, some have already speculated that the most recent declines have been happening because of the company selling.\nMoreover, regulators will seize every opportunity they have to control the industry, and this would be the perfect excuse to go there, which leads us to the long- term risk: strict and prohibitive regulations.\nHowever, this situation raises a question that is probably on the mind of every crypto enthusiast and investor: unlike traditional financial institutions, such as banks, blockchain technology allows one to be in full control of their assets. But isn’t this the case with Celsius, as investors have no longer access to theirs?\nBlockchain transparency & control over assets\nAs mentioned above, the group, which offers users higher-than-average interest rates on their deposits, is essentially the crypto equivalent of a bank — but without the strict insurance requirements faced by traditional lenders. Nonetheless, since it functions under blockchain technology, depositors have significantly more control over their personal information and financial data than users of fiat currencies.\nThis shows that at the end of the day, even if one is fully invested in this technology and hands over their assets to an exchange, they will not be in control of anything they own, as Celsius’ decision to pause all transactions confirms that.\nFuture of the market & other projects\nCelsius explains that its decision is intended to protect the community, and that the activity itself will serve the users, but there is nothing in this action that really serves them. It is just a signal to announce that the company is in a liquidity crisis and it cannot meet its obligations.\nNevertheless, this remains a great tragedy for the immense number of users who have put all their trust in this platform, as they have lost huge amounts of money that they might not even get back. But the Celsius situation is only a small part of the bigger picture; the company’s collapse took place not only because of its business model, but because it invested its assets in projects with a business model similar to its own. These projects operated on a mutual feed of risk aimed at creating artificial demand for their currencies, which made them look more successful than they really were. This is why, other projects are expected to collapse as well, which will cleanse the market in the long-run. But this steadiness will not be achieved without regulatory intervention and oversight of players managing billions of dollars in assets. Until then, cryptocurrencies will keep on suffering and more projects will eventually fall.\nLikewise, it is not looking good for MicroStrategy, a huge investor in Bitcoin, which has borrowed $205 million from crypto bank Silvergate Capital Corp in March, with the three-year loan mostly secured against some 19,466 bitcoins.\nThe CEO of the technology company actually began purchasing Bitcoin in August 2020, bringing the company’s total to 129,218 Bitcoins over the following months.\nSince MicroStrategy owns roughly 129,218 bitcoin, a drop in the value of Bitcoin is commonly connected to a drop in its share price.\nThe lower the price goes, the bigger risk it poses to the company, and if the value of Bitcoin keeps decreasing, MicroStrategy may have to offer up more of its Bitcoin stash to cover the loan with Silvergate Bank that has been used to buy more Bitcoin. In other words, if both companies, whether Celsius or MicroStrategy, officially reach liquidation state, it will create an intense selling pressure, leading to a bigger crash of the market.\nHowever, the good news is that even if we reach that point, the company holds sufficient Bitcoin to secure the loan and still have some in store, giving investors a sense of relief..\nBetter yet, all it takes is a rise in Bitcoin price to clear this out, in hopes of readjusting the whole space and Celsius issue. Nonetheless, tonight’s decision of the Federal Reserve regarding the increase in interest rate will be the deal breaker, as it will affect the price of Bitcoin even more, making it a fight- fire- with- fire situation.\n","create_date":"2022-06-15T15:50:44+00:00","tag":"","author":"Anna K."},
{"url":"https://www.unlock-bc.com/123096/hong-kong-etfs-bleed-millions-as-market-turbulence-rages-on/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Bosera, ChinaAMC, and Harvest Global’s Bitcoin ETFs collectively lost $32.7 million, with ChinaAMC’s fund highest outflow of $15.5 million.","title":"Hong Kong ETFs Bleed Millions as Market Turbulence Rages On","content":" Hong Kong’s Bitcoin and Ether exchange-traded funds (ETFs) experienced their largest-ever net outflow on Monday, May 13, wiping out all gains made since their launch less than two weeks ago.\nAccording to data from Farside Investors, Bosera, ChinaAMC, and Harvest Global’s spot Bitcoin ETF funds saw net outflows of $32.7 million, with ChinaAMC’s Bitcoin fund leading the losses with $15.5 million in outflows. Additionally, spot Ether ETFs from the same issuers recorded total joint net outflows of $6.6 million, with Harvest Global and ChinaAMC each seeing $3 million in outflows.\nSince their trading launch on April 30, these funds have collectively experienced $20.9 million in total outflows, surpassing the $18.4 million in total inflows as of May 10.\nMonday marked the third consecutive trading day of net outflows for Hong Kong’s crypto ETFs, with a total of $52.5 million withdrawn from the funds since May 9. Notably, it was the first time Harvest Global’s Bitcoin ETF recorded outflows, amounting to $9.8 million.\nThis trend coincided with Bitcoin trading below $61,000 over the weekend, which many attribute to a post-halving slump. Bitcoin mining rewards were halved on April 20, typically leading to a decrease in Bitcoin’s price in the following weeks.\nIt’s important to note that Hong Kong’s crypto ETF market is much smaller in terms of funds offered and assets under management compared to the United States. While the US boasts over $50 billion in assets under management across 11 spot Bitcoin ETFs, Hong Kong’s ETFs manage only $179.2 million, with the majority allocated to Bitcoin ETFs.\nIn another report, Hong Kong’s six spot Bitcoin and Ether ETFs recorded their largest net outflows since debuting on April 30. The combined daily net outflow for Bitcoin ETFs managed by China Asset Management, Harvest, Bosera, and HashKey totaled 519.5 BTC on Monday, compared to 99.99 BTC on Friday.\nChinaAMC’s Bitcoin ETF saw the highest outflows, followed by Harvest and Bosera HashKey. The total net assets of these ETFs shrunk to $219.7 million from $262.7 million on Friday.\nSimilarly, the three spot Ether ETFs experienced their largest daily net outflows on Monday, with a total of 2,270 ETH exiting the products. In USD terms, these ETFs recorded a total net outflow of $6.6 million.\nAs of Monday, Bitcoin was trading at around $62,400, up 2.74% over the past 24 hours.\n","create_date":"2024-05-14T09:41:46+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88285/celsius-network-pauses-all-activities-as-market-collapses-and-major-coins-drop/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Crypto lender Celsius Network decided to pause its withdrawals, swaps and transfers on its platform, leading to steep drop in major coins.","title":"Celsius Network Pauses All Activities as Market Collapses and Major Coins Drop","content":" As the market continues to slump, crypto lender Celsius Network Ltd. decided to pause its withdrawals, swaps and transfers on its platform, leading to a grand cryptocurrency selloff and prompting a competitor to announce a potential bid for its assets.\nAs a result, the announcement created a huge fuss, as Bitcoin dropped as much as 10%, reaching its lowest level since December 2020, as well as other major coins that plunged steeply, such as Ether.\nThe announcement came as follows:\nWe are writing with a very important message for our community.\nDue to extreme market conditions, today we are announcing that Celsius is pausing all withdrawals, Swap, and transfers between accounts. We are taking this action today to put Celsius in a better position to honor, over time, its withdrawal obligations.\nActing in the interest of our community is our top priority. In service of that commitment and to adhere to our risk management framework, we have activated a clause in our Terms of Use that will allow for this process to take place. Celsius has valuable assets and we are working diligently to meet our obligations.\nWe are taking this necessary action for the benefit of our entire community in order to stabilize liquidity and operations while we take steps to preserve and protect assets. Furthermore, customers will continue to accrue rewards during the pause in line with our commitment to our customers.\nWe understand that this news is difficult, but we believe that our decision to pause withdrawals, Swap, and transfers between accounts is the most responsible action we can take to protect our community. We are working with a singular focus: to protect and preserve assets to meet our obligations to customers. Our ultimate objective is stabilizing liquidity and restoring withdrawals, Swap, and transfers between accounts as quickly as possible. There is a lot of work ahead as we consider various options, this process will take time, and there may be delays.\nWe thank the incredible Celsius community for your support today. It is our pleasure to serve you. Our operations continue and we will continue to share information with the community as it becomes available.\nSincerely,\nThe Celsius team\nIt is important to note that Celsius, which raised $750 million in funding late last year, is a significant player in crypto lending. It offers interest-bearing products to customers who deposit their cryptocurrencies with the company, and lends out crypto currencies to earn a return.\nAccording to its website, the company had processed $8.2 billion worth of loans and had $11.8 billion in assets as of May 17. The company also mentioned last August that it had more than $20 billion in assets.\nHowever, unusual token movements began on Sunday, around 6 pm EST when a huge amount of wBTC was removed from the Aave staking and lending platform.\nSo far, 9, 500 wBTC tokens (worth about $247 million) have been redeemed from Aave, and following several transactions, all these tokens have been sent to FTX exchange for unknown reasons. Moreover, 54,749 ETH (wroth about $74.5) have been also sent to FTX.\nSince Sunday, Celsius has staked 204 million USDCs on Aave, and has deposited 10 million USDCs, in addition to 8.2 million DAI on Compound, which means that the total amount of the stable coins that have been re-staked by Celsius, almost matches the number of wBTC removed tokens. Nonetheless, it still not close to the value of wBTC and ETH combined.\nCrypto and blockchain enthusiasts and experts have been commenting on the poor transparency that Celsius is providing, while keeping in mind that the company might sell the assets that were sent to FTX, or might stake them to earn yields.\n\n","create_date":"2022-06-13T09:04:41+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123065/coinbase-faces-major-outage-service-temporarily-unavailable/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The disruption came to light through an official status update indicating a \"major outage\" that commenced at 4:15 am UTC on May 14.","title":"Coinbase Faces Major Outage, Service Temporarily Unavailable","content":" United States-based cryptocurrency exchange Coinbase faced a significant setback as it encountered a “system-wide outage,” disrupting access to its platform via desktop and mobile devices.\nThe disruption came to light through an official status update from Coinbase, indicating a “major outage” that commenced at 4:15 am UTC on May 14.\nUsers attempting to access the website are met with a frustrating “503 Service Temporarily Unavailable” error message, a common indicator of server issues, as outlined in Mozilla’s developer guide, which suggests maintenance or overload as potential causes.\nCoinbase Support addressed the outage on its official channels, confirming the issue and assuring users that their funds remain secure. They promptly initiated an investigation into the root cause of the problem and commenced efforts to rectify the situation.\nThis recent incident recalls a similar disruption experienced by Coinbase and other exchanges on February 28. During a rapid surge in crypto trading activity, coinciding with a flash crash in Bitcoin’s price that led to a temporary 10% drop followed by a quick recovery, multiple platforms, including Coinbase, encountered temporary outages, according to Cointelegraph.\nWhile such outages pose inconvenience to users, they often fuel a bullish sentiment among crypto enthusiasts on platforms like Crypto Twitter. Many see the influx of traffic, causing extended downtime, as a sign of increasing interest and adoption of cryptocurrencies.\n","create_date":"2024-05-14T06:04:02+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122977/bitcoins-deja-vu-follows-2016-history-and-a-350k-price-prediction/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Rekt noted Bitcoin's current phase as the \"last pre-halving retrace,\" akin to 2016's pattern, where a 48% surge occurred six months later.","title":"Bitcoin's Déjà Vu: Follows 2016 History and a $350K Price Prediction","content":" Bitcoin seems to be tracing a similar trajectory as it did after the 2016 Bitcoin halving event, according to cryptocurrency traders, with indicators suggesting potential for both a local bottom and a significant price surge to $350,000 during the peak of this cycle.\nCrypto trader Rekt Capital noted the striking resemblance to Bitcoin’s 2016 history, particularly emphasizing a downside wick below the bottom of its current re-accumulation range within a three-week window after the Halving event. As per Rekt’s analysis, the reaccumulation range at this stage of the cycle encompasses any price below $61,081, with Bitcoin currently trading at a slightly higher price.\nAdditionally, Rekt highlighted that Bitcoin is presently in the “last pre-halving retrace” stage, reminiscent of the period in 2016, which saw a 48% spike just six months later, soaring to $973.\nOn the other hand, Timothy Peterson, the founder and investment manager at Cane Island Alternative Advisors, drew attention to the price drawdown from the all-time high (ATH) chart, indicating a more ambitious price projection. Peterson estimates Bitcoin’s current price could surge nearly sixfold by the beginning of 2025, ranging between $175,000 and $350,000, based on adoption rates and prior drawdowns.\nMeanwhile, analyzing the daily 100 moving average—a critical technical indicator for predicting long-term Bitcoin price trends— crypto trader Daan Crypto traders suggested that Bitcoin’s price might be hovering around its local bottom. They drew parallels to a comparable formation seen after the approval of 11 spot Bitcoin exchange-traded funds in January, which preceded a 32% price surge to $51,730 within a month.\nWhile these indicators offer insights into potential price movements, traders caution that support levels are subject to change and emphasize the importance of ongoing bullish activity to sustain upward momentum.\nWith Bitcoin navigating its post-halving trajectory, investors eagerly await further developments in anticipation of potential price surges and market trends.\n","create_date":"2024-05-13T07:01:54+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122925/bitpanda-mena-expansion-insights/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Exclusive insights into Bitpanda MENA's ambitious expansion plans and strategic roadmap in the UAE with Walid Benothman","title":"Exclusive Insights: Bitpanda MENA's Ambitious Expansion - An Interview with Walid Benothman","content":" In the rapidly changing world of cryptocurrency, establishing a foothold in new territories often demands meticulous planning and strategic leadership. However, Bitpanda’s recent expansion into the UAE defied convention by swiftly assembling a team of seasoned industry leaders. This move, led by Walid Benothman, signifies Bitpanda’s unwavering commitment to its global expansion endeavors.\nWe had the privilege of engaging in a candid discussion with Walid Benothman, shedding light on Bitpanda’s ambitious venture into the UAE, its strategic roadmap, and the transformative services it aims to introduce in the region.\nWalid Benothman, with a rich background in the web3 space and having played a pivotal role in the growth of 1inch Network, provided invaluable context into his decision to join Bitpanda. “The next 500 days are pivotal,” remarked Benothman, underlining the evolving dynamics of the crypto market and the paradigm shift towards institutional investors. This strategic move to Bitpanda, he emphasized, stems from a profound belief in the transformative potential of blockchain technology, particularly in empowering institutional players to leverage crypto assets effectively.\nDelving into Bitpanda’s strategic foray into the Middle East, Benothman articulated the region’s burgeoning status as an international financial hub, with Dubai at its epicenter. Emphasizing Dubai’s regulatory clarity and progressive stance towards innovation, Benothman highlighted the compelling rationale behind Bitpanda’s decision to establish its regional presence in the UAE. He noted the region’s remarkable embrace of cryptocurrency, exemplified by the significant volume of real estate transactions settled in crypto – an indication of Dubai’s proactive approach towards embracing emerging technologies.\nA pivotal question centered on Bitpanda MENA’s service offerings and whether they would mirror the diverse investment options available in Europe. Benothman affirmed this, underlining Bitpanda MENA’s commitment to offering a comprehensive suite of investment opportunities, including stocks, ETFs, commodities, and digital assets. However, he also underscored a nuanced approach, with an initial emphasis on business-to-business (B2B) services while navigating regulatory nuances and awaiting necessary approvals.\nIn discussing regulatory landscapes, Benothman drew parallels between Europe’s Markets in Crypto Assets (MiCA) framework and the regulatory framework in the UAE, emphasizing Bitpanda’s proactive engagement with regulators to enhance regulatory clarity and consumer protection. Leveraging Bitpanda’s extensive experience in obtaining licenses across Europe, Benothman articulated the company’s proactive role in contributing to regulatory evolution in the UAE.\nThe choice to pursue a license from the Virtual Asset Regulatory Authority (VARA) in Dubai prompted queries regarding regulatory preferences and long-term strategic considerations. Benothman elucidated the rationale behind focusing on traditional crypto brokerage licenses and hinted at potential collaborations with other regulatory bodies in the future, aligning with Bitpanda MENA’s overarching vision.\nMoreover, Benothman highlighted Bitpanda MENA’s plans to obtain a custody license for its services, building upon its existing licensing in the UK under Bitpanda Custody. This strategic move underscores Bitpanda MENA’s commitment to providing comprehensive and secure investment solutions to its clients.\nBefore concluding our conversation, Benothman graciously reflected on our discussion, expressing genuine appreciation, ‘Engaging in this dialogue has been truly enlightening. I must extend my thanks to Unlock for providing such an exceptional platform. Your commitment to professionalism and transparency is instrumental in nurturing informed discussions within our crypto community.’\nAmidst his expressions of gratitude, it was evident that Benothman’s demeanor remained relaxed and candid. His willingness to speak openly, unconstrained by compliance apprehensions, reflects his character. One can only hope that he continues to maintain this refreshing honesty as Bitpanda MENA navigates its path forward.\nMoreover, in a seamless transition, Benothman subtly acknowledged the pivotal roles of Walid Rassuli and Nadeem Ladki, underscoring their contributions to Bitpanda MENA’s journey. With Rassuli’s operational acumen and regulatory expertise complementing Ladki’s proficiency in business development, Bitpanda MENA is poised for remarkable growth.\n","create_date":"2024-05-11T03:00:00+00:00","tag":"","author":"Walid Abou Zaki"},
{"url":"https://www.unlock-bc.com/123296/genesis-global-to-return-3-billion-to-customers-in-bankruptcy-liquidation/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Genesis Global received court approval to return $3 billion to customers in a bankruptcy liquidation, leaving owner DCG with no recovery.","title":"Genesis Global to Return $3 Billion to Customers in Bankruptcy Liquidation","content":" On Friday, Crypto lender Genesis Global received court approval to refund approximately $3 billion in cash and cryptocurrency to its customers as part of a bankruptcy liquidation process, as reported by Reuters.\nThis decision left its owner, Digital Currency Group (DCG), with no recovery from the bankruptcy. U.S. Bankruptcy Judge Sean Lane endorsed Genesis’ Chapter 11 liquidation plan and dismissed an objection raised by DCG.\nThe objection argued that Genesis should only pay its customers and creditors based on the valuation of crypto assets in January 2023, when Genesis filed for bankruptcy. Since then, crypto prices have surged significantly, leading to disagreement between DCG and Genesis regarding who should benefit from the price increase.\nLane rejected DCG’s objection, emphasizing that even if customer claims were restricted to lower prices, Genesis would first need to settle obligations with other creditors, including federal and state financial regulators with asserted claims totaling $32 billion, before allocating funds to DCG. “There are nowhere near enough assets to provide any recovery to DCG in these cases,” Lane noted.\nGenesis Global aims to reimburse customers primarily in cryptocurrency, but the available funds are insufficient to cover all owed amounts. Genesis attorney Sean O’Neal disagreed with DCG’s stance that customers could be compensated “in full” based on lower cryptocurrency prices in January 2023. “We don’t buy into the idea that claims are capped at the petition date value,” O’Neal said.\nIn February, Genesis estimated that it could repay customers up to 77% of their claim value, contingent on future price fluctuations\n","create_date":"2024-05-18T11:34:11+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123293/nigerian-court-rules-binance-executive-can-stand-trial-in-tax-evasion-case/","web_url":"https://www.unlock-bc.com/","type":"article","description":"On Friday, a Nigerian court ruled that Binance executive Gambaryan can stand trial on behalf of the crypto exchange in a tax evasion case.","title":"Nigerian Court Rules Binance Executive can Stand Trial in Tax Evasion Case","content":" On Friday, a Nigerian court decided that Tigran Gambaryan, a Binance executive, could stand trial for the cryptocurrency exchange in an ongoing tax evasion case, as reported by Reuters. Binance and its executives, including Gambaryan, who is a U.S. citizen and head of financial crimes compliance, and Nadeem Anjarwalla, a British-Kenyan national serving as a regional manager for Africa, face four counts of tax evasion.\nAdditionally, they are accused of laundering over $35 million and conducting specialized financial activities without a license in a separate case. All parties have pleaded not guilty to the money laundering charges. Following the Nigerian court hearing on Friday, Binance’s lawyer and Gambaryan’s lawyer declined to comment.\nA Binance spokesperson expressed disappointment that Gambaryan, who lacks decision-making authority in the company, remains detained. They described the charges against him as baseless and called for his release while discussions between Binance and Nigerian government officials continue. While Gambaryan remains in custody, Anjarwalla fled the country in March. Nigeria’s security adviser’s office is collaborating with Interpol to pursue Anjarwalla’s arrest.\nBinance’s CEO criticized Nigeria for what he perceives as setting a perilous precedent, especially after the company’s executives were initially invited to the country for talks with authorities before being detained as part of a crypto crackdown.\nNotably, Binance itself has not been charged in the tax evasion case by Nigeria’s Federal Inland Revenue Service (FIRS), which has indicated that Gambaryan could face charges on the exchange’s behalf. Gambaryan’s lawyer has argued that Gambaryan lacked the authority to represent Binance and had received no written instructions to do so.\nJudge Emeka Nwite ruled on Friday that Gambaryan should be served with the charges against Binance because he serves as the chief financial compliance officer of Binance and was duly appointed to represent it in a meeting in Nigeria.\nGambaryan is scheduled to be arraigned in court on Wednesday to enter a plea on behalf of Binance, according to Reuters. However, his bail application in relation to the money laundering case was denied on Friday.\nNigeria has attributed its currency woes to Binance after cryptocurrency platforms emerged as preferred venues for trading the Nigerian naira amidst chronic dollar shortages.\n","create_date":"2024-05-18T10:04:04+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123106/dubai-fintech-summit-wraps-up-with-50-mous-and-8000-visitors-from-118-countries/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The event also witnessed the signing of more than 50 Memorandum of Understandings (MoUs) with global financial leaders.","title":"Dubai FinTech Summit Wraps Up with 50+ MoUs and 8,000+ Visitors from 118 Countries","content":" The 2nd edition of the Dubai FinTech Summit (DFS) recently concluded with remarkable success, setting the stage for transformative discussions and strategic partnerships in the financial technology sector.\nOrganized by the Dubai International Financial Centre (DIFC) under the patronage of His Highness Sheikh Maktoum bin Mohammed bin Rashid Al Maktoum, the event attracted over 8,000 decision-makers from 118 countries, marking it as one of the largest gatherings in the global FinTech calendar.\nHeld at the prestigious Madinat Jumeirah, the two-day summit witnessed the convergence of government officials, policy makers, startup founders, and industry leaders, engaging in over 125 discussions across five stages.\nWith more than 200 exhibitors showcasing cutting-edge technologies, the event provided a comprehensive platform to explore emerging trends and opportunities in the FinTech landscape.\nHis Excellency, Essa Kazim, Governor of DIFC, emphasized the Summit’s role as a catalyst for collaboration and innovation, reaffirming Dubai’s commitment to shaping the future of finance on a global scale. “The Dubai FinTech Summit is not just a gathering; it is a platform for transformative discussions and collective action,” remarked His Excellency.\nThe Summit featured distinguished speakers, including Arif Amiri, Chief Executive Officer at DIFC Authority, who highlighted the pivotal role of FinTech in reshaping traditional financial services. “Today, we are experiencing an extraordinary period of technological transformation where FinTech defines how we transact, save, and manage our financial lives,” stated Amiri.\nOver 50 international associations participated in the Summit, underscoring its global significance and reach. The event also witnessed the signing of more than 50 Memorandum of Understandings (MoUs) with global financial leaders, signaling a commitment to fostering cross-border collaboration and innovation.\nAmong the notable announcements, Revolut revealed expansion plans in the MEASA region, while State Street Global Advisors announced its return to DIFC, capitalizing on the region’s dynamic growth opportunities. Additionally, Dyna.Ai launched its operations across multiple regions, aiming to transform businesses with AI-driven solutions.\nThe Summit concluded with insights into the UAE’s evolving blockchain ecosystem, highlighting the surge in active companies and regulatory clarity driving industry growth. As part of the Dubai Economic Agenda (D33), DFS remains instrumental in positioning Dubai as a leading global financial hub by 2033, fostering innovation and collaboration in the FinTech sector.\nSupported by over 150 global corporate partners, including Visa, Emirates NBD, and Mashreq, the Dubai FinTech Summit continues to drive financial progress and innovation in the MEASA region and beyond.\n","create_date":"2024-05-14T11:53:00+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88329/xpertlearning-and-educhain-announce-partnership/","web_url":"https://www.unlock-bc.com/","type":"article","description":"XpertLearning and Educhain announce strategic partnership to offer blockchain technology and implement a distributed database system.","title":"XpertLearning and Educhain Announce Partnership","content":" Dubai-based XpertLearning, a leading provider of Digital Learning, Talent, and Performance solutions in the Middle East, announces its strategic partnership with Educhain, a Canadian startup using blockchain technology to build software solutions for academic institutions, governments, and employers. This partnership is designed to offer blockchain technology and implement a distributed database system, where all academic institutions can contribute to one shared database of cryptographic records.\nBlockchain technology has significantly evolved in recent years. However, many people don’t realize how blockchain can help their company with data management and security. With Educhain products, we are set out to solve the problem by finding a way to help Institutions and universities kickstart digital transformation, to drive value for them, their students, and the recipients of their documents, like governments and employers.\n“XpertLearning are constantly looking at partnerships with new technologies so we can bring them to our region. As Blockchain becomes not just about cryptocurrency and more about solving real-world challenges we are delighted to partner with Educhain to bring these solutions to the Middle East” said Paul Michael Gledhill, Co-founder – XpertLearning.\n“With our technical background, we found that blockchain technology was the key to empowerment. Educhain leverages blockchain technology to implement a distributed database system where all academic institutions can contribute towards one shared database of cryptographic records, thereby mutualizing their infrastructure and eliminating redundant third parties while enabling seamless verification of academic records” quoted Gary Liang, Director – Educhain.\nIn this sense, we are building an infrastructure of trust for academic institutions to both enable instant issuance and authentication of digital credentials and create a comprehensive “academic passport” aggregating academic achievements and records for students to own and share.\n","create_date":"2022-06-14T11:38:04+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123313/venezuela-enforces-ban-on-crypto-mining-amid-energy-crisis/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Venezuela's Ministry of Electric Power intends to disconnect cryptocurrency mining companies from the national power grid","title":"Venezuela Enforces Ban on Crypto Mining Amid Energy Crisis","content":" According to local news outlet AlbertoNews, Venezuela’s Ministry of Electric Power intends to disconnect cryptocurrency mining companies from the national power grid, SEN (Sistema Electrico Nacional). The government is taking this step to manage excessive energy use and ensure a reliable power supply for the population.\nVenezuela’s National Association of Cryptocurrencies confirmed the ban on crypto mining in a post on X dated May 18. This announcement comes after authorities recently confiscated 2,000 cryptocurrency mining devices in Maracay as part of an anti-corruption operation.\nThe Electric Ministry stated that it is necessary to reduce the strain on the national grid caused by high-energy-consuming mining companies to maintain efficient and stable electricity service throughout Venezuela.\nOfficials believe these measures are crucial to stabilize the country’s power supply, which has been inconsistent for the past ten years.\nSince 2009, Venezuela has been enduring a prolonged power crisis, exacerbated by severe blackouts in 2019 that left numerous towns and cities without electricity for over a week. These frequent power outages have significantly disrupted daily life and the economy.\nDue to the high electricity demands of cryptocurrency mining, countries like China and Kazakhstan have imposed stringent regulations or outright bans to safeguard their power grids, centralizing mining in fewer locations.\nThe Venezuelan government’s crackdown on cryptocurrency mining is part of a broader anti-corruption initiative that has resulted in the arrest of several top officials.\nJoselit Ramírez, the former head of the National Superintendency of Cryptoassets, is a central figure in the corruption charges.\nRafael Lacava, governor of Carabobo state, highlighted the need for public support in identifying illegal mining operations and urged citizens to report any illicit activities:\n“If you, a neighbor, see a house involved in this, tell them to turn off the mining equipment, or report it. When the power is cut off, you lose electricity because someone else is illegally making money.”\nExperts cited by AlbertoNews attribute the crisis to inadequate maintenance and investment in the power grid, whereas the government blames sabotage and has vowed to modernize the state-controlled power network.\nThis isn’t Venezuela’s first action against crypto mining. Last September, authorities seized Bitcoin mining equipment from a gang-controlled prison, alongside weapons, during a raid involving over 11,000 soldiers.\nIn March, Venezuelan regulators halted Bitcoin mining operations following investigations into a corruption scheme involving cryptocurrency wallets used to divert funds from the state-run oil company, Petróleos de Venezuela SA (PDVSA).\n","create_date":"2024-05-20T05:52:58+00:00","tag":"","author":"News Desk"},{"url":"https://www.unlock-bc.com/122939/bitcoin-and-ethereum-prices-plummet-sparking-150-million-in-liquidations/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Bitcoin and Ethereum prices plummeted early Friday, leading to over $150 million in total crypto liquidations within 24 hours.","title":"Bitcoin and Ethereum Prices Plummet, Sparking $150 Million in Liquidations","content":" Friday morning witnessed significant declines in the prices of both Bitcoin and Ethereum, triggering a fresh wave of liquidations of long positions, surpassing $150 million in total crypto liquidations within 24 hours, according to CoinGlass.\nBitcoin plummeted by over $2,000 within an hour, dropping from a price exceeding $63,000 to a daily low of $60,890, as reported by CoinGecko. Presently, it has slightly rebounded to $61,130 but remains down by over 1% for the day.\nConcurrently, Ethereum experienced a 2% decrease over the past day, declining from $3,027 to a low of $2,927 in tandem with Bitcoin’s decline. It has since recovered slightly to $2,940 but remains below its levels since May 1.\nThe exact cause of the leading cryptocurrencies’ price drops is not immediately evident. Several other top coins have also suffered losses the same morning, including Solana, which retreated below the $150 mark after briefly surpassing that price earlier on Friday. Within an hour alone, liquidations of long positions amounted to over $62 million.\nOver the past day, the cumulative liquidations of both long and short positions exceeded $150 million across all major cryptocurrencies. Long positions signify expectations for the coin’s price to rise, while short positions anticipate declines.\nDespite this, Square CEO and Twitter co-founder, Jack Dorsey, remains optimistic about Bitcoin reaching $1 million within the decade. Just a week ago, a surge in the crypto market resulted in $100 million worth of liquidations of bearish short positions.\nWhen asked by Pirate Wires about Bitcoin’s price in 2030, Dorsey said, “I don’t know. Over… at least a million.” He added that, “I do think it hits that number and goes beyond.” Calling Bitcoin “a fascinating ecosystem and movement,” Dorsey added that, “anyone who works on it, or gets paid in it, or buys it for themselves—everyone who puts any effort in to make it better—is making the entire ecosystem better, which makes the price go up.”\n","create_date":"2024-05-11T07:05:21+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123290/bank-of-america-upgrades-coinbase-rating-from-underperform-to-neutral/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Bank of America upgraded Coinbase's rating from underperform to neutral and increased its price target from $110 to $217.","title":"Bank of America Upgrades Coinbase Rating from Underperform to Neutral","content":" Bank of America has revised its rating on Coinbase from underperform to neutral, with a raised price target of $217, up from $110. According to the bank’s report, the current macroeconomic environment has fostered growth in crypto market capitalization and trading volumes.\nWhile the bank acknowledges positive dynamics, it also cautioned that certain risks, such as Coinbase’s dependence on transaction revenue and regulatory uncertainties related to the SEC lawsuit, could limit the stock’s potential upside.\nCoinbase shares saw a 2.5% increase in pre-market trading on Friday following the upgrade to neutral. The stock, trading around $204 at the time of publication, has benefited from Bank of America’s revised outlook. Bank of America’s analysts, led by Mark McLaughlin, emphasized several factors contributing to the upgrade, including Coinbase’s expense management and diversification efforts, which are expected to bolster earnings.\nThe recent decline in Coinbase shares, over 9% following reports of potential competition from the Chicago Mercantile Exchange in spot bitcoin trading, underscores the volatility and competitive landscape facing Coinbase and similar exchanges.\n","create_date":"2024-05-18T09:05:42+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122916/binance-india-regulatory-challenges-market-resurgence/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Binance navigates Indian regulations, resumes operations, reshaping the crypto market amidst regulatory challenges.","title":"Binance Charts Path to Compliance, Resumes Operations in Indian Crypto Market","content":" Binance Holdings Ltd.’s journey in India has been marked by twists and turns. Once a dominant player in the local market, Binance faced regulatory hurdles that prompted a temporary suspension of its operations. However, with a strategic pivot and a renewed emphasis on compliance, Binance has adeptly navigated the regulatory landscape, reemerging to shape the Indian crypto scene.\nThe narrative of Binance’s trajectory in India shifted dramatically when Indian authorities cracked down on offshore platforms, including Binance, citing concerns over regulatory compliance and tax evasion. This crackdown led to a significant exodus from Binance, alongside other exchanges, as stringent measures such as the removal of their apps from Apple Inc.’s App Store and compliance Show Cause Notices from the Financial Intelligence Unit India (FIU IND) were enforced. These actions underscored the mounting regulatory pressure on offshore exchanges operating in India.\nIn response, Binance took decisive action to regain regulatory compliance and reestablish its foothold in the Indian market. The exchange announced plans to resume operations as a fully compliant FIU-registered entity, demonstrating its commitment to adhere to Indian laws, including the Prevention of Money Laundering Act (PMLA) and the taxation framework for virtual digital assets (VDA).\nBinance’s return to the Indian market signifies a significant milestone in the ongoing evolution of the crypto landscape. Overcoming regulatory hurdles and prioritizing compliance, Binance is poised to reclaim its position in the Indian market. However, uncertainties persist as ongoing regulatory developments continue to shape the future of cryptocurrency trading in India.\nWhile Binance’s registration with the FIU signals a commitment to compliance, its full operational reinstatement hinges on the resolution of pending regulatory matters, notably the settlement of a speculated fine. The exact amount of this fine remains undisclosed but is rumored to surpass KuCoin’s modest $41,000 penalty.\nAs Binance navigates the regulatory landscape and awaits clarity on its fine, stakeholders in the Indian crypto ecosystem remain vigilant. The resolution of regulatory issues, coupled with Binance’s compliance commitments, will play a pivotal role in shaping the future dynamics of the Indian crypto market and influencing the strategies of other industry players.\n","create_date":"2024-05-10T11:51:25+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123359/crypto-funding-surge-q1-2024-highlights-analysis/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Explore Q1 2024's crypto funding surge: $2.4B investments, key trends, and analyst insights. Dive into the latest data of PitchBook","title":"Crypto Startup Funding Surges to $2.4 Billion in Q1 2024","content":" The resilience and growing attraction of the cryptocurrency market have been underscored by a surge in funding for crypto startups, reaching an impressive $2.4 billion in the first three months of 2024, according to data from PitchBook. This substantial influx of capital reflects a renewed optimism among investors, buoyed by expectations of lower interest rates and the highly anticipated debut of the first U.S. bitcoin spot exchange-traded fund (ETF).\nThe latest figures, revealed by PitchBook and highlighted by Reuters, indicate a robust 40.3% increase in funding compared to the previous quarter, with investment dispersed across 518 deals. Interestingly, while global venture capital investments experienced a dip, dropping to a near five-year low during the same period, funding for digital asset startups defied the trend.\nHowever, it’s worth noting that investor enthusiasm for crypto startups has seen its fair share of peaks and troughs. Since its zenith in the first quarter of 2022, where investments soared to over $10 billion, the market has weathered economic uncertainties and the fallout from the shutdown of key market players. Despite these challenges, the landmark regulatory approval of spot bitcoin ETFs in the United States, offered by industry giants BlackRock and Fidelity, breathed new life into the sector. This regulatory green light not only lent credence to the asset class but also propelled bitcoin to a record high of $73,803 in March, further stimulating investor interest.\nPitchBook analyst Robert Le articulated, as reported by Reuters, “The recovery in publicly traded tokens and continued rise in institutional adoption will drive increased VC funding.” Le’s insights shed light on the evolving landscape of crypto investments, indicating a shift towards more established and institutionalized players within the market.\nMoreover, startups focusing on developing infrastructure for crypto and blockchain technology emerged as frontrunners in securing funding during the quarter, according to PitchBook. The standout deal of the period was orchestrated by decentralized cloud platform Together AI, which successfully raised a staggering $106 million in an early-stage round led by Salesforce Ventures. This injection of capital propelled the company’s valuation to a remarkable $1.1 billion, underscoring the growing allure of innovative ventures in the crypto space.\nHowever, amidst the flurry of funding activities, concerns loom regarding valuation dynamics and the sustainability of early-stage investment trends. PitchBook’s Le remarked, “The investment rounds have become highly competitive, especially at the early stages.” He pointed out the paradoxical scenario where early-stage deals are commanding higher valuations than their late-stage counterparts, highlighting a potential area of scrutiny in the coming quarters.\nDespite the buoyant funding environment, exits remained subdued in the crypto startup landscape. Nonetheless, Le remains optimistic about the future trajectory of the market, foreseeing a potential uptick in mergers, particularly among crypto exchanges, custodians, and infrastructure providers, as the market continues to mature.\nIn conclusion, the robust funding inflows witnessed in the first quarter of 2024, underscore the growing investor confidence in the cryptocurrency sector. As regulatory clarity improves and institutional adoption gains momentum, the stage is set for further innovation and expansion within the dynamic realm of crypto startups.\n","create_date":"2024-05-20T09:14:19+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/88344/dubai-chamber-of-commerce-joins-forces-with-india-to-enhance-ai-blockchain-fintech/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Dubai Chamber of Commerce organized a webinar to highlight UAE-India free trade deal (CEPA) that focuses on AI, Fintech and Blockchain.","title":"Dubai Chamber of Commerce Joins Forces With India to Enhance AI, Blockchain & Fintech","content":" \nDubai Chamber of Commerce, one of the three chambers under Dubai Chambers, recently organized a webinar, which shed light on the landmark UAE – India Comprehensive Economic Partnership Agreement (CEPA), and the various economic benefits that are expected to be created by the free trade deal.\nAttended by over 270 participants, the webinar was held in partnership with the UAE Embassy in India, the Associated Chambers of Commerce and Industry of India (ASSOCHAM), Dubai Economy and Tourism, and the Indian Business & Professional Council (IBPC).\nAfter coming into effect in May 2022, CEPA is projected to give an added boost to 90% of exports and imports between the two countries, while the trade agreement is also expected to benefit bilateral investment and tourism exchange.\nSpeaking during the event, Omar Khan, Director of International Offices, Dubai Chamber of Commerce, explained how CEPA is expected to expand UAE-India economic cooperation to new emerging and innovation focused sectors, such as AI, blockchain and fintech.\nHe noted that the Chamber is examining new business opportunities emerging on the horizon, as CEPA changes the dynamics of UAE-India bilateral trade and builds new bridges between the two business communities.\nIn a special address to participants, Sunjay Sudhir, Ambassador of India to the UAE, explained, “The thrust of this agreement are comprehensive and strategic outcomes, and CEPA flows from this commitment to boost trade and deepen economic ties. UAE keeps evolving its policies for the interest of the business communities and future of the economy,” said Sudhir.\nCEPA is the UAE’s first bilateral trade agreement signed with India and the accord is expected to increase the total value of bilateral trade in goods to over $100 billion and trade in services to over $15 billion within five years.\n","create_date":"2022-06-15T06:55:35+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122405/roger-ver-tax-evasion-arrested-spain/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Roger Ver faces tax evasion charges after arrest in Spain. Allegations detail $50M scheme despite renouncing US citizenship","title":"\"Bitcoin Jesus\" Roger Ver Faces Allegations of $50 Million Tax Evasion Scheme","content":" A case of alleged tax evasion involving Roger Ver, widely recognized as “Bitcoin Jesus,” has surfaced, revealing accusations totaling nearly $50 million. Ver, a prominent early investor in bitcoin, faces charges including mail fraud, tax evasion, and filing false tax returns, as detailed in an unsealed indictment. Following his recent arrest in Spain, extradition proceedings have been initiated to bring him to trial in the United States.\nThe indictment sheds light on Ver’s ownership of companies specializing in computer and networking equipment, as well as his accumulation of bitcoins dating back to 2011. His fervent advocacy for bitcoins earned him the nickname “Bitcoin Jesus.”\nIn 2014, Ver allegedly renounced his U.S. citizenship after obtaining citizenship in St. Kitts and Nevis, triggering U.S. tax obligations. However, he purportedly failed to report assets such as bitcoins and pay the required taxes upon expatriation. Allegedly, Ver provided misleading information to legal counsel and an appraiser, resulting in undervalued tax returns for both his companies and personal assets.\nDespite no longer holding U.S. citizenship, Ver allegedly neglected to report and pay taxes on significant bitcoin sales in 2017, compounding the accusations of tax evasion. The indictment suggests that Ver’s actions led to an estimated loss of $48 million for the IRS.\nThe announcement of these developments came from Acting Deputy Assistant Attorney General Stuart M. Goldberg of the Justice Department’s Tax Division and U.S. Attorney Martin Estrada for the Central District of California. The IRS Criminal Investigation’s cybercrimes unit is spearheading the case, with prosecution led by Assistant Chief Matthew J. Kluge, Trial Attorney Peter J. Anthony of the Justice Department’s Tax Division, and Assistant U.S. Attorney James C. Hughes for the Central District of California.\n\n","create_date":"2024-05-01T05:14:18+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123229/liechtenstein-blockchain-act-token-definition/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Groundbreaking strides in regulatory clarity with Dr. Clara Guerra as she delves into Liechtenstein's Blockchain Act and token definition","title":"Bridging Innovation and Tradition in Liechtenstein's Digitalization: Insights from Dr. Clara Guerra","content":" In a recent interview with Unlock Blockchain at the World Blockchain Summit, Dr. Clara Guerra, Director of the Office for Financial Market Innovation and Digitalization for the Liechtenstein government, shed light on the principality’s pioneering role in blockchain innovation and beyond. Dr. Guerra’s remarks underscored Liechtenstein’s proactive approach to embracing emerging technologies while maintaining regulatory clarity and consumer protection.\nA dedicated competence center and operating unit is critical to navigating the rapidly evolving landscape of financial market innovation and digitalization. According to Dr. Guerra, Liechtenstein recognized the importance of not just reacting to technological advancements but actively shaping and implementing regulatory frameworks. However, this proactive approach goes beyond regulatory frameworks; it extends to building a future-proof infrastructure and spearheading innovative ideas and projects to foster innovation.\n“I used to work in the hi-tech, private sector space. The important thing was to actually bring that innovation mindset, competence and approach into a state framework and how we, as a government, approach innovation in this very fast-moving sector with unprecedented exponential growth and development,” said Dr. Guerra.\nThe pivotal moment for Liechtenstein came already in 2016 and 2017 when the first wave of FinTech and blockchain companies approached its financial market authority for regulatory guidance. Understanding both the challenges and potential inherent in these technologies, Liechtenstein embarked on crafting landmark legislation, culminating in the introduction of the Blockchain Act which became applicable already in January of 2020.\nThe Blockchain Act established a registration and supervision regime for crypto asset service providers, ensuring user protection and legal certainty for companies operating within the blockchain ecosystem. Dr. Guerra highlighted the success of this approach, noting Liechtenstein’s growing international recognition as a hub for blockchain innovation. “That has proven very successful and also placed us on the map and made us part of the international discussion.”\nLiechtenstein’s regulatory approach to virtual assets has two main elements. Firstly, the registration and supervision of crypto asset service providers ensures compliance with minimum capital and operational requirements. Secondly, the introduction of a dedicated civil law for tokens provides a legal framework for the transfer and legitimation of tokens within Liechtenstein’s civil law system.\nDr. Guerra stressed the importance of not only governing financial market instruments but also embracing the broader token economy. Liechtenstein’s law for tokens is designed to be principle-based, adaptable to various use cases, and future-proof against technological advancements.\nAt the heart of the Liechtenstein Blockchain Act is the Token Container Model, where a token acts as a container that can hold any right. This means a right representing a real asset, like stocks, bonds, real estate, commodities, or fiat money, can be ‘loaded’ into the container. Conversely, the container could be empty, as in the case of Bitcoin’s digital code. This model helps distinguish between law and technology by treating them separately, despite the digital encoding of specific rights as tokens. These rights are transformed, although the underlying asset remains unchanged. This principle-based approach ensures it is versatile and applicable to a wide range of use cases,” concluded Dr. Guerra.\nDr. Guerra highlighted the forthcoming Markets in Crypto-Assets (MiCA) regulation proposed by the European Commission, which she anticipates will serve as a catalyst for blockchain innovation in Europe. As a proactive member of the European Economic Area (EEA), Liechtenstein is adopting the MiCA regulation while further refining its own regulatory framework. This integration will enable Liechtenstein-registered and supervised Crypto Asset Service Providers to benefit from passporting, facilitating their operations across the EU-market while enhancing regulatory coherence.\n“This is all working in the broader context of the token economy. For us, it’s about quality, future-proofing, and stability, while being future-focused and agile. It was crucial for us not just to attract the masses but to provide the best possible legal and regulatory framework for this new technology and the service providers. We did not want to govern only financial instruments but to encompass the entire token economy. To achieve this, we devised civil law for tokens that is principle-based rather than rule-based. We defined a token as a piece of information on a Trusted Technology (TT), such as a blockchain system, which can represent claims or rights of membership against a person, rights to property, or other absolute or relative rights. This new model expands the token’s use beyond securities to cover music rights, patents, utility coins, software rights, and more.”\nLiechtenstein is indeed emerging as a trailblazer in blockchain regulation and innovation. By combining regulatory clarity with a forward-thinking approach, it is rapidly fostering a safe, secure, and thriving environment for digital transactions and services in the emerging era of blockchain technology.\n","create_date":"2024-05-17T03:15:00+00:00","tag":"","author":"Henzie Healley"},
{"url":"https://www.unlock-bc.com/88323/unlock-blockchain-announces-partnership-with-gulf-news-agenc3-as-web3-decode-exhibition-takes-shape/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Unlock Blockchain teams up with Gulf News agenc3 for Web3 DeCode exhibition on June 25 and 26 at Grand Hayatt.","title":"Unlock Blockchain Announces Partnership with Gulf News agnc3 as Web3 DeCode Exhibition Takes Shape","content":" Unlock Blockchain is happy to announce its partnership with Gulf News agnc3, who will be hosting Web3 DeCode, a two-day exhibition on June 25 and 26 at Grand Hyatt.\nFollowed by a gala dinner for the distribution of Web3 awards, the event will be held to raise awareness on Web3 technology, its rise in growing markets like the UAE, as well as its impact on our daily life. In fact, attendees will be able to submit nominations to honor innovative projects in tech, gaming, art and other related industries, while offering each winner a tokenized NFT.\nHowever, this is not all, for many other events will be taking place during the two-day exhibition.\nFrom a stately speaker line-up to presenter booths, NFT experiences, upcoming Metaverse projects and builders, and creators and artists, Web3 DeCode will cover it all!\nGulf News exclusive NFT drop is one of the most prominent highlights of the event, as it will attract great footfall from investors and a high networth audience, all eager to know their roadmap for upcoming collections. The attendees can expect a surprise since the actual collection is kept discreet.\nTF1 part of Warner Bros is also planning a unique Rolls Royce RWheels activation to be covered live during the two-day event. This activity aims to encourage international audiences through the Metaverse event participation.\nIn addition to that, attendees will have access to exclusive NFT drops designed by artists at Web3 DeCode, which will be displayed in dark rooms and theme-based activations.\nArts Dao, a well-known NFT community, will host many artists that will be explaining about their collection too.\nAnother exciting event that will happen is the BEATMYTEAM Metaverse Fantasy league Prelaunch, the first-of-its-kind football fantasy league. The game will reveal a collector’s edition of football NFTs and will give them the chance to win.\nLast but not least, the DAS NFT Museum marketplace launch will take place, and it will focus on masterpiece artworks in the form of NFTs from the past and the present. The launch will also promote the NFT rental model, which will play a major role in the NFT world where unsold inventory is a problem.\nAs for the informative side of the exhibition, several seminars on blockchain, crypto, NFTs, the metaverse, Web3 ecosystems and their impact on commerce, culture and communities will be set in motion. They will be presented by some of the most successful leaders in the space. Contests will also be part of this exhibition, as start ups will come together to showcase some of their most promising entrepreneurial projects in the Web3 space and compete to win valuable prizes.\n","create_date":"2022-06-14T09:49:31+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122888/esma-considers-digital-assets-eu-investment-market/","web_url":"https://www.unlock-bc.com/","type":"article","description":"ESMA explores integrating digital assets into EU investment market, reflecting global trends. Learn about the potential impact","title":"ESMA Explores Inclusion of Digital Assets in the EU Investment Market","content":" The European Securities and Markets Authority (ESMA) is embarking on a significant journey towards modernizing the regulatory framework for Undertakings for Collective Investment in Transferable Securities (UCITS). With the recent approvals of Bitcoin exchange-traded funds (ETFs) in the United States and Hong Kong, ESMA is now considering whether to include digital assets within the scope of UCITS regulation.\nUCITS, established under Directive 2009/65/EC, have long been regarded as a cornerstone of the EU’s Capital Market Union, offering standardized investment products to retail investors across the European Economic Area. However, the rapid evolution of the digital assets market, including cryptocurrencies like Bitcoin and Ethereum, has prompted a reevaluation of UCITS eligibility criteria.\nRecognizing the need for expert guidance and stakeholder input, ESMA has initiated a consultation process to gather insights on the potential inclusion of digital assets in UCITS regulation. This move comes in the wake of regulatory approvals for Bitcoin ETFs in key global financial markets, signaling a growing acceptance of digital assets as legitimate investment vehicles.\nESMA is requested to deliver its technical advice by October 31, 2024, to enable a thorough public consultation process. The overarching objective of this endeavor is to preserve and strengthen the UCITS framework, uphold investor interests, and enhance the quality of investment products offered to retail clients.\nThe recent approvals of Bitcoin ETFs in the United States and Hong Kong have reverberated across global financial markets, underscoring the mainstream acceptance of digital assets. These developments have prompted ESMA to explore the feasibility and implications of incorporating digital assets into the UCITS framework, with a focus on investor protection, market integrity, and regulatory clarity.\nThe European securities market is one of the largest and most dynamic in the world, comprising a diverse array of asset classes and investment products. With a market capitalization of trillions of euros, Europe represents a significant opportunity for the adoption and integration of digital assets within regulated investment frameworks like UCITS.\nESMA’s exploration of including digital assets in the EU investment market reflects a broader trend towards embracing innovation and adapting regulatory frameworks to accommodate emerging asset classes. As discussions unfold and expert opinions are sought, stakeholders eagerly await ESMA’s technical advice, which will shape the future landscape of investment opportunities within the European Union.\n","create_date":"2024-05-10T06:59:24+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122665/bitcoin-privacy-service-zksnacks-ceases-operations-prompting-concerns-in-bitcoin-ecosystem/","web_url":"https://www.unlock-bc.com/","type":"article","description":"This move, impacting users seeking enhanced privacy in their cryptocurrency transactions, has stirred many discussions within the community.","title":"Bitcoin Privacy Service zkSNACKs Ceases Operations, Prompting Concerns in Bitcoin Ecosystem","content":" In a recent announcement, zkSNACKs, a prominent player in the Bitcoin ecosystem, revealed its decision to discontinue its CoinJoin coordination service.\nThis move, impacting users seeking enhanced privacy in their cryptocurrency transactions, has stirred discussions within the community and raised questions about the future of privacy-enhancing tools in the United States.\nMax Hillebrand, CEO of zkSNACKs, shared insights into the decision exclusively with Cointelegraph. He cited the evolving legal landscape in the U.S. as a key factor driving the cessation of the CoinJoin service. Amidst regulatory uncertainties surrounding cryptocurrencies and privacy tools, maintaining compliance became paramount.\nThe closure of this service has also sparked reactions from notable figures, including former NSA whistleblower Edward Snowden, who expressed disappointment over the loss of a tool known for its privacy features.\nHillebrand emphasized the importance of the CoinJoin service in enhancing privacy within the Bitcoin ecosystem, acknowledging the setback its discontinuation represents. Despite this, he assured users that Wasabi Wallet, developed by zkSNACKs and incorporating the CoinJoin feature, will continue to operate as a standard Bitcoin wallet, without the privacy-enhancing service.\nWhile alternatives such as Tor integration and custom coin selection still offer privacy benefits, Hillebrand acknowledged that the level of anonymity provided by CoinJoins remains unmatched. The closure of zkSNACKs’ CoinJoin coordination service also impacts other products and services within the ecosystem, including Trezor Suite and BTCPayServer, which will cease to offer the service to their users from June 2024.\nIn light of these developments, concerns linger about the broader implications for user privacy and the future of privacy protocols in the cryptocurrency space. Hillebrand refrained from speculating on potential crackdowns in jurisdictions beyond the U.S., underscoring the uncertainty prevailing in the regulatory landscape.\nCoinJoin, as explained by Hillebrand, operates by combining multiple inputs and outputs from different users into a single transaction, obscuring transaction details and enhancing privacy. Wasabi Wallet, known for its rigorous privacy features, was launched in 2018 and has since been a favored choice among privacy-conscious users due to its robust architecture and commitment to anonymity.\n","create_date":"2024-05-06T11:33:45+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/113824/elizabeth-warren-urges-bank-secrecy-act-update-over-crypto-concerns/","web_url":"https://www.unlock-bc.com/","type":"article","description":"U.S. Senator Elizabeth Warren has called for a revision of the Bank Secrecy Act due to a pressing concern posed by cryptocurrencies.","title":"Elizabeth Warren Urges Bank Secrecy Act Update Over Crypto Concerns","content":" U.S. Senator Elizabeth Warren (D-Mass.) has urged for a revision of the Bank Secrecy Act in response to what she perceives as a pressing concern posed by cryptocurrency.\nIn a talk with CNBC Squawk Box, Warren highlighted the necessity to update the Act, citing cryptocurrency as a new, significant threat. She expressed concerns over the alleged exploitation of crypto in activities such as terrorist financing and drug trafficking, asserting that North Korea has purportedly utilized cryptocurrency to fund approximately half of its nuclear weapons program, a point she reiterated from a recent Senate banking committee hearing. Warren emphasized the urgency of halting such practices.\nWarren reiterated her stance in a tweet, emphasizing the importance of enforcing anti-money laundering regulations on cryptocurrency, emphasizing their role in national security.\nWhen it comes to banking policy, I don’t usually agree with the CEOs of multi-billion dollar banks. But enforcing anti-money laundering rules against crypto to protect national security is common sense & critical. It's time for Congress to act. pic.twitter.com/zZAegAjeb4\nDespite contrasting views expressed by CEOs like Jamie Dimon, who voiced opposition to crypto during the Senate hearing and urged its shutdown, the Bank Secrecy Act mandates U.S. financial institutions to aid government agencies in detecting and preventing money laundering, tax evasion, and other illicit activities.\nWarren has a history of associating cryptocurrency with criminal activities, having previously linked it to the fentanyl trade in June 2023. While Warren’s assertion about North Korea purporting to have stolen “more than $3 billion in crypto” aligns with figures from the 2023 Crypto Crime Report by blockchain analytics firm Chainalysis, some of her claims have been disputed by other entities.\n","create_date":"2023-12-09T11:52:08+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123285/hong-kong-expands-cross-border-digital-yuan-pilot-to-include-hong-kong-residents/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The e-CNY wallets support cross-boundary payments, not person-to-person transfers, and can be topped up via FPS through 17 Hong Kong banks.","title":"Hong Kong Expands Cross-Border Digital Yuan Pilot to Include Hong Kong Residents","content":" The Hong Kong Monetary Authority (HKMA) and the People’s Bank of China (PBOC) have expanded their cross-border digital yuan pilot, allowing Hong Kong residents to use e-CNY wallets.\nThe digital yuan, China’s central bank digital currency (CBDC), has been in development for several years, making China one of the leaders in exploring digital currencies. Users can set up e-CNY wallets with just a phone number and use them for cross-boundary payments to retailers, though not for person-to-person transfers, according to an HKMA press release on Friday. These wallets are available for use in the Guangdong-Hong Kong-Macao Greater Bay Area (GBA) and other mainland China regions participating in the pilot.\nBy expanding the e-CNY pilot in Hong Kong and leveraging the 24×7 operating hours and real-time transfer advantages of the Faster Payment System (FPS), users may now top up their e-CNY wallets anytime, anywhere without having to open a Mainland bank account, thereby facilitating merchant payments in the Mainland by Hong Kong residents,” said Eddie Yue, Chief Executive of the HKMA. Users can top up their wallets in real time through 17 Hong Kong retail banks via FPS.\n“We will continue to work closely with the PBoC to gradually expand the applications of e-CNY, enrich the range of functionalities of the e-CNY wallet available to Hong Kong residents and step up efforts in promoting the acceptance of e-CNY by more retail merchants in the two places,” added Yue.\nFurthermore, the HKMA and the Digital Currency Institute (DCI) will explore upgrading the e-CNY wallet to higher tiers through real-name verification and improving payment interoperability to provide more convenient experiences for individuals and merchants. They also plan to explore corporate use cases to facilitate cross-boundary trade settlements.\nIn December 2021, China and Hong Kong successfully completed the first phase of their cross-border digital yuan trials, following initial discussions a year earlier. Additionally, Hong Kong has been piloting its own CBDC, the e-HKD, which entered its second phase in March.\n","create_date":"2024-05-18T08:00:37+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123049/rain-exchange-hack-regulatory-safeguarding-user-funds/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Learn how Rain Exchange ensures user fund safety through regulatory measures post-hack incident #ADGM #UAE #Central_bank_of_Bahrain","title":"Rain Exchange Upholds User Safety Through Regulatory Compliance Amid Security Breach","content":" The recent security breach at Rain Exchange has underscored the critical role of regulatory frameworks in ensuring the safety of user funds within the cryptocurrency industry. While concerns regarding the timing of public disclosure have surfaced, the incident ultimately emphasizes the effectiveness of regulatory oversight in protecting customer assets.\nOn April 29, 2024, Rain Exchange experienced a security breach resulting in the unauthorized withdrawal of approximately $14.8 million worth of BTC, ETH, SOL, and XRP from its wallets. The breach came to public attention after details were shared by blockchain detective ZachXBT on Telegram, raising questions about the sequence of information dissemination to both users and regulatory authorities.\nDespite the delayed public statement, Rain Exchange swiftly initiated comprehensive security protocols and launched an investigation into the breach. Their subsequent statement on May 13th reassured customers of the swift resolution and emphasized the security measures in place to protect customer funds.\nOperating under the oversight of the Central Bank of Bahrain and the ADGM Financial Services Regulatory Authority, Rain Exchange adheres to stringent regulatory guidelines. These regulations mandate strict asset-to-funds ratios, providing users with an added layer of assurance regarding the safety of their investments.\nWhile the timing of regulatory awareness remains a topic of discussion, Rain Exchange’s commitment to regulatory compliance highlights the efficacy of regulatory frameworks in safeguarding user interests. By collaborating with regulatory authorities to enhance security measures, Rain Exchange aims to mitigate future risks and uphold the trust of its user base.\nAs Rain Exchange continues to reinforce its security infrastructure, the incident serves as a testament to the importance of transparent communication and proactive regulatory engagement in maintaining the integrity of the cryptocurrency ecosystem.\n","create_date":"2024-05-13T20:35:55+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123268/sec-sab-121-congressional-battle-potential-presidential-veto/","web_url":"https://www.unlock-bc.com/","type":"article","description":"The SEC's SAB 121 rule as Congress debates its fate, with a potential presidential veto looming. Stay updated on the latest developments","title":"Presidential Veto Looms as U.S. Congress Battles Over SEC's Cryptocurrency Custody Rule","content":" The U.S. Congress and the White House are embroiled in a contentious battle over the Securities and Exchange Commission’s (SEC) rule on cryptocurrency asset accounting, with recent developments showcasing the deep divide between legislative and executive powers.\nOn May 8, 2024, House lawmakers voted to nullify the SEC’s Staff Accounting Bulletin 121 (SAB 121), sparking intense debate over the regulation of digital asset custody. SAB 121, requiring custodians to treat digital assets as liabilities on financial statements, drew criticism from both cryptocurrency firms and major banks. Led by Representatives Mike Flood and Wiley Nickel, the House resolution contested the SEC’s authority to establish such rules without proper public input. Despite opposition, SEC Chair Gary Gensler maintained support for SAB 121, citing its classification as a rule subject to oversight under the Congressional Review Act.\nThe clash escalated on May 16, 2024, as the U.S. Senate passed a measure to overturn SAB 121, marking a significant victory for opponents of the SEC rule. The measure, passed by a vote of 60 to 38, now heads to President Joe Biden’s desk, where it is expected to face a veto. Despite bipartisan support, the vote margin falls short of the threshold needed to override a presidential veto. The White House has signaled its intent to veto the measure, citing concerns about financial instability and market uncertainty if the SEC’s regulatory authority is curtailed.\nAs the legislative and executive branches clash over SAB 121, the outcome will have far-reaching implications for cryptocurrency regulation and the broader financial landscape. The standoff highlights fundamental disagreements over the appropriate balance between regulatory oversight and innovation in the rapidly evolving realm of digital assets. As stakeholders await the president’s decision, the future trajectory of cryptocurrency custody regulation hangs in the balance, shaping the dynamics of the market and influencing investor confidence in the burgeoning cryptocurrency sector.\n","create_date":"2024-05-17T11:50:10+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123122/ethereums-gas-system-revamp-vitalik-buterin-proposes-multidimensional-framework/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Ethereum co-founder Vitalik Buterin has unveiled a significant proposal to address limitations in the current gas system. What is it?","title":"Ethereum's Gas System Set for Revamp, Vitalik Buterin Proposes Multidimensional Framework","content":" Ethereum is gearing up for a significant transformation in its gas system, a vital component determining transaction costs.\nCo-founder Vitalik Buterin has unveiled a major proposal to introduce a multidimensional gas framework, aiming to tackle the existing system’s limitations.\nAt present, Ethereum operates on a unified gas system, where diverse computational tasks—ranging from processing to storage operations and cryptographic proofs—are all measured under the single metric of “gas.”\nFor example, a typical transaction might consume 47,085 gas, encompassing base costs, data inclusion, storage interactions, and execution efforts. While this approach simplifies market operations and fee calculations, it lumps together fundamentally different types of resources, leading to inefficiencies.\nButerin explained that this results in inefficiencies as it treats distinct network resources as interchangeable. This misinterpretation can cause the network to either reject safe transaction blocks or accept potentially harmful ones due to inappropriate gas limit settings. Therefore, transitioning to a multidimensional gas model could rectify these issues by accurately representing the network’s limits and capabilities, potentially enhancing throughput.\nNonetheless, while the concept of multidimensional gas isn’t entirely novel, Buterin underscored its active implementation through EIP-4844. This enhancement introduces “blobs” for rollup data, significantly reducing transaction costs on layer 2 solutions. By enabling separate caps and fees for data and computation, Ethereum can handle more substantial and complex operations without compromising network integrity.\nButerin also addressed the challenges posed by large block sizes and their impact on Ethereum’s scalability. He noted that prior to recent reforms, even a slight reduction in data costs could dangerously inflate the maximum block size, burdening the network, according to CoinMarketCap. The introduction of blobs mitigates this issue by setting distinct limits and costs for different data types, making operations like rollups more economical and boosting transaction volumes.\nLooking ahead, Buterin envisions integrating stateless clients as the next significant challenge. These clients require a network to process transactions without storing every piece of state data on every node. This approach would greatly benefit from a refined gas model where different types of data and operations are priced according to their actual demands on the system.\nThe true potential of a multidimensional gas system lies in its flexibility to manage various network resources independently. For instance, state growth could be governed under its pricing model, separate from transaction processing or data storage, enabling the network to adapt dynamically to changing demands.\nDespite acknowledging the complexities involved, particularly regarding transaction execution and sub-calls within the Ethereum Virtual Machine (EVM), Buterin remains optimistic about the benefits. He believes that, with careful implementation, a multidimensional gas system could enhance Ethereum’s scalability and efficiency, making it better suited to meet the diverse needs of its user base.\n","create_date":"2024-05-14T13:00:44+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123332/crypto-venture-capital-investment-reaches-2-4-billion/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Funding for crypto startups increased for the second consecutive quarter, reaching $2.4 billion in the first quarter of 2024","title":"Crypto Venture Capital Investment Reaches $2.4 Billion","content":" Funding for crypto startups increased for the second consecutive quarter, reaching $2.4 billion in the first quarter of 2024, according to PitchBook data. This rise was driven by expectations of lower interest rates and the launch of the first U.S. bitcoin spot ETF, which spurred investor interest.\nThe funding was distributed across 518 deals, marking a 40.3% increase from the previous quarter, PitchBook reported. Meanwhile, global venture capital investments fell to a near five-year low during the same period.\nInvestment in digital asset startups has declined since peaking at over $10 billion in the first quarter of 2022, impacted by economic concerns and the collapse of major market players. However, the U.S. regulatory approval of spot bitcoin ETFs from major firms like BlackRock and Fidelity enhanced the legitimacy of the asset class, pushing bitcoin to a record high of $73,803 in March.\nPitchBook analyst Robert Le stated, “The recovery in publicly traded tokens and the ongoing rise in institutional adoption will drive increased VC funding.”\nStartups focusing on crypto and blockchain infrastructure attracted the most funding during the quarter, according to PitchBook.\nThe largest deal involved Together AI, a decentralized cloud platform, which raised $106 million in an early-stage round led by Salesforce Ventures, valuing the company at $1.1 billion.\n“The competition for investment rounds is intense, especially at the early stages,” said Le. “Early-stage deals are currently seeing higher valuations compared to late-stage deals, but it remains to be seen if this trend will continue in the coming quarters.”\nHowever, exits remained low. Le anticipates an increase in mergers later this year, particularly among crypto exchanges, custodians, and infrastructure providers as the market matures.\n","create_date":"2024-05-20T06:50:21+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/123200/mastercard-start-path-uae-startups/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Explore Mastercard's Start Path Blockchain program and the absence of UAE startups. Reflect on the implications for regional innovation.","title":"Mastercard's Start Path Program and the Missing UAE Startups","content":" In the recent unveiling of Mastercard’s Start Path Blockchain and Digital Assets program, the spotlight shines on innovation and collaboration as five promising startups from around the world join forces to explore the transformative potential of blockchain technology. Yet, amidst the excitement surrounding this global initiative, one notable absence catches the attention of observers: the United Arab Emirates (UAE).\nAs the UAE continues to cement its position as a regional hub for innovation and entrepreneurship, questions arise about the lack of representation from its vibrant startup ecosystem in Mastercard’s latest cohort. Did UAE startups apply for the program? Were they overlooked during the selection process? Or perhaps, is there a broader issue at play concerning the promotion and accessibility of such opportunities within the UAE and the wider MENA region?\nMastercard’s presence in the MENA region is robust, with initiatives aimed at fostering innovation and driving digital transformation. However, the apparent absence of UAE startups in this global program prompts reflection on whether Mastercard MENA is effectively promoting such opportunities and ensuring equitable access for startups in the region.\nIn a landscape where collaboration between industry giants and emerging startups is crucial for driving innovation forward, it’s essential to address any barriers that may hinder the participation of UAE or MENA startups in programs like Start Path. By fostering a more inclusive ecosystem and actively promoting opportunities for collaboration, Mastercard and other industry players can help unlock the full potential of the region’s entrepreneurial talent and drive meaningful change on a global scale.\nAs the conversation continues, it’s essential to acknowledge that the absence of UAE or MENA startups from Mastercard’s Start Path program prompts deeper reflection. While it’s possible that no startups from the region applied, it’s equally important to consider what this signifies about the strength of our ecosystem. Are we truly addressing real-world problems, or are we merely making noise? By asking these critical questions, we can catalyze meaningful introspection and drive necessary improvements to ensure that our entrepreneurial landscape thrives and competes effectively on the global stage.\n","create_date":"2024-05-16T07:15:19+00:00","tag":"","author":"News Desk"},
{"url":"https://www.unlock-bc.com/122891/binance-leading-in-virtual-assets-regulation-and-innovation/","web_url":"https://www.unlock-bc.com/","type":"article","description":"Meera Judge's highlights on UAE's regulatory leadership in cryptocurrency & Binance's commitment to compliance and best practices","title":"Binance: Leading in Virtual Assets Regulation and Innovation","content":" In the dynamic realm of cryptocurrency, regulatory clarity serves as the bedrock for fostering innovation and safeguarding consumer interests. The United Arab Emirates (UAE) has emerged as a beacon of regulatory leadership, setting a commendable example for jurisdictions worldwide.\nAssessing the regulatory landscape for virtual assets (VAs) reveals a spectrum of approaches adopted by different regions. While Switzerland boasts a mature regulatory framework, the EU’s Markets in Crypto-Assets Regulation (MiCA) aims for cross-jurisdictional harmony. However, the UAE is quickly positioning itself at the forefront of regulatory clarity in the crypto space.\nCentral to the UAE’s regulatory competence are pioneering initiatives such as the Dubai Virtual Assets Regulatory Authority (VARA), the world’s first dedicated regulatory authority solely focused on virtual assets. VARA’s establishment underscores the UAE’s proactive approach in addressing the unique challenges posed by cryptocurrencies, setting a new standard for regulatory innovation.\nAdditionally, the presence of the Financial Services Regulatory Authority (FSRA) within the Abu Dhabi Global Market (ADGM) reinforces the UAE’s commitment to regulatory excellence. The FSRA’s role in ensuring the integrity of the financial system within ADGM further contributes to the UAE’s leadership in the global crypto landscape.\nAt Binance, we commend the UAE’s dedication to regulatory clarity and consumer protection. Our collaboration with regulators in the UAE and globally underscores our commitment to developing robust regulatory benchmarks centred on consumer protection and market integrity.\nLooking ahead, there is potential for a similar regulatory framework to emerge within the Gulf Cooperation Council (GCC). With its footprint in the UAE and Bahrain, and anticipated presence in Saudi Arabia, Binance is well-positioned to contribute to the development of innovation hubs in the evolving digital asset landscape.\nRecent leadership changes at Binance reflect our unwavering commitment to leading the way in Anti-Money Laundering (AML) and Know Your Customer (KYC) compliance. In line with this commitment, we have significantly bolstered our compliance team with specialised capabilities aimed at addressing industry challenges. Our team comprises a diverse range of experts, including former law enforcement officers, regulators, crypto and fintech compliance specialists, as well as seasoned professionals from traditional banking backgrounds. This diverse expertise ensures that we maintain comprehensive risk management strategies and strict regulatory adherence.\nFurthermore, we have established dedicated departments within our compliance team to address crucial functions, such as Financial Crimes, MLRO, Sanctions/ABC/CTF, Corporate Compliance, Customer Due Diligence, High-Risk Clients, and Transaction Monitoring. These units work together to uphold our AML compliance and ensure the security of our platform and users.\nBinance’s definition of ‘best practices’ in the crypto exchange industry prioritises stability and regulatory compliance. Our focus on risk management, maintaining reserves, and reinforcing security protocols aligns seamlessly with the regulatory environment in the UAE and beyond. We invest heavily in finding the best KYC vendors and data sources across jurisdictions, ensuring that our compliance efforts are robust and effective.\nIn addition to regulatory collaborations, we actively engage with institutions, corporations, communities, and users to foster crypto demand and address business requirements. Our emphasis on trust-building through education and compliance underscores our commitment to responsible growth. Moreover, we advocate for the transformative potential of underlying Web3 technology beyond traditional finance.\nBinance remains steadfast in ensuring the responsible development of innovative products and services by prioritising compliance and working closely with regulators. We recognize the importance of balancing innovation with adherence to evolving global regulations. Through industry collaboration, education, and technology incubation, we aim to cultivate an effective crypto assets environment that nurtures trust and fuels sustainable growth, both globally and within the UAE.\nBy fostering initiatives like the Innovation Center, established with the Dubai World Trade Center Authority, Binance aims to drive regional and global technology advancements in blockchain and crypto, empowering users, businesses, and governments. This collaborative effort underscores our commitment to pioneering solutions that not only meet regulatory standards but also push the boundaries of what’s possible in this dynamic space.\n","create_date":"2024-05-10T08:52:03+00:00","tag":"","author":"Meera Judge"},
{"url":"https://www.unlock-bc.com/113829/eu-agrees-on-ai-regulations-setting-global-precedents/","web_url":"https://www.unlock-bc.com/","type":"article","description":"This agreement marks a significant step towards the EU being the first major global authority to implement comprehensive laws governing AI.","title":"EU Agrees on AI Regulations: Setting Global Precedents","content":" On Friday, Europe reached a preliminary agreement on groundbreaking regulations within the European Union (EU) concerning the use of artificial intelligence, as reported by Reuters. This encompasses the governmental utilization of AI in biometric surveillance and the oversight of AI systems like ChatGPT. This agreement marks a significant step towards the EU being the first major global authority to implement comprehensive laws governing AI.\nThe deal, achieved after extensive negotiations spanning nearly 15 hours following a marathon 24-hour debate, involves EU countries and members of the European Parliament. The finer details are yet to be finalized, potentially altering the ultimate shape of the legislation in the days ahead.\nEuropean Commissioner Thierry Breton emphasized EU’s pioneering role, recognizing the significance of setting global standards. He hailed the agreement as a historic milestone during a press conference.\nThe accord mandates foundational models like ChatGPT and general-purpose AI systems to adhere to transparency requirements before their market release. These obligations encompass creating technical documentation, compliance with EU copyright laws, and sharing detailed summaries about the training data.\nHigh-impact foundational models posing systemic risks will need to undergo evaluations, mitigate risks, conduct adversarial testing, report serious incidents to the European Commission, ensure cybersecurity, and disclose energy efficiency details.\nGeneral-purpose AI systems with systemic risks may opt for codes of practice to comply with the new regulations.\nRegarding real-time biometric surveillance in public spaces, governments are restricted to specific scenarios like addressing victims of certain crimes, preventing immediate threats such as terrorist activities, and pursuing individuals suspected of severe offenses. Prohibited activities include cognitive behavioral manipulation, untargeted harvesting of facial images from the internet or CCTV footage, social scoring, and using biometric categorization to infer personal beliefs, orientation, or race.\nConsumers will possess the right to file complaints and receive comprehensive explanations, with penalties for violations ranging from 7.5 million euros ($8.1 million) or 1.5% of turnover to 35 million euros or 7% of global turnover. However, business group DigitalEurope criticized these rules as an additional burden for companies, adding to recent regulatory pressures.\nThe legislation is anticipated to take effect early next year after formal ratification by both sides, with implementation expected two years thereafter.\nThis regulatory move by the EU occurs amidst global efforts by governments to strike a balance between harnessing the benefits of AI—its capacity for human-like interactions, answering queries, and programming—and the necessity of establishing regulatory frameworks.\nEurope’s ambitious AI regulations could set a precedent for other governments, providing an alternative approach to the United States’ lighter regulatory touch and China’s interim rules.\n","create_date":"2023-12-09T12:43:08+00:00","tag":"","author":"News Desk"}
]