[{"url":"https://www.ledgerinsights.com/dlt-carbonplace-inks-deal-to-distribute-pnz-carbon-credits/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Carbonplace, the DLT carbon distribution platform backed by banks, has signed its first deal to distribute carbon credits by PNZ Carbon","title":"Bank backed DLT platform Carbonplace inks deal to distribute PNZ carbon credits - Ledger Insights - blockchain for enterprise","content":" Carbonplace has signed a deal with PNZ Carbon to distribute its carbon credits via the bank distribution network. Carbonplace was founded by nine global banks and developed a DLT-based transaction network. Meanwhile, PNZ Carbon performs mass retrofits of UK housing to make them more energy efficient. It uses the carbon credits generated to help fund the upgrades.\nCIBC, Itaú Unibanco, National Australia Bank and NatWest founded Carbonplace in 2021. Subsequently BBVA, BNP Paribas, Standard Chartered, SMBC and UBS joined, with all the members backing a $45 million funding round last year.\nPNZ Carbon will be the first project to go live on Carbonplace. It will enable the carbon credits to be distributed via the platform, enabling buyers to manage and retire them.\nPNZ has two ways to make houses more carbon efficient. It performs housing retrofits involving insulation and air sealing so they lose less heat. In other cases it installs solar panels. For 2022 it partnered with the Housing Associations’ Charitable Trust (HACT) and sold the carbon credits to the likes of Berkeley Group, Unity Trust Bank and others. The partnership between PNZ and HACT is funding more than 100,000 UK retrofit projects.\n“Carbonplace’s partnership with PNZ Carbon exemplifies how our platform’s registry access services can set a new bar for security and transparency in the voluntary carbon market and together, we can rapidly scale carbon finance for some of the UK’s trickiest areas to decarbonise,” said Scott Eaton, CEO of Carbonplace. “Buyers of PNZ Carbon credits on Carbonplace’s platform can be safe in the knowledge they’re trading and retiring credits in the most secure way available to the market today.”\nThe technology that underpins Carbonplace is a private Ethereum blockchain with Consensys as the development partner.\n","create_date":"2024-04-23T15:29:38+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/iran-confirms-working-with-russia-on-cbdc-tokenized-assets-for-payments/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Iran says it is exploring with Russia the use of CBDC and Russia's digital financial assets (digital asset commodities) for payments","title":"Iran confirms working with Russia on CBDC, tokenized assets for payments - Ledger Insights - blockchain for enterprise","content":" During early 2023 there were reports that Iran was looking to create a gold backed digital currency to use for settlement with Russia. At the time, Russian law wouldn’t support settlement with gold backed tokens. However, that’s changed. Now, Russian newspaper Izvestia spoke to Iran’s trade attaché at the embassy in Russia, Rahimi Mohsen. He says the two countries are working together to address settlements using central bank digital currency (CBDC) and Russian digital financial assets (DFAs), the legal framework for tokenized assets.\nWith sanctions, the two countries are locked out of Swift for cross border payments and can’t easily trade in dollars or euros. Hence, they have resorted to local currency payments, which may not be ideal.\nWhen the topic of the Iran-Russia digital currency arose in 2023, digital financial assets such as tokenized gold were not allowed to be used for payments in Russia. However, last month Russia passed legislation allowing their use for cross border payments precisely to skirt sanctions.\nThat said, ACRA, the local rating agency, discussed the practicality of using tokenized commodities in February. Iranian counterparties would have to onboard to the DFA platforms to use digital financial assets (DFA) such as tokenized gold. They’d likely need to open a Russian bank account as well. Given that friction, ACRA suggested the creation of “an international exchange operator capable of connecting Russian information systems with foreign platforms.” That looks like a time consuming solution.\nPerhaps for this reason, the countries are also exploring CBDC.\nThere was also a blocker for using cross border CBDC. When Russia drafted its CBDC legislation, it included amendments allowing foreign banks to hold a CBDC. However, the central bank didn’t have a framework to support this, so it developed appropriate by-laws. Reports state this will be effective from January 1, 2025. Hence, this is likely the earliest date for Russian-Iranian CBDC settlements.\nAccording to Izvestia, CBDC might address another challenge the trading partners face – the discrepancy between the market exchange rate and the state rate in Iran. However, we’d expect market rates to be more favorable for Russia, whereas a wholesale CBDC might lock in the less appealing state rate.\nRussia originally planned to start exploring cross border CBDC in the first quarter of 2023. However, the legislative go ahead for a CBDC only came in mid July 2023, which likely delayed the work. Russia said it would explore two modes of interconnectivity, a shared platform for multiple CBDC and bilateral linking of domestic CBDCs.\nLately the Chinese renminbi has become the dominant currency for Russian cross-border payments. China developed the technology for mBridge, the cross border CBDC shared platform. However, this is being developed under the auspices of the Bank for International Settlements (BIS), which is unlikely to condone Russia as a participant.\nIn the meantime, the five nation BRICS trade alliance, currently chaired by Russia, recently expanded to ten members, including Iran. It is discussing a potential BRICS Bridge, which sounda similar to mBridge. Russia plans to deliver recommendations on the topic later in the year.\n","create_date":"2024-05-03T11:51:17+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/eu-parliament-finally-passes-aml-legislation-impacting-crypto/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The European Parliament has passed the final version of a package of anti money laudering (AML) legislation that also impacts crypto","title":"EU Parliament finally passes AML legislation impacting crypto - Ledger Insights - blockchain for enterprise","content":" Yesterday the European Parliament passed the final version of three sets of broad anti money laundering (AML) legislation that include clauses that impact cryptocurrencies and crypto-assets more broadly. The timing was critical as Parliament recesses today ahead of elections. Crypto receives the most attention in the EU single rulebook regulation. The final necessary step is for the European Council to approve the legislation.\nWhile the legislation is by no means a light touch, several crypto-related clauses were watered down compared to the early drafts. As reported in January, the major impact is crypto asset service providers (CASPs) now have to implement the same AML rules as banks for transactions of more than €1,000.\nThe good news is that they dropped the original plan to include NFT platforms and Decentralized Autonomous Organizations (DAOs), which are not classified as CASPs. However, the legislation notes that by the end of the year the Commission will report to Parliament on crypto-assets in general and NFTs in particular. Hence NFT AML legislation could still arrive, just not yet. There’s no mention of DAOs.\nSelf hosted wallets were another contentious area. CASPs are not allowed to provide custody for anonymous crypto accounts, nor are they allowed to custody ‘anonymity-enhancing coins’. However, the legislation explicitly does not impose AML requirements on self hosted wallet providers:\n“The prohibition does not apply to providers of hardware and software or providers of self-hosted wallets insofar as they do not possess access to or control over those crypto-assets wallets.”\nOne clause deals with the steps a CASP needs to take when a transaction involves a self-hosted wallet. The CASP needs to try to identify the wallet holder “including through reliance on third parties” which likely means blockchain intelligence firms. It must collect additional information on the origin and destination of the crypto and conduct enhanced ongoing monitoring.\nOther regulations already substantially covered CASP transactions with self hosted wallets. When the EU passed the MiCA regulations there was a companion AML regulation relating to the travel rule. For self hosted wallet transactions, enhanced due diligence is required. That’s the highly invasive type where they ask about all your assets, sources of income, etc.\nThe European Banking Authority published guidelines on the implementation of the regulations in January. It’s not just self hosted wallets that are considered high risk. Some pretty innocuous behaviors are as well. One of the benefits of the EU is people can work in other countries. However, using a bank account from a different jurisdiction – highly likely if you work in another EU country – is considered high risk. If you use more than one card or bank account to top up the crypto account, that’s dodgy! And if you deposit crypto in an unregulated P2P lending platform, you must be iffy, apparently.\n","create_date":"2024-04-25T09:59:17+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/us-dlt-settlement-trials-citi-jp-morgan-in-sifma-coordinated/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"SIFMA will coordinate US DLT settlement trials of the Regulated Settlement Network involving ten institutions such as JP Morgan, Citi and Visa","title":"Citi, JP Morgan in SIFMA coordinated US DLT settlement trials - Ledger Insights - blockchain for enterprise","content":" Ten financial institutions including Citi and JP Morgan will participate in a distributed ledger (DLT) feasibility trial. It involves using tokenized deposits, wholesale central bank money, U.S. Treasuries and other tokenized assets on a shared ledger as part of the Regulated Settlement Network (RSN). The goal is to test settlement on a common regulated venue under existing laws by simulating USD delivery versus payment transactions.\nThe latest proof of concept (PoC) builds on an initiative last year involving several of the same institutions for the similarly named Regulated Liability Network (RLN).\nOne of the major additions is the two U.S. interbank tokenized deposit networks. The USDF Consortium is a participant and Tassat Group is a project contributor, potentially integrating with the shared ledger. Deloitte is providing advisory services and the group plans to engage vendors for technology and legal analysis.\nThe Securities Industry and Financial Markets Association (SIFMA) will act as the program manager for the proof of concept (PoC), taking on a role similar to that of UK Finance in the British trials.\nCharles de Simone, Managing Director at SIFMA, said the initiative aims “to explore innovations working with digital forms of USD cash and securities, as market participants continue to innovate to support efficient, resilient capital markets.”\nBeyond the ten participants, another six project contributors will provide subject matter expertise and could demonstrate connectivity between the shared ledger and external solutions. They include BNY Mellon, Broadridge, the DTCC, ISDA and Tassat Group, with the non profit MITRE Corporation also involved.\nThe New York Innovation Center (NYIC) at the Federal Reserve Bank of New York is also involved in a narrow role, purely as a technical observer.\nThe full list of participants are Citi, J.P. Morgan, Mastercard, Swift, TD Bank N.A., U.S. Bank, USDF, Wells Fargo, Visa, and Zions Bancorp.\n“As blockchain technology continues to mature, it will be critical for public and private organizations to partner closely to explore how it can be applied to solve for real-world pain points and improve efficiencies,” said Raj Dhamodharan, EVP, Blockchain & Digital Assets at Mastercard. “The application of shared ledger technology to dollar settlements could unlock the next generation of market infrastructures – where programmable settlements are 24/7 and frictionless.”\nWhile Mr Dhamodharan and some of the participants mentioned blockchain and DLT, SIFMA only referred to a “shared ledger”. We’ve previously noted that the BIS’s Unified Ledger may not use DLT because central banks prefer an infrastructure with central bank money to be centralized. Arguably, the RLN inspired the concept of a Unified Ledger and hence the RSN and Unified Ledger are similar.\n","create_date":"2024-05-08T09:16:11+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/co2-emission-savings-from-electronic-bills-of-lading/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"GSBN commissioned a study by SIA to assess the CO2 emission of paper bills of lading. Electronic bills of lading will have a big impact","title":"GSBN quantifies massive CO2 emission savings from electronic bills of lading - Ledger Insights - blockchain for enterprise","content":" Bills of lading are a foundational document representing ownership of cargo in transit and are widely used in trade finance. A couple of weeks ago the Global Shipping Business Network (GSBN) published a groundbreaking study assessing the environmental impact of digitizing bills of lading. It commissioned consultancy SIA, which assessed that every electronic bill of lading could save 27.9 kg of greenhouse gas emissions. Extrapolating that figure over the industry’s 15.8 million paper bills yields a potential CO2 emissions saving of 440,820 metric tons per year.\nSeparate calculations were performed for electronic delivery orders (eDO) used in GSBN’s cargo release application, which can save around 16.9 kg per shipment. GSBN applied the figures to the 120,000 electronic bills of lading (eBLs) its DLT network supported in 2023, plus the one million usages of its cargo release application, giving a CO2e reduction of 20,428 metric tons.\nWe didn’t immediately publish the news because we wanted to fact check the research, so there was some back-and-forth about the data. We only explored the bills of lading and concluded the figures are on the high side, but not outrageously so. Our rough figure using generous average mileage came to 16.2kg per bill of lading versus 27.9kg from the study.\nHowever, the study’s foundations are solid, and the workings were shared for transparency. Critiquing the work from an armchair is easier than creating necessary research from a clean sheet. The report also included caveats that results depend on the specific examples used. We arrived at the above figures after revising them upwards to use the study’s example of a Shanghai to Rotterdam shipment as an average.\nThe shipping industry has been slow to adopt electronic bills of lading (eBLs), most of which use DLT. Part of the reason has been poor interoperability, but inertia is a major factor. While the container shipping industry has committed to fully digitizing in ten years, research such as this could provide an additional motivation to accelerate that. Even if one applied half the emissions savings, it’s still worthwhile digitizing.\n“As the shipping industry sails towards a greener horizon, the journey to net zero is not just about cleaner fuels but also about transforming the very fabric of trade through digitisation,” said Alicia Lee, COO at GSBN. “Paper-laden processes are not only inefficient and insecure for modern trade but are underpinned by carbon-intensive land and air logistics.”\nMs Lee alluded to the crux of the calculations. One copy of the paper bill of lading has to be couriered from the port of loading (POL) to the port of delivery (POD). This involves couriers by road and air. The bulk of the emissions savings are from the road courier at the loading and destination cities.\nBecause a paper bill weighs so little, the air courier accounts for only around 1% of the emissions, or around 0.27kg of savings, even for a 9,000 km flight from Shanghai to Rotterdam. Other costs, like paper, printing, etc., account for an even smaller amount.\nSIA used quite long road distances, which is not unreasonable given that it represented a real shipment from Shanghai to Rotterdam. This was used for the average. Using the long road distance and allowing for a generous 5% uplift for other costs (air courier, extra bill copies, paper, etc), our figure came to 16.2kg per bill of lading versus 27.9kg. Even our calculation is on the high side.\nGiven that the emissions figures were from the Agency for Ecological Transition (ADEME), the only numbers that really matter are the distances the road couriers travel.\nDistances for a Shanghai – Rotterdam shipment:\nThis gives a total of 210 km in road travel.\nRoad courier emissions are 0.0736 kg of CO2 per passenger km per ADEME. That gives 15.46kg of CO2 for a 210km trip. With a generous 5% uplift for other emissions, the total savings are around 16.2 kg. As you’d expect, SIA was far more precise than us and measured all the small emissions as well. However, 5% more than covers all those items and then some.\nThere are three copies of the paper bill of lading, but we do not believe the extra copies account for the discrepancies in the calculations. We already described the main copy. A second copy travels by ship with the cargo, so the emissions are very low as it’s based on weight. The other copy goes from the carrier to the shipper, who keeps it. The shipper also receives the first bill of lading simultaneously, so we did not double-count this trip in our calculations. The emissions relating to the copies easily fall within the 5% uplift we added.\nWhile the figures appear high, GSBN and SIA deserve credit for conducting and sharing the research.\n","create_date":"2024-04-24T09:19:43+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/eu-wholesale-dlt-settlement-trials-start/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The EU wholesale DLT settlement trials started yesterday with a simulation by Oesterreichische Nationalbank. Some other trials use real money","title":"EU wholesale DLT settlement trials start - Ledger Insights - blockchain for enterprise","content":" Yesterday, the Oesterreichische Nationalbank participated in the first trial of wholesale DLT settlement transactions as part of the Eurosystem experiments. As reported last month, 16 institutions were onboarded to participate in the first wave of DLT trials, which use real central bank money. In addition, there are experiments involving simulations.\nThe Oesterreichische Nationalbank example was a simulation involving the tokenization and simulated settlement of government bonds against central bank money – a delivery versus payment (DvP) transaction.\nThe ECB says upcoming trials and experiments will include\nParticipants can choose between three different settlement solutions. Only one of them is a wholesale central bank digital currency (CBDC) provided by the Banque de France. The Deutsche Bundesbank is providing its trigger payment solution which links to Target 2, and the Bank of Italy is providing the TIPS Hashlink offering.\nMany argue that only on-chain settlement with the likes of a CBDC can provide full DLT benefits. One of the original motivations for institutional adoption of DLT was removing the need for reconciliation. If there’s a link to an external payment system, then reconciliations are still necessary. Hence, one of the outcomes being explored is the need to reconcile between DLT and participant systems.\nSome of the participants have shared their plans for the trials, including Deutsche Börse’s Clearstream and SWIAT, which includes LBBW and Dekabank.\nThis first wave of trials runs until November this year. Applications are now closed for the second wave which starts in July and also runs until November.\n","create_date":"2024-05-14T15:42:35+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/bundesbank-survey-explores-digital-euro-disintermediation-impact-on-banks/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Bundesbank shared a survey and model measuring the intermediation impact of the introduction of the digital euro on bank deposits","title":"Bundesbank survey explores digital euro disintermediation impact on banks - Ledger Insights - blockchain for enterprise","content":" Last week, the Deutsche Bundesbank unveiled the results of a comprehensive digital euro survey that explored how households might react to the introduction of a central bank digital currency (CBDC). It combined the data with an econometric model to measure disintermediation – the impact of consumers shifting from bank deposits to the digital euro.\nThe findings, while expected in some aspects, offered nuanced details that added depth to the analysis. While there were many caveats, the work recommended holding limits of €1,500 – €2,500, less than the current expected limit of €3,000.\nOnly just over a quarter of survey participants had heard of a CBDC, so the basic concept was explained. It’s worth remembering that Germany is a relatively cash-favoring economy compared to others.\nWhile there are no plans for the digital euro to pay interest, the survey asked the question under several scenarios. With zero interest, 45.9% of respondents might use the digital euro. If the CBDC were remunerated at the same rate as bank deposits, the figure was 57.3%, rising to 72.6% if an additional quarter percent were offered. Oddly if it were remunerated at a quarter less than deposit rates, the take up would be 34.4% – ie. less than if it were not remunerated. The paper highlighted that the survey was conducted in April 2023 when interest rates in Germany were considerably lower than currently.\nOn average, about 10% of money holdings would shift to the digital euro, rising to 21% for the keen group. That includes movements out of cash, bank deposits and other financial instruments, with bank deposits losing the largest slice.\nThe survey also explored trust in the European Central Bank (ECB) and central banks, with the low trust group shifting far less money into the digital euro. “Experience of an authoritarian East German regime is associated with a reduction of approximately 4 percentage points,” the authors observed.\nIn the case of bank runs, of those who would adopt a zero interest CBDC, 84 percent would withdraw money to a digital euro in a crisis. Even amongst those who would not use the CBDC during normal times, a third would use it during banking stress. However, cash is still the preferred instrument in the case of bank runs, and even more so for the low trust group.\nOne anomaly identified by the survey was the disinterest from the financially excluded. Three quarters of the unbanked hadn’t heard of a CBDC. The report authors speculated whether the CBDC description provided – a digital bank account with central bank backing – might have deterred them, given their unbanked status. Alternatively they might be suspicious of the ECB. At the other end of the scale, the wealthier respondents are also less interested.\nMeanwhile, this is not the first study exploring bank disintermediation for the digital euro. Another was published a year ago. There have been multiple studies on holding limits, including in Europe and Canada.\n","create_date":"2024-04-30T14:33:20+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/northern-trust-survey-17-of-asset-managers-consider-adding-digital-assets/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"A Northern Trust asset manager survey found 32% are already invested in digital assets with an additional 17% planning to","title":"Northern Trust survey: 17% of asset managers consider adding digital assets - Ledger Insights - blockchain for enterprise","content":" Northern Trust surveyed asset management executives, finding a strong interest in digital assets. Almost a third are already invested in the asset class. Another 32% plan to support new asset classes. Of that group 54% are eyeing digital assets, translating to 17% overall. In other words, if the investment managers follow through on their plans, the proportion of assets managers invested in the asset class would increase from 32% to 49%.\nThese are not small asset managers. Of the 300 survey respondents, 90% manage more than $10 billion, with half managing north of $100 billion.\n“It is not surprising that digital assets are increasing and there is a shift towards longer-term investment in digital assets versus more short-term gains that we saw two years ago,” said Caroline Higgins, Head of Global Fund Services Northern Trust, Asia Pacific.\nNorthern Trust itself has been involved in the blockchain sector for years. It’s one of the world’s largest global custodians, with $16.5 trillion in assets under custody. In 2020 it partnered with Standard Chartered as a minority investor to launch a digital asset custody solution Zodia Custody. Even earlier than that, in 2018 it developed a blockchain administration system for the private equity sector.\nDuring 2022 Northern Trust created a Digital Assets and Financial Markets team, which last year unveiled a DLT workflow solution connecting institutions to carbon credit projects.\n","create_date":"2024-05-02T11:12:32+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/regulated-crypto-firm-coins-ph-debuts-philippines-stablecoin-in-sandbox/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Coins.ph is trialing a Philippine Peso stablecoin PHPC in a regulatory sandbox. Cross border remittances are the most likely use case","title":"Regulated crypto firm Coins.ph debuts Philippines stablecoin in sandbox - Ledger Insights - blockchain for enterprise","content":" Last week Coins.ph said it had started testing its a Philippine Peso stablecoin, PHPC, as part of a Bangko Sentral ng Pilipinas (BSP) sandbox. It commenced testing the stablecoin in April which will likely continue until June. At that point, it’s hoping to open it up for broader usage, but that will be subject to the central bank’s assessment. The stablecoin is backed by cash and cash equivalents held at Philippine banks.\nIt says the trials will involve ‘real world applications’. Given the 12 million or so Filipino diaspora, cross border remittances are the most obvious one. It will also target domestic payments, although this competes with the 24/7 faster payment system InstaPay, which has a transaction limit equivalent to $865. Most other use cases are crypto focused, such as trading, hedging when there’s market volatility and using the stablecoin as collateral for DeFi applications.\n“While PHPC presents a variety of potential applications in trading and payments, we anticipate remittances to be a foremost use case for Filipinos, as PHPC will not only reduce costs; it also means that now peso transactions can happen 24/7 and in real time,” said CEO Wei Zhou, according to GMA News.\nCoins.ph is already active in remittances. In 2019 it inked a deal with Western Union that enabled offshore workers to optionally remit payments directly to the Coins.ph wallet.\nWith 7 million active users of its wallet, Coins.ph already holds licenses as an e-money firm and a virtual currency service provider in the Philippines. More recently it has acquired licenses in several other jurisdictions.\n","create_date":"2024-05-14T10:58:03+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/b2c2-founders-launch-bond-tokenization-platform-pv01/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The founders of institutional crypto broker B2C2 launched a digital bond broker-dealer PV01. At launch it's issuing treasury backed bonds","title":"B2C2 founders launch bond tokenization platform PV01 - Ledger Insights - blockchain for enterprise","content":" Shortly before Christmas in 2020, Japan’s SBI bought out B2C2, the institutional crypto broker and liquidity provider. Now its co-founders Max Boonen and Flavio Molendin have launched PV01, a Bermuda-based broker-dealer and arranger of digital bond issuances. Earlier this month it ran a proof of concept that involved bond issuances on the public Ethereum blockchain under English law.\nThe $5 million native bond was issued via a special purpose vehicle, Digital Bonds Ltd, with the proceeds used to buy a US Treasury Bill, so the token was secured by the bill. Investors included B2C2, Keyrock and BlockTower and the issuer redeemed the bond a week later.\nWhile Treasury backed tokens are a planned product, its easy to get distracted that the intent here is for PV01 to provide an institutional grade bond platform with PV01 regulated as a Digital Assets Business in Bermuda. Apart from Treasury-backed bonds it can also enable crypto firms to issue corporate bonds.\nPV01 touts one of the advantages as the ability to use the bonds as collateral.\nIts digital treasury bills (TBL) are an interesting starting point. It invites comparison with Blackrock’s BUIDL, the digitally native fund unveiled last month that is also backed by Treasuries. One is a bond and the other is a fund, and each has pros and cons from a legal perspective. Ultimately they both offer Treasury-backed yield in a tokenized form.\nBUIDL has a high minimum investment of $5 million and is only available to US investors. However, Ondo Finance is using BUIDL as backing for its OUSG token which is open to international investors with a minimum investment of $100,000. Ondo operates a fund structure but is not a regulated entity.\nPV01 targets non-U.S. institutional investors. An advantage of PV01’s treasury-backed bonds is it can offer fixed maturities in contrast to a rolling fund. A fund is equity so it represents ownership of the underlying assets, whereas a bond does not. However, debt ranks higher than equity in bankruptcy.\nIf the fund and this type of bond both involve SPVs, the relative advantage might not be huge.\nMeanwhile, PV01 raised a $9 million seed round from Tioga Capital, BlockTower, and Ryze Labs.\n","create_date":"2024-04-24T18:04:24+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/standard-chartered-partior-interbank-tokenized-deposit-network/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Standard Chartered is the first settlement bank to support Euro payments on the Partior DLT network for cross border payments","title":"StanChart confirms Euro transactions on the Partior interbank tokenized deposit network - Ledger Insights - blockchain for enterprise","content":" In November 2022 Standard Chartered invested in Partior, the blockchain-based interbank payment network founded by DBS Bank, JP Morgan and Temasek. Today Standard Chartered announced it is the first settlement bank on the tokenized deposit network to support Euro transfers, with Siemens and iFast Financial participating in transactions earlier this week.\nOn Monday we reported that all three founding banks are now in production. Several other currencies are planned but the network currently supports US Dollars, Singapore Dollars and Euros. Standard Chartered confirmed it has integrated Partior with its core banking system. The network uses DLT to speed up cross border payments and also provides added transparency for customers.\nWhile Partior doesn’t disrupt the correspondent banking system, it addresses some of Swift’s pain points. Firstly, the banks perform compliance in advance, preventing delays for AML queries. Many conventional payments are held up by the operating hours of the recipient banks or delays in the recipient bank updating the balance in customer accounts. Partior avoids the split between the message and money movement and enables 24/7 interbank transfers. That’s particularly important for corporates.\n“Our collaboration with Partior to be the first Euro settlement bank to launch on the network brings us closer to our goal of providing real time, 24/7 flows at scale for corporates and financial institutions while meeting their treasury needs in a safe and efficient manner,” said Mahesh Kini, Global Head of Cash Management at Standard Chartered.\nWe understand the plan is for other banks to connect to the network via the settlement banks.\nPartior calls itself a Unified Ledger. So how does it differ from Project Agorá, the cross border payment initiative recently launched by the BIS and seven central banks? Agorá also uses tokenization and avoids disrupting the correspondent banking system. However, the presence of the central banks is the big differentiator.\nPartior enables 24/7 interbank transfers for smaller banks and corporate clients. However, the settlement banks still need to settle amongst themselves. This is currently done conventionally via Swift. In contrast, Project Agorá will use tokenized central bank money (like wholesale CBDC) for the interbank settlement.\nSiemens is no stranger to blockchain solutions. It issued a €60 million digital bond on a public blockchain and was amongst the first clients to use JP Morgan’s JPM Coin blockchain-based bank account and its programmable payment functionality. JPM Coin allows the company to move money between subsidiaries in different jurisdictions 24/7. However, it is restricted to dollars and euros and accounts at the one bank.\n“Leveraging the groundbreaking Partior platform, we’re not just streamlining cross-bank payments but also covering our geographical footprint for such transactions,” said Heiko Nix, Global Head of Cash Management and Payments, Siemens AG. “The bank’s integration of Euro-denominated settlements between Hong Kong and Singapore, via Partior, is not just a testament to its technological advancement but a beacon for the future of seamless, secure, and efficient global payment systems.”\nThis week, we reported that Partior has a new CEO, Humphrey Valenbreder, after the founding CEO’s departure four or five months ago.\n","create_date":"2024-05-15T09:30:59+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/visa-launches-stablecoin-analytics-website/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Visa has launched a stablecoin analytics website that strips out bot activity in an attempt to show true settlement","title":"Visa launches stablecoin analytics website - Ledger Insights - blockchain for enterprise","content":" Today, Visa unveiled a new stablecoin analytics website in partnership with Allium Labs. In a blog post, Cuy Sheffield, Visa’s head of crypto, explained why the analytics were published. He demonstrated a frequently circulated graphic showing that stablecoin volumes have surpassed PayPal and are almost up to sVisa’s transaction levels.\nHowever, Sheffield argues there’s a lot of noise in the data from bots. These bots perform necessary crypto activities like arbitrage, liquidity provision and market making. However, these are not conventional settlement transactions, so it compares apples with oranges.\nRemoving bot activity reduces 30 day transaction volumes from $2.65 trillion to $265 billion. However, active stablecoin users have risen steadily to 27.5 million.\nWe’d also note the statistics are for on-chain volume only. Most crypto transactional activity happens on exchanges, with Tether being the popular settlement stablecoin. These transactions are recorded within the exchanges own books, with only occasional on-chain transactions. While we’re no defender of Tether, Visa’s statistics undercount Tether’s true volumes (including exchanges) and show that USDC makes up a larger proportion of transactions than it likely does.\nIt’s worth asking why Visa is publishing these analytics.\nBack in January we explored whether Visa might be considering launching its own stablecoin. While central bankers might be concerned about the thought, we concluded that it’s doubtful as Visa is not a direct-to-consumer company. On the other hand, it could launch a stablecoin issuance and multi-chain management solution similar to Japan’s Progmat Coin. We’d be shocked if it didn’t offer a wallet or other services, after recently launching a web3 loyalty solution. And it’s already actively involved in tokenized deposits.\nOn the public blockchain front, Visa supports payment to web3 merchants using stablecoins (USDC) if they use Worldpay or Nuvei.\n","create_date":"2024-04-25T13:44:55+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/tokyo-subsidizes-digital-securities-issuance-costs/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Government of Tokyo will pay up to two thirds of the issuance costs relating to digital securities in its support for tokenization","title":"Tokyo subsidizes digital securities issuance costs - Ledger Insights - blockchain for enterprise","content":" Japan is one of the most active jurisdictions for tokenization and digital securities. Today the Tokyo Metropolitan Government announced a subsidy for security token issuances.\nWe expected the subsidy to be small, but it’s pretty significant. The government will cover half the costs or two thirds for startups, with an upper limit of five million yen ($31,785). That amount can be even higher for certain use cases that address social issues or provide new investment experiences for individuals through digital technology. The costs covered include platform fees, consultancy and system development costs.\nTokyo acknowledged two major benefits of security tokens – lower denominations for issuances and the removal of intermediaries.\nMeanwhile, Japan’s ruling Liberal Democrat Party has been very supportive of web3 and published its latest white paper on the topic a few days ago. A key goal is to “Make our country the center of web3”.\nOne of its action plans aims to promote the distribution of security tokens through private trading systems (PTS). It already created laws supporting stablecoins on public blockchains. Its latest plans include beneficial tax treatment and support for decentralized autonomous organizations (DAOs) and decentralized identity.\nHowever, the ruling party is embroiled in a slush fund scandal and lost all three parliamentary seats in a by-election this weekend. Hence, it’s unclear whether it will be in power to follow through on its plans.\n","create_date":"2024-04-30T15:51:17+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/is-converting-a-digital-yuan-salary-out-of-cbdc-a-feature-or-a-bug/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"While many receiving Chinese salaries in digital yuan don't keep it in their CBDC wallets, is that a feature or a bug","title":"Is converting a digital yuan salary out of CBDC a feature or a bug? - Ledger Insights - blockchain for enterprise","content":" Today the South China Morning Post (SCMP) published an article entitled, “China is paying some workers in digital yuan – but few are choosing to use it”. At first we thought it might be an audacious article. That’s because SCMP is owned by Alibaba which, along with sister company Ant, has been the target of a regulatory clampdown by the Chinese government. However, the main gist of the piece is that employees receiving salaries in the central bank digital currency (CBDC) are transferring it out of the eCNY because it doesn’t pay interest. In our view, that is a feature not a bug.\nAfter all, most CBDCs are intended for payments, not as deposit instruments.\nHowever, a secondary driver for converting the salary from the eCNY, is that few retail outlets accept the CBDC. That’s a more serious issue because network effects require sufficient retail outlets to support it. As with all jurisdictions with good existing payment infrastructure, it’s hard for users to justify using an alternative.\nHowever, given that Chinese retailers pay zero acceptance fees on the CBDC, you’d think there would be more outlets. On the one hand, acceptance fees are relatively low in China – around 0.6%. However, point-of-sale equipment manufacturers reportedly earn a cut of merchant fees. So if CBDC fees are zero, they are disincentivized to convert their equipment because they lose fees from alternative payment methods, as we wrote last year.\nThe person who expressed their reluctance to keep the eCNY to the SCMP, Sammy Lin, added “Though I myself don’t worry much about privacy – online payment is so common that I rarely use cash now – I understand there are people who are concerned about this.” China claims small value payments can be anonymous, but not medium or large ones. However, small value wallets still need to provide a phone number. In that scenario, the authorities need a warrant to identify the user.\nMeanwhile, the eCNY is becoming deeply integrated with Huawei’s phone and IoT devices. Plus, the central bank recently published an English CBDC guide for tourists.\n","create_date":"2024-05-13T13:51:24+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/comparing-the-uk-eu-approach-to-fostering-dlt-innovation/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"R3's Marcus van Abbé compares two tokenization sandboxes, the EU's DLT Pilot Regime and the UK's Digital Securities Sandbox","title":"The race to regulate: comparing the UK and EU’s approach to fostering DLT innovation - Ledger Insights - blockchain for enterprise","content":" In this opinion piece, Marcus van Abbé, Head of Digital Market Infrastructures at enterprise blockchain firm R3, compares the EU’s DLT Pilot Regime to the UK’s Digital Securities Sandbox.\nBoth the UK and the EU have emerged as fintech powerhouses over the past few years. London, Paris and Berlin all frequently appear on lists of the world’s top ten fintech hubs, each contributing several billion dollars to their respective economies and sitting right at the forefront of innovation.\nThis has stoked competition, with governments and regulatory bodies in both regions looking to inch ahead in the race to a financial services revamp. To this end, the EU’s digital finance package and the UK’s Financial Services and Markets Act (FSMA), their respective landmark digital finance guidelines, both set out proposals to utilise distributed ledger technology sandboxes to enable enduring financial services innovation.\nThe EU made the first move, with the EU DLT Pilot Regime, launched on 23rd March 2023. The UK then followed suit, launching its very own Digital Securities Sandbox (DSS) on 8th January 2024. Both sandboxes are instrumental in the development of their guidelines, allowing Financial Market Institutions (FMIs) and other financial institutions to explore DLT in a regulated framework by temporarily modifying legislation.\nFor the industry to truly realise why DLT is a critical piece of the puzzle when looking to unlock the full potential of tokenization and digital assets, we must invest time into understanding the potential impacts and advantages of the EU DLT Pilot Regime and the DSS in their respective markets.\nFirst, it’s important to take note of the set rules regarding participation, as these can potentially limit the use cases being explored in each sandbox. The FSMA enables far broader institutional participation in the DSS than the DLT Pilot Regime allows. The EU DLT Pilot Regime is open to use by multilateral trading facilities (MTFs) and central securities depositories (CSDs). The DSS is available for UK-based MTFs and CSDs but is also open to technology companies – allowing for a wider range of use cases and collaboration between incumbents and cutting-edge new entrants.\nThe Pilot Regime does, however, allow direct access for retail investors. Generally, regulated exchanges don’t allow access to retail participants, however if ESMA grants permission, the pilot regime waives this, on the condition that the exchange or settlement system offers compensation if something goes wrong.\nThere are some limitations. Retail investors are expected to have a sufficient level of trading ability, competence and experience – including a working knowledge of DLT. Users also cannot act as a market maker or engage in algorithmic trading.\nThe HM Treasury currently does not permit retail access to the DSS, however in its consultation response back in November, it stated that retail participation is not ruled out and that future sandboxes may look at more novel retail focused solutions.\nIn terms of participation, the DSS has the edge on the DLT Regime. Whilst the Pilot Regime allows for retail access, it actually accounts for a very small number of users. Instead, the DSS’s inclusion of technology companies allows for greater collaboration between FMIs and new cutting-edge firms, fostering a more innovative environment.\nThe use cases for each sandbox differ significantly. The EU Pilot addresses barriers to adoption within MiFID II and Central Securities Depositories Regulation (CSDR). This is done by offering some exemptions to these regulations, enabling firms to test and experiment with DLT specific to use cases that fall under these legislations.\nThis is where the DSS has another edge. Unlike the EU DLT Pilot Regime, the DSS goes further than just disapplication, by allowing for the modification of legislation or even the application of specific legislation in certain scenarios.\nCrucially, the DSS enables the modification, amendment and creation of rules by the Bank of England and FCA, creating the opportunity for the design and implementation of a bespoke regulatory framework. As a result, the conclusion of the DSS may result in a more targeted regulatory framework for a wider range of use cases.\nA key point where the DSS and EU DLT Pilot Regime differ is hinted at in their names. The EU DLT Pilot Regime solely focuses on promoting the use of DLT, whereas the DSS promotes the use of ‘developing technologies’ which includes, but is not limited to, DLT.\nThe Pilot Regime allows market infrastructures to use either permissioned or permissionless blockchains for the issuance and trading of tokenized bonds, stocks and funds – including money market funds.\nSimilarly, the DSS allows for digital representations of debt and equity securities, and money market instruments. Derivatives are deliberately excluded, as no derivatives-specific legislation is modified under the regulations. The DSS however does not currently allow the use of permissionless blockchains, as it is difficult for permissionless systems to comply with current legislation. This makes private and permissioned blockchains more important in the exploration of innovative use cases, that will further the UK’s position as a leader in the tokenization and digital asset space.\nThe DSS once again trumps the Pilot Regime in this respect, as it promotes the use of more than just DLT.\nIt is clear an increasing number of banks and financial institutions will turn to pilot programmes and regulatory sandboxes as this technology matures and industry adoption grows. Both the DSS and the Pilot Regime are hugely promising first steps in the introduction of industry wide DLT applications for the trading and settlement of securities.\nThe DSS may offer a more sophisticated framework in the enablement of innovation, providing a broader scope of technologies and regulatory flexibility. It seems it may also allow the participation of a wider range of infrastructures and companies than its European counterpart.\nThe DSS may benefit from a ‘fast follower’ approach, learning from ESMA’s market implementation however the consultations have proven to be invaluable. Allowing European NCAs to find a best path forward for their market participants and build on ESMA’s work.\nThrough continued dedication to smart frameworks and consistent collaboration, the industry can leverage tokenization and DLT to reach the ultimate end goal for financial markets – participants building innovative products to progress markets via the secure, seamless and streamlined management of their assets across different networks.\n","create_date":"2024-05-06T12:22:11+00:00","tag":"","author":"Marcus Van Abbé (op-ed)"},
{"url":"https://www.ledgerinsights.com/regulated-asset-tokenization-gift-city-india/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"India's international financial center GIFT City will host its first tokenization platform in January 24, for a building in its zone","title":"Regulated asset tokenization to launch in India's GIFT City - Ledger Insights - blockchain for enterprise","content":" India’s international financial services center (IFSC), Gujarat’s GIFT City, is readying to launch its first regulated tokenization platform for real world assets (RWA) in January 2024, the Times of India reported. India is positioning GIFT City as a competitor to Singapore and Dubai.\nA spokesperson for GIFT City regulator, the IFSCA, said that the first tokenized asset class will be real estate, but art, aircraft and ships are on the agenda. “This will enable more foreign investors to fund development and other projects here,” the official said.\nThe team behind real estate development firm Collated has created a separate blockchain fintech, Terazo, to tokenize assets on the Poylgon blockchain. Terazo says it’s part of the GIFT City sandbox and it also provides a marketplace. GIFT City’s Alternative Investment Fund (AIF) is used to structure the investment.\nCollated is collaborating with Indian construction firm Savvy Group on the first real estate tokenization venture where they plan to raise $7 million. It’s for a building within the Gift City Special Economic Zone (SEZ). However, access isn’t entirely open to retail investors. There is an approved list of eligible investee countries and a net worth minimum of $150,000. That’s a significantly lower hurdle than accredited investor criteria in other jurisdictions.\nShaan Zaveri from Tezaro and Collated observed that tokenization is happening in other Indian cities, but the investments are unregulated. He reiterated that it’s hard for foreign investors to access private markets and there’s a lack of liquidity. “Through Terazo, we intend to make the private market investing inclusive and frictionless,” he said. Secondary investors can invest as little as $1,000.\nMeanwhile, tokenized cash is also being piloted in GIFT City. JP Morgan provided the tokenization solution through its Onyx JPM Coin blockchain-based bank accounts. The tokenized U.S. dollars are used to settle Rupee forex derivative contracts by five GIFT City banks. In this case, the key benefit is enabling dollar transactions 24/7 rather than just doing U.S. banking hours.\n","create_date":"2023-12-19T11:07:37+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/swiss-national-bank-explores-pros-cons-of-wholesale-cbdc-other-dlt-settlement-options/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Chairman Jordan of the Swiss National Bank explores the issues considered in its wholesale CBDC pilot, Project Helvetia III","title":"Swiss National Bank explores pros, cons of wholesale CBDC, other DLT settlement options - Ledger Insights - blockchain for enterprise","content":" Today Thomas Jordan, Chairman of the Swiss National Bank Governing Board, outlined the pros and cons of wholesale central bank digital currency (wholesale CBDC) at the BIS Innovation Hub Summit. The SNB is currently conducting live pilots as part of Project Helvetia III, in which the digital Swiss Franc is being tokenized on the SIX Digital Exchange (SDX) and used for settlement.\nHelvetia III is unique in many ways. Firstly, it uses a production DLT financial market infrastructure, which is a rarity and makes for a better pilot. Another is the issuance of the CBDC on a third party platform, which is where governance is critical in order to give the central bank the control and monitoring capability it desires. Governance was one of two wholesale CBDC challenges outlined by Chairman Jordan.\nSDX is part of the SIX group, which also operates the country’s real time gross settlement (RTGS) system, SIC. Hence, it is dealing with a group that already has a significant track record with the central bank, lowering it’s risk. We’d also observe that before the wholesale CBDC, SDX was privately tokenizing cash from its central bank account using the same system, reducing the risk even further.\nThe second challenge identified by Chairman Jordan is fragmentation by creating a second pocket of central bank money on SDX. However, by automating the tokenization and movement between the SDX platform and RTGS account, this fragmentation is reduced. Synchronizing the operating hours of both helps address the fragmentation. However, we’d observe in future that could also limit the utility of potentially expanding hours when secondary DLT markets are more active than now.\nChairman Jordan compared the wholesale CBDC to two alternatives. One is a direct link to an RTGS system, which is a little similar to the Bundesbank’s Trigger solution. He acknowledged this addresses both the governance and fragmentation challenges. But it also uses the old way of siloing operations and linking via messaging. This reduces the DLT benefits as it still requires reconciliations and has many of the drawbacks of the status quo.\nAnother alternative is to have private tokenized currency backed by a bankruptcy remote vehicle and central bank money deposits. This is similar to Fnality, the UK-based infrastructure that’s starting by tokenizing pounds with plans for dollars and euros.\nChairman Jordan noted that private tokenized money addresses the governance challenge, but not the fragmentation one. And the regulatory treatment needs reviewing as it’s not a direct claim on the central bank.\nHence, in summary there are tradeoffs between governance and risk issues versus the ability to deliver efficiency gains. The SNB plans to continue assessing these issues before deciding on one or more approaches.\nLast month Chairman Jordan gave another speech about CBDC in which he discussed different issues, including design questions for a wholesale CBDC. He also stated that a retail CBDC was too risky for Switzerland.\n","create_date":"2024-05-06T14:57:43+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/digital-yen-bank-of-japan-cbdc-api-sandbox/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Bank of Japan has launched a CBDC API Sandbox for its digital yen work. The current activity involves extensive industry engagement","title":"Bank of Japan launches CBDC API Sandbox, publishes digital yen report - Ledger Insights - blockchain for enterprise","content":" Last week the Bank of Japan (BoJ) published an interim report on its central bank digital currency (CBDC) work. It revealed that it launched a CBDC API Sandbox this month, giving a nod to the Bank of England’s Project Rosalind. The central bank ran two previous proofs of concept (PoCs) for the digital yen, the latest ending a year ago.\nIn contrast to the PoCs the latest work extends beyond the CBDC platform, involving end-to-end experiments including with intermediaries. Apart from APIs it’s exploring interoperability with external systems more generally and additional functionality.\nA key feature of the latest activity is extensive industry engagement with five working groups. So far quite a bit of work is desk-based research, but the Bank of Japan plans to experiment based on the results.\nExamples of additional functionality explored in the current phase include privacy and scalability. On the privacy front, the central bank wants to separate personal data from payment data, mentioning the digital euro as an example. However, the paper also explores potentially selling data including details about purchases if users provide consent.\nIf this path is pursued the BoJ suggests that the data distribution function should be external to the central bank and intermediaries.\nIn terms of scalability, the CBDC platform needs to be capable of processing tens of thousands of transactions per second during normal periods and more than 100,000 transactions per second during peak times.\nOther functionalities discussed included compatibility with offline payments, extending functionality including programmable payments, and security.\nThe topics covered by the working groups include:\nA sixth working group plans to explore the coexistence between CBDC and other payment methods, including electronic money.\nThe Bank of Japan hasn’t yet made a decision to launch a CBDC. It might find it challenging to promote given consumer awareness of the concept is exceptionally low in Japan. The BoJ is also participating in Project Agora, the BIS project for cross border payments using tokenization. Meanwhile, the first Japanese tokenized deposit solution DCJPY is expected to launch in the coming months.\n","create_date":"2024-04-29T10:17:27+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/nomuras-laser-partners-re-staking-protocol-kelp-dao-backs-web3-game/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Nomura's Laser Digital will introduce crypto re-staking to its digital funds through an alliance with Kelp DAO","title":"Nomura's Laser partners re-staking protocol Kelp DAO, backs web3 game - Ledger Insights - blockchain for enterprise","content":" Nomura’s digital asset subsidiary Laser Digital has partnered with Kelp DAO to introduce re-staking to Laser’s digital funds. Additionally, Laser Digital is the lead investor in web3 gaming protocol Tevaera’s $5 million funding round.\nBy now blockchain users are familiar with staking as the way proof of stake blockchains such as Ethereum are secured. Re-staking allows the same committed crypto to be used for staking additional protocols. Eigenlayer, the big re-staking protocol, now has more than $15 billion in value locked (TVL), making it the second largest DeFi protocol after Lido, the liquid staking protocol.\nKelp DAO is the comparatively user friendly way for users to participate in Eigenlayer. It has more than $850 million in TVL with more than 40,000 re-stakers. Laser says its providing a “robust channel for institutional investors to delve into Ethereum’s dynamic market.”\nEthereum co-founder Vitalik Buterin has some reservations about re-staking. He said he supports “uses of re-staking that do not look like slippery slopes to extending the role of Ethereum consensus”.\nGiven Laser Digital’s heritage it’s no surprise that it’s interested in funds. It launched an institutional Bitcoin fund last September, and more recently the Digital Polygon Adoption Fund which earns yield by staking Polygon’s token MATIC. Apart from that, it’s a backer of Libre the fund tokenization protocol and Solv V3, the asset management protocol. It’s a prolific investor in the web3 space.\n","create_date":"2024-04-25T16:51:52+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/sec-classifies-ether-as-security-before-gensler-congressional-testimony/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Gary Gensler sidestepped Congressional questions about whether Ether is a security days after an SEC order allegedly declared it was","title":"Did SEC classify Ether as a security before Gensler's Congressional testimony? - Ledger Insights - blockchain for enterprise","content":" Last week blockchain firm Consensys filed a redacted lawsuit against the Securities and Exchange Commission (SEC), arguing that the SEC is unlawfully claiming that Ethereum’s Ether token is a security. Yesterday the unredacted version was published, revealing that most of the excluded words related to the SEC’s Formal Order of Investigation in the matter of “Ethereum 2.0”. The timeline is highly relevant.\nAccording to the legal filing, Consensys alleges that the SEC approved the Order on April 13, 2023 stipulating that Ether was a security, six days before SEC Chair Gary Gensler gave Congressional testimony. The SEC Chair failed to directly answer very specific questions on the topic.\nAs context, in 2018 SEC Director William Hinman made a statement in which he declared that Ether was not a security. By making the statement, Mr Hinman classified Ether differently from other cryptocurrencies. One may or may not expect the SEC to take a clear position on other tokens. However, if it has changed its position on a specific previous statement, then avoiding clarity on the matter seems unacceptable.\nIf you watched the Congressional testimony below from April 2023, Gensler appeared cagey because it depends on the specific circumstances of a token. Financial Services Committee Chair Patrick McHenry seems a little aggressive.\nHowever, if the Consensys timescale allegation is true, then Chair Gensler ducked a direct question from the Committee Chair, which was asked not just once but five times.\nTalking about commodities versus securities, Chair McHenry asked, “So how would you categorize Ether then?”\nChair Gensler started to respond about laws in the nineteen thirties.\n“I’m asking you, sitting in your chair now to make an assessment under the laws as exist, is Ether a commodity or a security?” asked Congressman McHenry. Chair Gensler proceeded to answer by referencing 10-12,000 tokens.\n“I’m asking you a specific question Chair Gensler. I said this in private. This should be no shock to you I’m asking this question. Is Ether a commodity or a security?”\nChair Gensler responded, “It depends on the facts and the law and if there’s a group of individuals…,” starting to reference the Howey Test.\n“I’m asking you about the facts and the law sitting in your seat and the judgment you are making,” said Congressman McHenry.\nMr. Gensler said “You would not want me to prejudge.”\n“But you have prejudged on this,” said Congressman McHenry talking about Wells notices on a variety of digital assets. “I’m asking you a very simple question about the second largest digital asset. What is your view?”\nAgain Mr Gensler responded with the Howey Test, “My view is if there’s a group of individuals in the middle that the public is…” and Congressman McHenry interrupted him, now clearly frustrated after asking the question five times.\nHe moved on. “Do you think it serves the market for an object to be viewed by the commodities regulator as a commodity and by the securities regulator to be viewed as a security? Do you think that provides safety and soundness for the product? Do you think that provides consumer protection? Do you think it serves the value of innovation? I think ‘no’ should be a very simple answer for you here. That uncertainty is bad, is it not?”\nGensler said he was answering generically to avoid speaking about one set of facts. That response may have been valid had Hinman not made the 2018 statement that Ether was not a security.\nMeanwhile, Consensys claimed it redacted parts of its legal filing because the SEC’s order was not public information. However, the redactions attracted far more attention to these issues than would otherwise have been the case, perhaps deliberately.\nIn several cases, the cryptocurrency community has criticized the SEC for simply doing its job. Consensys claims that the SEC had established that Ether was a security prior to Chair Gensler’s testimony. IF that is accurate, then this passage is not a good look for the SEC, no matter what your stance is on cryptocurrency.\n","create_date":"2024-04-30T10:48:20+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/jpm-coin-to-be-used-for-settlement-on-broadridges-dlt-repo-platform/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"JP Morgan's JPM Coin will be used to settle DLT intraday repo transactions on the Broadridge Distributed Ledger Repo (DLR) platform","title":"JPM Coin to be used for settlement on Broadridge's DLT repo platform - Ledger Insights - blockchain for enterprise","content":" Starting next month, Onyx by JP Morgan will enable its JPM Coin tokenized deposit solution to be used for on-chain settlement for Broadridge’s Distributed Ledger Repo (DLR) platform. Synchronizing the two blockchain networks will enable delivery versus payment for intraday repo transactions.\n“We are delighted to launch our synchronised settlement solution using JPM Coin through our work with Broadridge,” said Nelli Zaltsman, head of platform settlement solutions at Onyx. “At Onyx, we look to be the foremost provider of Cash-on-Chain solutions to existing and steadily growing digital asset platforms globally.”\nThis initiative marks the first use of JPM Coin to settle on-chain transactions not executed on the Onyx blockchain. However, Vodafone’s blockchain subsidiary PairPoint recently mentioned integrating with JPM coin.\nJPM Coin first launched in late 2020 and achieved daily volumes of $1 billion last year. The Onyx blockchain handles up to $2 billion transactions a day including others Onyx Digital Asset solutions, such as its own intraday repo solution targeting JP Morgan clients.\nIf many of Broadridge’s DLR users adopt JPM Coin, the collaboration could see a big bump in Onyx volumes. While Onyx has processed a cumulative $1 trillion in notional transactions, last year Broadridge’s DLR started executing those volumes on a monthly basis. However, several DLR clients are big banks such as UBS, HSBC and Societe Generale, which may be more reluctant. However, DLR is not only used by banks. For example, trading firm DRW uses Broadridge’s DLR and is also extremely blockchain savvy.\nUsing JPM Coin for cross chain settlement is just one example of Onyx becoming more open. Earlier this week Onyx revealed it is looking to collaborate with third parties interested in deploying apps on the Onyx blockchain.\nOne question is which technical solution the companies are using to synchronize their blockchains. Onyx uses a permissioned version of Ethereum and DLR uses the DAML smart contract language and the VMWare blockchain, but the latest version of DAML includes the Canton blockchain. “We are in the process of migrating to a purely DAML/Canton stack, which will be completed by end of month,” Horacio Barakat, Broadridge’s Head of Digital Innovation, told Ledger Insights via email. “To achieve the interoperability with JPM Coin, we are using an API-based mechanism that is replicable for a wide range of platforms.” Update: added response from Broadridge regarding interoperability\n","create_date":"2024-05-14T18:32:09+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/hong-kong-community-for-wholesale-cbdc-project-ensemble/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Hong Kong Monetary Authority set up a community including 4 banks to provide input for its Project Ensemble wholesale CBDC project","title":"Hong Kong creates 'community' for wholesale CBDC Project Ensemble - Ledger Insights - blockchain for enterprise","content":" In March the Hong Kong Monetary Authority (HKMA) unveiled Project Ensemble, which includes a new wholesale central bank digital currency (wholesale CBDC). It will provide a sandbox to enable interoperability between the CBDC, tokenized deposits and tokenized assets. Today it announced the creation of an Architecture Community for the project. In addition to regulators and the existing academic CBDC Expert Group, it includes seven private sector companies.\nThey include four banks – Bank of China (Hong Kong), Hang Seng Bank, HSBC and Standard Chartered Hong Kong – plus Hashkey Group, Ant Digital Technologies and Microsoft Hong Kong. Hashkey Group owns one of two Hong Kong-regulated cryptocurrency exchanges and runs a brokerage, asset manager and tokenization platform, amongst other entities. Ant was recently involved in a tokenized deposit trial with HSBC.\nThe first task of the Community is to make recommendations about using the wholesale CBDC for interbank settlement of tokenized deposits. And the second initiative is the design and implementation of the sandbox which will launch mid-year.\nIn addition to the HKMA, the regulators participating in the Community include the Securities Futures Commission and the BIS Innovation Hub Hong Kong.\nMeanwhile, in March, the Boston Consulting Group (BCG), Hong Kong Telecom, and others published research showing that digital currencies, including CBDCs, tokenized deposits, and stablecoins, could add HK$160 billion (US$20.5bn) or 0.5% to GDP by 2032.\n","create_date":"2024-05-07T13:03:08+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/why-the-dtc-wont-accept-bitcoin-etfs-as-collateral/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"For collateral purposes the DTC applies a 100% haircut to Bitcion ETFs and other cryptocurrencies. We explore the reasons","title":"Why the DTC won't accept Bitcoin ETFs as collateral - Ledger Insights - blockchain for enterprise","content":" On Friday the Depository Trust Company (DTC) published an update regarding the valuation of collateral it accepts for settlement purposes. To the dismay of the crypto community, the DTC applies a 100% haircut on any Bitcoin ETFs, crypto funds or investment vehicles that include crypto. This means it effectively doesn’t accept crypto as collateral. The DTC is a clearinghouse for settling trades, processing $446 trillion of conventional transactions in 2023, and is a subsidiary of the DTCC.\nThere are at least two sound reasons why crypto gets a 100% haircut. The first is its inherent volatility and lack of ratings, characteristics that makes it a risky asset for collateral. The second reason is the Basel Committee rules for bank exposure to cryptocurrencies.\nTo settle transactions and avoid exposing the DTC to too much risk, participants must provide cash or collateral exceeding the amount they owe. If they go overdrawn, transaction settlement will be delayed.\nThe DTC is not a bank, so it’s dependent on lines of credit from 34 banks. Hence, collateral is valued using the prices the night before, and a haircut is applied based on what the banks are willing to advance.\nAll securities are subject to a haircut, with those with higher volatility or credit risk subject to bigger haircuts. Treasuries attract a haircut ranging from 2% to 12% for longer dated securities. Mortgage backed securities rated below Aa2/AA also receive a 100% haircut even if issued by a US Government Sponsored Enterprise. Similar rules with different cut off points apply to other securities such as corporate bonds.\nGiven the potential for crypto volatility and the lack of credit rating, a 100% haircut is consistent with rules for other assets.\nAdditionally, banks are subject to Basel Committee rules for crypto-assets. Basel doesn’t consider cryptocurrencies or stablecoins as eligible collateral. That means any loan using crypto as collateral would be considered unsecured for risk-weighting purposes. Hence, a bank must set aside additional capital, making it too expensive.\n","create_date":"2024-04-29T15:45:25+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/globacap-partners-with-tokeny-to-distribute-tokenized-private-assets/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Globacap is partnering tokenization firm Tokeny to integrate with Tokeny's DINO distribution network for private market securities","title":"Globacap partners with Tokeny to distribute tokenized private assets - Ledger Insights - blockchain for enterprise","content":" Today Globacap, the private markets workflow firm, announced a partnership with Tokeny. Tokeny is the APEX-backed tokenization firm that founded the ERC-3643 standard widely used for security tokens. While Tokeny offers a tokenization solution, the announcement focuses on Globacap’s integration with Tokeny’s DINO distribution network.\nFor Globacap, once it automates the workflow of a private issuance and tokenizes it, the issuer will want to ensure it has wide distribution. That contrasts with the fragmented silos often seen in the institutional DLT space. Hence, through the DINO network, Globacap can access many venues supporting the ERC-3643 standard.\nLast year Myles Milston, the CEO of Globacap, wrote an opinion piece for Ledger Insights about his vision of tokenization in private markets. One of the points he highlighted is that most cryptocurrencies are bearer instruments, which contrasts with securities.\nThat’s where the ERC-3643 standard comes in. Many may be familiar Ethereum’s dominant ERC-20 token standard. ERC-3643 is compatible with ERC-20 but adds multiple layers of compliance. It restricts access to eligible investors. Plus, issuers or their agents retain control over the tokens despite investors holding them.\nSo far Globacap has provided the workflow for more than 150 private placements and helped digitize more than $20 billion in investment vehicles. Backers include Cboe Global Markets and the Johannesburg Stock Exchange (JSE).\n“Despite the size and importance of private markets which have over $13 trillion AUM, for years they have lacked the infrastructure and transparency necessary for efficient transactions,” said Globacap’s Milston. “The combination of our offering with Tokeny is immense and will help to drive private markets innovation and growth forward.”\n","create_date":"2024-04-25T11:23:54+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/will-21x-launch-the-first-dlt-pilot-regime-infrastructure/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"21X is the first DLT Pilot Regime to apply to operate both an exchange and a settlement solution for tokenized securities","title":"Will 21X launch the first DLT Pilot Regime infrastructure? - Ledger Insights - blockchain for enterprise","content":" More than a year after Europe’s DLT Pilot Regime came into force in March 2023, not a single platform has been approved. The European Securities and Markets Authority (ESMA) recently revealed that four applications are pending. One of those is from Germany’s 21X, the only one of the quartet that has applied for a DLT trading and settlement systems (DLT TSS) license. If approved, this would allow it to both operate a secondary market (DLT MTF) and run the settlement systems (DLT SS).\n“We were the first DLT TSS applicant in Europe. We do have a first mover advantage that we are hoping to realize,” 21X CEO Max Heinzle told Ledger Insights.\nTraditionally there’s a strict separation between the exchange and the central securities depository (CSD). So the DLT Pilot Regime is relaxing this requirement for TSSs. Another traditional finance (TradFi) requirement is that exchanges can only deal with brokers and not retail users directly. The DLT Pilot Regime supports direct consumer access provided the operator offers consumer compensation and a couple of other restrictions.\nSome of the big banks have raised concerns about the low transaction limits and restricted timeframe of the Regime. However, last week Commissioner Mairead McGuinness wrote to ESMA saying, “there is no expiration date for the DLT Pilot Regime.” New legislation would need to be passed to terminate the Regime, and the Commissioner said, “at this stage, no proposal to terminate the regime is envisaged.”\nHowever, the activity limits are just fine for businesses that aim to deal with issuances for SMEs, such as 21X. Although the company is also expecting some of the world’s largest asset managers to list funds on 21X.\nIt plans to match, trade and settle on chain, using its own central limit order book (CLOB). Polygon is the chosen blockchain.\nThat’s one major difference between the DLT Pilot Regime and the UK’s Digital Securities Sandbox – the European initiative allows public blockchains. 21X also claims to have a solution to public blockchain frontrunning, otherwise known as Maximal Extractable Value (MEV). One could see that would appeal to regulators (more on that later).\n21X was ahead of the curve, submitting the first iteration of its application just days after the enactment in March 2023. If you recall, ESMA only published some of the reporting requirements in October 2023. As a pioneer, this means that 21X and the regulators – Germany’s BaFin and Europe’s ESMA – had a bit of an iterative learning curve. For this process 21X was advised by law firm YPOG and KPMG Germany.\nWhile there’s much talk today about real world asset tokenization of alternative assets, 21X is keeping it simple by supporting digital bonds and funds.\nGiven that the entire process is on-chain, an obvious question is: What is used for settlement? 21X said it will use tokenized e-money from a licensed e-money institution. On the 21X website, Monerium is listed as a partner and the company ticks these boxes. However, 21X was reluctant to name the e-money launch partner, implying it may be someone else. We’d also speculate that several companies have applied for EU e-money licenses under MiCA. So it could be one of those new licensees given they are starting to be granted. For example, BCB Group received approval a couple of weeks ago.\nOne fun fact is that the Chairman of 21X, Alexander Höptner, is also the incoming CEO of AllUnity. That’s the stablecoin joint venture between Deutsche Bank’s DWS, Galaxy Digital and Flow Traders. However, AllUnity is only likely to launch its stablecoin in 2025, and it’s clear that 21X is hoping to launch this year, subject to regulatory approval. That makes the AllUnity stablecoin an unlikely launch candidate.\nWhile there might be a single launch stablecoin provider, 21X is planning to provide options on many fronts. “We have an open market infrastructure and also an open market approach,” said Heinzle. “So what we are looking for is to enable tokenization service providers.”\nWhen you start thinking about the scope of service providers and other partners, there’s a wide variety. So there are buy-side and sell-side users, listing agents, brokerage platforms, tokenization platforms, fund administration firms and custodians. Plus, in Germany there are crypto registries under the local eWpG laws, which has similar legal waivers to the DLT Pilot Regime.\nThe registries are low hanging fruit, with a reasonable number of issuances in Germany waiting for a secondary market. On Friday the Cashlink registry said it would partner with another DLT Pilot Regime candidate, FINEXITY, although FINEXITY has yet to submit its license application.\nOn the custody side, given these are digital versions of traditional assets, there’s a good chance future custodian partners might be banks. However, the platform will also support self custody.\n21X says it has already signed several memorandums of understanding (MoUs) and letters of intent (LoIs), including with some heavyweight players. However, it won’t name names until its license is in place, other than IDnow, which will help with customer identification for the onboarding process.\nThe German company 21X is a subsidiary of Liechtenstein-based 21.finance AG, which has pivoted since its founding. In 2018 Bank Frick took a 25.1% stake and the following year it started tokenizing traditional securities as security tokens. It distributed the tokens in Germany, Austria, Switzerland and Liechtenstein. Subsequently, it evolved into a SaaS tokenization solution before focusing on developing a DLT TSS. To date it has raised €10 million just for the DLT TSS and is about to embark on another funding round.\nCircling back to Europe’s support of public blockchains, before the Ethereum Merge in September 2022, MEV or frontrunning resulted in losses of around $675 million for Ethereum users. Post Merge, one set of research pegs the losses at $1.4 billion (at current ETH prices), and another reckons it was $350 million in 2023.\nWith regulators already wary about public blockchains because of a lack of control, MEV doesn’t help.\nHowever, around 90% of Ethereum validators use MEV systems, compared to only around 1% of Polygon’s, according to 21X.\nWhile there are numerous ways to thwart frontrunning, the most effective one involves permissions, as found in most regulated infrastructures.\nFrontrunning through MEV is more prevalent on DeFi automated market makers (AMMs) where there’s an open formula for pricing trades. In contrast, 21X has a central limit order book (CLOB). Rather than using existing attack programs, different code would be required. That’s because an attacker needs to consider the open orders instead of using the AMM’s formula.\nNonetheless, the orders are in a public memory pool so they are exposed to attackers. Tactics such as tight slippage settings or high gas usage help to make it less attractive for frontrunners.\nHowever, the most effective tool is to use participant allow listing. The combination of known exchange participants and market surveillance means offenders will be banned from the exchange. In fact, a regulator could order 21X or the issuer to seize the frontrunner’s on-exchange assets.\nWhile there are existing DLT secondary markets such as Switzerland’s SDX, 21X could be the first to launch a combined regulated exchange and settlement solution on-chain. With the launch of each new trading venue, the future becomes clearer.\nJeffrey Hartjes, the 21X project manager for the DLT Pilot Regime application, commented, “Everyone knows how traditional finance works. Not many know or have a vision of how (the) DLT financial markets of tomorrow work.”\n","create_date":"2024-05-13T10:17:03+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/russia-gives-mixed-signals-about-common-brics-digital-currency/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Russia is giving mixed signals about a BRICS common digital currency. It says now is not the time. But something could happen in under a year","title":"Russia gives mixed signals about common BRICS digital currency - Ledger Insights - blockchain for enterprise","content":" At the BRICS (Brazil, Russia, India, China, South Africa) summit last year, the much-anticipated announcement of a common digital currency gave way to talk about using local currencies for cross border payments. Now BRICS has expanded from five to ten members and Russia is currently the organization Chair. Last week Russia’s Deputy Foreign Minister Sergei Ryabkov discussed the topic saying that a common currency is not a current priority. On the other hand, he said it would be possible to move very quickly, implying a solution could be less than a year away.\nAfter this year’s February BRICS meetings, Russia spoke about a BRICS Bridge platform for payments without mentioning digital currency. Two BRICS members, China and the UAE, are involved in mBridge the similarly named cross border central bank digital currency (CBDC) initiative. Using individual digital currencies for cross-border payments is a significantly different approach than using a common currency.\nThe Governor of the Bank of Russia, Elvira Nabiullina, has previously spoken about the complexity of creating a single BRICS currency. She made the comments before the BRICS membership expanded.\n“I would not say that this idea has been shelved,” said Mr Ryabkov last week. “Although its implementation, as we all understand, involves, among other things, such aspects as the creation of a single issuance center, the creation of a Central Bank that sets a common basic discount rate, as possibilities for borrowing from the Central Bank by the banks of the participating countries.” That’s according to an automatically translated press conference, as reported by Ria Novosti.\n“(We) agree that today BRICS, which has 15 years behind it and has just doubled in size, is hardly ready for such steps and experiments. But this does not mean that this idea has been postponed.”\nHe added that a “quite bold, quite innovative scheme in this area will be worked out, and in a future that is not calculated in years and decades, but much faster.”\nAs context, during January discussions about current Russian CBDC pilots, central bank Governor Nabiullina said the CBDC platform was designed to support integration with similar foreign solutions. “We are currently conducting consultations and negotiations with many friendly countries and, of course, with the BRICS countries, on cross-border payments through digital currencies.”\n","create_date":"2024-04-29T11:48:17+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/metamask-wallet-developer-consensys-files-lawsuit-over-secs-claims-that-eth-is-a-security/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Consensys has filed a lawsuit against the SEC saying it is unlawfully claiming that ETH is a security. Also defends its Metamask wallet","title":"Metamask wallet developer Consensys files lawsuit over SEC's claims that ETH is a security - Ledger Insights - blockchain for enterprise","content":" Yesterday blockchain development firm Consensys filed a Texas lawsuit against the Securities and Exchange Commission (SEC) and its Commissioners, arguing that the SEC is unlawfully claiming that Ethereum’s ETH token is a security. The lawsuit also seeks an injunction preventing the SEC from taking legal action against MetaMask, Consensys’ popular cryptocurrency wallet with more than 30 million monthly active users.\nSome redacted parts of the text are worth exploring as they could imply that the SEC has issued some confidential ruling or internal guideline that ETH is a security. Apart from the redactions, the lawsuit explicitly states, “The SEC’s investigation into transactions in ETH is predicated on a determination that ETH is a security.”\nFounded by Ethereum co-founder Joe Lubin, ConsenSys is backed by numerous traditional finance (TradFi) firms. These include HSBC, JP Morgan, Mastercard, Microsoft, Softbank and UBS.\nConsensys was first informed about the SEC’s interest in MetaMask in April 2022 and has provided considerable information since then. On April 10 Consensys received an SEC “Wells Notice” warning of an imminent enforcement action. This was on the grounds that the SEC believes the MetaMask Swaps and Staking services violate federal security laws because Consensys is not a broker dealer.\nConsensys argues it is simply providing a user interface enabling access to other services such as decentralized exchanges (DEXs) and staking protocols. The SEC has also sent a Wells Notice to Uniswap, the leading DEX.\nWhile it’s a different jurisdiction, Europe’s latest anti money laundering (AML) legislation imposes requirements on crypto asset service providers, but explicitly excludes self-hosted wallet providers such as MetaMask.\nBack in 2018 there was much debate about whether or not ETH was a security. One lawyer in the crypto space raised questions about the patterns in the ETH ICO and concluded it probably was*. However, just a few months later, SEC Director William Henman delivered a high profile speech in which he said ETH was a commodity.\nConsensys is understandably unhappy that the SEC has flip flopped on this position. However, since then Ethereum has changed by moving from proof of work to proof of stake (the Ethereum Merge). This involves validators locking up cryptocurrency and earning a return in exchange for helping to secure the blockchain. Based on this, the SEC also targeted Consensys’ sales of ETH from its treasury and asked why Consensys considers these are not sales of securities. Additionally, Consensys received three subpoenas relating to the Ethereum Merge.\nIt’s not the only one that relied on the ETH being a commodity. The CFTC continues to say ETH is a commodity. As a result TradFi crypto players such as EDX Markets – founded by Fidelity, Citadel Securities and others – only trade Bitcoin, ETH and Litecoin. No license is required for spot trading of commodities.\nConsensys’ statement that the SEC has taken the position that ETH is a security, combined with redactions in the text, indicates that the SEC’s stance appears to have formally changed.\nHere’s one redaction: “The SEC’s self-aggrandizing about-face on ETH is notable for its lack of transparency. In April 2023, Gary Gensler, the Biden Administration’s crusading SEC Chair, appeared before the House Financial Services Committee. The Committee Chairman repeatedly asked Gensler: does the SEC now think ETH is a security? Gensler refused to answer this direct question from the Chairman of the Congressional committee charged with overseeing his agency. He did not want to admit that his SEC had already secretly cemented its power-grab by issuing an <redacted>.”\nElsewhere in the text it states, “ETH is not a security under the Securities Act, and therefore <redacted> exceeds the SEC’s statutory authority.”\nOn the basis of the first redaction, we quizzed ChatGPT to see if it could fill in any blanks. The suggestions it came up with were :\nIf, as Consensys implies, the SEC had already made some internal finding that ETH is a security, then given this is an about face, they should publicize it sooner rather than later. That said, Gensler has stated that proof of stake tokens should be regulated as securities for over a year.\nThe crypto markets seem rather sanguine about the latest news of SEC’s position, perhaps because it’s already built in. ETH is up 1% during the past 24 hours. However, the SEC is also expected to approve an ETH ETF. If the SEC believes that ETH primarily trades on unauthorized exchanges, could this serve as grounds for rejecting the ETF? This reasoning differs from the grounds it used to reject previous Bitcoin ETFs, which courts threw out last year. Bitcoin is definitely a commodity, so its spot markets do not need to register.\n* in response to the ICO blog post, high profile crypto techie Hasu penned another.\n","create_date":"2024-04-26T11:55:42+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/jp-morgan-explains-why-it-prefers-unified-ledger-over-public-blockchain-for-tokenization/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Umar Farooq of Onyx by JP Morgan shared why shared networks such as the Unified Ledger are necessary. And why public blockchains aren't ready","title":"JP Morgan explains why it prefers Unified Ledger over public blockchain for tokenization - Ledger Insights - blockchain for enterprise","content":" Last year the Bank of International Settlements (BIS) introduced its concept of a Unified Ledger that would support central bank money, tokenized deposits and digital assets on the same network. Using a common tokenization infrastructure eliminates the need for transaction messaging and associated inefficiencies and supports programmability. JP Morgan’s Umar Farooq and Circle’s Dante Disparte shared their views on the Unified Ledger concept during the BIS Innovation Summit.\nTalking about a Unified Ledger, Mr Farooq said, “I think you almost need something like that. I mean, it’s actually almost a necessity because if you look at … public blockchain ledgers, they are not fit for purpose for large transactions today.”\nHe elaborated that if there were a $100 million transaction, there would be no recourse to validators or anyone else if something went wrong. “Who do I sue?” he asked. “You need to get somewhere where people can do trusted transactions between financial institutions with some sort of accountability in the system.”\nHence the concept of a Unified Ledger or similar ideas such as the Regulated Liability Network (RLN), mBridge and Singapore’s Global Layer 1.\nAnother issue with public blockchains is the existence of tokens, which means that each blockchain wants to attract users to push up the price of its token. “While tokenomics is an interesting concept, I think the core of tokenomics also makes it very hard to converge,” added Mr Farooq. “The internet was developed as a public good,” he said, pointing to real time gross settlement (RTGS) systems, Swift and CLS.\n“We need to get to an evolution point where the technology starts to be seen as a public good versus as a means to enrich.”\nIronically, some incumbents have asserted that JP Morgan wants everyone to use its blockchain, Onyx, although the same has been said of other enterprise blockchains.\nMr Farooq also points out that the shared networks should involve central banks and private institutions, such as banks or non-banks.\nCircle’s Dante Disparte raised the issue that many initiatives target banks and leave out non-banks. While Circle argued for a seat at the table, Mr Farooq noted that the closer you get to the central bank, the more regulation is required because there is greater systemic risk.\nMr Disparte had two points to make regarding Unified Ledgers – why aren’t there already more improvements, and what about geopolitics?\nHe observed that institutions often seek marginal improvements. However, BIS head Augustin Carstens made that point in his keynote – there needs to be two kinds of innovations – small steps and giant leaps such as the Unified Ledger.\n“The only reason you don’t move money any faster arguably is either because of a lack of will or because it’s a pathway for monetizing speed,” said Mr Disparte. “Speed in the banking system is a premium service.” He noted the continued lack of execution at night and weekends in traditional finance.\nThen there’s the issue of geopolitics. “You don’t weaponize a currency, you weaponize the rails on which currencies ride,” said Mr Disparte. “Cross border payments integration of this kind is often aligned too far for national security interests. And that’s the unfortunate piece of the puzzle.”\nThe result is the coming fragmentation of global payments. Geopolitics is highly relevant to one of the BIS’s solutions, mBridge, for cross-border payments, which involves China. It’s worth bearing in mind that geopolitics are driving fragmentation. Technology is simply an enabler.\n","create_date":"2024-05-07T09:05:48+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/stripe-adds-support-for-stablecoin-payments/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Stripe will start accepting payments with the USDC stablecoin. This is for general payments not just web3 firms","title":"Stripe adds support for stablecoin payments - Ledger Insights - blockchain for enterprise","content":" After dropping support for Bitcoin payments in 2018, Stripe announced yesterday that it would start accepting the USDC stablecoin at checkout on the Ethereum, Solana, and Polygon blockchains. Co-founder and President John Collison demonstrated the offering yesterday.\nCollison said Stripe dropped Bitcoin support because of the slow speed of settlement. Rolling forward six years, and payments on certain blockchains such as Polygon and Solana are quicker to settle and the costs are insignificant. That said, Stripe will take its cut of 1%.\nYesterday’s announcement is a broader offering compared to some of Stripe’s crypto announcements in 2022. Then, it targeted web3 businesses to provide crypto on and off ramps. Additionally, it launched a solution for Twitter creators where some could receive USDC payouts on Polygon.\nMeanwhile, Visa launched support for web3 merchants that wanted to receive settlements using the USDC stablecoin last year.\nBut it is PayPal that has embraced crypto the most. Its merchants have been able to accept cryptocurrencies since 2021, with the payments firm launching its own stablecoin last year, PYUSD. Currently the balance is just over $300 million, with more than a third held in the Paxos Treasury wallet, PayPal’s crypto partner.\n","create_date":"2024-04-26T12:01:00+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/government-owned-kfw-elaborates-on-blockchain-digital-bond-plans/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"German development bank KfW plans to issue a blockchain-based digital bond during the summer under Germany's eWpG law","title":"Government-owned KfW elaborates on blockchain digital bond plans - Ledger Insights - blockchain for enterprise","content":" Last year, we reported that the state-owned German bank KfW was planning to issue a blockchain-based digital bond. This week the bank shared a few more details. Given its shareholders, it aims to demonstrate digitalization and increase the profile of crypto securities, the German legal term for securities issued on a blockchain.\nThe bond will be issued under the German Electronic Securities Act (eWpG) during the summer of 2024, with Cashlink as the registrar. Under the law, the registar in some ways takes the place of a central securities depository (CSD) with fewer requirements. As previously announced, Union Investment will be the anchor investor, as it has been in many of the early European digital bond issuances.\nKfW has put together a bookrunner consortium consisting of DZ Bank, Deutsche Bank, LBBW and Bankhaus Metzler, which all have blockchain experience. DZ Bank will also be the collective registered holder of the bond. The bond settlement will be executed in the traditional fashion.\n“The initial goal on the road to the digitalisation of refinancing is to learn and thereby identifying potential for improvement,” said Tim Armbruster, Treasurer at KfW, “We believe that digitalisation will be advantageous in terms of increased efficiency and scalability,” said Armbruster.\nWhile this will be KfW’s first crypto bond, it previously issued a digital bond on Deutsche Börse’s D7, which involves the Clearstream central securities depository (CSD).\nIt also says it’s working with the Luxembourg-based NowCM digital bond issuance platform. Early last year, NowCM bought Nivaura, the capital markets automation firm backed by the London Stock Exchange. Nivaura provided a workflow for bond issuance as part of a DLT-ready solution.\nAfter publication KfW confirmed the Polygon public blockchain will be used for the issuance. Update: added that Polygon is the chosen blockchain\n","create_date":"2024-05-08T08:38:08+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/sbi-digital-assets-forms-joint-venture-with-socios-fan-token-blockchain-chiliz/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"SBI Digital Asset Holdings is creating a Japanese joint venture with Chiliz to bring the Socios sports fan tokens to Japan","title":"SBI Digital Assets forms joint venture with Socios fan token blockchain Chiliz - Ledger Insights - blockchain for enterprise","content":" Today SBI Digital Asset Holdings (SBI DAH) announced a Japanese joint venture with Chiliz to bring its football club fan tokens to Japan. The tokens are known under the Socios fan engagement brand and include top soccer clubs such as Arsenal, AC Milan, Manchester City, FC Barcelona, Inter Milan and Paris Saint-Germain. Additionally, SBI DAH plans to operate a node on the Chiliz Chain. To date more than 2 million users have engaged with the Socios fan tokens.\nWhile companies such as Sorare and Dapper Labs are focused on sports NFTs, fan tokens are not unique. They’re fungible. Some have compared them to tracking stocks. Hence, while Socios has inked fan engagement deals in the United States including with Major League Soccer and 13 NFL teams, we’re not aware of the issuance of any fan tokens stateside. Apart from the trading aspect, the tokens enable fan engagement in the form of voting, competitions, VIP experiences, merchandise and exclusive offers.\nOn the topic of stockholders, in Japan private investors typically engage more with companies than in the West. That includes receiving discount coupons, gift cards, points and memberships. Hence, while fan tokens don’t represent any ownership interest in the clubs, they offer similar engagement opportunities. Shortly after Chiliz launched, a Japanese version emerged, FiNANCiE. It has various relationships with Japanese sports teams, including J-League soccer clubs. However, Chiliz provides the international exposure.\n“At SBI DAH, we prioritize the utility and underlying value which technology brings to communities. Technology is an enabler in the new world, and we are pleased to bring new experiences to the Japanese audience by working with strong players like Chiliz,” said Fernando Luis Vázquez Cao, CEO of SBI DAH.\n“The partnership between SBI DAH and Chiliz will bring together the best-in-class capabilities of both traditional finance and Web3, leveraging fintech innovations to transform the sports and entertainment experiences for communities.”\nThe Ethereum-compatible Chiliz blockchain used to be Proof of Authority, which equates to a public permissioned ledger. It recently migrated to a Proof of Staked Authority version and is signing up node operators, including Paris Saint Germain.\nMeanwhile, SBI DAH has numerous blockchain interests. They include a AsiaNext, SBI Digital Markets and SBI Zodia Custody. SBI DAH partnered with Switzerland’s SIX for AsiaNext, and Standard Chartered and Northern Trust for custody. Additionally, SBI DAH invested in Swiss digital asset bank Sygnum, Blockdaemon and the Tangem wallet. SBI Holdings has an even more extensive range of blockchain investments and activities.\n","create_date":"2024-05-09T10:15:23+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/chile-finds-no-current-need-for-a-cbdc-but-will-prepare/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Central Bank of Chile ran a public survey and working groups about a potential CBDC. It concluded there's no current need, but plans PoCs.","title":"Chile finds no current need for a CBDC, but will prepare - Ledger Insights - blockchain for enterprise","content":" This year Chile published its second report exploring a potential central bank digital currency (CBDC). The country has the highest rate of financial inclusion in the region at 85-87% with a significant proportion of digital payments. As a result the Banco Central Chile does not see a current need for a CBDC (or MDBC as it’s called locally). However, it wants to prepare in case the need arises in the medium term.\nIts first report primarily covered desktop research, whereas the second relates to public engagement. This includes a public survey with 450 responses and eight round table working groups with payment industry participants.\nSixty-three percent of survey respondents thought that a CBDC could catalyze greater innovation. Regarding motivations, offering an alternative to current electronic payments was seen as the number one driver, given current payment mechanisms have some frictions, although the details were not shared. There’s also a desire to encourage greater competition.\nIn the survey, the second and third-ranked drivers were lowering costs and enhancing efficiency.\nOther motivations from the consultations included:\nHowever, some of the firms in the payments ecosystems noted that these issues could be addressed without a CBDC.\nConsumer acceptance of a potential CBDC is seen as a major challenge. Chile has two debit or credit cards per capita. Electronic wallets are widely available, and the state-owned Banco Estado provides 14.5 million basic Cuenta RUT accounts, according to the IMF. That’s equivalent to around 95% of the adult population (total population 19.6m).\nOn the flip side, if Chile successfully issued a CBDC, it’s concerned about attracting away bank deposits and the knock on effect on credit.\nRegarding next steps, the central bank plans to start with some proofs of concept (PoC) on its own. That’s despite its desire to operate a two tier system with banks and payment providers performing distribution. At this stage the PoCs will focus on infrastructure, evaluating gaps and building internal skillsets, rather than specific use cases. The central bank says it has a technology neutral approach.\nMeanwhile, all eyes are on Brazil, which is rapidly advancing its DREX CBDC. In 2020, Brazil launched the Pix payment system, which addresses financial inclusion with digital payments. Rather than basic payments, DREX targets open finance, using tokenization to expand financial inclusion relating to savings and investments. With a population more than ten times Chile’s, the central bank’s speed of movement is impressive.\n","create_date":"2024-05-03T09:03:00+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/dlt-real-estate-firm-coadjute-lands-two-major-uk-estate-agents-foxtons-tpfg/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Real estate DLT platform Coadjute has signed up real estate agents Foxtons and TPFG to its transaction workflow solutoin","title":"DLT real estate firm Coadjute lands two major UK estate agents, Foxtons, TPFG - Ledger Insights - blockchain for enterprise","content":" At the start of the month real estate DLT startup Coadjute announced a funding round led by Lloyds Bank, including two other major banks Natwest and Nationwide, and the largest UK property website Rightmove. Since then things have snowballed with two major estate agencies, Foxtons and The Property Franchise Group (TPFG) announcing they will use the platform to digitize the paperwork and communications involved in house sales.\nCoadjute is a workflow solution that enables data sharing about a sale between estate agents, conveyancers (lawyers), mortgage brokers and banks. Several UK real estate software suppliers have integrated with the platform.\nMeanwhile, TPFG spent five months piloting the solution at 12 branches and found it saved 25 minutes per transaction on average. It is the largest franchised estate agency in the UK, with 930 locations and 16 brands.\nAdditionally, a large proportion of UK transactions fall through after a sale is agreed. Some estimate the figure at more than 30%. A strong sign is if the transaction stalls with a system like Coadjute’s making it easier for the seller to identify the bottleneck.\n“We know that in today’s market, consumers are increasingly anxious about the whole process and by offering access to the Coadjute network, we can help to ease these concerns and offer a level of transparency around the process, whilst speeding up transaction times,” said Adam Noonan, Group Commercial Director TPFG.\n“Coadjute’s technology enables everyone in the property transaction a clear view of what is happening and when, thanks to the real-time connection.”\nLast week the Negotiator reported that upmarket realtor Foxtons has signed up and is also using the consumer app Home.\n“With the help of Home and Coadjute, our buyers and sellers will be able to better manage the cost and admin requirements of moving, while also benefiting from the reduced chance of a fall through,” said Foxtons CEO Guy Gittins.\n“Thanks to advanced blockchain technology buyers and sellers can immediately, securely and confidently communicate with their agent, conveyancer or broker, all from one place.”\nLast year Coadjute participated in the Bank of England’s Project Meridian to synchronize the change of ownership of a house at HM Land Registry with the payment. Coadjute uses R3’s Corda enterprise blockchain.\n","create_date":"2024-04-24T14:57:09+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/robinhood-crypto-pushes-back-over-sec-wells-notice-warning-of-legal-action/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Robinhood Crypto has received a Wells Notice from the SEC warning of legal action. It plans to fight it after attempting to register","title":"Robinhood Crypto pushes back over SEC Wells Notice warning of legal action - Ledger Insights - blockchain for enterprise","content":" Yesterday Robinhood announced it received a Wells Notice from the Securities and Exchange Commission (SEC) warning of impending legal action relating to crypto custody, cryptocurrency listings and platform operations. Although Robinhood is a registered broker-dealer for traditional securities, it plans to resist the SEC’s steps. The news follows Wells Notices, which were recently issued to Ethereum developer Consensys and automated market maker Uniswap. Last year the SEC filed lawsuits against Coinbase, Binance and others.\n“After years of good faith attempts to work with the SEC for regulatory clarity including our well-known attempt to ‘come in and register,’ we are disappointed that the agency has decided to issue a Wells Notice related to our U.S. crypto business,” said Dan Gallagher, Chief Legal, Compliance and Corporate Affairs Officer, Robinhood Markets. “We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law.”\nDuring Congressional testimony last year Mr Gallagher outlined that it attempted to register in good faith, starting in late 2021. It spent a year and a half with more than a dozen meetings and calls with the SEC. It made a written request for relief for a registered special purpose broker-dealer to support both digital asset commodities and securities. “We have unfortunately not been able to make any progress with the Commission on our request for relief to register,” said Mr Gallagher in July last year. However, it said it continued to engage with the SEC.\nRobinhood noted that some of the steps it took to comply put it at a disadvantage to other crypto marketplaces. It doesn’t provide lending or staking products, nor does it conduct ICOs. It operates a marketplace, passing the transactions to others to execute rather than operating an exchange. Before 2022 it only listed Bitcoin, Ether and their forks. Subsequently, it expanded the list to just 18 tokens after a “robust” review process. In contrast most exchanges list hundreds of tokens. Some of the additional tokens include Aave, Avalanche, Chainlink, Compound, Shiba Inu, Stellar, Tezos and Uniswap.\nBefore its demise, FTX and Sam Bankman Fried (SBF) clearly had Robinhood in their sights. Not only did FTX buy a major stake in the firm, FTX also offered exposure to stocks for its offshore clients. SBF envisioned a convergence.\nThis could explain why Robinhood felt compelled to expand its coins beyond the Bitcoin and Ether offerings. However, with the SEC’s latest moves against Consensys, it appears that Ether is also now viewed as a security, in an about turn on a 2018 statement.\n","create_date":"2024-05-07T10:12:02+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/gd-wins-cbdc-project-for-mauritania/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Giesecke +Devrient has won a central bank digital currency contract for Mauritania, its second in West Africa","title":"G+D wins CBDC project for Mauritania - Ledger Insights - blockchain for enterprise","content":" Today Giesecke+Devrient (G+D) announced a partnership with the Banque Centrale de Mauritanie to design and explore a potential central bank digital currency (CBDC).\n“The digital Ouguiya is part of the digital transformation agenda for the entire country and is of critical importance for economic and social progress,” said Wolfram Seidemann, CEO of G+D Currency Technology. He added that G+D has a 50 year relationship with the central bank.\nG+D has formally participated in at least three other CBDC projects with its G+D Filia CBDC platform. They include Thailand which recently reported its results, an offline solution as one of the pilot projects in Brazil, and fellow West African country Ghana.\nHowever, Ghana and Mauritania are fundamentally different scenarios. Where Ghana has a population of more than 33 million, Mauritania’s is less than five million.\nMore importantly, Mauritania has a very low rate of financial inclusion. Just 23% of the population aged 15 or older has some kind of financial account. That compares to Ghana, where the rate is more than 68%, largely due to mobile money services introduced in 2009. Despite this, Ghana’s per capita income is only about 7% higher than Mauritania, which has a DGP of $2,065 per capita.\n","create_date":"2024-04-23T14:35:52+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/applications-for-central-bank-tokenization-project-agora-close-in-2-weeks/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The BIS has started the application process for Project Agorá, the tokenization project for cross border payments involving 7 central banks","title":"Applications for central bank tokenization Project Agorá close in 2 weeks - Ledger Insights - blockchain for enterprise","content":" Today the BIS unveiled the application process for private sector institutions to participate in Project Agorá. That’s the tokenization initiative for wholesale cross border payments involving seven central banks. Eligible applicants are financial institutions, including FMIs with accounts at the participating central banks, plus critical payment service providers. It’s a tight timeframe to make a decision, with applications closing on May 31 and the results announced in early August.\nWhile Agorá is a public private partnership, it is the private sector that will fund the work through participation fees. A likely rationale is that the private sector founded Swift.\nThe initiative is the first to explore the BIS concept of a Unified Ledger seriously. It is coordinated by the BIS and the Institute of International Finance (IIF), although participants need not be IIF members. The seven central banks include Europe (France), Japan, Korea, Mexico, Switzerland, England and the U.S. represented by the New York Innovation Center (NYIC). In the case of the EU, the applicant needs an account with any Eurosystem central bank.\nAgorá will explore the use of tokenized deposits and tokenized central bank money for cross border payments using smart contracts. Four workstreams include business requirements, technology, legal and communications.\nApplicants will be assessed based on their footprint in global payments and domestically, expertise in innovation projects, and the experience of the executives who will represent the institution. However, there is a desire to ensure a diverse group of participants.\nThe application form emphasizes that Agorá is not purely a proof of concept (PoC), with the intent to progress it beyond that stage. However, it’s also described as an experimental research project.\nSeveral of the relevant institutions are already participating in initiatives that cross over with Agorá. For example, there’s a Regulated Liability Network project in the UK, a Regulated Settlement Network initiative in the United States and the EU started its wholesale DLT settlement trials this week. Nonetheless, given the involvement of seven central banks, there’s likely to be plenty of candidates.\n","create_date":"2024-05-14T13:49:15+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/cboe-ditches-spot-crypto-trading-in-digital-assets-reshuffle/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Cboe is shuttering its spot crypto trading offering and merging the rest of its digital assets business into the main one","title":"Cboe ditches spot crypto trading in digital assets reshuffle - Ledger Insights - blockchain for enterprise","content":" Cboe acquired crypto firm ErisX in late 2021 and formed a new division Cboe Digital. Yesterday Cboe announced plans to shutter crypto spot trading and roll the derivatives trading and clearing into its main business, citing regulatory uncertainty around digital assets.\nThe spot trading arm only supports four coins, but one of them is Ether which the SEC now considers to be a security.\nIn reality the entire business is tiny compared to the rest of the company but its overheads are not. It expects savings of $2m-$4m this year and $11-$15m on a normalized annual basis.\nEven on the derivatives side, open interest for Bitcoin is just 400 contracts compared to more than 26,000 for the CME.\nSubject to regulatory review, the digital assets futures business will be rolled into the existing derivatives business.\nCboe plans to continue clearing bitcoin and ether futures through Cboe Clear Digital, but it will share management with Cboe Clear Europe.\nOne thing that was not mentioned was that Cboe Digital was not a wholly owned subsidiary. In late 2022 it announced 13 minority outside investors, mainly crypto or proprietary trading firms. They included B2C2, Cumberland DRW, Jump Trading, StoneX and Talos. Shortly before the announcement, it revealed a $460 million write down on its ErisX investment.\n“Bringing digital asset derivatives and clearing into our existing business lines enables us to leverage the full breadth of our global derivatives team and unlock the full value of Cboe to our clients around the world,” said David Howson, Global President of Cboe. “We expect to continue to see greater demand for exchange-traded derivatives to help manage crypto exposures, hedge risk and enhance capital and operational efficiencies.”\nNonetheless, Cboe continued to expand the offering this year, launching margined Bitcoin and Ether futures in January.\nCboe has other interests in the digital asset space, having invested in the Osaka Digital Exchange (ODX), Japan’s first secondary market for digital securities founded by SBI Holdings.\n","create_date":"2024-04-26T14:01:46+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/deutsche-bank-joins-singapores-project-guardian-tokenization-initiative/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Deutsche bank announced it will participate in Singapore's Project Guardian to continue exploring the administration of tokenized funds","title":"Deutsche Bank joins Singapore's Project Guardian tokenization initiative - Ledger Insights - blockchain for enterprise","content":" Today Deutsche Bank announced it will participate in Singapore’s Project Guardian which explores tokenization on public blockchains. Last year the bank completed a proof of concept for Project DAMA (Digital Assets Management Access), which was awarded a grant from the Monetary Authority of Singapore (MAS). Project Guardian already has 17 institutional participants, ten of whom are experimenting with asset and wealth management.\nIn addition to MAS, regulators from the UK (FCA), Switzerland (FINMA) and Japan (FSA) are also involved.\nThe first iteration of DAMA explored fund issuance and administration. The different participants, including the asset managers, transfer agents, and custodians, used a shared solution on a public blockchain. Like some other Project Guardian participants (Schroders, Apollo), DAMA also explored mass customization for asset managers.\nFor Project DAMA 2, Deutsche Bank will continue to explore servicing tokenized and digital funds. It plans to “propose protocol standards” and identify best practices.\nThe bank will continue its collaboration with Memento Blockchain, which has developed various DeFi asset management solutions and multi asset swaps. Memento is currently working on a zero knowledge Layer 2 solution. In addition to Memento, Deutsche Bank will also work with Interop Labs, the founder of the Axelar Network a blockchain interoperability platform. JP Morgan used Axelar for its Project Guardian initiative with Apollo.\n“Contributing to Project Guardian will bolster our efforts to help shape the new frontier of asset servicing, and strongly position us to contribute to industry progress, and not only anticipate our clients’ needs but exceed their expectations,” said Anand Rengarajan, Head of Securities Services for Asia Pacific and the Middle East.\nSome of Deutsche Bank’s recent web3 activity is coming out of DWS, its asset management subsidiary. It plans to launch ALLUnity, a Euro stablecoin initiative with Galaxy and Flow Traders.\n","create_date":"2024-05-14T14:51:42+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/schwab-citadel-backed-digital-assets-firm-edx-markets-launches-singapore-services/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"EDX Markets, the institutional crypto exchange, has launched the settlement platform of its Singapore subsidiary, EDXM Global","title":"Schwab, Citadel-backed digital assets firm EDX Markets launches Singapore services - Ledger Insights - blockchain for enterprise","content":" On Tuesday EDXM Global announced it launched its settlement platform in Singapore. It’s a subsidiary of EDX Markets, the institutionally focused cryptocurrency exchange founded by Citadel Securities, Fidelity Digital Assets, Virtu Financial and Charles Schwab, alongside venture capital firms. Initially EDXM Global provides a settlement process for OTC transactions. It also plans to provide custody services, but we believe that requires a Singapore license.\nEDX investors GSR and Virtu Financial were the first firms to use the settlement solution. EDXM Global supports the same set of assets as stateside, BTC, ETH and LTC.\n“The launch of EDXM Global is the first step in the international expansion of our digital asset business,” said Jamil Nazarali, CEO of EDX. “We are thrilled to introduce our settlement service, built on cutting-edge technology, rigorous compliance, and an unwavering commitment to customer service. By mitigating counterparty risks, EDXM Global empowers our Members to navigate the complexities of trade settlement while reducing counterparty risks.”\nEarlier this year EDX launched EDX Clearing in the United States and announced a Series B investment round co-led by Pantera Capital and Sequoia Capital. It said it traded $1.4 billion in notional value last December.\nWhen it announced plans for the Singapore subsidiary it said it intended to get a spot trading license and also aims to host derivatives trading, particularly perpetual futures. One of the advantages of a Singapore base is it is not restricted to cryptos classified as commodities in the United States. Although it appears ETH is no longer considered a commodity.\nSingapore has attracted other incumbents such as AsiaNext, backed by Swiss stock exchange SIX and Japan’s SBI. Earlier this year it launched an institutional crypto derivatives exchange, which offers monthly and perpetual futures for BTC and ETH.\n","create_date":"2024-05-09T16:19:28+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/congress-passes-resolution-to-overturn-sec-crypto-custody-rule/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Congress passed a resolution overturning SAB 121 the SEC accounting bulletin preventing banks providing digital asset custody including crypto","title":"Congress passes resolution to overturn SEC crypto custody rule - Ledger Insights - blockchain for enterprise","content":" Yesterday, the U.S. House of Representatives passed a bipartisan resolution to overturn the Securities and Exchange Commission’s (SEC) SAB 121, a staff accounting bulletin that restricts banks from offering digital asset custody services. Twenty-one Democrats joined Republicans in voting in favor of the resolution, with a count of 228 and 182 against. To cancel SAB 121, the Senate has to take similar action.\nSAB 121 requires listed companies, including banks, to record crypto assets as both an asset and liability on the balance sheet. This is contrary to the conventional treatment of assets under custody, which usually do not appear on the balance sheet as they belong to the client. Compliance with Basel rules for banks requires banks that provide custody to set aside a dollar of capital for every dollar held in custody. Not only does this render bank cryptocurrency custody prohibitive in the United States, but also the custody of any tokenized securities. As a result, most of the custody provided for Bitcoin ETFs is from crypto specialists such as Coinbase.\nThere’s been considerable pushback over the rule. The Government Accountability Office (GAO) determined that SAB 121 warranted a Congressional review.\n“Because they called it staff guidance, the SEC could avoid public comment and the rulemaking process governed by the Administrative Procedure Act or APA,” said House Financial Services Committee Chair Patrick McHenry.\n“Not only did the SEC bypass Congress and the Comptroller General, but the Commission did not even consult with the prudential regulators responsible for overseeing banks prior to issuing SAB 121.”\nSEC Commissioner Hester Pierce previously noted that SAB 121 “arguably does not protect investors” as banks have better experience, given they look after trillions of dollars of customer assets. That compares to the relatively small security budgets of crypto specialists.\nSeveral industry bodies also objected to the rule. A letter to Congress prior to the vote stated, “SAB 121 represents a significant departure from longstanding accounting treatment for custodial assets and threatens the industry’s ability to provide its customers with safe and sound custody of digital assets.” It was penned by the American Bankers Association (ABA), the Bank Policy Institute, the Financial Services Forum and the Securities Industry and Financial Markets Association (SIFMA).\nNot everyone disapproves of SAB 121. Maxine Waters the ranking member of the House Financial Services Committee said the driver of overturning the resolution was custody banks. However, the accounting bulletin serves a wider purpose of disclosure and ensuring companies have sufficient assets in case of losses.\nCustody banks have repeatedly raised this issue regarding bank capital requirements – for at least 1.5 years – to no avail. That includes a recent letter to the SEC from the industry bodies asking for limited carve outs from SAB 121. SEC Chair Gensler previously said it was up to prudential regulators.\nMaxine Waters referenced that letter in her comments. “This Bill does far more than implement targeted modifications, as this letter proposed. This CRA resolution would overturn all of SAB 121, not just a part this special interest group has complained about.”\nShe continued, “The largest custody bank in the United States, the Bank of New York Mellon which custodies more than $45 trillion in customer assets, because they told me that they do not want this CRA and did not push for it in any way because they share our concerns about the Bill being overly broad.”\n“The SEC would be prohibited from issuing any guidance in the future that is substantially similar to this one, including disclosure guidance on this issue,” said Representative Waters. “This means that the SEC would not be able to simply turn around and narrowly address this one little concern while preserving the rest of the guidance.”\nCongressman Flood, one of the authors of the resolution, retorted, “The easiest way to fix this problem is for the SEC to simply rescind the bulletin themselves and work with the prudential regulators on an alternate solution. The SEC has been unwilling to have any conversation about making changes. That leaves us with no choice.”\nHe also said it was a bigger issue than crypto custody, adding, “If we don’t pass this resolution, we are effectively giving the green light to our regulators to bypass the APA rulemaking process with immunity.”\nThe last word goes to the White House, which says it objects to overturning SAB 121 and the President will veto the resolution if it’s presented to him. The statement says the resolution will “inappropriately constrain the SEC’s ability to ensure appropriate guardrails and address future issues related to crypto-assets including financial stability.”\nUpdate: added the final paragraph regarding the White House statement\n","create_date":"2024-05-09T08:36:16+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/fed-governor-bowman-warns-of-risks-of-resisting-innovation-including-dlt/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"U.S. Federal Reserve Governor Bowman explored the topic of innovation arguing that regulators should avoid the temptation to resist it","title":"Fed Governor Bowman warns of risks of resisting innovation, including DLT - Ledger Insights - blockchain for enterprise","content":" Federal Reserve Governor Michelle Bowman suggested a methodology for regulators to get comfortable with innovation during a speech yesterday. Most innovations come with both benefits and risks. The key is for regulators to expand their understanding by getting to grips with new technology, business models and the companies introducing the innovations to the banking sector. They also need to understand the ‘why’, the problem that the innovation aims to solve. She acknowledged that sometimes regulators “reflexively resist these changes”.\nIt’s up to industry to educate regulators, but at the same time regulators need to be willing to listen.\n“We must fight the temptation to say “no” and resist new technology, and instead focus on solutions — how can we mitigate the risk of new technology? What benefits will technology bring to the financial system? How can we provide clear regulatory expectations?” said Governor Bowman.\n“The appeal of resisting innovation — resisting change — is that it preserves the familiar and known. But the cost of resistance to change may be great, in that it promotes stagnation and inertia. Ultimately, this could lead to a banking system that may be safer and smaller, but also less effective at providing banking products and services and in supporting the U.S. economy.”\nSometimes, technology is unable to address frictions that exist for a reason. She gave the example of compliance in cross-border payments. “New technology alone cannot solve the issue unless it also addresses the required safeguards,” she noted. We’d add that innovation can also help with compliance.\nFor example, both Partior and Project Agorá, which involve tokenization, aim to perform compliance checks just once and in advance of the transaction. This prevents many of the typical holdups in international payments. A separate issue is that blockchains enable new types of compliance checks through blockchain analysis, something that’s worth exploring.\nGovernor Bowman also addressed tokenization, exploring the potential impact. “Will “tokenized” products and platforms duplicate existing bank deposits and payment rails, potentially creating parallel systems? If so, will the products and platforms that duplicate these functions provide the same legal protections for customers and the overall financial system?” she asked.\nMeanwhile, in a speech last year, Governor Bowman highlighted reservations about allowing a wholesale central bank digital currency (CBDC) to circulate on a platform not operated by the bank, for example as part of a Unified Ledger. However, another possibility is to allow it to control its own ledger.\nSince then the BIS has launched Project Agorá for cross border payments with seven central banks, including the New York Innovation Center (NYIC), which is part of the New York Fed. The NYIC emphasized the project’s exploratory nature, which will use tokenized central bank money.\nThe terminology in Project Agorá is noteworthy in that it avoids the phrase ‘wholesale CBDC’ and instead sticks to ‘tokenized central bank money’. This distinction is reminiscent of a Federal Reserve paper that, in our view, explored the legal nuances of tokenized central bank money.\nIn the paper the authors differentiate between the payment system and the settlement asset. If tokenized central bank money is the same settlement asset then legally it’s the same as what exists today. With DLT they argue that the novelty is in the payment system and its programmable nature. Thus, in Governor Bowman’s speech relating to wholesale CBDC, she questioned the use of that term.\nThe NYIC also takes on the role of technical observer of the recently announced Regulated Settlement Network that will explore tokenized deposits.\n","create_date":"2024-05-16T13:24:57+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/indias-upi-aadhaar-to-influence-bis-vision-for-unified-ledger-finternet/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Agustín Carstens, BIS General Manager, shared more details about the Unified Ledger and Finternet tokenization concepts","title":"India's UPI, Aadhaar to influence BIS vision for Unified Ledger, Finternet - Ledger Insights - blockchain for enterprise","content":" During today’s BIS Innovation Summit, BIS General Manager Agustín Carstens elaborated on the concepts of the Finternet and the Unified Ledger. The latter came first, a big vision to rewire the financial system using tokenization and programmable assets, whether that’s central bank money, tokenized deposits, or tokenized assets such as real estate.\nWhile the Unified Ledger represents the wholesale finance vision, it doesn’t appeal much to the average person. After a chat with his friend Nandan Nilekani, the co-founder of Infosys, they expanded that concept to a user-centric Finternet. In this vision of the future of finance, the individual has tremendous financial choices without frictions and high costs.\nMr Carstens again spoke of his time as Governor of the Bank of Mexico, which used a DC9 airplane to distribute cash. Every year the maintenance costs were significant. Eventually he concluded that they needed to ditch the 40 year old DC9 and get a new plane, resulting in massive cost savings. Likewise he argues that minor tweaks to legacy financial systems can only get you so far and can hold back innovation. At some point there’s a need to take a big leap. This was the topic of his opening keynote.\nMeanwhile, Mr Nilekani, the co-author of the Fnternet paper, also led the government body that launched India’s digital identity framework Aadhaar, which was a massive success and is approaching 1.4 billion issuances. Mr Nilekani’s colleague Siddharth Shetty spoke today about how Aadhaar allowed India to leapfrog financial inclusion by roughly four decades. Before the launch of Aadhaar in 2008, around a quarter of adults had a transaction account, compared to 80% today.\nA widely known feature of Aadhaar is its relative simplicity. Traditional identity systems collect 40 to 50 attributes, but Aadhaar requires four: name, address, date of birth, and sex. It additionally requires biometrics and documents.\nMr Shetty’s team is fleshing out the thinking behind the Finternet, which will be heavily influenced by three major Indian projects – Aadhaar, the faster payments network UPI and a new open banking project, Account Aggregator.\nOne of the learning experiences from UPI was that it leverages existing infrastructure from central and commercial banking. Initially it was only possible to transfer money from one bank account to another. However, with the subsequent addition of third party fintechs, the number of supporting merchants increased tenfold, and the instruments expanded to credit cards and wallets . Most of these third parties are unregulated because the money flows through the regulated providers. Perhaps this is a hint that while the Unified Ledger might start with regulated banks, fintechs will follow.\nMr Carstens quipped that Mr Nilekani asked Mr Shetty to estimate how long it would take to implement the Finternet concept and he said three months, a little optimistically.\nMr Shetty outlined the mental models behind the Finternet. First, it is user centric. “Many times we design systems putting providers at the center rather than users, and that makes a big difference in terms of adoption,” said Mr Shetty.\nSecond, the architecture needs to unify diverse asset classes, sectors, and countries. In addition, it needs to support different adoption rates among sectors and countries.\nThis leads to the third point, the need for universality – the technology has to be universal.\nFollowing on from this, across various asset classes, there is a role that is more or less universal – that of the custodian, although the terminology differs across industries. You might think of a commercial bank as a custodian of your money.\nIn Mr Shetty’s vision, custodians can act as token managers, issuing or canceling tokens. We’ve previously noted that the BIS may not plan to use blockchain. This may be reinforced by the mention of issuing and canceling tokens rather than the terms ‘mint’ and ‘burn’ typical of blockchain. However, for adoption purposes, less jargon is always better.\nWhen custodians issue tokens they will embed the local rules for that asset. The need to be able to de-tokenize will be important in the early days. That’s much like when things were first digitized, people often wanted to keep a physical copy. In the early days of the internet many people were accustomed to paper memos and printed out their emails!\nOther key players alongside custodians will be attestors, guarantors and verifiers to create ‘proof chains’.\nMr Shetty also outlined three pitfalls worth avoiding. One is the trap of centralization. Not everyone will use the same ledger. Second is the trap of synchronization. People will adopt new technologies at different rates and that needs to be supported. And third is the trap of over-standardization. In other words, target the most minimal standards. One example is the TCP IP protocol that underpins the internet as we know it. There needs to be scope for standards across different sectors and countries but with a mechanism to enable discoverability.\nThis last point is one of the trickiest. We’d observe that in the private sector there’s a tendency for the dominant leaders tend to heavily influence which standards are popular. In the public sector there’s currently much talk of regulatory harmonization. It’s happening in some areas but not in others. One example is stablecoins, where there is some commonality but sufficient differences to encourage regulatory arbitrage.\nListening to the Indian influence on the Unified Ledger concept, we’d note that another central bank has also had recent success in this area – Brazil and its Pix payments system used by 80% of the adult population within 2.5 years of launch. Brazil is already far advanced in developing its equivalent of a Unified Ledger, DREX. One thing both have in common is user-centricity. That’s what made DREX so distinct from other central bank tokenization projects. For Brazil, DREX is its core open banking initiative.\n","create_date":"2024-05-07T17:08:04+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/finexity-plans-dlt-pilot-regime-application-partners-with-cashlink/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"FINEXITY and Cashlink are partnering to pool digital securities distribution. FINEXITY also plans to apply for the DLT Pilot Regime","title":"Finexity plans DLT Pilot Regime application. Partners with Cashlink - Ledger Insights - blockchain for enterprise","content":" Today FINEXITY announced a collaboration with fellow German DLT fintech Cashlink. FINEXITY is best known for tokenizing real estate although it expanded its range of assets to include precious metals, collectibles such as vintage cars, and other assets. It also has an over the counter (OTC) secondary market. In addition to the partnership with Cashlink it revealed plans to apply for a license to participate as an exchange and settlement system (DLT TSS) under the DLT Pilot Regime. This waives certain rules such as allowing consumers to engage directly with exchanges.\nMeanwhile, Cashlink is one of Germany’s most prolific crypto securities registrars, with a provisional license from BaFin. Germany has its eWpG laws for crypto securities (digital securities) which waive rules in a similar manner to the DLT pilot regime. Thus instead of the need for a central securities depository (CSD), the combination of a blockchain and registrar take on that role.\n“Together, the respective ecosystems are expanding to include issuers, investors and connected distribution platforms and financial institutions,” said Michael Duttlinger, Co-Founder and CEO of Cashlink. “The Cashlink and FINEXITY offering brings the issuance, trading and settlement of crypto securities into the fully regulated securities business.”\nBoth FINEXITY and Cashlink have been using Effecta GmbH’s investment brokerage license for years. By working together and with Effecta they aim to achieve three benefits. First is the regulated issuance of crypto securities using the Cashlink registry. Secondly, they will pool their ecosystems including links to banks to expand distribution for both sets of clients. And thirdly there is FINEXITY’s secondary market, which it hopes to evolve into a full trading venue if approved under the DLT Pilot Regime.\nDLT Pilot Regime exchanges are similar to existing ones, but more efficient by reducing the intermediaries and enabling atomic settlement.\nGermany’s eWpG crypto securities legislation is the main reason why German firms are likely to have a disproportionate representation in the DLT Pilot Regime. So far there have been at least 88 crypto securities issuances, starting with one by DekaBank in late 2021. However, there’s a desperate need for secondary markets.\n“The partnership between FINEXITY and Cashlink is an important first step in preparing for a Capital Market 2.0.,” said says Paul Huelsmann, founder and CEO of Finexity AG. “We complement each other excellently with Cashlink and its capabilities in crypto securities registry management. This, combined with FINEXITY’s efficient trading and settlement system, enables both companies to provide issuers with greater distribution power.”\nA year into the DLT Pilot Regime, there are no active projects and just four DLT Pilot applications in progress. Two are from Germany. One is confirmed to be 21x (we will publish a feature on Monday) and sources say the other is 360x, the joint venture between the Deutsche Börse and Commerzbank. However, the Deutsche Börse declined to comment. Previously, 360x made no secret about plans for a secondary market.\nUpdate: Corrected FINEXITY plans from a DLT MTF, to a DLT TSS. In other words, an exchange plus a settlement system.\n","create_date":"2024-05-10T15:08:18+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/jefferies-subsidiary-tradu-launches-retail-crypto-trading/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Tradu, a subsidiary of Investment bank Jefferies, has launched a retail crypto trading offering. It is sister to FXCM retail forex trading","title":"Jefferies subsidiary Tradu launches retail crypto trading - Ledger Insights - blockchain for enterprise","content":" Last year Stratos, known for the FXCM retail forex trading platform, launched Tradu for stock and multi-asset trading. Now Tradu has unveiled a crypto trading offering, aiming to compete on low fees and other features. Jefferies owned 49.9% of Stratos, but that recently increased to 100% following a debt default, which ceded the balance to Jefferies.\nTradu charges 0.1% in crypto commission with rebates for larger trades. This is equivalent to Binance, which offers one of the best rates on the market. It is considerably lower than rates charged by Coinbase and other competitors. In addition with the Stratos history in retail trading platforms, it provides support and transparency around fees.\n“We are bringing institutional-grade pricing and infrastructure to the retail crypto market, providing traders with upfront costs and tight, transparent spreads enabling active traders and investors to maximise their returns,” said Brendan Callan, CEO of Tradu.\nTradu’s sister brand FXCM has offered crypto trading for years, so it’s not a new group activity. Stratos Markets is registered for several activities with the UK’s Financial Conduct Authority. However, existing registrants have to apply as a cryptoasset firm to demonstrate compliance with anti money laundering (AML) rules. We didn’t find a registration for Stratos Markets but the company confirmed that the crypto offering is currently live in Asia, Latin America and Africa. Future rollouts are planned for the UK, Europe and the Middle East.\nStratos doesn’t have to worry about U.S. crypto restrictions because it shuttered U.S. activities in the United States in 2017. That was after it surrendered its Commodities and Futures Trading Commission (CFTC) registration when the CFTC found FXCM misled its retail clients regarding conflicts of interest. Senior management also stepped down.\nMeanwhile, Jefferies has been involved with at least one crypto-linked company for several years. Figure Technologies founded the Provenance public blockchain and also provides retail real estate lending. In early 2019 Jefferies and WSFS Institutional Services provided a $1 billion asset-based financing facility. Jefferies also invested in Provenance and reportedly will help with Figure’s planned IPO.\nUpdate: confirmed the jurisdictions in which it is live.\n","create_date":"2024-05-08T13:02:26+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/pwc-china-partners-xalts-for-tokenization/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"PwC China has partnered Xalts for tokenization and programmable assets. Xalts is backed by Citi and acquired the Contour trade finance app","title":"PwC China partners Xalts for tokenization - Ledger Insights - blockchain for enterprise","content":" Yesterday PwC China announced it is partnering with Hong Kong’s Xalts for tokenization infrastructure and programmable assets. Xalts is a Citi backed startup founded in 2022. It provides quick to deploy blockchain solutions on multiple networks as well as applications for trade credit, loyalty, and lending with plans to launch an asset management solution. Xalts acquired Contour, the trade finance blockchain that shuttered last year.\nThe recently announced Project Ensemble by the Hong Kong Monetary Authority (HKMA) influenced PwC’s timing. HKMA aims to trial a wholesale central bank digital currency (CBDC) for interbank settlement of tokenized deposits. That’s one of the objectives, with the primary purpose of bridging the gap between tokenization and money.\n“PwC sees enormous potential for programmable assets to deliver important innovations for the financial services industry, including wholesale payments and trade finance,” said Peter Brewin, Partner, PwC China.\nXalts supports both public and private blockchains, although they all appear to be Ethereum compatible. Apart from Ethereum itself (presumably Geth) it supports Hyperledger Besu, Avalanche, Polygon and Optimism. The Corda DLT is not mentioned, but the Contour solution was Corda-based. Deployments include Asian clouds such as Alibaba and Tencent, as well as AWS, Google and Azure.\nHong Kong is making rapid strides in tokenization and digital currency. In February the city state issued the world’s largest digital bond, a green bond with an issuance size in excess of $750 million. In the span of one week in March it launched Project Ensemble, a stablecoin sandbox, plus the second phase of its retail CBDC trials.\n","create_date":"2024-05-03T10:29:59+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/stanchart-backed-zodia-custody-lands-bitcoin-miner-marathon-digital-as-client/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Standard Chartered backed digital asset custodian Zodia Custody has landed Marathon Digital as a client, one of the largest Bitcoin miners","title":"StanChart backed Zodia Custody lands bitcoin miner Marathon Digital as client - Ledger Insights - blockchain for enterprise","content":" In one of its biggest wins to date, Zodia Custody announced it landed Marathon Digital as a digital asset custody client. Marathon is the largest listed Bitcoin miner by market capitalization ($5.2 billion). The custody firm was founded by Standard Chartered’s SC Ventures and Northern Trust, with SBI joining as a significant backer.\nOne argument for incumbents getting involved in digital asset custody is that they have way more experience than crypto startups and have more on the line in terms of reputation. For example, Northern Trust is one of the world’s largest global custodians, with $16.5 trillion in assets under custody.\nHowever, incumbents have barely made inroads into crypto custody until recently. In the United States, that’s a lot to do with the SEC’s accounting rule, SAB 121, which renders custody non-viable for banks. Hence, no banks are looking after the crypto that underpins the massive Bitcoin ETFs in the United States. Zodia Custody will provide services outside of the United States only.\n“The addition of Zodia Custody demonstrates our continued commitment to the secure management and diversification of our Bitcoin holdings – especially as we continue to grow internationally and expand into new territories,” said Salman Khan, Marathon’s Chief Financial Officer. “Zodia Custody’s compliance and reputation in the market as a leading institutional digital asset custody provider make valuable addition to our list of diversified custodians.”\nEarlier this month Zodia Custody announced it was one of the crypto custody providers for Deutsche Bank’s asset manager DWS crypto exchange-traded product (ETPs). In that case, Zodia is a custodian alongside Coinbase.\n","create_date":"2024-04-29T09:33:23+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/emtech-ghana-cbdc-hackathon-public-dlt-hedera/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Bank of Ghana completed a central bank digital currency (CBDC) hackathon using the Hedera public DLT, in a collaboration with EMTECH","title":"EMTECH completes Ghana CBDC hackathon on public DLT - Ledger Insights - blockchain for enterprise","content":" The Bank of Ghana (BoG) concluded its first central bank digital currency (CBDC) hackathon. The event involved ten teams developing eCedi solutions deployed on Hedera’s public DLT, using EMTECH’s Beyond Cash digital currency solution. KPMG participated as a service provider on a pro bono basis, establishing the competition criteria and supervising the event. The hackathon participants included developers, banks and fintechs.\nThe prizes were significant, with the winning team Forward Titans walking away with eCedi 500,000 ($41,500). Second and third-placed participants Nokofio and Pay Code received eCedi 300,000 ($25,000) and 200,000 ($16,600) respectively. The organizers didn’t share the winners’ use cases.\nHowever, the ten finalists launched apps covering agriculture, government payments, business payments, taxation, securities, crowdfunding, interoperability and credit scoring.\nGhana’s hackathon started in October with 88 applications pruned to 68 and eventually to ten finalists.\n“We appreciate the cross-country and cross-continent collaboration among innovators,” said Dr Ernest Addison, Governor of the Bank of Ghana. He reiterated that Ghana’s eCedi project is motivated by financial inclusion, improving the safety and efficiency of payments, and digitalization. In 2021 Ghana’s financial access ratio improved to 68%, up from 41% in 2014.\nEMTECH said that participants were given access to BYDC-eCedi APIs to ease integration. All transactions used the ERC-20 token standard. While transactions were transparent on the public DLT, user information was kept private.\n“Bank of Ghana’s successful pilot with our web3-enabled technology stack showed foresight and leadership,” said EMTECH’s CEO Carmelle Cadet. “It also establishes a template of ‘How To CBDC for the Web3 era’ while collaborating with banks and fintech ecosystems.”\nMeanwhile, in 2021 the Bank of Ghana contracted Giesecke+Devrient (G+D) Currency Technology to develop a pilot for its retail CBDC, with trials conducted during 2022. That included offline CBDC.\nWe were curious about whether the EMTECH offering integrated with the G+D offering or was entirely independent. For clarification, we contacted the Bank of Ghana, EMTECH and G+D, but we didn’t receive a response.\nUpdate: Following publication we received the following response from EMTECH CEO Carmelle Cadet. “After working with G+D for offline CBDC, BoG’s exploration continued in testing a web3 components and test various cases with their ecosystem. A hackathon, also called an innovation challenge, approach with EMTECH offered that. We fully expect to support various offline integrations, so we’re ready to work with others to build the right solution for Ghana, when it’s ultimately decided by the Bank of Ghana.”\nIt’s still relatively unusual for CBDC trials to use public blockchains. However, some of the recent Australian pilots did. That said, Australia does not plan to proceed with a retail CBDC for now. Its current focus is wholesale CBDC.\n","create_date":"2023-12-18T17:53:47+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/south-africa-wholesale-cbdc-trials-bank-stablecoins/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The South African Reserve Bank (SARB) confirmed it is progression Project Khokha2x for bank backed stablecoins and wholesale CBDC","title":"South Africa plans wholesale CBDC trials, bank stablecoins - Ledger Insights - blockchain for enterprise","content":" As part of its Digital Payments Roadmap, the South African Reserve Bank (SARB) confirmed that it is progressing its central bank digital currency (CBDC) work as part of Project Khokha 2x. This involves a wholesale CBDC and bank-issued stablecoins, which will be used for regional payments in Africa. Additionally, SARB set a two year timeframe for supporting domestic stablecoins as part of a sandbox.\nThere was no mention of a retail CBDC, something that Standard Bank’s CEO pushed back on last year. Previously Standard Bank ran its own stablecoin trials with Korea’s Shinhan Bank for cross border payments on the Hedera DLT. Those trials continued with other participants and parts of the stablecoin code were open sourced.\nAlso last year, Gerhard van Deventer, a fintech expert at SARB, discussed Khokha 2x saying one interest area was integrating with trade finance platforms. In the meantime, multiple blockchain trade finance solutions have shuttered. Standard Bank participated in the Letter of Credit platform Contour, which closed last November. Van Deventer mentioned potentially using a wholesale CBDC as collateral for letters of credit.\nWhen it came to bank-issued stablecoins, the central bank had not decided whether settlement would happen on a private network or by integrating with real time gross settlement systems. However, interoperability was considered important because of the belief in a multi-DLT world.\nDuring 2021/22 SARB ran Project Khokha 2, a wholesale CBDC trial for securities settlement. That also involved a commercial bank money stablecoin backed by central bank deposits. While there were several findings, the report on the proof of concept didn’t draw strong conclusions. In fact, it didn’t conclude whether there was a need to move forward.\nTalking about Khokha 2 (rather than 2x), van Deventer said, “This was an exploratory project and, among other reasons, regulators typically follow the market, and there are questions about whether we should set a direction.”\nIn related news, yesterday South Africa’s Financial Sector Conduct Authority approved 75 crypto asset service provider licenses. While that sounds like a large number and potentially unwieldly for oversight purposes, there were more than 370 applications.\n","create_date":"2024-04-23T12:04:48+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/basel-bank-crypto-rules-delayed-to-2026/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The Basel Committee which said global regulatory standards for banks is delaying the implementation of crypto-asset rules by a year","title":"Basel crypto rules for banks delayed to 2026 - Ledger Insights - blockchain for enterprise","content":" The Basel Committee, the global standard setter for regulating banks, has delayed the implementation of the Basel rules for crypto-assets by a year to January 2026. Its definition of crypto-assets is broad, including cryptocurrencies, stablecoins and tokenized securities such as stocks and bonds.\n“The revised implementation date will help to ensure that all members are able to implement the standard in a full, timely and consistent manner,” said the Basel Committee’s oversight body.\nThe first set of crypto-asset rules was finalized in late December 2022. However, a year later the Committee consulted on proposals for substantial changes. The Committee plans to revise the rules later this year.\nThe proposed amendments tighten the requirements for crypto-assets to be classified in the low risk Group 1. Tokenized securities usually fall into this group. Under the draft amendments, any security tokens issued on a public blockchain automatically fall into the higher risk Group 2, which has prohibitive capital requirements. For example, U.S. banks would have to set aside a dollar of capital for every dollar of tokenized securities they hold on a public blockchain. The same applies to any other digital securities that don’t meet the risk requirements set out in the standard.\nIndustry bodies GFMA, FIA, IIF, and ISDA object to this change. They also aren’t happy with another proposal regarding ‘infrastructure risk’. Before the first standard was published, the Committee had proposed that all Group 1 assets, including digital or tokenized securities, incur a 2.5% infrastructure risk add-on. The final 2022 standard removed the add-on, but the 2023 proposed amendments re-introduce a watered-down version at 0%. However, it gives local regulators the leeway to increase the percentage.\nThe industry bodies want to see all references to the infrastructure risk dropped. They also addressed several other proposed changes.\nMeanwhile, Erik Thedéen, the Governor of Sweden’s Riksbank will become the new Chair of the Committee in June this year. He will replace Spain’s Pablo Hernández de Cos who has been in the role for more than five years.\n","create_date":"2024-05-14T08:58:54+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/softbank-line-next-web3-nfts-raises-140m/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Softbank backed Web3 startup LINE NEXT has raised $140 million in funding led by Crescendo Equity Partners","title":"Softbank offshoot LINE NEXT raises $140m for web3, NFTs - Ledger Insights - blockchain for enterprise","content":" Last week Korea’s LINE NEXT confirmed a $140 million funding round led by Peter Thiel-backed private equity firm Crescendo Equity Partners. In 2022 social media app LINE launched LINE NEXT as its web3 offshoot with two arms, one in Korea and the other in the United States. Additionally, it unveiled DOSI a web3 wallet and non-fungible token (NFT) marketplace reminiscent of OpenSea.\nLINE has since been renamed to LINE Yahoo or LY and at its founding was half owned by Softbank and Korean social media firm Naver. The LINE NEXT web3 subsidiary had other external investors from the start, including WEBTOON and major Korean firms.\nSo far DOSI has 5.5 million users globally and 470,000 cumulative transactions. It considers the past as the beta phase and plans to launch DOSI globally in January 2024.\nStepping back, one has to consider the rich anime culture in Japan and to a lesser extent Korea as well. Avatars and gaming will be an important focus area based on past LINE NEXT investors, and current validators on LINE’s blockchain (now renamed to Finschia).\nFor example, the images below are from the largest Finschia blockchain validator, Korea’s GoodGang Labs.\nDOSI plans a social app to integrate AI-generated characters and web3 games.\nJapan has had a huge impact on the video game sector. Think Sony Playstation, Nintendo, SEGA and Bandai Namco. However, those are all hardware console developers.\nLooking at DOSI, many brands are Asian. But then most of LINE’s audience is too. LINE’s monthly active users in Japan are 96 million expanding to 179 million counting users in Thailand, Taiwan and Indonesia.\nOne of the brands on DOSI is based on Bored Ape Yacht Club (BAYC) – Wake Up Bored – themed on coffee drinking, based on BAYC character #1208.\n“LINE’s global competitiveness and its vision to lead Web3 services were the investment thesis,” said Kevin Lee, the managing partner of Crescendo. He added, “We hope to build a standard for Web3 apps that general users can easily use and adopt blockchain to all sorts of services and brands of Web2.”\n","create_date":"2023-12-18T16:13:20+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/blockchain-carbon-registry-cad-trust-verra-cdm/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The CAD Trust has launched. It's a blockchain meta registry aggregating data from multiple registries including Verra, CDM and others","title":"World Bank-backed meta carbon registry CAD Trust launches with Verra, CDM, others - Ledger Insights - blockchain for enterprise","content":" The Climate Action Data Trust (CAD Trust) went live last week. It creates a blockchain log of projects across multiple carbon credit registries to prevent the double counting of initiatives. Hence it supports compliance reporting and auditing. CAD Trust founders include the International Emissions Trading Association (IETA), the World Bank and the Singapore government.\nCarbon market registries integrated with the Dashboard include the world’s largest Verra, as well as the Global Carbon Council, EcoRegistry and the BioCarbon Registry. It also incorporates data from the Clean Development Mechanism (CDM), part of the United Nations Framework Convention on Climate Change (UNFCCC). The CDM makes up more than 60% of CAD Trust data.\nAdditionally, CAD Trust recently announced the addition of Bhutan’s national registry.\n“Verra is pleased to have been instrumental in the launch of the Climate Action Data Trust’s new Data Dashboard,” said Verra president and interim CEO Judith Simon. “This is a dynamic addition to the transparency of carbon markets that will help us pursue even greater mitigation.”\nCAD Trust uses the Chia blockchain (founded by the creator of BitTorrent) and is intended as a public good.\n“Having gathered a critical mass of carbon credit data, the Dashboard marks a significant milestone in enhancing trust and transparency within carbon markets,” said Yuvaraj Dinesh Babu, Executive Director of the Climate Action Data Trust. “The standards and registries that have so far connected with CAD Trust are demonstrating leadership and a shared commitment to enhancing transparency in carbon markets.”\nMeanwhile, blockchain technology continues to play an important in the sustainability movement. Today Deutsche Börse-backed exchange ACX announced its latest collaboration in Vietnam. Last month, the Nasdaq launched smart contract technology for carbon credits. And the Interwork Alliance has published its Carbon Emission Token Protocol.\n","create_date":"2023-12-19T17:51:11+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/when-is-an-asset-a-security-mifid-versus-a-crypto-mica-esma-receives-stakeholder-feedback/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"ESMA's stakeholder group provided feedback on ESMA guidelines for deciding whether an asset is a crypto-asset or a financial instrument","title":"When is an asset a security (MiFID) versus a crypto (MiCA)? ESMA receives stakeholder feedback - Ledger Insights - blockchain for enterprise","content":" On January 29 the European Securities and Markets Authority (ESMA) launched two consultations relating to the EU’s MiCA crypto-asset regulations. One relates to providers from third countries promoting crypto in the EU. The other covers when a crypto-asset falls under the new MiCA regulations rather than the MiFID II securities laws.\nESMA’s Securities and Markets Stakeholder Group (SMSG) provided feedback today, largely agreeing with ESMA on many points.\nIf a crypto asset service provider (CASP) is involved with financial instruments, it must also be regulated under MiFID II. The concept of a financial instrument is generally technology agnostic and includes transferable securities, money market instruments, funds, derivatives and emission allowances.\nSeveral popular crypto-assets would be considered as financial instruments. For example, a tokenized money market fund or even a derivative relating to an underlying crypto token.\nAs previously noted, one of the challenges with MiFID II is that each country implemented the legislation slightly differently. As a result, there’s no common definition of a financial instrument throughout the EU. In the past that’s not been that big a deal, but it is for MiCA.\nHence, the stakeholder group made a suggestion that goes beyond the consultation: it proposes defining financial instruments in a regulation or giving ESMA the powers to determine whether or not a particular asset qualifies.\nThis messiness regarding definitions could be problematic, particularly because of the EU passporting concept. That allows a CASP to be licensed in one member state and operate throughout the EU.\nFor example, say the CASP is regulated in Ireland and wants to sell a crypto-asset in France. If the Irish regulator considers the asset is a crypto, it believes the CASP can proceed. However, if the French regulator believes the asset is a financial instrument, without the CASP having a MiFID license, transactions in France wouldn’t be allowed. This goes against the whole EU passporting concept.\nThe stakeholder response covered several topics but made a very practical suggestion. Whenever an asset is being sold, the distributor should disclose which framework applies to the transaction – MiCA or MiFID II.\n","create_date":"2024-05-02T17:58:44+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/middle-east-cbdc-saudi-bahrain-cross-border-cbdc/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"During the recent World Economic Forum meeting held in Saudi Arabia, Bahrain and Saudi revealed their interest in cross border CBDC","title":"Middle East CBDC: Saudi, Bahrain eye cross border CBDC, IMF financial inclusion - Ledger Insights - blockchain for enterprise","content":" Last week the World Economic Forum (WEF) held a Middle East Special Meeting, during which central bank digital currency (CBDC) was discussed. Cross border CBDC is a priority for both the Saudi and Bahraini central banks. In contrast, the International Monetary Fund (IMF) sees potential for a retail CBDC to improve financial inclusion. The Governor of the Bank of Bahrain also hypothesized about the attractions of an interest bearing retail CBDC.\nJihad Azour, the IMF Director for Middle East and Central Asia (MECA), sees a huge opportunity for CBDC given the low rate of digital payments in MECA (40%) compared to South East Asia (80%). There’s great potential because the region also has a very high rate of telecom and internet penetration.\nHowever, he also noted the tremendous disparity between countries. A recent IMF CBDC report about the region shows that the Gulf Cooperation Council countries – including Saudi Arabia and Bahrain – have a far higher digital payment rate of around 75%.\nThe deputy Governor of the Saudia Arabian Monetary Authority (SAMA), Yazeed Al-Nafjan, said the digital payment rate in Saudi increased from 62% in 2022 to 70% in 2023.\nFor that reason, SAMA sees no reason to adopt a retail CBDC. However, it is interested in a cross border CBDC. SAMA is an observer of mBridge, the project that currently includes the central banks of China, Hong Kong, Thailand and the UAE. It hopes to become a full member. SAMA is particularly interested in learning about the different design choices and policy implications. SAMA’s first cross border CBDC initiative was Project Aber with the UAE during 2021.\nmBridge adopts the single platform model, one of three potential models for cross border CBDC outlined by the Bank for International Settlements (BIS) in 2021. The other options involve creating compatible CBDCs and interlinking domestic CBDC systems.\nMr Al-Nafjan noted that there was not yet a consensus on which model is optimal, so experimentation should continue.\nOn the one hand, Hong Kong has said that mBridge would launch a minimum viable product (MVP) mid year. The project coordinator, the BIS, is quite conservative regarding its launch expectations, and Mr Al-Nafjan said it was difficult to say when the experimentation would end. He doesn’t see any first mover advantage so he is keen to ensure that any launch is well coordinated.\nKhalid Humaidan, the Governor of the Central Bank of Bahrain, concurred with Saudi that cross border CBDC is the most important aspect. That’s partly because Bahrain has a large expat worker base that remits money back home with Bahrainis making up less than half of the residents. Like Saudi, Bahrain is also an official observer of the mBridge project.\nDespite the focus on a wholesale cross border CBDC, Governor Humaidan finds the prospect of an interest bearing retail CBDC appealing, although we believe he was talking hypothetically.\n“Imagine we start introducing an interest rate to a central bank digital currency. It starts to look very much like we’ve securitized a money market fund. That could be something very powerful,” said the Governor.\n“The central bank (would have) introduced a new monetary policy tool that’s more direct in nature than what we currently have.”\nToday when the central bank adjusts interest rates, it relies on banks to pass on the rate change. With an interest bearing CBDC that would not be the case. He suggested that with a direct transmission mechanism interest rate adjustments could be smaller, benefiting the economy.\nOf course this would compete with bank deposits. However, he argued that digitalization would create many opportunities for innovation.\nMeanwhile, the topic of CBDC and bank disintermediation is being explored around the world, but especially in the EU. The Bundesbank recently published a survey and model.\n","create_date":"2024-05-02T14:50:02+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/digital-securities-sandbox-legislation-no-limits/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The UK has published the legislation for the digital securities sandbox. It still doesn't specify any volume limits","title":"UK legislation for Digital Securities Sandbox published. No limits specified - Ledger Insights - blockchain for enterprise","content":" Under the recently passed Financial Services and Markets Act 2023, the UK’s Treasury has the right to issue Statutory Instruments (SI) to create financial market infrastructure (FMI) sandboxes. Today it published the SI for the Digital Securities Sandbox which comes into force on January 8, 2024. It is still unclear about volume limits.\nLast month His Majesty’s Treasury (HMT) clarified the scope of the Digital Securities Sandbox together with the results of a consultation. Volume limits in the EU’s DLT Pilot Regime discouraged some larger institutions from participating. HM Treasury said it planned to impose limits that would take into account the size of the organization.\nHowever, today’s legislation states: “The Treasury may direct the appropriate regulator, having first consulted with them, to impose restrictions on the overall FMI activities or ancillary FMI activities in the FMI sandbox arrangements, whether by reference to a number, value or another metric.”\nIt remains to be seen if some organizations will be hesitant to participate without these details. Otherwise, they risk putting in a lot of work – time is money – and having to halt their activities quickly.\nLast month HM Treasury said 19 organizations had expressed an interest in participating and they are keen to hear from more.\nThe regulators involved are the Bank of England and the FCA. Four types of FMI’s can apply to be FMI sandbox participants:\nAs previously reported, there’s quite a bit of leeway regarding the end users that are not sandbox entrants.\nApart from defining the sandbox, the statutory instrument goes through various pieces of legislation and defines which clauses will be waived or altered in the sandbox.\n","create_date":"2023-12-18T18:34:07+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/etfs-and-mutual-funds-are-all-going-to-be-on-blockchain-says-franklin-templeton-ceo/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Jenny Johnson CEO of asset manager Franklin Templeton says all ETFs and mutual funds will be on blockchain eventually.","title":"ETFs and mutual funds are all going to be on blockchain, says Franklin Templeton CEO - Ledger Insights - blockchain for enterprise","content":" Jenny Johnson, President and CEO, Franklin Templeton has long been a blockchain fan. “Eventually I think ETFs and mutual funds are all going to be on blockchain,” she told Bloomberg TV last week. The asset manager issued a money market fund on blockchain, which was the largest blockchain-based treasury fund until last week. The Franklin Onchain US Government Money fund has a market capitalization of $367 million and more than four hundred token holders. It was recently pushed into second spot by BlackRock’s institutionally targeted BUIDL fund.\nMs Johnson spoke about the benefits of blockchain. She discussed how the SEC required the asset manager to run the blockchain-built record of shareholders alongside their existing in-house system for six to eight months. “We were astonished about how less costly it was to run it on blockchain. It’s a very efficient technology,” she said.\nWhile this sort of benefit sounds like it would appeal mainly to accountants, it impacts most businesses, especially anything involving transactions. She went on to explain how it reduces the need for counterparties to reconcile because everybody shares the same single source of data.\n“So that drives out a lot of costs. When you drive out the friction in transactions, you can start to invest in new areas,” said Ms Johnson.\nShe’s also interested in new opportunities, such as the possibility of investing in a music track license to earn a tiny amount of money every time a track is played.\nAt the same time, the Bloomberg interviewer asked about the risks with digital assets and whether retail investors understand what they’re investing in.\n“There’s a lot of areas that are risky which is why you want good advice if you are investing in the digital asset or the crypto world,” said Ms Johnson. “But there’s also really interesting investment opportunities in that space. But it is a challenge, and you can definitely step on some landmines.”\nThat’s one of the reasons why Franklin Templeton runs a digital asset course for financial advisors. While other asset managers are starting to get interested in blockchain, to our knowledge only Franklin Templeton runs staking nodes on multiple blockchains – Provenance, Cardano, Stellar, Ethereum, Polkadot and Solana.\n","create_date":"2024-05-13T16:10:42+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/securitize-47m-funding-led-by-blackrock-tradeweb/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Tokenization startup Securitize raised $47m in funds led by BlackRock. Hamilton Lane and bond trading platform Tradeweb also invested","title":"Tradeweb joins Securitize's $47m funding led by BlackRock - Ledger Insights - blockchain for enterprise","content":" Yesterday tokenization firm Securitize announced a $47 million funding round led by BlackRock. Other backers include Hamilton Lane, Parafi Capital and Tradeweb Markets. Securitize has a long standing working relationship with Hamilton Lane. The most newsworthy addition is Tradeweb Markets, one of the big three global players in the trading of bonds and other fixed income securities.\nIn March BlackRock launched its first digital fund on the Ethereum blockchain, the BlackRock USD Institutional Digital Liquidity Fund (BUIDL), a money market fund that aims to offer a stable $1 value. At the time it mentioned investing in Securitize, which acts as the transfer agent, tokenization platform and placement agent for BUIDL. Joseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, joins the Securitize board.\nSecuritize has been working with alternative asset manager Hamilton Lane for some time. “Hamilton Lane has a deep history with Securitize, having partnered initially in 2022 and since then enabling access to our Senior Credit Opportunities Fund (SCOPE) as well as our Equity Opportunities Fund V,” said Juan Delgado, Hamilton Lane Co-CEO.\n“We are committed to making the private markets accessible to a broader set of investors, including through digital first, token-based technology. Securitize continues to be a leader in this space.”\nWith the latest funding, the cumulative amount raised is around $150 million. Securitize raised $13m in seed funding from crypto firms such as Ripple, Blockchain Capital, and Coinbase. Subsequently, it attracted numerous backers from traditional finance (TradFi). Its $14m Series A included Santander Innoventures, MUFG and Nomura. SBI and Sony Financial Ventures joined an extension. In 2021 it raised a $48 million Series B led by Blockchain Capital and Morgan Stanley Tactical Value Investing. Other investors included IDC Ventures, NTT Data and Sumitomo Mitsui Trust Bank.\n","create_date":"2024-05-02T10:25:48+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/world-bank-to-issue-swiss-digital-bond-settled-in-wholesale-cbdc/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The World Bank confirmed the issuance of a digital bond next month on the SIX Digital Exchange, to be settled with a wholesale CBDC","title":"World Bank to issue Swiss digital bond settled in wholesale CBDC - Ledger Insights - blockchain for enterprise","content":" Yesterday the World Bank announced it has priced a CHF 200 million digital bond to be issued on June 11 on the SIX Digital Exchange (SDX) and settled using the Swiss Franc wholesale central bank digital currency (wholesale CBDC). The Swiss National Bank (SNB) is currently in pilot mode for its wholesale CBDC on the SDX DLT platform as part of Project Helvetia. Several digital bonds have used it for settlement. However, the World Bank, or rather the International Bank for Reconstruction and Development (IBRD), is the first international issuer to use the wCBDC.\nJust last month the World Bank’s treasurer, Jorge Familiar, pondered a possible issuance at an SNB event. A month on, the seven-year, Aaa/AAA rated security is ready to launch.\n“This achievement marks another significant step in the World Bank’s commitment to increasing capital markets’ efficiency through digitalization in partnership with central banks and central securities depositories,” said Mr Familiar.\nThe bond has mainly been placed in Switzerland with 60% allocated to banks and corporates. Institutional investors make up 39% and central banks and official institutions the balance. Commerzbank is the sole lead manager as well as paying and issuer agent for the bond. Coupons and redemption payments will be made using tokenized CHF. However, unless the wCBDC gets the formal green light, that might be tokenized CHF issued by SDX. That was the case before the Helvetia pilot.\nIn November 2022, UBS debuted a CHF 375 million digital bond on SDX. For the first time it linked the SDX central securities depository (CSD) to the main SIX SIS CSD. This allowed a dual listing on both SDX and SIX main exchange, supporting institutions not yet ready for blockchain. With the passage of time, SDX has integrated with Clearstream and Euroclear, enabling the World Bank’s bond to settle through four different CSDs.\nOn the topic of Euroclear, last year the World Bank issued a digital note on Euroclear’s D-FMI infrastructure. Plus, it was the first major institution to adopt blockchain for bonds in 2018 with the bond-i issuance. Like the European Investment Bank (EIB), it is one of the most prolific digital issuers.\nMeanwhile, the digital bonds that were previously settled using the wCBDC include issuances by Basel, Zurich, Lugano and St Gallen.\n","create_date":"2024-05-16T09:44:40+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/digital-euro-unlikely-to-launch-before-2028-2029-bundesbank/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The digital euro is likely to launch in 2028/29 according to Dr Joachim Nagel, the President of the Deutsche Bundesbank. Rather than 2026.","title":"Digital euro unlikely to launch before 2028/2029 - Bundesbank - Ledger Insights - blockchain for enterprise","content":" During a speech this week, Dr Joachim Nagel, President of the Deutsche Bundesbank, implied that Europe’s central bank digital currency (CBDC) will launch in 2028/2029. Previously 2026 was mentioned as a potential digital euro launch date by European Central Bank (ECB) President Christine Lagarde, former ECB Director Fabio Panetta, and François Villeroy de Galhau, the Governor of the Banque de France.\nThe ECB made a decision to progress to the two year preparation phase on schedule in October 2023.\nHowever, this week Dr Nagel said, “A digital euro won’t be introduced any time soon. It may take another four or five years before it is actually implemented.”\nSo why the delay? A CBDC needs the approval of parliament. Parliament recesses tomorrow for the June elections, and the balance of power could shift after that. There’s no digital euro legislation on the agenda for voting this week. Last year another Bundesbank board member, Burkhard Balz, observed, “If not completed, the legislative procedure will start again from scratch with the new Parliament.”\nAs it turned out, the first draft was published last June. Initially there was considerable conservative pushback.\nHowever, two parliamentary committees heard an amended draft this February, with the European Committee on Civil Liberties and Justice (LIBE) voting in favor. Given that privacy and civil liberties are contentious issues for the digital currency, the favorable vote indicated a good chance the legislation would have passed in the current parliament. But who knows what might happen in the next one?\nHence, 2025 is the earliest date for legislation. That will likely delay development because the legislation will impact the digital euro’s design.\nDuring his speech Dr Nagel outlined the reasons he believes a digital euro can be good for all parties. For consumers it offers a digital means of offline and online payment which is safe, free and usable throughout the euro area. Banks can use the digital euro as a base for innovation and need not fear deposits migrating to the CBDC. Dr Nagel argued that’s because users won’t earn interest on digital euros and there will be holding limits.\nOne of the biggest beneficiaries could be merchants. “Today, retailers often feel obliged to offer their customers a variety of payment solutions, some of which are quite expensive,” said Dr Nagel. “The digital euro would increase competition in the payments market. Merchants could negotiate lower transaction fees with private payment service providers.”\nAn even bigger benefit for merchants is they would receive payments instantly.\n","create_date":"2024-04-24T12:21:25+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/jp-morgan-backed-tokenized-deposit-firm-partior-names-new-ceo/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Partior, the interbank blockchain payment network, has a new CEO and its three settlement banks are live on the tokenized deposit network","title":"JP Morgan-backed tokenized deposit firm Partior names new CEO - Ledger Insights - blockchain for enterprise","content":" In January we reported the abrupt departure of CEO Jason Thompson from Partior, which has finally announced his replacement as Humphrey Valenbreder from bunq, the Dutch neobank. Singapore-based Partior has created an interbank blockchain network for wholesale cross border payments that maintains the correspondent banking model but uses tokenization for speed, round-the-clock payments and automation. It was founded by DBS Bank, JP Morgan, Standard Chartered and Temasek. In related news, all three settlement banks are now operational on the platform.\nFormer CEO Thompson and Mr Valenbreder have some things in common. Both have a commercial focus (Valenbreder was acting CCO at Bunq) and worked at unicorns before joining Partior. However, one major difference is that Valenbreder previously spent long stints at traditional banks, mainly with ABN Amro, but also with the Royal Bank of Scotland.\nJP Morgan was first to go live on the Partior network late last year after receiving the approval of the United States Office of the Comptroller of the Currency (OCC) a year ago. However, a single active bank on the network isn’t that useful, especially given JP Morgan has its own blockchain network.\nHence, the integration of DBS and Standard Chartered with the platform is big news. The initial supported currencies are U.S. dollars, Euro and Singapore dollars in five jurisdictions: Singapore, New York, Frankfurt, London and Hong Kong. Additionally it has a pipeline of more than 30 institutions looking to integrate.\nWith correspondent banking via Swift, there’s the separation of the message and money movement. The three founding Partior banks still act as correspondents, so there’s no removal of intermediaries. However, if a smaller bank wants to send a payment via one of them, compliance checks are done first, and then the tokenized payment is sent and arrives at its destination in minutes, including at night and weekends. What Partior enables is faster transactions with programmability supporting automated workflows.\nSince the BIS coined the term Unified Ledger, Partior likes to call itself a Unified Ledger. Beyond cross border payments, the company is now working on its second solution, intraday FX swaps.\nEarlier this year, Partior signed a Memorandum of Understanding with the Qatar Financial Centre (QFC). While the details were thin on the ground, it’s likely Qatar will explore connectivity with the network. Partior founder JP Morgan has been actively deploying its single bank blockchain-based network JPM Coin Systems in the Middle East.\nLedger Insights will soon publish a report on bank-issued stablecoins and tokenized deposits. Sign up for notification of its release.\n","create_date":"2024-05-13T18:19:41+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/fireblocks-plans-to-become-new-york-custodian-launches-custodian-partner-program/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Fireblocks plans to become a New York regulated custodian. It also launched a global custodian partner program","title":"Fireblocks plans to become New York custodian. Launches custodian partner program - Ledger Insights - blockchain for enterprise","content":" Today Fireblocks announced the planned launch of the Fireblocks Global Custodian Partner Program for licensed global custodians. This will enable clients using the Fireblocks Network to access multiple custodians. In addition Fireblocks announced it has applied to the New York State Department of Financial Services (NYDFS) for a limited purpose trust charter to provide cold storage for digital assets.\nWhile Fireblocks is known for its security and custody technology, it is not a regulated custodian. Hence, its application for a trust charter might appear to compete with clients and even investors such as BNY Mellon, the world’s largest custody bank. Its deal with BNY Mellon put the company on the industry map in 2021.\nHowever, banks in the United States are currently locked out of providing crypto custody. That’s despite a resolution passed in Congress this week to overturn the SEC SAB 121 rule preventing banks from providing digital asset custody. The White House has vowed to veto the resolution if the Senate also votes in favor.\nIt’s often highlighted that the crypto that underpins the hugely popular Bitcoin ETFs is not held in custody by banks. Most of it is held by Coinbase Custody and Fidelity Digital Assets Services, which both hold NYDFS trust charters.\nAdditionally, competitors with licenses are able to provide custody solutions in the United States. The SEC has proposed tougher safeguarding requirements for registered investment advisors (RIAs), and others have launched solutions to address this.\nFireblocks is particularly targeting RIAs, asset managers and ETF issuers, as well as other institutional participants.\nApart from custody technology, a larger part of Fireblock’s business is now the Fireblocks Network, which connects to exchanges, on and off ramps, staking, and many other services. Several custodians are already integrated with the Fireblocks Network to enable their clients to access these services. They include institutional custodians such as Standard Chartered’s Zodia Custody and Nomura-backed Komainu.\nHence, the Fireblocks Global Custodian Partner Program appears to be formalizing this process.\nIt plans to go live with the partner program during the current quarter in the United States, the United Arab Emirates, the United Kingdom, Singapore, Thailand, and Australia.\nUpdate: edited the paragraph regarding competition making it more succinct\n","create_date":"2024-05-10T18:28:39+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/mastercard-executes-first-tokenized-deposit-transactions-with-stanchart-subsidiaries/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Mastercard executed its first live test of the Mastercard Multi-Token Network with Standard Chartered Hong Kong, involving tokenized deposits","title":"Mastercard executes first tokenized deposit transactions with StanChart subsidiaries - Ledger Insights - blockchain for enterprise","content":" Mastercard has executed its first live test of the Mastercard Multi-Token Network (MTN) involving tokenized deposits and tokenized assets in collaboration with Standard Chartered Bank Hong Kong (SCBHK) and subsidiaries. Mastercard introduced MTN in mid-2023.\nThis proof of concept was completed as part of the Hong Kong Fintech Supervisory Sandbox. It involved a client of Standard Chartered’s Hong Kong digital bank, Mox Bank, buying a carbon credit. Mox requested SCBHK to tokenize the carbon credit, a task executed by Libeara, the tokenization platform incubated by Standard Chartered’s SC Ventures. Mastercard’s MTN was used to tokenize the deposit and execute an atomic swap between the tokenized deposit and the carbon credit. Ultimately the Mox client received the tokenized carbon credit in their wallet.\n“Using the Mastercard MTN, Mastercard is energized to partner with industry-leading players like SCBHK, Mox and Libeara to develop real-world applications that reshape how consumers and businesses connect, interact, and transact,” said Helena Chen, Mastercard managing director, Hong Kong & Macau.\nLedger Insights will soon publish a report on bank-issued stablecoins and tokenized deposits. Sign up for notification of its release.\nThe Hong Kong Monetary Authority (HKMA) recently launched Project Ensemble to explore wholesale CBDC and tokenized deposits. In addition, there have been multiple tokenized deposit experiments outside the project, including two by HSBC trialing tokenization with Ant (the owner of Alipay) and Visa. Alongside the four big Hong Kong banks, Ant is part of an architecture community that has launched to support the initiative.\n“The tokenization of real-world assets and the potential use of different forms of tokenized currency is integral to the future of the financial industry,” said Mary Huen, CEO of Standard Chartered Hong Kong. “Under the guidance of the HKMA, we are proud to pioneer this project with our virtual bank Mox, incubated venture Libeara, and longtime partner Mastercard, with the objective of catalyzing the adoption of tokenization in financial assets.”\nStandard Chartered Hong Kong is a participant in Ensemble as well as the eHKD retail central bank digital currency (CBDC) trials and mBridge. That’s the multi-CBDC cross border payment project involving the BIS and the central banks of Hong Kong, China, Thailand and the UAE.\n","create_date":"2024-05-15T11:23:00+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/quincy-us-municipal-bond-issued-on-jp-morgans-onyx-blockchain/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"This week JP Morgan's Onyx helped the City of Quincy issue a $10 million tax-exempt municipal bond using its permissioned blockchain","title":"Quincy US municipal bond issued on JP Morgan's Onyx blockchain - Ledger Insights - blockchain for enterprise","content":" The City of Quincy on the outskirts of Boston Massachusetts has issued a $10 million municipal bond using blockchain. JP Morgan was the sole underwriter of the tax-exempt seven year bonds and the issuance used the Onyx private permissioned blockchain.\nThis isn’t the first time JP Morgan has used distributed ledger technology (DLT) for debt issuance. In 2018 it issued a Yankee certificate of deposit for the National Bank of Canada in parallel on the blockchain.\nHowever, the Quincy issuance marks the formal launch of another application for Onyx Digital Assets, the JP Morgan Digital Debt Service. Existing Onyx tokenization solutions include intraday repo and the Tokenized Collateral Network. Additionally, Onyx has solutions for payments such as JPM Coin Systems and Liink for interbank data sharing.\n“Over time, we should see blockchain technology usher in lower issuance costs, enhanced liquidity, and reduced settlement times,” said Rick Coscia, Quincy’s strategic asset manager as reported by Bondbuyer.\nThe argument that tokenization brings additional liquidity is controversial in the blockchain sector. On the one hand, automation helps to cut issuance costs, making it viable to use smaller denominations. In turn this can make it accessible to a wider pool of people. However, many enterprise blockchain solutions currently lack integration with other networks and traditional platforms. To Mr. Coscia’s point, that should change over time.\n“I look forward to the day when Quincy residents can buy bonds to fund projects in Quincy that directly impacts and improves their quality of life,” added Quincy Mayor Thomas P. Koch.\nJoseph Lubin, the CEO of blockchain firm Consensys, voiced that sentiment when it acquired a US broker with the intention of launching “mini munis.” Most municipal bonds have minimum investment amounts of $5,000.\n“Tokenized, digital municipal bonds can help restore the muni market to its original community-driven spirit by making the securities more accessible to everyday citizen investors and more cost-effective for communities of all sizes,” said Lubin at the time. JP Morgan is a Consensys investor. We’re not aware of the Consensys subsidiary issuing municipal bonds.\nHowever, another startup Alphaledger used DLT for municipal bond issuance in late 2022.\n","create_date":"2024-04-26T09:37:18+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/subsidiary-of-government-owned-bank-emirates-nbd-inks-rwa-tokenization-deal/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Liv Digital Bank a subsidiary of state-owned Emirates NBD, has inked a deal with real world asset tokenization firm Ctrl Alt","title":"Subsidiary of Government owned bank Emirates NBD inks RWA tokenization deal - Ledger Insights - blockchain for enterprise","content":" Liv Digital Bank, a subsidiary of the UAE’s second largest bank, Emirates NBD, has inked a deal with real world asset (RWA) tokenization firm Ctrl Alt. A key driver is the perceived investment interest of millennials and Gen Z in alternative assets. These include private equity, private debt, real estate and infrastructure.\nAdditionally, people in Gen Z start investing earlier, hence the potential appeal of tokenization.\n“Liv is the first bank in the UAE to explore offering tokenised real-world asset investing opportunities to customers, and we are delighted to co-partner with a leading infrastructure provider such as Ctrl Alt for this initiative,” said Marwan Hadi, Group Head of Retail Banking and Wealth Management at Emirates NBD.\n“As the innovation incubator in Emirates NBD Group, Liv has always remained at the forefront of digital innovation, seeking to collaborate with partners to explore and experiment with technologies that are in demand globally and in the UAE.”\nMeanwhile, Emirates NBD has been a frequent blockchain user, particularly in the trade finance arena. It started working with the Dubai Chamber of Commerce on a trade finance blockchain in 2019. It also participated in UAE Trade Connect, the trade finance blockchain that started with an anti-fraud solution. Last year it invested in komgo, the Swiss-based trade finance platform backed by numerous global banks and energy firms.\n","create_date":"2024-05-08T15:12:32+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/esma-asks-if-crypto-etfs-should-be-eligible-assets-for-eu-ucits-funds/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"European securities regulator ESMA asked whether crypto ETFs should be eligible assets for UCITS funds as part of a broad eligibility review","title":"ESMA asks if crypto ETFs should be eligible assets for EU UCITS funds - Ledger Insights - blockchain for enterprise","content":" The European Securities and Markets Authority (ESMA) has opened a call for evidence regarding eligible assets for UCITS funds. UCITS make up 75% of the collective investments made by European Union retail investors. Given the list of eligible UCITS assets was last reviewed in 2007, ESMA is considering which liquid assets might be appropriate to be included in UCITS for retail investors. Hence, one of the questions is whether crypto-assets should be allowed as eligible investments and indirect exposure via crypto ETFs in particular.\nESMA wants to know which types of crypto could be considered. UCITS requires assets to be liquid, so the fact that Bitcoin and Ether make up almost two thirds of the market capitalization of all crypto is one indicator. Additionally, ESMA wants to know whether the new MiCA crypto regulations impact that assessment.\nOne issue that ESMA highlights is derivatives and some exchange traded products currently held in UCITS provide indirect exposure to assets that aren’t eligible for direct investment. For example, direct investment in real estate is not sufficiently liquid. However, a fair number of UCITS invest in real estate investment trusts (REITs).\nUCITS funds have several eligibility criteria for assets such as liquidity, risk diversification, the impact on whether units or shares can be redeemed, and the ability to calculate net asset values.\nCrypto is just one asset class in ESMA’s list of 19 items. For example, the list includes commodities such as precious metals which are not permitted as a direct investment under the current rules, although ‘ancillary liquid assets’ are allowed. Hence, the questionnaire asks about commodity ETFs which underpin several UCITS. Other assets on the list include unlisted equities, real estate, emission allowances and asset backed securities.\nThe call for evidence closes on August 7.\nMeanwhile, ESMA has legal responsibility for establishing rules and procedures for the MiCA crypto asset regulations. In March it finalized the rules for registering as a crypto asset service provider (CASP) or for incumbents to notify their regulator about planned CASP activities. It recently shared feedback following a consultation on when an asset is considered a security versus a crypto. Plus, there was another consultation on crypto promotions from third country CASPs.\n","create_date":"2024-05-09T12:33:44+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/credit-agricole-backed-blockinvest-receives-funding-from-open-venture-to-expand-tokenization-solution/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Today BlockInvest announced funding from venture capital firm Open Venture to expand its tokenization solution","title":"Credit Agricole-backed BlockInvest receives funding from Open Venture to expand tokenization solution - Ledger Insights - blockchain for enterprise","content":" Today tokenization firm BlockInvest announced that Italian venture capital firm Open Venture has made a strategic investment. One of BlockInvest’s existing backers is Crédit Agricole Italia, a partner in multiple tokenization initiatives.\n“Even if the tokenization industry is gaining momentum, creating disruptive software is not enough to become the European market leader,” said Lorenzo Rigatti, CEO of BlockInvest. “Now is the right time to strengthen the company foundation for future growth.”\nTogether with Crédit Agricole Italia it worked on DLT trials with the Bank of Italy to develop a solution for mini digital bonds for SMEs. Subsequently, it continued the development with a view to offering tokenized bonds as part of the bank’s wealth management offerings.\nHowever, Crédit Agricole Italia is not its only institutional client. BlockInvest was involved with a second central bank fintech hub solution with a small Italian bank, David & Morgan. That initiative involved tokenizing non performing mortgages. Additionally, it also partnered Centotrenta Servicing to tokenize its asset backed securities (ABS) portfolio of non performing loans (NPL). Centotrenta has issued $23 billion in ABS to date. These projects used the Polygon public blockchain.\n“We are excited to join forces with BlockInvest to jointly boost the very promising market of asset tokenization both in Italy and overseas,” said Fulvio Andriolo, CEO of Open Venture. He added that it plans to partner BlockInvest “to speed up and strengthen the very potential asset of emerging companies in emerging markets. “\n","create_date":"2024-05-10T11:32:09+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/jp-morgan-to-open-up-onyx-digital-assets-to-third-party-applications/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"JP Morgan plans to open up Onyx Digital Assets to third party applications enabling others to tokenize assets on its blockchain","title":"JP Morgan to open up Onyx Digital Assets to third party applications - Ledger Insights - blockchain for enterprise","content":" Today Stephanie Lok of Onyx by JP Morgan revealed that the Onyx blockchain has now processed more than $1 trillion in notional transactions. It follows the revelation earlier this week that its blockchain handles up to $2 billion in transactions daily. The biggest announcement during the Tokenize This conference is that JP Morgan plans to open its permissioned blockchain to allow third parties to deploy apps. That would also enable others to tokenize assets on the JP Morgan blockchain.\nJPM Coin Systems, the blockchain-based account solution, is the highest profile Onyx offering. However, it has a separate group focused on Onyx Digital Assets, the area where it wants to partner with third parties. In late 2020 it unveiled an intraday repo solution (Onyx digital financing) with Goldman Sachs as a participant. Last year its Tokenized Collateral Network launched with BlackRock and Barclays as partners. The Onyx digital debt servicing offering went live last week with the issuance of a blockchain-based municipal bond by the City of Quincy near Boston.\nNext up is funds.\nLast year JP Morgan shared the results of its Project Guardian fund tokenization trials with Apollo and WisdomTree, which was discussed during the conference today.\nJP Morgan is keen to move its proofs of concept (PoCs) into live products, so that’s its current focus. “We’re working with a fund manager, distributor, (and) fund admin to really tokenize an alternative investment fund to see what that could look like,” said Ms Lok. “And that would be a first step.”\nWhile not all alternative investment funds are a good fit, the goal is to diversify the returns of alternative investments.\nOne of the pain points is limited liquidity. While blockchain’s fractionalization is often touted as a quick liquidity fix, that’s not the case at the current stage of maturity. Hence, the funds in focus have more liquidity, such as hedge fund structures and funds where it’s possible to avoid lock-ins.\nWhen asked about the biggest tokenization challenge, Ms Lok mentioned the usual standardization and blockchain interoperability issues. However, it’s clear that Onyx’s key focus is to move beyond PoCs and demonstrate return on investment by launching production solutions.\n“We’re going to need to continue building, continue proving out the use case and continue proving how much tokenization can provide operational efficiences, cost savings and also just open up new opportunities for revenue,” said Ms Lok.\n","create_date":"2024-05-10T17:35:04+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/central-bank-pakistan-blockchain-kyc-shared/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Pakistan's blockchain shared KYC platform, developed by Pakistan Banks' Association, is live and the central bank advised banks to join.","title":"Central bank promotes new Pakistan blockchain-based shared eKYC - Ledger Insights - blockchain for enterprise","content":" In March we reported that the Pakistan Banks’ Association signed a contract with Avanza Group to develop a blockchain-based shared Know Your Customer (KYC) solution. It was developed with guidance from the State Bank of Pakistan, which advised all banks to join yesterday.\n“This new platform will provide a number of benefits to banks including; timely exchange and updating of customers’ KYC/ CDD (customer due diligence) information across the banking industry through a secure digital channel, standardization of KYC/ CDD data, enhancing customer onboarding experience and cost savings for the banks,” said the central bank.\nThe advantage of using DLT is the customer data resides within the banks rather than on a centralized platform. Banks where consumers plan to join can only access the data with customer consent.\nHowever, in preparation for this article, we visited the marketing website of technology provider Avanza Group. It had been hacked. According to our basic review, the website didn’t have a firewall and used outdated software.\nWe believe the same company is working on a shared KYC platform in Bahrain.\nAnother provider, norbloc, developed a blockchain-based shared KYC platform for the UAE that launched in 2020. Norbloc was one of a group that participated in a Sri Lanka KYC proof of concept, but we don’t believe Sri Lanka moved to production. Wecan Comply also provides an institutional KYC and compliance sharing platform in Switzerland.\nOther jurisdictions that have explored blockchain for shared KYC include Australia and Spain.\n","create_date":"2023-12-19T11:48:54+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/norway-cbdc-wholesale-decision-2025/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Norges Bank plans to decide on whether Norway will issued a CBDC at the end of 2025. It will now extend research to wholesale CBDC","title":"Norway to extend CBDC research to wholesale. Decision in late 2025 - Ledger Insights - blockchain for enterprise","content":" Yesterday Norges Bank shared the results of the fourth phase of its central bank digital currency (CBDC) experiments. It doesn’t believe there is currently a need for a retail CBDC but clarified which conditions might trigger a decision. Given that tokenized deposits could provide an alternative to a retail CBDC, it will now explore a wholesale CBDC, for interbank settlement of tokenized deposits.\nThe fifth phase will run until the end of 2025 when the central bank management will have the tools to decide whether or not to proceed to launch a CBDC.\nDeliverables for stage 5 include:\nThe above is for a retail CBDC. Additionally, there will be a similar report for wholesale CBDC to support tokenized deposits and DLT securities settlement.\nNorges Bank is concerned about the risks of currency substitution and reduced national control over payment systems. That might happen if there is widespread adoption of cryptocurrencies, including foreign currency stablecoins. Alternatively, there’s the threat of BigTech payments, with or without stablecoins. Or Norwegians could adopt the digital euro CBDC.\nEven in that scenario, a retail CBDC would only be needed if the private sector doesn’t provide an alternative enabling programmable functionality, such as tokenized deposits.\nDespite mentioning the digital euro as a risk, the Norges Bank paper also considers the possibility of using the digital euro infrastructure for its own CBDC. The topic of using Europe’s TARGET payment system is also mentioned. The paper concludes.”a large part of the core of the Norwegian payment system would then be dependent on one and the same actor.”\nNorges Bank considered the digital euro infrastructure because it views developing its own CBDC infrastructure as too big a task, even in collaboration with suppliers.\nIt believes current off-the-shelf CBDC solutions won’t match its needs. However, by the time the phase 5 reports are delivered, it hopes more mature and suitable off-the-shelf offerings will be available.\nThe central bank published a separate report covering the phase 4 technology tests.\nIts primary testing platform was a permissioned version of Ethereum, Hyperledger Besu. It also spent some time testing openCBDC, the MIT solution used in Project Hamilton. In general, it said the technology is available to serve its needs. However, it believes it is too early to make technological decisions. Plus, it still needs to do more testing on privacy, scalability and security.\nOne of the more distinctive aspects of the trials was the interest in exploring multiple blockchains or ledgers. It believes different technologies will be needed for various applications. These might include programmability, mass payments, machine-to-machine (M2M) payments and offline payments.\nHence, it tested swaps and bridges between different blockchain technologies, including IOTA. It didn’t use the public IOTA DLT but tested bridging between Ethereum and IOTA technologies. That’s particularly because IOTA uses the UTXO token format, whereas Ethereum’s tokens are account-based.\nThe paper uses the terms ‘register’ and ‘ledgers’ interchangeably. “In principle, it is also imaginable that a CBDC can be transferred to private registers (using a bridge), including decentralised registers, even if this raises some issues,” says the report.\nAdditionally, the central bank published a separate paper exploring the liquidity impact of a CBDC on banks and monetary policy.\n","create_date":"2023-12-19T14:51:08+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/vodafone-links-blockchain-sim-to-tokenized-deposits/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"Vodafone's blockchain subsidiary PairPoint has linked its blockchain network to tokenized deposit networks including JP Morgan's","title":"Vodafone links its blockchain SIM to tokenized deposits - Ledger Insights - blockchain for enterprise","content":" Vodafone launched its Digital Asset Broker (DAB) blockchain network in 2022 with the aim of linking IoT devices to make financial transactions. Since then Sumitomo invested in the joint venture which has rebranded to PairPoint. Last week PairPoint’s Chief Product Officer David Palmer told Yahoo Finance that it uses DAB and account abstraction to link to tokenized deposit networks such as Onyx by JP Morgan.\nDigital Asset Broker provides blockchain middleware, so apps don’t interact with the blockchain directly. “We act as a middleman for large enterprises that wish to write to a public blockchain,” Palmer said. “These large financial services (firms) can link to Vodafone’s blockchain, it is logged there and then a smart contract using things like account abstraction, allows cross chain interoperability.”\nSo far PairPoint has focused on the economy of things using a SIM card with additional software to add an identity layer to an IoT device, turning it into a device passport. Partners have particularly utilized it for automotive applications and cargo tracking.\nHowever, Mr Palmer also discussed the potential for a broader use case for SIM cards as the hardware needed to secure digital wallets on smartphones. One of China’s state owned telecom firms, China Telecom has developed a web3 SIM card. It also supports offline central bank digital currency (CBDC) payments.\nVodafone’s prediction is there will be 5.6 billion digital wallets by 2030.\nDigital Asset Broker’s first initiative in 2022 was with Mastercard and Energy Web to trial electric vehicles autonomously communicating with charging stations. This time last year, Vodafone spun out the DAB project as a joint venture with Sumitomo Corporation taking a 20% stake, which was followed by a rebranding to PairPoint. At the time a rollout in the automotive sectors in Germany and the UK was targeted, with applications ranging from pay-as-you-drive, to charging point transactions, automatic toll payments and fleet management.\nSubsequently PairPoint inked a deal with public blockchain Aventus for cargo tracking at airports. Last December it partnered Deloitte and major shipping carrier Hapag Lloyd to use the blockchain solution for cargo identification and tracking. In between PairPoint collaborated with Chainlink Labs and InnoWave to use Chainlink’s Cross Chain Interoperability Protocol (CCIP) for electronic bills of lading (eBL) – the key ownership document when cargo is loaded onto a vessel. Vodafone is also a validator on the Chainlink network.\nSo far PairPoint’s website remains focused on business use cases rather than usage of the SIM for consumer applications. It recently joined Hyperledger with the view to integrate with Hyperledger Besu, the Ethereum client that is used in both public and private blockchains. That announcement also referred to applications in supply chains and mobility rather than broader consumer wallets.\n","create_date":"2024-05-06T10:17:39+00:00","tag":"","author":"Ledger Insights"},
{"url":"https://www.ledgerinsights.com/hana-backed-busan-digital-asset-exchange-incorporates-focuses-on-rwa-tokenization/","web_url":"https://www.ledgerinsights.com/","type":"article","description":"The operating company for the Busan Digital Asset Exchange has incorporated and been funded. It focuses on tokenized real world assets","title":"Hana backed Busan Digital Asset Exchange incorporates. Focuses on RWA tokenization - Ledger Insights - blockchain for enterprise","content":" The City of Busan, South Korea’s second largest, has long planned to launch a digital asset exchange. It flirted with numerous cryptocurrency exchanges until this February, when it finally settled on the BDX Consortium to operate the exchange for tokenized real world assets (RWA) but not crypto. Earlier this month the 11 founders injected 10 billion won ($7.4 million), triggering a six month clock until the launch of the exchange.\nThe biggest names in the BDX Consortium are Hana Bank and Hana Securities. However, the group is led by ITcen, a listed IT consultancy that also operates a gold digital asset exchange, Korda. Other backers include Main Street Ventures, NHN Cloud, Barunson, Ocon, Optimus Block Korea, and Withers Partners Korea.\nFebruary’s announcement outlined the range of eligible assets, including gold, silver and other precious metals, commodities, intellectual property rights and carbon emission rights. Additionally it will include real estate, infrastructure and other assets such as ships. The latter links to Busan being Korea’s main port.\nLocal news reports this month said digital stocks and bonds are eligible for trading, but this was not mentioned in the February announcement. Late last year, press reports raised concerns about tokenized stocks and bonds being excluded. Hence, it appears tokenized financial instruments are a new addition.\nThe BDX CEO Sangmin Kim said, “The Busan Digital Asset Exchange will become a global leader in RWA real asset trading and a reference point for new investment and trading methods.” One distinction with Korea is its focus on retail investors. In contrast, some other jurisdictions often target accredited investors and institutions.\nKorea’s Financial News compared the BDX to Japan’s Osaka Digital Exchange (ODX), which went live with its START exchange for digital securities last Christmas Day.\nMeanwhile, several South Korean banks and security firms are planning to launch their own tokenization platforms or have formed alliances. Hana Securities plans to launch its solution later this year. And most of the country’s biggest banks have formed security token alliances.\n","create_date":"2024-05-15T16:47:38+00:00","tag":"","author":"Ledger Insights"}
]