[{"url":"https://forkast.news/frxethredemptionticket-leads-nft-sales-surge/","web_url":"https://forkast.news/","type":"article","description":"Ethereum's FrxETHRedemptionTicket tops NFT market with a significant sales increase in the last 24 hours.","title":"FrxETHRedemptionTicket leads NFT sales surge","content":" FrxETHRedemptionTicket, an Ethereum-based NFT collection, has emerged as the top performer in the non-fungible token market over the past 24 hours, with sales reaching US$4.64 million, marking a 480% increase.\nThis sales boost helped propel Ethereum to the top of the day’s blockchain rankings, CryptoSlam data shows.\nEthereum collections dominated the charts on Wednesday, as three collections claimed the top three spots.\nEthereum’s Azuki collection experienced a 263% increase in sales, amounting to US$1.54 million, the second most in the market, with transactions up by 2.67%.\nAzuki is the NFT market’s eighth all-time sales leader with US$1.1 billion\nBored Ape Yacht Club (BAYC), another Ethereum stalwart, saw a slight uptick of 51% in sales, reaching US$1.51 million for the day’s third rank.\nOn the Bitcoin platform, $JIGO BRC-20 NFTs also enjoyed a rise, with sales climbing 3.65% to US$1.33 million and transactions growing by 92%.\nMad Lads, a Solana-based collection that led yesterday’s sales, recorded US$1.32 million with an 18% sales decrease.\nDespite the dip, Mad Lads managed to stay in the top five.\nFroganas, another Solana-based collection that topped the rankings earlier this week continued to fall, adding on to Tuesday’s 20% sales decrease.\nOn Wednesday, it barely hung on in the top 10 after dropping 2.8% to US$658,014.\nThe Captainz, an Ethereum-based collection of 9,999 NFTs, trailed close behind at 11th with US$631,276.\n","create_date":"2024-03-28T02:26:04+00:00","tag":"Ethereum","author":"CryptoSlam"},
{"url":"https://forkast.news/hong-kong-sees-first-spot-bitcoin-etf-application/","web_url":"https://forkast.news/","type":"article","description":"Hong Kong could welcome its first spot Bitcoin ETF, courtesy of Harvest Global's recent filing.","title":"Hong Kong sees first spot Bitcoin ETF application","content":" Harvest Global has submitted an application for a spot Bitcoin exchange-traded fund (ETF) to the Hong Kong Securities and Futures Commission (SFC), Tencent News reported.\nA spot Bitcoin ETF, if approved, would allow investors to trade shares of the fund on a traditional stock exchange, with the shares directly linked to the actual price of Bitcoin, the world’s largest cryptocurrency by market capitalization. This ETF would provide a regulated investment vehicle for both retail and institutional investors, potentially attracting a new wave of participants to the crypto market.\nThe move by investment management firm Harvest Global comes at a time when Hong Kong is positioning itself as a more crypto-friendly jurisdiction.\nThe application was filed amid growing interest in cryptocurrency investment products that offer exposure to digital assets without the need for investors to hold the assets directly.\nIn the U.S., the Securities and Exchange Commission approved 11 spot Bitcoin ETF applications earlier this month, allowing the funds to start trading for the first time in the world’s largest economy.\nBlackRock, the world’s largest asset manager, became the first of the 11 Bitcoin ETFs to cross US$2 billion in assets under management since the funds launched.\n","create_date":"2024-01-30T02:20:30+00:00","tag":"Hong Kong","author":"CryptoSlam"},
{"url":"https://forkast.news/headlines/binance-fined-by-dutch-central-bank-for-improper-registration/","web_url":"https://forkast.news/","type":"article","description":"Cryptocurrency exchange Binance has been fined in the Netherlands for operating without proper registration, the Dutch central bank said on Monday.","title":"Binance fined by Dutch central bank for improper registration","content":" Cryptocurrency exchange Binance has been fined in the Netherlands for operating without proper registration, the Dutch central bank said on Monday.\nSee related article: Binance gets nod from Spain to offer crypto exchange, custody services\nSee related article: SEC said to probe Binance for rule violation in 2017 initial coin offering: report\n","create_date":"2022-07-19T10:56:22+00:00","tag":"Binance","author":"Timmy Shen"},
{"url":"https://forkast.news/headlines/binance-spent-over-us1b-on-compliance-founder-changpeng-zhao-says/","web_url":"https://forkast.news/","type":"article","description":"Binance founder and CEO Changpeng Zhao Monday said the world’s largest cryptocurrency exchange by trading volume spent over US$1 billion on compliance efforts","title":"Binance spent over US$1B on compliance, founder Changpeng Zhao says","content":" Binance founder and CEO Changpeng Zhao Monday said the world’s largest cryptocurrency exchange by trading volume spent over US$1 billion on compliance efforts with its market share continuing to increase.\nSee related article: Binance’s Changpeng Zhao sues Bloomberg publisher in HK\nSee related article: Binance fined by Dutch central bank for improper registration\n","create_date":"2022-08-02T11:25:18+00:00","tag":"Binance","author":"Timmy Shen"},
{"url":"https://forkast.news/bitcoin-etf-quiet-800-pound-gorilla-roar/","web_url":"https://forkast.news/","type":"article","description":"The general public does not know this yet, but there is no longer any doubt that a Bitcoin spot ETF will come soon to the US market. It's just a matter of when.","title":"Bitcoin ETF: The quiet 800-pound gorilla is about to roar","content":" A Bitcoin ETF will likely be approved in the U.S. by the end of 2023. The general public has no idea this is about to happen. Even crypto natives, dismayed by depressed markets and a decade of rejections by the Securities and Exchange Commission, are somehow brushing off the current state of affairs.\nBitcoin exchange-traded funds have been highly sought after since 2013 when the first application was submitted to the SEC and subsequently rejected. Over the past 10 years, the SEC has denied each of the several dozen ensuing proposals, including over 30 just since 2021. There are currently 10 active applications from major institutions. An uninformed observer may expect more of the same rejection, but this would be naive.\nTwo substantial developments in the past three months have drastically improved the prospects of an approval. Let’s take a look at these developments and consider whether or not a spot ETF could revitalize Bitcoin and lift crypto out of its bear market.\nMomentum kicked off on June 15 this year when BlackRock made waves by unexpectedly submitting a Bitcoin ETF application.\nBlackRock CEO Larry Fink has spoken favorably about Bitcoin since then. Bitcoin “has a differentiating value versus other asset classes, but more importantly, because it’s so international it’s going to transcend any one currency,” Fink said. His change of tune is remarkable as he previously denounced Bitcoin as an “index of money laundering” back in 2017.\nBlackRock’s track record of ETF application approvals is nothing short of superb. The asset management giant has submitted 576 applications and all but one have been approved. Have the Bitcoin ETF tea leaves adjusted, and BlackRock taken note? BlackRock’s 99.8% approval rate suggests so.\nSeveral other high-profile institutions including Fidelity and Ark Invest have followed suit with pending applications under review. Their filing dates and decision deadlines are largely identical. There are four deadlines during the review process in which the commission may, and often does, opt for delay and further review.\nWhether the SEC decision arrives early or not until final deadlines, the caliber of the institutions currently applying and their optimism are signaling one result: approval.\nA separate but equally significant development in the direction of ETF approval is the Aug. 29 federal court ruling that the SEC was wrong to deny Grayscale Investments’ filing for a spot Bitcoin ETF. Grayscale previously applied to convert their Grayscale Bitcoin Trust (GBTC) to an ETF. The SEC denied this application, and Grayscale responded with a lawsuit arguing that the decision was incorrect. The U.S. Court of Appeals for the District of Columbia sided with Grayscale in its decision stating “In the absence of a coherent explanation, this unlike regulatory treatment of like products is unlawful.” The court also ruled that the SEC’s “denial of Grayscale’s proposal was arbitrary and capricious.”\nThe court ordered the SEC to once again review Grayscale’s application, effectively reversing the previous rejection.\nWhile the ruling does not equate to automatic approval, it strengthens the odds that approval is on the horizon. The SEC would need to provide strong support for further rejection. This begs the question: If such support exists, would it not have been included in their original rejection?\nWhile the SEC recently delayed all ETF applications on Sept. 1, as most applicants’ first deadline for review was on Sept. 2, the delays were largely expected. The market responded accordingly with Bitcoin dropping about 5% from the delay announcement to around US$25,700 at the time of this writing. Despite the delays, the path to a spot ETF approval is much clearer after Grayscale’s win in court. JPMorgan analysts believe this, as well as former SEC Chair Jay Clayton who says approval is “inevitable.”\nIt is reasonable to expect the SEC to approve several or even all of the filings at once. The applications are structured very similarly, and it may be considered unfair to grant any of the applicants a head start. Cathie Wood, the CEO of Ark Invest, told Bloomberg: “I think the SEC, if it’s going to approve a Bitcoin ETF, will approve more than one at once.” Ark Invest has the earliest “final deadline” for its filing, which is slated for Jan. 10, 2024.\nEric Balchunas, a senior ETF analyst for Bloomberg Intelligence, believes there is a 75% chance of a spot Bitcoin ETF getting SEC approval this year. He ups the odds to 95% by the end of 2024.\nIf SEC approval is inevitable, how might we expect markets to respond?\nBitcoin ETFs already exist in the European Union, Canada, Brazil and Dubai. But as the U.S. is the center of world financial markets, including crypto markets, approval by its government would undeniably be a major event.\nAn ETF would shuttle new money into Bitcoin. While crypto exchanges such as Coinbase are the primary avenue for entering crypto today, the average American understandably has trust issues with them. KYC (know-your-customer) procedures and having to transfer funds to purchase crypto are also onerous as opposed to simply buying an ETF share. Crypto wallets, private keys and self-custody complicate matters further.\nThe institutions applying for a Bitcoin ETF deeply understand these hurdles. They know an ETF is an opportunity for a large segment of the population, who have thus far remained sidelined, to comfortably begin adding crypto exposure to their portfolio.\nBitcoin spot ETFs, in contrast to futures ETFs — which have traded in the U.S. since 2021 — may be particularly constructive to crypto markets. Spot ETFs, the type that all current applicants are applying for, would require the offering institutions to back the ETF with real Bitcoin. This differs from futures ETFs, which merely enable investors to trade an indexed derivative. In the case of futures ETFs, Bitcoin does not actually change hands. A new buyer of a spot ETF has a genuine positive impact on the price of the underlying asset.\nAnother way of thinking about a futures-based ETF is like two people betting on how the price of something will change. It’s more akin to a side bet on what will happen. Their bet has no direct effect on the price of the asset they are betting on.\nA Bitcoin spot ETF issuer such as BlackRock or Fidelity must buy bona fide Bitcoin to back the shares of the fund that their customers hold. A Bitcoin spot ETF buy or sell will actually change the price of BTC.\nThe new source of fund flows into the space may provide the spark the industry needs to recover from a series of blows in 2022. The news itself will almost certainly cause a rush of buying in the short term. The volatility will breathe new life into the markets which have largely been subdued throughout this summer. The Grayscale decision on Aug. 29 produced a near immediate 6% Bitcoin price increase from US$26,100 to US$27,700. This increase fully re-traced on news of the SEC’s choice to delay all of the outstanding applications on Aug. 31 as the first decision deadline for most filings approached.\nIf the ETF is approved, it is possible that market gains will extend longer than only in the short term.\nIn the short to medium term, a reflexivity loop may be created whereby:\nBitcoin price increases on ETF approval news.\n⬇\nInvestors desire Bitcoin allocation due to price increases.\n⤹ ⤴\nInvestors purchase shares in a spot ETF, which drives Bitcoin prices up further.\nIn the long term, we will see BlackRock et al shepherding clients to diversify part of their portfolio into Bitcoin. Passive investors will buy and hold for the long term. As Bitcoin’s supply is finite, the price is bound to be driven upward.\nGold appreciated eight years in a row after the initial spot Gold ETF was approved back in 2004. For all proclamations of Bitcoin as “digital gold,” it would be fitting for Bitcoin’s next upward cycle to similarly commence following ETF approval.\nThe world is not paying attention to Bitcoin at the moment. That will change before the year ends.\n","create_date":"2023-09-08T11:05:00+00:00","tag":"BTC - Bitcoin","author":"Charlie McGlynn"},
{"url":"https://forkast.news/unlicensed-crypto-exchanges-face-shutdown-hong-kong/","web_url":"https://forkast.news/","type":"article","description":"Only two exchanges are licensed to provide crypto trading services to Hong Kong’s retail sector so far.","title":"Unlicensed crypto exchanges face shutdown in Hong Kong","content":" Hong Kong’s financial regulator has issued a warning to cryptocurrency exchanges: obtain a license or shut down.\nThe Securities and Futures Commission (SFC) said that all crypto trading platforms operating in the city must apply for a license by the end of the month. All exchanges that fail to do so will be shut down by May 31.\nThe SFC’s ultimatum is part of a broader effort to bring cryptocurrency trading into the regulatory fold.\nLast June, Hong Kong opened up a licensing regime for crypto exchanges as part of the city’s plans to develop its market into a regional digital assets hub.\nExchanges in Hong Kong must obtain licenses from the SFC to offer crypto trading services to the retail sector.\nLast August, exchanges HashKey and OSL became the first exchanges permitted to serve the retail sector in Hong Kong.\nThe SFC has yet to approve any other application.\n","create_date":"2024-02-07T01:29:06+00:00","tag":"Hong Kong","author":"CryptoSlam"},
{"url":"https://forkast.news/bitcoin-jesus-arrested-for-us50-mln-tax-fraud/","web_url":"https://forkast.news/","type":"article","description":"Cryptocurrency figure Roger Ver faces extradition to the U.S. on tax evasion and fraud charges.","title":"Bitcoin 'Jesus' arrested for US$50 mln tax fraud","content":" Roger Ver, a cryptocurrency entrepreneur and Bitcoin Cash promoter, was arrested in Spain on charges of evading nearly US$50 million in U.S. taxes and committing mail fraud, according to the Department of Justice.\nThe indictment alleges that Ver failed to report capital gains from his substantial Bitcoin assets after renouncing his U.S. citizenship in 2014.\nThe DOJ is now seeking Ver’s extradition to face trial in the United States.\nThe case against Ver alleges that he and his companies, MemoryDealers and Agilestar, held approximately 131,000 Bitcoins in 2014, with the companies owning 73,000 of those.\nDespite selling tens of thousands of Bitcoins for around US$240 million in November 2017, Ver allegedly failed to disclose these gains to the Internal Revenue Service (IRS).\nThe indictment accuses him of providing false information to a law firm and an appraiser to hide the true size of his Bitcoin holdings.\nVer is known for promoting Bitcoin Cash, a Bitcoin spinoff.\nHe obtained the nickname “Bitcoin Jesus” as an early promoter of Bitcoin.\n","create_date":"2024-05-01T14:39:49+00:00","tag":"BTC - Bitcoin","author":"CryptoSlam"},
{"url":"https://forkast.news/cryptopunks-leads-daily-nft-sales-with-over-us1-39-million/","web_url":"https://forkast.news/","type":"article","description":"CryptoPunks tops daily NFT sales, Ethereum blockchain sees significant activity, and DMarket maintains strong buyer engagement.","title":"CryptoPunks leads daily NFT sales with over US$1.39 million","content":" CryptoPunks dominated the non-fungible token (NFT) market with a US$1.39 million daily sales volume on May 12, according to CryptoSlam data.\nMost of those sales came from CryptoPunk 741, which sold for almost US$800,000 at the Larva Labs marketplace. The NFT’s last on-chain sale occurred seven years ago, for US$400.\nCryptoPunk 741 is now the eighth-highest-valued CryptoPunk in the collection.\nThe second-ranking collection for the day was DMarket, which operates on Mythos Chain, a blockchain specialized for Web3 gaming applications. Dmarket had US$945,383 in daily sales, the third consecutive day above the US$900,000 mark.\nSunday’s sales total follows a monthly high of over US$970,000 on Friday.\nDMarket’s all-time sales volume now stands at US$427.16 million.\nNodeMonkes, the all-time leader among Bitcoin collections, claimed the third spot with sales of US$565,277, a decrease from the previous day’s US$1.21 million.\nOutside the top three in the NFT market, Pudgy Penguins saw a daily sales volume of US$473,136, and $CORE BRC-20 NFTs, recorded US$450,912.\nSolana Monkey Business, on the Solana blockchain, reported sales of US$429,598 for the day’s sixth spot, followed by $LTC+ BRC-20 NFTs, Mad Lads, and $π BRC-20 NFTs.\nSunday’s sales pushed the Ethereum blockchain, home to the CryptoPunks collection, to the top of the blockchain rankings for NFT sales.\nThe network reported a total sales volume of US$5.24 million on Sunday, a 25.6% increase from US$4.17 million the previous day.\nThe Bitcoin blockchain trailed behind with US$5.08 million in daily sales, as Solana posted US$2.67 million.\n","create_date":"2024-05-13T07:34:46+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/headlines/binance-sec-probe-ties-trading-affiliates/","web_url":"https://forkast.news/","type":"article","description":"The U.S. securities watchdog has launched a probe into crypto exchange Binance’s relationship with two trading firms with ties to founder Changpeng Zhao, the","title":"Binance US under probe for ties with trading affiliates: report","content":" The U.S. securities watchdog has launched a probe into crypto exchange Binance’s relationship with two trading firms with ties to founder Changpeng Zhao, the Wall Street Journal reported.\n","create_date":"2022-02-16T12:51:59+00:00","tag":"Binance","author":"Timmy Shen"},
{"url":"https://forkast.news/ethereum-leads-nft-market-with-over-us10-million-in-sales/","web_url":"https://forkast.news/","type":"article","description":"Ethereum sees a slight increase in NFT transactions, while Bitcoin and Solana experience declines in the past 24 hours.","title":"Ethereum leads NFT market with over US$10 million in sales","content":" Ethereum led the non-fungible tokens (NFT) market in sales on Thursday by racking up US$10.48 million in the 24 hours to 12 p.m. ET, according to CryptoSlam data.\nEthereum, which also leads the industry in all-time NFT sales with US$43.46 million, had a 42% surge in sales volume to top the day’s rankings as the only chain with at least US$10 million in sales.\nPandora, a collection of 10,000 “Replicants” enabled by the ERC-404 experimental token standard, had a 279% surge to US$1.61 million to help Ethereum.\nAll NFT collections on Thursday were from Ethereum, all pitching in at least US$1 million each.\nBitcoin and Solana, ranking second and third respectively, saw their sales dip over the past day.\nBitcoin’s NFT market faced a downturn, with sales dropping by 22.41% to reach US$6.61 million.\nSolana, holding the third position, also encountered a decline in sales by 18.32%, totaling US$6.12 million.\nPolygon, which ranks fourth, experienced a significant sales drop of 29.31%, with sales amounting to US$784,579.\nPolygon’s Thursday slump slows down its progress to its US$1.5 billion NFT sales milestone, which is about US$4.3 million.\n","create_date":"2024-04-05T00:47:56+00:00","tag":"Ethereum","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-executive-detained-nigeria-ceo-release/","web_url":"https://forkast.news/","type":"article","description":"Binance CEO demands freedom for compliance officer held on illegal transaction charges in Nigeria.","title":"Binance CEO calls for release of executives detained in Nigeria","content":" Binance Chief Executive Officer Richard Teng has demanded the release of Tigran Gambaryan, the cryptocurrency exchange’s executive, who has been detained in Nigeria since late February on allegations of illegal transaction profits.\nTeng’s blog post on Tuesday highlighted the tension between the Nigerian government’s crackdown on cryptocurrency operations and the safety of international corporate staff.\nGambaryan has a history of fighting financial crime in his previous role as a U.S. Internal Revenue Service agent and his efforts in freezing and seizing over US$2.2 billion in assets in collaboration with law enforcement worldwide, according to Teng.\nTeng added that Gambaryan was in Nigeria for policy discussions and not as a negotiator.\n“To invite a company’s mid-level employees for collaborative policy meetings, only to detain them, has set a dangerous new precedent for all companies worldwide,” said Teng.\nThe conflict between Binance and Nigerian authorities escalated when Gambaryan was detained on February 26, following accusations of the company’s involvement in illegal financial activities.\nThis development is part of a larger regulatory push in Nigeria, where the government is preparing to prohibit peer-to-peer crypto exchanges that use the Nigerian naira.\nThe Nigerian Securities and Exchange Commission is in the process of implementing new rules to safeguard the local currency from potential manipulation.\nGambaryan is set to stand trial on May 17 on charges including tax evasion, currency speculation, and money laundering.\n","create_date":"2024-05-07T14:39:33+00:00","tag":"Binance","author":"CryptoSlam"},
{"url":"https://forkast.news/headlines/binance-pulls-back-australia-regulatory-pressure/","web_url":"https://forkast.news/","type":"article","description":"Embattled crypto exchange Binance — the largest in the world by trading volume — is ending its derivatives trading in Australia by year's end.","title":"After Singapore, Binance pulls back from Australia under regulatory pressure","content":" Following similar moves in Singapore, embattled crypto exchange Binance — the largest in the world by trading volume — is ending its derivatives trading in Australia by year’s end, according to a company blog post on Tuesday.\n\n","create_date":"2021-09-22T13:47:00+00:00","tag":"Australia","author":"Lachlan Keller"},
{"url":"https://forkast.news/headlines/sec-probes-binance-bnb-ico-2017/","web_url":"https://forkast.news/","type":"article","description":"The SEC is reportedly looking into whether Binance violated rules regarding the sale of securities when its BNB token was sold through an ICO in 2017.","title":"SEC probes Binance’s BNB for initial coin offering in 2017: report","content":" The Securities and Exchange Commission (SEC) is reportedly looking into whether Binance violated any rules regarding the sale of securities when its BNB token was sold through an initial coin offering (ICO) in 2017.\nSee related article: Binance’s venture arm raises US$500 mln to invest in Web3, blockchain\nSee related article: Binance US under probe for ties with trading affiliates: report\n","create_date":"2022-06-07T10:53:16+00:00","tag":"Binance","author":"Timmy Shen"},
{"url":"https://forkast.news/hong-kong-pushes-ahead-with-crypto-hub-plans-as-tech-firms-startups-show-interest-financial-secretary/","web_url":"https://forkast.news/","type":"article","description":"Hong Kong will continue pushing ahead with the development of the Web 3.0 industry as it aims to become a regional hub for the nascent industry despite the series of collapses of crypto exchanges, said Paul Chan, the city’s financial secretary on Monday.","title":"Hong Kong pushes ahead with crypto hub plans as tech firms, startups show interest: financial secretary","content":" Hong Kong will continue pushing ahead with the development of the Web 3.0 industry as it aims to become a regional hub for the nascent industry despite the series of collapses of crypto exchanges, said Paul Chan, the city’s financial secretary, on Monday.\nSee related article: Hong Kong lawmaker says e-HKD has potential to be a stablecoin\nSee related article: Hong Kong financial service providers gear up for retail crypto traders\n","create_date":"2023-01-09T16:49:55+00:00","tag":"Hong Kong","author":"Timmy Shen"},
{"url":"https://forkast.news/binance-introduces-self-custody-web3-wallet/","web_url":"https://forkast.news/","type":"article","description":"Binance said it aims to onboard the next billion Web3 users with its new wallet.","title":"Binance introduces self-custody Web3 wallet","content":" Binance, the world’s largest cryptocurrency exchange, announced the launch of its new Web3 wallet on Wednesday.\nSee related article: Binance says it signed agreements with new euro banking partners\nSee related article: Binance.US suspends USD withdrawals\n","create_date":"2023-11-08T21:08:14+00:00","tag":"Binance","author":"Zoltan Vardai"},
{"url":"https://forkast.news/binance-one-year-on-from-ftxs-downfall/","web_url":"https://forkast.news/","type":"article","description":"A look at the world’s largest crypto exchange Binance's annus horribilis.","title":"Binance: One year on from FTX’s downfall","content":" When cryptocurrency exchange FTX collapsed, it should have been a boon for its rival Binance, but it only made things worse for the world’s largest crypto exchange.\nThe exchange — which reportedly employs over 6,500 staff — has faced an onslaught of headwinds since November last year when its Chief Executive Officer Changpeng Zhao (CZ) sold FTX’s FTT tokens. That move triggered a surge in withdrawals from FTX, which in turn revealed a shortfall on the rival exchange of over US$8 billion in customer funds.\nBut since then, all eyes have turned to Binance and CZ.\n“Binance is still the biggest exchange in the world, but it has faced a difficult year marred by regulatory enforcement actions, falling volumes, and a reputational hit,” said Clara Medalie, research director at crypto data firm Kaiko.\nHere’s Forkast’s guide to where things stand for Binance, almost a year after FTX’s downfall. Binance did not respond to a request for an interview or provide commentary for this article.\nBinance is everywhere and nowhere all at once. The global exchange sits within a Cayman Islands holding company and has no formal headquarters — a structure that’s helped Binance skirt global regulations over the years.\n“The exchange has been known to be accessible to users in all countries around the world,” said Robert Le, a crypto analyst at capital markets data platform Pitchbook. “Binance.com has in the past provided instructions on how to access their services via VPN.”\nBinance is said to operate in over 100 countries, but only lists 45 on its website. The rise of the cryptocurrency market, when Bitcoin hit peaks of US$69,000, and its abrupt collapse put the spotlight back on the global operations of crypto exchanges as FTX’s collapse heightened regulators’ concerns.\nThe United Kingdom’s Financial Conduct Authority (FCA) raised concerns about Binance’s ambiguous corporate structure in 2021 leading to the financial regulator revoking the exchange’s U.K. permissions earlier this year. Last week, Binance attempted to reinstate some local services with a new partner, but the FCA promptly intervened, asking the partner to withdraw any existing approvals.\nBinance sold its Russian entity to the newly-launched exchange CommEx amidst regulatory pressures and potential sanctions violations. Despite the ongoing divestment, Binance still lists Russia as an operational country on its website. Binance also closed shop in Canada due to restrictions on stablecoin use while withdrawing from several European countries, like Germany, the Netherlands, and Austria due to registration issues. It also sought deregistration in Cyprus, aiming to focus on fewer entities in Europe and comply with the European Union’s Markets in Crypto Assets (MiCA) regulation.\nBinance exited Belgium only to return three months later. The exchange also reentered Japan and cleared the third stage of Dubai’s four step licensing process. Binance is also dominant in Turkey, said Kaiko’s Medalie.\nUsing fiat pairs trading volumes as a proxy for trading activity, Binance appears dominant in several developing countries. It has 86% market dominance in Brazilian Real transactions, 69% in Nigerian Naira transactions, and 57% in Argentine Pesos transactions, said Jacob Joseph, a research analyst at digital asset data firm CCData.\nGlobal regulators have been homing in on Binance since FTX’s collapse. In February, the New York Department of Financial Services (NYDFS) ordered Binance’s stablecoin partner Paxos to stop minting Binance USD (BUSD). The loss of BUSD, the third largest stablecoin in the market at the time, was a major blow to Binance.\nThen the U.S. Commodity Futures Trading Commission (CFTC) charged Binance, Zhao and the exchange’s former chief compliance officer Samuel Lim with operating an illegal derivatives exchange and evading federal law. The CFTC action was quickly followed by the U.S. Securities and Exchange Commission (SEC), which filed 13 charges against Binance and Zhao including operating an unregistered exchange and the unregistered sale of securities. Binance said it would vigorously defend itself against the allegations.\nThe exchange is also reportedly facing a number of investigations including from the U.S. Department of Justice over potential violations of Russian sanctions as well as a broader probe, according to Reuters.\nIn Australia, regulators have been investigating Binance’s former derivatives operations, while in France there’s been an investigation into whether Binance carried out adequate money laundering checks and illegally advertised to consumers. Most recently, a congressional committee in Brazil recommended the indictment of Zhao and several other executives last week for running “a financial pyramid scheme” in the country.\nBinance is not taking the accusations lightly, splashing the cash on lobbyists and lawyering up. In the first six months of this year, Binance spent more than US$1 million on lobbying in the U.S., almost as much as it spent on lobbying in all of 2022, according to data from OpenSecrets.\nAs Binance splurged on legal support, it made cuts within its organization. Binance.US eliminated an unspecified number of jobs in June, while the broader company laid off around 1,000 employees in July. A few months later, Binance.US cut around a third of its workforce.\nBinance and several of the executives who have departed attributed this to natural turnover rather than the exchange’s legal and regulatory battles. “Some of our team members are growing into bigger roles, some outside of Binance. We are supportive of everyone,” said Zhao on X (formerly Twitter). “Some are doing new exciting ventures. I even made intros/references for many of them.”\nIt’s not only employees that Binance has lost in the last year. Several key partnerships have come to an end including its relationships with Paxos and its on-ramp service providers Paysafe and Checkout.com.\nThe loss of on-ramp services are impeding the process of onboarding traders in Europe, said Kaiko’s Medalie. Binance’s market share in pound and euro trading volumes are down 6% and 14% respectively compared to 35% and 28% at the start of the year, said CCData’s Joseph.\nBinance’s debit card programs have also halted with Mastercard ending its offering entirely and Visa distancing itself from the exchange. Internally, the exchange is streamlining services.\nSome partnerships are continuing to bloom including plans to offer a stablecoin in Japan with Mitsubishi UFJ Financial and TrueUSD (TUSD), a little-known stablecoin, replacing BUSD.\n“Over the past year, the exchange has experimented with different types of trading promotions using little-known stablecoins such as TUSD or FDUSD,” Medalie said. “These trading promotions have temporarily boosted volumes, but because the markets are zero-fee, it has likely not translated into additional revenues for the exchange.”\nBinance generates around 90% of its revenues from transaction fees, said Zhao in a November TechCrunch interview. The exchange maintains around 50% of global volumes, Medalie said, which is down from a high of over 70% earlier this year. Revenues for Binance’s U.S. arm is reportedly down 70% year-to-date.\n“The discontinuation of the zero-fee trading promotion for USDT pairs in March, alongside increased regulatory scrutiny, has primarily driven Binance to record seven consecutive monthly declines in market share,” said CCData’s Joseph.\nExchanges, such as M2 — which is reportedly backed by Abu Dhabi — are hoping to take advantage of this change in market conditions. However, they still have to contend with broader headwinds including a general decline in trading appetite, a fast-changing regulatory environment and an already crowded landscape.\n“No entity, regardless of its size, is immune to failure, with FTX, Terra/Luna, and especially Mt. Gox — which accounted for nearly 70% of the bitcoin transactions back in 2014 — serving as poignant examples,” said Joseph. “Should Binance fail, it would deliver a substantial blow to the industry and could potentially dissuade both retail and institutional participants from actively engaging in the crypto markets.”\nThis is a perspective shared by Pitchbook analyst Le. Though there would be no government intervention if Binance were to fail, he expects other exchanges such as Coinbase, OKX and Bybit to eventually fill the vacuum.\n“The asset class has navigated through similar perils in the past and, given enough time, would likely continue to do so,” Joseph said.\n","create_date":"2023-10-16T20:00:00+00:00","tag":"","author":"Kari McMahon"},
{"url":"https://forkast.news/ethereum-layer-2-market-cap-to-reach-us1-trillion-by-2030-vaneck-predicts/","web_url":"https://forkast.news/","type":"article","description":"VanEck forecasts a $1 trillion market cap for Ethereum Layer-2 networks by 2030, highlighting their scalability and efficiency.","title":"Ethereum layer-2 market cap to reach US$1 trillion by 2030, VanEck predicts","content":" Investment firm VanEck has predicted Ethereum layer-2 networks will collectively reach a market capitalization of US$1 trillion by 2030.\nThe projection, detailed in a report released on April 3, underscores the potential of layer-2 solutions to significantly enhance the scalability and efficiency of blockchain technology.\nThe analysis by VanEck points to Optimistic and Zero-Knowledge Roll-Ups as pivotal in addressing Ethereum’s scalability hurdles, setting the stage for a transformative impact on the digital asset sector and solidifying layer-2’s integral role within the Ethereum framework.\nVanEck examines various facets of the Layer-2 ecosystem, including transaction costs, user and developer experiences, trust requirements, and overall ecosystem size.\nIt emphasizes the anticipated benefits of the EIP-4844 upgrade, known as “Blob Space,” which is expected to drastically cut data posting expenses and financially benefit layer-2 operations.\nThe report also identifies transaction sequencing as a key revenue stream for layer-2 solutions and forecasts that by 2030, these networks will command a significant share of Ethereum’s transaction and total value locked, a measure for assets locked in a network’s decentralized finance ecosystem.\n","create_date":"2024-04-05T01:25:48+00:00","tag":"DeFi - Decentralized Finance","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-exceo-changpeng-zhao-sentenced-for-money-laundering/","web_url":"https://forkast.news/","type":"article","description":"Changpeng Zhao receives a 4-month prison term and a $50 million fine for laundering violations.","title":"Binance ex-CEO Changpeng Zhao sentenced for money laundering","content":" Changpeng Zhao, the former CEO of cryptocurrency exchange Binance was sentenced to four months in prison on Tuesday, with a personal fine of US$50 million and a US$4.3 billion fine on Binance.\nZhao pleaded guilty to money laundering charges last year.\nThe Department of Justice pushed for a three-year sentence.\nHis post-incarceration plans include working on the Giggle Academy, an educational initiative designed to provide accessible and adaptive basic education for children globally.\n“I will do my time, conclude this phase and focus on the next chapter of my life (education). I will remain a passive investor (and holder) in crypto. Our industry has entered a new phase. Compliance is super important. A silver lining of this whole process is that Binance has been under the microscope. And funds are SAFU,” Zhao said on X.\nThe case against Zhao and Binance has been building since 2018, with U.S. authorities scrutinizing the company’s adherence to anti-money laundering statutes and sanctions.\nThe investigations, involving the Department of Justice, the Securities and Exchange Commission, and the Commodity Futures Trading Commission, accused Binance of enabling transactions for individuals linked to terrorism and child exploitation.\n","create_date":"2024-05-01T14:30:48+00:00","tag":"Binance","author":"CryptoSlam"},
{"url":"https://forkast.news/ftt-up-65-secs-gensler-hints-ftx-restart/","web_url":"https://forkast.news/","type":"article","description":"FTT rose over 65% despite FTX founder Sam Bankman-Fried’s guilty verdict last week.","title":"FTT up 65% after SEC’s Gensler hints FTX restart","content":" FTT, the native token of the bankrupt FTX cryptocurrency exchange, rose over 65% on Thursday, after U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler said that he is open to the idea of restarting the exchange.\nSee related article: SBF conviction closes “dark chapter” in crypto: Yat Siu\nSee related article: SBF convicted on all charges, Hong Kong buzzes with Web3 events\n","create_date":"2023-11-09T22:59:08+00:00","tag":"FTX","author":"Zoltan Vardai"},
{"url":"https://forkast.news/first-digital-says-hk-singapore-join-hands-on-crypto/","web_url":"https://forkast.news/","type":"article","description":"The Hong Kong-based consultancy was on the KPMG and HSBC list of Emerging Giants in Asia Pacific for 2022.","title":"First Digital says HK, Singapore can join hands on crypto","content":" Hong Kong-based consultancy First Digital was on the KPMG and HSBC list of Emerging Giants in Asia Pacific for 2022. It provides crypto custody and escrow services for institutions and raised about US$20 million in a pre-seed round in September 2021 at a US$100 million valuation.\nThe Q&A with Chief Executive Officer Vincent Chok has been edited for language and brevity.\nPradipta Mukherjee: Elizabeth Wong at Hong Kong’s Securities and Futures Commission, this week referred to the “one country, two systems” model and said the city has a different cryptocurrency policy from mainland China, which has banned trading of such digital assets. What does that mean and how is it going to work?\nVincent Chok: I think she’s referring to the basic rule of law that was implemented after the 1997 handover to China. Hence, the one country two systems. And I think China pretty much left Hong Kong to rule itself, knowing that Hong Kong is a key financial center, not only to the Asia Pacific region, but globally. So I think that’s really pretty much her stance to follow that particular policy.\nMukherjee: But is it do-able because of China’s influence on Hong Kong?\nChok: There’s really no official stance saying that it’s “one country, one system.” I mean, there’s no capital control, no exchange control in Hong Kong – so it’s still a very secure financial hub. If it was one country, one system, that would affect everything, not just crypto.\nMukherjee: Why is Hong Kong taking this stance on crypto now? Is it losing out to rival Singapore and becoming less relevant as a financial center?\nChok: We’ve seen a lot of money move out of Hong Kong during the protests and during the pandemic. But I don’t think Hong Kong is losing its position. I think Hong Kong just takes a little bit more time to review issues. In March 2023, they’re scheduled to release the Virtual Asset Service Providers, or VASP, licensing in Hong Kong. We see that Hong Kong regulators are constantly looking at the digital asset space and there have been licenses that’ve been approved here. But the speed of it, I think it’s just a lot more conservative than most other governments and regulators when it comes to issuing licenses. It just wants to get it right, I believe.\nMukherjee: How will the licensing next year help structure the industry in Hong Kong?\nChok: Well, I think regulation is always good. It just separates the good and the bad players in the industry and gives it credibility. It will focus on how to help retail consumers because right now it’s basically focusing more on the institutional. But if we’re going to adopt this for retail consumers, licensing really needs to be in place. We see sometimes people are investing heavily into crypto because of the large yields that they’re seeing. However, there’s a lack of regulations and when people lose their money, who do they run to? They have to run to the regulators. So that’s really why it needs to be addressed. So the VASP license is to really look at anybody handling digital assets that needs to be licensed under the Securities and Futures Commission.\nCryptos, to me, are another form of financial asset or another asset class. It just needs to be integrated into the existing infrastructure that Hong Kong has built and that infrastructure is very strong. All the major banks are located here. It has a very strong technology center. So I believe that this is just a phase that it is going through, but it’ll pick up for sure. Hong Kong will be another driving force in the digital asset space.\nMukherjee: And when do you think that’s going to happen?\nChok: Well, I think we have to clear up something called the pandemic first. I mean, we’re heading the right way. Hong Kong recently announced a zero plus three policy for quarantine for travelers coming in. And we’re hearing that the “plus three” might be gone by the end of November. So we’re seeing more activities, more trade shows coming back. We have the Hong Kong FinTech week coming at the end of this month. So there are larger activities coming back to Hong Kong. So probably give it another 12 to 16 months. You know, by that time the VASP license will be issued as well. People can start applying. There will be more clarity on exactly the regulation and sort of direction the regulators are going. So probably about 12 to 16 months.\nMukherjee: Every regulator is talking about cryptocurrencies and strengthening oversight. But regulations have been rather slow. When can we see something concrete?\nChok: Singapore is taking the right direction, at least in the Asia Pacific region. They’ve been very bullish. They have been granting licenses to large companies like Coinbase. And I think other regulators can look towards Singapore as a jurisdiction to follow and to look at how they might adopt those policies into their own jurisdictions when it comes to regulating crypto. But again, different jurisdictions treat cryptocurrencies differently. Some are securities, some are currencies, some are properties. So different treatments also create different taxation, different reporting. So all of these things need to be standardized.\nI think Hong Kong needs to re-energize itself. And we want to see not just competition between Hong Kong and Singapore. I think that collaboration between Hong Kong and Singapore can be wonderful for the crypto industry because we can complement each other as we have a different style of doing things. We have to think about ways of cooperating and opening up to the world when it comes to digital assets. Singapore is very strong in what it’s doing (in regulating digital assets) and Hong Kong with its strong financial experience and infrastructure could make a great partnership if the two countries work together to create a really strong jurisdiction for crypto companies.\nMukherjee: We also have Dubai emerging as a crypto-friendly destination, granting licenses to several exchanges. Do you see Dubai or the Middle East emerging as the next crypto hub?\nChok: I do. I think each continent will have a country that will come out as a crypto hub. The US is a strong crypto hub, we see Singapore advancing in Asia and in the Middle East now we see Dubai. So in Africa, South America we haven’t really seen a country stepping up yet, but I believe there’s going to be a crypto hub in every continent.\nMukherjee: According to Chainanalysis, October is the “biggest month in the biggest year ever” for cryptocurrency hackers, with US$718 million stolen from decentralized finance sites across 11 different hacks. What kind of oversight is necessary in Asia and globally to combat this?\nChok: The oversight that’s really needed is really a lot of these exchanges and crypto companies need to have separation of power. A lot of them are still doing self-custody. So what are the security protocols that are in place?\nFor us as a company that custody crypto, we have many protocols in place to address potential hacks. You have to have proper sign offs in approving processes. So are the hacked companies missing (security) protocols? Is it one person holding the key? Is it one person doing the approvals? A lot of hacks are also internal.\nMukherjee: Singapore has banned public advertising for crypto, while India has established a punishing taxation regime. Is this the way to regulate?\nChok: They are following traditional finance. If you think about advertising crypto, it’s like promoting a sale of a security. You know, these companies need to be licensed properly. You just can’t be posting investment ads all over town. You need to be properly licensed.\nAs for India, I think the government’s 1% TDS (tax deducted at source) and the 30% flat tax on all crypto income is hurting traders and India’s (crypto) trading volume has dropped by over 70%. So traders are going to look elsewhere, which in turn will hurt the government in the long run when it comes to seeking tax revenue from crypto.\nPersonally, I think what they’re (India) doing is deterring people from trading in crypto, but India has always been that way when it comes to taxes. They’ve been taxing other asset classes heavily in the past as well.\nDespite so many crypto restrictions in different countries, we’ve seen an increase in the number of investors. Why is that happening?\nPeople are looking at ways of making a good return. During the last two years, we’ve seen Treasuries at zero. The stock market has been hit so badly. So people are just looking for an alternative way of generating a good return. And with crypto, that’s the only thing that they’re seeing that is generating proper high yield. Because the standard of living in most countries in Asia is quite high and wages in Asia are quite low. So there’s always going to be people looking for secondary income.\n","create_date":"2022-10-20T16:42:50+00:00","tag":"Hong Kong","author":"Pradipta Mukherjee"},
{"url":"https://forkast.news/headlines/india-tax-breaks-cryptos-back/","web_url":"https://forkast.news/","type":"article","description":"Trading volumes at India’s major cryptocurrency trading exchanges slumped to their lowest in years after new taxes kicked in on April 1.","title":"India tax breaks crypto’s back","content":" Trading volumes at India’s major cryptocurrency exchanges slumped to their lowest in years after new taxes kicked in on April 1, according to research by Crebaco.\nSee related article: Coinbase’s India launch hits road bump\nSee related story: Indian e-wallet provider MobiKwik yanks crypto support\n","create_date":"2022-04-12T11:54:09+00:00","tag":"India","author":"Pradipta Mukherjee"},
{"url":"https://forkast.news/pepe-hits-record-high-as-gamestop-meme-trading-returns/","web_url":"https://forkast.news/","type":"article","description":"The value of PEPE cryptocurrency soars as Roaring Kitty returns to put GME back on the meme trading map.","title":"PEPE hits record high as Gamestop meme trading returns","content":" Pepe, a frog-themed memecoin, soared to a record peak value of US$0.00001118 on Tuesday, according to CoinGecko data.\nPepe was the only token in the green across 24 hours among the top 30 cryptocurrencies by market capitalization, as of 10 a.m. ET.\nPepe’s surge came amid the return of a meme trading frenzy involving stocks of Gamestop (GME), a U.S. video game retailer.\nGameStop experienced a dramatic surge of nearly 100% on Tuesday, though it later retreated from these highs.\nThis upswing built on a 74% increase from Monday. During Monday’s trading, the stock at one point soared up to 110%, leading to multiple trading halts due to its volatility.\nGameStop’s shares surge was sparked by the return of Keith Gill, also known by his online alias “Roaring Kitty.” Gill’s enthusiastic endorsement of GameStop played a pivotal role in triggering the meme stock phenomenon in 2021.\nAlongside GameStop, theater chain AMC (AMC) also saw its shares climb significantly on Monday.\nOn Tuesday, AMC’s stock surged approximately 120% in early trading sessions. According to a filing with the SEC, AMC issued around 72.5 million new shares, successfully raising about $250 million for the company.\n","create_date":"2024-05-14T14:26:07+00:00","tag":"Memecoin","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-mastercard-launch-card-in-argentina/","web_url":"https://forkast.news/","type":"article","description":"Binance has partnered with Mastercard to introduce a Binance card in Argentina for making purchases and paying bills with cryptocurrencies.","title":"Binance partners Mastercard to launch card in Argentina","content":" Binance has partnered Mastercard to introduce a Binance card in Argentina for making purchases and paying bills with cryptocurrencies.\nSee related article: Philippines’ SEC warns public not to invest with Binance\nSee related article: Binance spent over US$1B on compliance, founder Changpeng Zhao says\n","create_date":"2022-08-05T17:41:49+00:00","tag":"Binance","author":"Pradipta Mukherjee"},
{"url":"https://forkast.news/ex-binance-ceo-faces-3-years-prison-and-millions-in-fines/","web_url":"https://forkast.news/","type":"article","description":"Changpeng Zhao, the former CEO of Binance, may receive a 3-year sentence and $50M fine for anti-money laundering violations.","title":"Ex-Binance CEO faces 3-years prison and millions in fines","content":" Changpeng Zhao, the ex-chief executive officer of cryptocurrency exchange Binance, is facing a potential 36-month prison sentence and a US$50 million fine.\nHis sentencing, recommended by the U.S. Department of Justice, is set for April 30.\nZhao pleaded guilty to anti-money laundering (AML) law violations last November.\nProsecutors are pushing for a harsher sentence than federal guidelines typically suggest, due to Zhao’s “willful failure” to establish a comprehensive AML program at Binance, according to court documents.\nThe exchange’s practices allegedly facilitated various illegal activities, including transactions that obscured the origins of funds and violated U.S. sanctions.\nIn February, Binance agreed to pay US$4.3 billion in fines and compensation.\nDespite resigning as CEO, Zhao remains the majority owner of Binance and continues to be a prominent figure in the crypto world, recently launching an educational initiative for children.\n","create_date":"2024-04-24T19:25:39+00:00","tag":"Binance","author":"CryptoSlam"},
{"url":"https://forkast.news/crypto-wallets-exit-us-amid-regulatory-pressure/","web_url":"https://forkast.news/","type":"article","description":"Wasabi and Phoenix wallets halt US services due to increasing regulatory scrutiny.","title":"Crypto wallets exit US amid regulatory pressure","content":" Wasabi Wallet and Phoenix have suspended their services for customers in the United States.\nThe companies behind these wallets, zkSNACKs and ACINQ, announced the suspensions following actions taken by U.S. authorities against similar cryptocurrency services.\nzkSNACKs has already implemented measures to block U.S. IP addresses from accessing its services, including the Wasabi Wallet.\nACINQ plans to remove its Phoenix Wallet from U.S. application stores by May 3.\nThese steps reflect the companies’ efforts to comply with potential regulations classifying self-custody wallets as money services businesses, which would impose strict regulatory requirements.\nThe regulatory pressure on cryptocurrency services has intensified following the arrest of two individuals linked to the Samourai Wallet on charges of laundering money from illegal sources, including the Silk Road marketplace.\nThe U.S. government’s crackdown on Samourai Wallet resulted in the seizure of its web servers and domain, as well as the app’s removal from the Google Play Store in the U.S.\nKeonne Rodriguez, co-founder of the privacy-focused crypto wallet Samourai Wallet, was granted release on a US$1 million bond.\nRodriguez pleaded not guilty to charges of money laundering and operating an unlicensed money-transmitting business on Monday at the U.S. District Court for the Southern District of New York.\n","create_date":"2024-04-30T23:24:59+00:00","tag":"Cryptocurrency Wallet","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-loses-two-more-top-execs-in-uk-and-france/","web_url":"https://forkast.news/","type":"article","description":"Global regulatory pressure on the world’s largest exchange continues to take its toll.","title":"Binance loses two more top execs in UK and France","content":" Binance, the world’s largest cryptocurrency exchange, has lost two top executives in the U.K and France over the past month, adding to a series of executive departures across its global operations amid increased regulatory scrutiny.\nSee related article: Binance Japan — death knell or savior for the nation’s smaller crypto exchanges?\nSee related article – Binance: One year on from FTX’s downfall\n","create_date":"2023-10-25T10:12:07+00:00","tag":"Binance","author":"Will Fee"},
{"url":"https://forkast.news/ftx-cautions-against-unauthorized-asset-sales/","web_url":"https://forkast.news/","type":"article","description":"FTX warns public about unauthorized parties soliciting bids for its digital assets, reaffirming Galaxy Asset Management's exclusive role.","title":"FTX cautions against unauthorized asset sales","content":" FTX, the bankrupt cryptocurrency exchange, has issued a public warning about unauthorized entities soliciting bids for its digital assets, which are exclusively managed by Galaxy Asset Management as per the bankruptcy court’s mandate.\nThe warning, posted on March 1, comes as FTX continues its efforts to restructure and repay creditors following its 2022 collapse.\nThe exchange has been actively recovering assets, totaling US$7 billion, to fulfill obligations to former customers. The sale of FTX’s digital assets is a critical component of the repayment plan, which is subject to the court’s approval and oversight.\nFTX’s debtors have been working to settle claims with creditors, proposing reimbursements based on the value of cryptocurrencies at the time of the exchange’s bankruptcy. This pricing has been a point of contention, as current market values are higher.\nRecently, the United States Bankruptcy Court for the District of Delaware has approved the sale of FTX’s nearly 8% stake in the artificial intelligence firm Anthropic, which is expected to contribute over US$1 billion to the repayment efforts.\nThe official liquidator has notified creditors to submit electronic claims by May 15, 2024, with the first interim distribution expected in late 2024 or early 2025.\nMeanwhile, former FTX CEO Sam Bankman-Fried was found guilty of multiple charges in November 2023 and awaits sentencing on March 28. He faces a maximum sentence of 110 years in prison.\n","create_date":"2024-03-05T02:52:09+00:00","tag":"FTX","author":"CryptoSlam"},
{"url":"https://forkast.news/sec-expected-to-deny-ethereum-etfs-reuters/","web_url":"https://forkast.news/","type":"article","description":"The SEC signals a cautious crypto stance, likely rejecting Ethereum ETFs and delaying Bitcoin ETF options.","title":"SEC expected to deny Ethereum ETFs: Reuters","content":" The U.S. Securities and Exchange Commission (SEC) is expected to decline spot Ethereum exchange-traded fund (ETF) applications next month, according to Reuters.\nThe regulator’s anticipated refusal of Ethereum ETFs contrasts with its earlier sanctioning of Bitcoin ETFs, which have garnered substantial investor interest.\nAccording to four people who reportedly participated in meetings with the SEC, current applications are expecting rejections due to unfruitful discussions with the securities regulator.\nThe lack of engagement observed in these meetings, compared to those preceding the Bitcoin ETF approvals, suggests the SEC may demand additional information on the Ethereum market.\nThere are nine spot Ether ETF applicants, including VanEck and BlackRock.\nAnalysts speculate that the green light for Ether ETFs might be postponed until later in 2024 or even further, Reuters reported.\nMeanwhile, Hong Kong’s Securities and Futures Commission (SFC) has sanctioned the first series of Bitcoin and Ether ETFs, with trading slated to begin on April 30.\n","create_date":"2024-04-26T02:45:19+00:00","tag":"Ethereum","author":"CryptoSlam"},
{"url":"https://forkast.news/hong-kong-expected-to-approve-spot-bitcoin-etfs-mid-april/","web_url":"https://forkast.news/","type":"article","description":"Hong Kong's SFC is set to approve spot Bitcoin ETFs, offering new investment avenues.","title":"Hong Kong expected to approve spot Bitcoin ETFs mid-April","content":" Hong Kong’s Securities and Futures Commission (SFC) will likely announce the approval of the city’s inaugural spot Bitcoin exchange-traded funds (ETFs) around April 15, according to sources familiar with the matter cited by Reuters.\nThe announcement is expected to precede the launch of the financial products in April.\nThe approval will enable both institutional and retail investors to engage in Bitcoin investments via regulated ETFs, with the Hong Kong Stock Exchange reportedly aiming to complete listing processes shortly after approval.\nThe SFC has recently expanded its list of authorized fund companies, including Harvest Global Investment and China Asset Management, to issue crypto-related fund products.\nThe SFC and the Hong Kong Monetary Authority (HKMA) have established rigorous guidelines for these virtual asset products, ensuring they meet the same regulatory standards as traditional mutual funds.\nThe expected sanctioning of spot Bitcoin ETFs in Hong Kong comes after the U.S. Securities and Exchange Commission approved similar products in January.\n","create_date":"2024-04-11T00:46:30+00:00","tag":"Hong Kong","author":"CryptoSlam"},
{"url":"https://forkast.news/mastercard-explores-partnerships-with-crypto-wallets-metamask-ledger-coindesk/","web_url":"https://forkast.news/","type":"article","description":"Mastercard's potential tie up with custody service providers may turbocharge crypto wallets' growth with its global payments prowess.","title":"Mastercard explores partnerships with crypto wallets MetaMask, Ledger: CoinDesk","content":" Global payments company Mastercard is exploring partnerships with cryptocurrency wallets, MetaMask, and Ledger, CoinDesk reported, citing a Web3 workshop deck.\nSee related article: Parity Technologies, Polkadot blockchain developer, lays off 30% of staff\nSee related article: Binance loses two more top execs in UK and France\n","create_date":"2023-10-25T16:15:35+00:00","tag":"Mastercard","author":"Maha Shah"},
{"url":"https://forkast.news/headlines/asic-binance-australia-derivative-license/","web_url":"https://forkast.news/","type":"article","description":"The Australian securities regulator has canceled Binance Australia's derivatives license.","title":"ASIC cancels Binance Australia's derivatives license","content":" The Australian Securities and Investments Commission (ASIC) canceled Binance Australia’s derivatives license on Thursday, a day after receiving a cancelation request from the exchange.\nSee related article: Binance, Zhao sued by CFTC for alleged regulatory violations\nSee related article: After Singapore, Binance pulls back from Australia under growing regulatory pressure\n","create_date":"2023-04-06T17:49:21+00:00","tag":"Binance","author":"Forkast.News"},
{"url":"https://forkast.news/cryptopunks-leads-nft-sales-for-the-second-straight-day/","web_url":"https://forkast.news/","type":"article","description":"The iconic CryptoPunks collection tops daily NFT sales, but this isn't enough to keep Ethereum above Bitcoin.","title":"CryptoPunks leads NFT sales for the second straight day","content":" CryptoPunks dominated the market with a daily sales volume for the second consecutive day on Wednesday.\nThe Ethereum-based non-fungible token (NFT) collection recorded over US$1.25 million in daily sales with eight total transactions attributed to seven unique buyers and sellers each.\nCryptoPunks led the market despite a 25% sales drop from the day prior. Its US$1.7 million daily sales volume also led the market on Tuesday, according to CryptoSlam data.\nCryptoPunks’ two-day dominance was not able to keep Ethereum, its host chain, at the top of the blockchain rankings for NFT sales. Bitcoin collections collectively achieved US$6.68 million in sales on Wednesday, edging out Ethereum’s US$6.04 million.\nThe second-highest performing collection of the day was DMarket, with a daily sales volume of US$725,058, involving a staggering 4,147 unique buyers and 3,569 sellers across 31,734 transactions.\nDMarket is a NFT collection that represents in-game items for the Mythos chain.\nNodeMonkes on Bitcoin claimed the third spot with a daily sales volume of US$717,301.84, engaging 37 unique buyers and 35 sellers in 38 transactions. This is a slight decrease from the US$750,024.31 generated the day before. The collection’s all-time sales now stand at US$214.35 million, reflecting a strong market position.\nNodeMonkes is the all-time leading collection on the Bitcoin network, with US$214.5 million in sales. It is now about US$1 million away from overtaking CyberKongz, an Ethereum-based collection that currently holds the 26th spot on the all-time sales chart.\nOther notable collections that made Wednesday’s top 10 sales list include the $PMPS BRC-20 NFTs, which saw a daily sales volume of US$634,465, and Mad Lads, which generated US$518,697 in sales.\nBoth collections experienced fluctuations in their daily performance, with $PMPS BRC-20 NFTs witnessing an increase in transactions from the previous day, while Mad Lads saw a decrease in sales from US$800,760.\nSolana Monkey Business, Bored Ape Yacht Club, Mutant Ape Yacht Club, DogeZuki Collection, and Guild of Guardians Avatars also featured in the day’s top-performing NFT collections\n","create_date":"2024-05-09T06:24:35+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/what-the-coming-bitcoin-futures-etf-bonanza-means-for-investors/","web_url":"https://forkast.news/","type":"article","description":"The first US Bitcoin futures EFT is set to begin trading today. Will this exchange-traded fund bring Bitcoin closer to the masses?","title":"What the Bitcoin futures ETF bonanza means for investors","content":" In 2017 when Bitcoin futures contracts were launched on the Chicago Mercantile Exchange, they were heralded as a liquid, safe and lower-cost way to get exposure to Bitcoin.\nThe advantage to futures is that they are cash-settled: The buyers of futures do not receive actual Bitcoins, and investors who short futures are not obligated to deliver Bitcoin. The futures are therefore a unique synthetic exposure to Bitcoin, which has been difficult to access for a broader audience. This hurdle is about to lower even more as the launch of the first Bitcoin-futures exchange-traded fund will encourage wider investing in Bitcoin and comfort in crypto as an investment asset.\nLast Friday the registration for ProShares Bitcoin Strategy ETF appeared in the Security and Exchange Commission’s Edgar filings database and that was the SEC’s low-key signal that it will not block the New York Stock Exchange from offering the fund for trading under the ticker BITO as early as Tuesday, October 19. ProShares would be the first Bitcoin futures-based ETF, a regulated entity in which retail and institutional investors can put their dollars to hold Bitcoin futures.\nExchange-traded funds are a type of security that tracks an index, sector, commodity, or other asset, but which can be purchased or sold on a stock exchange the same way as a regular stock. ETFs are regulated under the Securities Act of 1933, which defined securities, but a Bitcoin-futures fund product could fall under the stricter 1940 Act that governs mutual funds, according to SEC Chairman Gary Gensler. Bloomberg projects that initial demand for Bitcoin-futures ETFs could be low, at about $4 billion of assets or just about 3% of the outstanding notional value of bitcoin futures. Still, the premise of ETFs consisting solely of futures is an interesting one, especially from an arbitrage vantage point.\nIn theory, Bitcoin spot and futures prices should converge by the settlement of the contract. When futures are based on a digital asset, their prices could trade close to the price of the actual digital asset. In other words, an exchange-traded fund could boost liquidity, volume, and open interest of Bitcoin futures.\nThe CME meanwhile is planning to raise the cap of the number of futures contracts that can be held by a single firm. That could create additional room for asset-management firms and institutions to build large portfolios of Bitcoin futures. As many as four Bitcoin-futures ETFs are scheduled for October, unless the SEC blocks them, and more could be following.\nFor the crypto market, the futures-based ETF is a milestone that could transform the trading aspects of Bitcoin, Ethereum and other crypto assets. There is scope for arbitrage, hedging and shorting because ETFs attract flows from financial advisers and institutions that seek a regulated instrument in their portfolios. For investors, that the ETFs are regulated is a key comfort over purchasing Bitcoin on as-yet unregulated crypto exchanges.\nAs the first day of trading of BITO approaches, the premium of Bitcoin futures maturing in November over futures expiring in October has risen notably, in a sign that markets expect the ETF to attract money inflows. Futures are pricing in that Bitcoin could reach a new record high in the next months, which in crypto terms could mean in a few days or hours. The Bitcoin-futures ETF could enhance the arbitrage opportunities because an ETF would allow investors to short Bitcoin, which is currently not possible.\nThe Grayscale Bitcoin Trust is the closest alternative to a futures-based exchange-traded fund. The trust has a single position in Bitcoin and its net asset value is settled at the closing price of Grayscale BTC on the OTCQX, the highest-quality market tier in the OTC Markets Group.\nThe implied value of Bitcoin based on the net asset value of Grayscale BTC (“GBTC”) is approximately US$55,000 compared to Bitcoin futures trading around US$60,000, as of October 18. The discount of GBTC to Bitcoin futures — at an average of around US$5,000 lately — is likely to widen as demand for futures picks up from multiple ETF launches. Investors may also be drawn to the lower cost in fees of a Bitcoin-futures ETF. By some estimates, the futures-based ETF could cost around 90 basis points, while Canadian-listed Bitcoin ETFs like EBIT charge 75 basis points and the GBTC’s expense ratio is 2%.\nA Bitcoin-futures ETF is likely to boost volumes of Bitcoin futures and offer investors arbitrage, hedging, and cost-effective Bitcoin buying-and-selling opportunities. The more opportunity for arbitrage and hedging, the more liquidity will centralize in Bitcoin futures to the benefit of Bitcoin itself. Eventually, Bitcoin’s extraordinary daily volatility could move more in line with equity and commodity volatility, making it a more attractive asset for investors overall.\n","create_date":"2021-10-19T02:53:36+00:00","tag":"BTC - Bitcoin","author":"Forkast.News"},
{"url":"https://forkast.news/from-silicon-valley-to-sand-dunes-why-indian-crypto-firms-eye-dubai-expansion/","web_url":"https://forkast.news/","type":"article","description":"Indian crypto companies flock to Dubai, escaping high local taxes and finding solace in the emirate's favorable regulatory environment.","title":"From Silicon Valley to Sand Dunes: Why Indian crypto firms eye Dubai expansion","content":" According to RBI Remittance Survey 2021, India’s 30% expat population in the United Arab Emirates (UAE) account for 18% of the US$110 billion global remittance inflow to India. The financial ties between the two countries stretch beyond remittances, now encompassing the realm of Web3, an evolving iteration of the internet based on blockchain technology.\nBilateral trade between India and the UAE surged to US$85 billion last year, and both countries are exploring interoperability between their central bank digital currency (CBDCs) projects.\nDubai, the most populous city in the UAE, saw over 90,000 Indian companies registered with the Dubai Chambers, while the city’s largest tech event, GITEX, saw more than 300 Indian startups, a number that had tripled from last year.\nIndia topped Chainalysis Global Crypto Adoption Index in 2023, and is now the world’s second-largest crypto market by raw transaction volume. But the local industry, that has been drying up due to the government’s strict tax rules, is inspiring local players to seek the oasis of Dubai’s burgeoning crypto ecosystem.\n“A lot of Web3 founders prefer Dubai or Singapore as their hub, because they have clarity and certainty around regulations and greater community support. When you’re setting up a business, investors are more comfortable investing in a jurisdiction where there are no last minute surprises. I am starting to see this trend on the ground and it must be reversed,” Sumit Gupta, the chief executive of Indian crypto exchange CoinDCX, told Forkast.\n“We have seen a decline of more than 90% in volumes. That’s a huge, steep decline. And what you have seen is that India continues to be number one when it comes to grassroot crypto adoption, but a lot of that activity is happening on alternative channels because of the high tax rates,” said Gupta.\nFinance Minister Nirmala Sitharaman, during last year’s budget announcement, introduced 30% tax plus applicable surcharge and 4% cess on profits made from crypto trading.\nThis year brought more bad news for Indian crypto traders with the introduction of a 1% tax deducted at source or TDS on crypto transactions above Rs 10,000. According to an amendment to the Income Tax Act, failure to pay TDS may result in a penalty equal to the unpaid amount, a 15% interest on late payments and in certain cases even a jail sentence.\nAccording to Gupta, the “regulatory arbitrage” may not be around for much longer. The Indian Finance Ministry did not respond to a request for an interview or provide commentary for this article.\n“There is a regulatory arbitrage which will not sustain for long, and has to go away. The government is aware of that. It’s a matter of when they decide to remove that arbitrage. Serving Indian customers from offshore is not scalable, not reliable and not compliant,” said Gupta.\nBut low taxes, ease of setting up businesses, a dedicated regulator and access to international markets such as Asia and Europe are driving the wave of Indian crypto firms towards Dubai.\nCrypto projects can meet the rest of the world through Dubai. If I look at new businesses coming in, predominantly the UK, India, China, US, Russia, make up the top 5%. Dubai is basically a hub, ” said Belal Jassoma, head of business development at the Dubai Multi Commodities Centre (DMCC), at the Future Blockchain Summit.\nDMCC houses over 23,000 companies, out of which 3,700 are from India. Last year it opened a representative office in Mumbai to further grow its members and provide customized licenses to Indian businesses.\nIts dedicated Crypto Centre has 550 Web3 companies out of which 50 are Indian. The DMCC Crypto Centre welcomed the Solana Foundation as its ecosystem partner at the Future Blockchain Summit and houses a long list of Web3 companies including crypto exchange Bybit, digital asset market maker DWF Labs, Web3 incubator TDeFi, and venture capital fund Brinc.\nThe city’s dedicated regulator for digital assets, Virtual Assets Regulatory Authority (VARA), oversees cryptocurrencies and related activities in all free zones in Dubai except the Dubai International Financial Centre (DIFC). Abu Dhabi, the capital of the UAE, also has a similar scope of work through the Abu Dhabi Global Market (ADGM).\n“VARA has crafted its regulations to be adaptable to market demands and be agile in addressing global market risks, aiming to attract entrepreneurs to solidify Dubai’s position as a central hub for Web3,” said Sunita Khatri, Commercial Director, Dubai World Trade Centre (DWTC).\nThe UAE is one of the countries that make up the Middle East & North Africa (MENA) region. According to Chainalysis, the region had the sixth largest crypto economy with an estimated US$400 billion dollars or 7.2% of global transaction volume recorded between July 2022 and June 2023.\n“MENA as a region is quite an interesting opportunity for CoinDCX to tap into because it’s a fast growing market, the adoption numbers there are pretty impressive and Web3 can unlock many opportunities in the India-UAE corridor. New use cases around remittances and payments are emerging from that region,” said Gupta.\nBitOasis, a crypto trading platform based in the UAE had its license suspended for “not meeting mandated conditions, required to be satisfied within 30-60 day timeframes,” according to VARA in a notice. The exchange that secured funding from CoinDCX, said it’s working with the regulator to fulfill the remaining conditions.\n“BitOasis was a strategic investment approach by CoinDCX to create an impact in international markets, maybe not directly, but by partnering with the right companies who are aligned with our mission and values.\nIndia, the world’s most populous country and the world’s sixth largest economy by nominal gross domestic product, is not alone tightening restrictions on crypto businesses.\nIn Australia, progress on crypto regulations has been slow. The country is aiming to release a draft legislation in 2024 for licensing and custody of crypto asset providers and Australian crypto exchanges may not get licensed until 2025.\nTop banks in Australia including the Commonwealth Bank (CBA) applied restrictions on crypto exchanges citing “scams” as the reason. As a result of debanking, Binance Australia had to halt customer deposits and withdrawals.\n“We’ve always been an Australian only exchange, but with the difficulties and challenges around licensing and the time it’s taken for that to come through to fruition, we’re now actively looking to expand overseas,” said Caroline Bowler, CEO, BTC Markets, an Australian crypto exchange.\n“The benefit for Dubai is that they’ve gone for something very tailored, very specific. And I think they’ve kind of the way that they framed it, it looks as though they’re looking to build out this sector for the longer term.”\nBinance recently earned an operational license in Dubai, opening up services of the world’s largest cryptocurrency exchange to customers in Dubai. Crypto exchanges Gemini and Bybit are also seeking a license in the United Arab Emirates.\nU.S.-based Coinbase’s Brian Armstrong has had discussions with UAE regulators over plans of setting up a second headquarters in the country to access markets in the Middle East, Africa and Asia. Coinbase suspended its operations in India three days after its launch in April 2022 due to issues with the local digital payment service. Informal pressure from India’s central bank was cited as a contributing factor. The exchange remains inactive in India, but its wallet services and tech hub remain active.\nRipple’s XRP recently received approval from the Dubai Financial Services Authority (DFSA) for use within the Dubai International Financial Centre (DIFC). Licensed virtual asset firms in the DIFC can now offer XRP as part of their services.\nBrad Garlinghouse, CEO of Ripple, said in a press release: “Dubai continues to demonstrate global leadership when it comes to the regulation of virtual assets and nurturing innovation…Ripple will continue to double down on its presence in Dubai and we look forward to continuing to work closely with regulators to realize crypto’s full potential.”\nAround 20% of Ripple’s customers are based in MENA.\n“The U.S. regulatory climate has been relatively hostile or unclear for digital asset businesses, so exchanges such as Coinbase and other major players have announced that they’re going to be applying for licenses here,” said Jimmy NGuyen, CEO, New Win Global, a Web3 venture advisory firm. “And the reason is because Dubai has been progressive at creating regulatory clarity with the launch of the Virtual Assets Regulatory Authority, putting out guidelines and policies about licenses to get. So all around the world, exchanges and other digital asset service providers are setting up second headquarters.”\nUK-based crypto lender, Nexo is expanding its UAE operations, aiming for 30% of its global footprint. The move follows sanctions imposed by the Securities and Exchange Commission (SEC) on a crypto lending product in the US, where Nexo paid US$45 million to regulators in settlements.\nThe U.K. government is gearing up to regulate the crypto industry by 2024 , bringing it in line with the rules governing traditional banks and financial services.\n","create_date":"2023-11-20T09:17:00+00:00","tag":"Dubai","author":"Maha Shah"},
{"url":"https://forkast.news/headlines/binance-change-euro-banking-partner-september/","web_url":"https://forkast.news/","type":"article","description":"Binance’s euro banking partner, Paysafe Payment Solutions, will stop offering its services for the world’s largest cryptocurrency exchange from Sept. 25.","title":"Binance to change euro banking partner from September","content":" Binance’s euro banking partner, Paysafe Payment Solutions, will stop offering its services for the world’s largest cryptocurrency exchange from Sept. 25.\nSee related article: SEC lawsuit sees Binance.US wobble, trading platforms delist cryptos\nSee related article: BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian\n","create_date":"2023-06-29T19:39:09+00:00","tag":"Binance","author":"Zoltan Vardai"},
{"url":"https://forkast.news/senators-urge-sec-to-halt-crypto-etf-approvals-amid-concerns/","web_url":"https://forkast.news/","type":"article","description":"U.S. Senators Jack Reed and Laphonza Butler have expressed concerns over the approval of crypto ETFs beyond Bitcoin.","title":"Senators urge SEC to halt crypto ETF approvals amid concerns","content":" U.S. Senators Jack Reed and Laphonza Butler have called on the Securities and Exchange Commission (SEC) to refrain from approving further crypto exchange-traded products (ETPs), particularly those linked to cryptocurrencies other than Bitcoin.\nIn a letter to SEC Chair Gary Gensler dated March 11, the senators highlighted the lack of sufficient trading volumes and integrity in cryptocurrencies like Ethereum, which they believe could expose retail investors to risks of fraud and market manipulation.\nThe senators’ concerns follow the launch of ten spot Bitcoin ETFs in the U.S. in January, which contributed to the resurgence of the cryptocurrency market with Bitcoin surging as high as US$73,737.\nThe senators’ letter comes amid ongoing SEC considerations for spot Ethereum ETFs.\nBloomberg analysts have reduced the likelihood of a spot Ethereum ETF approval to 35%, and the SEC has delayed its ruling on several proposed Ethereum ETFs.\nThe agency is expected to announce its decision in May.\nInstitutional interest in Bitcoin has been growing, with the approval of US spot Bitcoin ETFs contributing to this trend.\nHowever, experts warn that challenges within the crypto industry, such as security and compliance issues, may slow down institutional adoption.\n","create_date":"2024-03-16T03:09:43+00:00","tag":"ETF","author":"CryptoSlam"},
{"url":"https://forkast.news/us-job-growth-slows-as-bitcoin-price-soars-past-62000/","web_url":"https://forkast.news/","type":"article","description":"April sees a slight rise in US unemployment to 3.9% as Bitcoin's value rebounds.","title":"US job growth slows as Bitcoin price soars past $62,000","content":" Bitcoin surged past US$62,000 on Friday, as data from the United States Labor Department reported the unemployment rate rising to 3.9% last month.\nIn April, the U.S. economy’s job growth decelerated, with the creation of 175,000 non-farm jobs falling short of the 243,000 jobs forecasted.\nThe Federal Reserve’s decision to keep interest rates steady has contributed to the softening of the U.S. dollar and Bitcoin’s rebound.\nBitcoin, which fell to as low as US$56,800 this week, traded at US$61,678 at 2:30 p.m. ET, according to CoinGeck.\nBitcoin’s rebound follows multiple positive developments for the world’s largest cryptocurrency, including the launch of spot Bitcoin and Ethereum ETFs in Hong Kong on Tuesday.\nThe Bitcoin network underwent the quadrennial halving on April 20, cutting miner rewards by 50% from 6.25 to 3.125 Bitcoins.\nThe halving impacts the scarcity of the asset by slowing down the inflow of new Bitcoins.\nThe launch of Runes, which is a new fungible token protocol on Bitcoin, also coincided with the halving.\n","create_date":"2024-05-04T02:28:52+00:00","tag":"BTC - Bitcoin","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-exec-refutes-nigeria-laundering-claims/","web_url":"https://forkast.news/","type":"article","description":"Binance's Tigran Gambaryan pleads not guilty to money laundering in Nigeria, faces remand.","title":"Binance exec refutes Nigeria laundering claims","content":" Tigran Gambaryan, a Binance executive, stood before a Nigerian court on Monday and denied allegations of money laundering and tax evasion, as part of a wider probe into the cryptocurrency exchange’s dealings in the nation.\nGambaryan, who is being held at Kuje prison in Abuja until further court proceedings, contends he has no significant control over Binance’s operations.\nThis case has become a focal point in Nigeria’s intensified efforts to combat financial misconduct within the crypto industry and has sparked debate over the judicial treatment of international figures.\nGambaryan’s legal representative, Chukwuka Ikuazom, maintained that his client’s lack of executive authority at Binance absolves him of responsibility for the company’s actions in Nigeria.\nHowever, Judge Emeka Nwite deemed Gambaryan a Binance envoy during his Nigerian visits, under local legislation.\nThe court has postponed the case to April 19, with a bail hearing on April 18 and a full examination of the charges scheduled for May 2.\nThe accusations against Gambaryan, alongside another Binance executive, Nadeem Anjarwalla, who has left Nigeria, are part of a broader investigation into Binance’s supposed role in the depreciation of the Nigerian naira and tax evasion.\nThe Nigerian authorities have previously imposed a US$10 billion penalty on Binance, prompting the suspension of transactions involving the Nigerian currency.\nBinance and its ex-CEO Changpeng Zhao have been under international regulatory scrutiny, with Zhao stepping down following a guilty plea to U.S. federal charges.\n","create_date":"2024-04-09T01:36:47+00:00","tag":"Binance","author":"CryptoSlam"},
{"url":"https://forkast.news/sec-talks-grayscale-bitcoin-etf-coindesk/","web_url":"https://forkast.news/","type":"article","description":"The SEC has reportedly been in contact with Grayscale since its court victory in August.","title":"SEC in talks with Grayscale for Bitcoin ETF: CoinDesk","content":" The U.S. Securities and Exchange Commission (SEC) has reportedly started discussions with Grayscale Investments on converting its Bitcoin trust fund into a spot Bitcoin exchange-traded fund (ETF).\nSee related article: Standard Chartered’s SC Ventures, SBI Holdings launch crypto investment firm in UAE\nSee related article: HSBC plans tokenized securities custody service with Ripple’s Metaco\n","create_date":"2023-11-09T21:14:27+00:00","tag":"Grayscale","author":"Zoltan Vardai"},
{"url":"https://forkast.news/bitcoin-leads-nft-market-with-slight-sales-uptick-to-open-the-week/","web_url":"https://forkast.news/","type":"article","description":"Bitcoin's NFT sales see a marginal increase, outperforming Ethereum and Solana over the past day.","title":"Bitcoin leads NFT market with slight sales uptick to open the week","content":" Bitcoin led Monday as the top-ranking blockchain in the non-fungible tokens (NFT) market over the last 24 hours, with sales reaching US$10.37 million, marking a 4.02% increase.\nBitcoin reclaimed the top position to open the week after conceding the position to Ethereum for the last three business days last week.\nBitcoin’s all-time sales volume now stands at US$2.95 billion and is on pace to become the fourth network to hit US$3 billion this week.\nEthereum, the day’s second-ranking blockchain and the market’s all-time leader, experienced a more dramatic sales increase of 32.96% to US$10.32 million.\nMonday’s top two chains are the only networks to have at least US$10 billion in sales.\nSolana, ranking third, also saw a notable increase in sales by 26.65%, reaching US$7.53 million.\nMythos Chain was came in fourth with US$1.02\nClose behind, Polygon, in the fifth position, experienced a significant boost in sales activity with a 63.06% increase, reaching over US$1.01 million. It is the last chain to achieve at least US$1 million in sales.\n","create_date":"2024-03-26T03:01:11+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/headlines/grayscale-sec-spot-bitcoin-etf-rejection/","web_url":"https://forkast.news/","type":"article","description":"Grayscale Investments filed a lawsuit against the SEC within an hour of the markets regulator rejecting an application that would have allowed its spot Bitcoin ETF to trade on the NYSE.","title":"Grayscale sues SEC over spot Bitcoin ETF rejection","content":" Grayscale Investments filed a lawsuit against the U.S. Securities and Exchange Commission (SEC) within an hour of the markets regulator rejecting an application that would have allowed its spot Bitcoin exchange-traded fund (ETF) to trade on the New York Stock Exchange (NYSE).\nSee related article: Bitcoin ETF rejection could trigger Greyscale to sue the SEC\nSee related article: Grayscale fancies SEC green light for Bitcoin spot ETF\n","create_date":"2022-06-30T13:26:10+00:00","tag":"Grayscale","author":"Monika Ghosh"},
{"url":"https://forkast.news/bitcoin-network-surpasses-1-billion-transactions/","web_url":"https://forkast.news/","type":"article","description":"Bitcoin marks a historic achievement with over one billion transactions since 2009.","title":"Bitcoin network surpasses 1 billion transactions","content":" The Bitcoin network recorded its one billionth transaction, according to data from Clark Moody’s Bitcoin dashboard.\nBitcoin transactions and their corresponding fees have been a key discussion point among industry participants in recent weeks, in part, due to the introduction of Bitcoin Ordinals and Runes.\nThe latter, a fungible token protocol launched in tandem with the latest Bitcoin halving last month, raised transaction fees to an all-time record during its debut.\nThe halving reduces miners’ rewards by 50% roughly every four years, with the latest quadrennial event cutting them from 6.25 Bitcoins to 3.125.\nBitcoin is the world’s first blockchain-based cryptocurrency.\nThe network’s genesis block was mined by its founder Satoshi Nakamoto in January 2009.\nFirst introduced by the pseudonymous founder as a peer-to-peer payment system, Bitcoin has historically been an inefficient blockchain for tokenized assets such as non-fungible or fungible tokens when compared to other networks like Solana or Ethereum.\nThe introduction of Bitcoin Ordinals brought a new wave of tokenized assets onto the network by inscribing data onto satoshis, the smallest unit of Bitcoin, allowing a rendition of NFTs to exist on the network.\nWith the launch of Runes, primarily used for memecoins today, fungible tokens can potentially introduce new possibilities to the network, such as expanded applications for decentralized finance.\n","create_date":"2024-05-06T14:26:55+00:00","tag":"BTC - Bitcoin","author":"CryptoSlam"},
{"url":"https://forkast.news/straitsx-to-show-real-world-stablecoin-use/","web_url":"https://forkast.news/","type":"article","description":"Singapore-based StraitsX, a payments infrastructure for digital assets, will pilot stablecoin applications at the ongoing Singapore Fintech Festival. ","title":"StraitsX to show real-world stablecoin use at SFF","content":" Singapore-based StraitsX, a payments infrastructure for digital assets, will pilot stablecoin applications at the ongoing Singapore Fintech Festival.\nSee related article: Singapore’s DBS Bank trials use of digital SingDollar with vouchers\nSee related article: USDC stablecoin issuer Circle wins Singapore digital payment license\n","create_date":"2022-11-02T18:57:11+00:00","tag":"MAS - Monetary Authority of Singapore","author":"Pradipta Mukherjee"},
{"url":"https://forkast.news/nodemonkes-becomes-all-time-bitcoin-nft-leader-tops-daily-sales-with-us1-62-million/","web_url":"https://forkast.news/","type":"article","description":"NodeMonkes tops the daily NFT market with significant sales, outperforming other collections.","title":"NodeMonkes becomes all-time Bitcoin NFT leader, tops daily sales with US$1.62 million","content":" NodeMonkes surged to the top of the non-fungible token (NFT) market on Thursday with over US$1.62 million in sales.\nThe sales spike on Thursday pushed NodeMonkes’ all-time sales volume to US$210.72 million, as it flipped $SATS BRC-20 NFTs to become the top Bitcoin collection.\nNodeMonkes also snapped a six-day streak of under US$1 million in sales after recording US$934,294 the day before, CryptoSlam data shows.\nThe second-highest performing collection of the day is CryptoPunks, with a daily sales volume of US$1.33 million, a 488% leap from the day before.\nCryptoPunks’ all-time sales volume now stands at an impressive US$2.82 billion as the third best-selling set of NFTs.\nCryptoPunk 7846 was the highest-valued NFT to change hands on Thursday. It sold for US$557,804 in Ether, around US$300,000 lower than its last sale.\nFellow Ethereum collection Bored Ape Yacht Club claimed the third spot in daily sales, generating US$1.06 million. Yuga Labs’ flagship collection is the second best-selling NFT, withUS$3.14 billion.\nOther notable movements in the top 10 list NFT market include DMarket, which saw a slight decrease in daily sales to US$899,114.68. $WZRD BRC-20 NFTs experienced a more than twofold increase in daily sales, jumping to US$718,591.\nAzuki and DeGods also witnessed fluctuations, with Azuki’s sales climbing to US$652,683.33 and DeGods’ sales increasing to US$645,370.45.\n","create_date":"2024-05-03T19:47:58+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-japan-partners-mufj-stablecoin-development/","web_url":"https://forkast.news/","type":"article","description":"Mitsubishi UFJ and Binance Japan will collaborate on the issuance of fiat-pegged stablecoins.","title":"Binance Japan partners with MUFJ on stablecoin development","content":" Mitsubishi UFJ Trust and Banking Corporation, the largest banking group in Japan, and Binance Japan — the Japanese arm of the world’s largest cryptocurrency exchange — are collaborating on the issuance of fiat-pegged stablecoins, the two companies announced via a joint press release Tuesday.\nSee related article: MUFG enables bank-backed stablecoin issuance amid new Japanese regulations\nSee related article: Binance Japan launches with 34 tokens, BNB debuts in the country\n","create_date":"2023-09-26T16:20:12+00:00","tag":"Binance","author":"Danny Park"},
{"url":"https://forkast.news/headlines/binance-executivessay-leaving/","web_url":"https://forkast.news/","type":"article","description":"Binance Chief Strategy Officer Patrick Hillmann and Vice President for Compliance Steven Christie both confirmed they are leaving the firm.","title":"Binance executives Hillman, Christie say they are leaving, cite personal reasons","content":" Binance Chief Strategy Officer Patrick Hillmann and Vice President for Compliance Steven Christie confirmed in tweets on Friday morning in Asia that they are leaving the world’s largest crypto exchange. The confirmations came after Fortune reported multiple Binance senior executives were resigning amid regulatory investigations and lawsuits.\nSee related article: Why the US is waging war on Binance, Coinbase\nSee related article: Binance to change euro banking partner from September\n","create_date":"2023-07-07T11:01:58+00:00","tag":"Binance","author":"Tom Zuo"},
{"url":"https://forkast.news/independent-reserve-plans-hong-kong-office/","web_url":"https://forkast.news/","type":"article","description":"Independent Reserve may have a new Hong Kong office in the “next few months,” the Singapore chief of the Australian crypto exchange said.","title":"Independent Reserve plans Hong Kong office","content":" Australian cryptocurrency exchange Independent Reserve is one of Singapore’s eleven Major Payment Institutions, a licensed firm that is permitted to offer digital payment token services in the Lion City. The firm plans to open an office in Hong Kong and is looking at a “few other” jurisdictions in Southeast Asia.\nIn an interview with Forkast’s Pradipta Mukherjee, the exchange’s Singapore chief executive officer Lasanka Perera said that the city-state’s restriction on public advertising by crypto exchanges had led to a 90% drop in its monthly retail customer acquisition. The exchange has been focusing on institutional customers, including family offices and accredited investors, and is looking to introduce more products and services for them. Independent Reserve hopes to double its daily trade volumes and expand its user base by 50% in Singapore by the end of this year.\nThe following Q&A has been edited for clarity and length.\nPradipta Mukherjee: What are your expansion plans in Asia and globally?\nLasanka Perera: Singapore is our first market outside of our home in Australia. We are spending a bit of time looking at Hong Kong and a few other jurisdictions in Southeast Asia.\nHong Kong might have a new Independent Reserve office in the next few months. When we do establish in Hong Kong, we’ll be looking to be a regulated business [by applying for a license to operate in Hong Kong].\nMukherjee: The Monetary Authority of Singapore (MAS) says that cryptocurrencies have no fundamental value and also discourages retail trading. Given this situation, how easy or difficult has it been for Independent Reserve to work in Singapore as a crypto exchange?\nPerera: We are restricted from [public] advertising and that has had an impact on potential customer acquisition. But otherwise, MAS has established a pretty robust regulatory framework. And [Independent Reserve] having been operating for 10 years, we have had a very strong focus on consumer protections, corporate governance, risk management. But certainly the advertising restriction (in Singapore) is one thing, if removed, that will be helpful for customer acquisition.\nMukherjee: What are Hong Kong’s advantages over Singapore and how would you compare that with Dubai and the rest of the world?\nPerera: Hong Kong is a very active financial hub, [with] deep capital markets. It’s the doorway to greater China. So that’s a very enticing commercial opportunity.\nSingapore has quite active capital markets. But it’s a place where investors are more [focused on] capital preservation and asset protection so not necessarily as active with allocations and risk taking. It’s certainly a different market.\nThe Dubai market regulations are just falling into place. The regulators are working out the framework over there. The opportunity of Dubai is, of course, access to the European market and European capital. Many capital markets in Europe and a lot of the flows are going through Dubai. A lot of the crypto participants that are looking at Dubai as a market will be looking to capture some of that flow by basing themselves in Dubai, hoping that sensible and stable regulations are introduced by those regulators and, of course, stable banking is very important for fiat to crypto exchanges like us.\nMukherjee: At Independent Reserve, are you hiring more people?\nPerera: Yes, we are hiring quite a few people at the moment. We are hiring institutional sales people and Mandarin speakers in our Singapore and Australian businesses. We have around 70 employees right now and we will be looking at another five or 10 in the next few months across compliance, sales and development.\nMukherjee: Has Singapore discouraging retail crypto trading affected Independent Reserve’s development in the city state?\nPerera: We had a period of time where we were able to advertise. From that time to when the restriction on advertising came in, there was a significant drop in business. We had to, since that time, focus on accredited investors, family offices, work with wealth management firms to onboard high value customers, service Web3 firms and the high velocity payment sector.\nFrom the period before the ban [on public advertising] to the period after, monthly customer acquisitions of retail customers dropped by 90% or more. But we have grown our business across the family offices, Web3 payment segments and wealth management sectors. We have grown significantly since that time. While we have a smaller number of institutional customers, they represent a far larger volume per customer. So you might find 10% of customers giving you 90% of your flow.\nMukherjee: What percentage of your total customers in Singapore would be institutional and retail?\nPerera: Less than 20% are institutional customers right now, and about 80% is retail by user numbers. But by volume, it’s the other way. So this 20% of institutional customers make up about 90% of trading volume at Independent Reserve.\nMukherjee: What are your targets for this year?\nPerera: Daily trade volumes in Singapore are about US$20 million to US$30 million and most of this comes from institutional traders, including Web3 firms, payment firms, and the wealth management sector. I hope to more than double that by the end of the year. We are also looking at a 50% growth in user base by the end of this year.\nMukherjee: The U.S. has been in a regulation paralysis when it comes to digital assets, but it has been attacking crypto exchanges anyway, like Coinbase and Binance. How do you see that influencing the global digital assets industry’s development?\nPerera: U.S. businesses and innovators in the space will be looking to move offshore. Ultimately, the U.S. will lose out on jobs and innovation and commercial opportunities, and customers in the U.S. will lose access to solid [crypto] platforms.\nAs an exchange, what we look for is the size of the commercial opportunity, the size of the market; stability, sensible regulation and also stable banking. And in the U.S., the regulatory box is now firmly unticked. So new participants and new exchanges outside of the U.S. will definitely not be considering setting up in the U.S. and I guess the [ones based in] U.S. will be looking to de-risk their U.S. operations by establishing elsewhere.\n","create_date":"2023-06-19T07:00:53+00:00","tag":"Cryptocurrency Exchanges","author":"Pradipta Mukherjee"},
{"url":"https://forkast.news/cryptopunks-bayc-lead-nft-daily-sales-put-ethereum-on-top/","web_url":"https://forkast.news/","type":"article","description":"CryptoPunks collection outperformed other NFTs in daily sales, as Ethereum led all blockchains.","title":"CryptoPunks, BAYC lead NFT daily sales, put Ethereum on top","content":" CryptoPunks topped the daily sales chart with US$1.7 million, up from US$130,640 from the day prior.\nEthereum-based CryptoPunks was one of two non-fungible token (NFT) collections with more than US$1 million in sales on Tuesday, from just 14 transactions, according to CryptoSlam data.\nCryptoPunks’ all-time sales volume rose to US$2.82 billion, third in the all-time NFT sales.\nThe second-highest performer of the day was another Ethereum collection, Bored Ape Yacht Club (BAYC), which recorded US$1.05 million in sales.\nBAYC previous day’s US$350,481, with unique buyers growing to 17 and sellers to 27, culminating in 19 total transactions. BAYC’s all-time sales now stand at US$3.14 billion, which is second in all-time sales.\nBAYC and CryptoPunks led the Ethereum chain’s US$7.7 million in daily sales, the highest volume among NFT blockchains.\nDMarket dropped to the third spot in daily sales after topping the charts on Tuesday. Its sales reached US$839,582, dropped less than a percent from the previous.\nOther notable collections include Mad Lads and NodeMonkes, which also experienced substantial daily sales. Mad Lads saw a daily sales volume of US$800,761, an increase from the previous day’s US$543,026. Bitcoin-based NodeMonkes followed closely with US$750,024 in daily sales, up from US$672,684 the day before.\nSolana Monkey Business and Ethereum’s Pudgy Penguins also made headlines with their daily sales figures.\nSolana Monkey Business recorded US$656,402 in sales, while Pudgy Penguins posted US$595,679, both collections showing a slight decrease from their previous day’s performance.\nNew entries to the day’s top 10 include the $PMPS BRC-20 NFTs collection, which surged to the top 10 with US$551,476 in sales, exploding by more than 500% from the day prior.\nDeGods and DogeZuki Collection rounded out the list with sales of US$411,440 and US$380,574, respectively.\n","create_date":"2024-05-08T07:27:02+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/headlines/binance-resumes-bitcoin-withdrawals-after-halting-transactions-twice-in-12-hours/","web_url":"https://forkast.news/","type":"article","description":"Binance resumed withdrawals of Bitcoin around Monday noon in Hong Kong after temporarily halting the service twice within 12 hours due to what the world’s largest cryptocurrency exchange said was a “large volume of pending transactions.”","title":"Binance resumes Bitcoin withdrawals after halting transactions twice in 12 hours","content":" Binance resumed withdrawals of Bitcoin around Monday noon in Hong Kong after temporarily halting the service twice within 12 hours due to what the world’s largest cryptocurrency exchange said was a “large volume of pending transactions.”\nSee related article: Israel confiscates suspicious Binance accounts allegedly linked to Islamic State: Reuters\nSee related article: Binance chief says unclear crypto regulation ‘the worst’\n","create_date":"2023-05-08T12:27:22+00:00","tag":"Binance","author":"Timmy Shen"},
{"url":"https://forkast.news/nodemonkes-leads-nft-sales-with-us876k-in-a-day-cryptopunks-drops-off-top-10/","web_url":"https://forkast.news/","type":"article","description":"NodeMonkes snatches the top spot from CryptoPunks, ending a two-day streak of leading the market.","title":"NodeMonkes leads NFT sales with US$876K in a day, CryptoPunks drops off top 10","content":" Bitcoin’s NodeMonkes led the non-fungible token (NFT) market in daily sales with US$876,936 on Thursday.\nNodeMonkes rose 21% from the previous day’s sales total of US$725,058. It was the third best-selling collection on Wednesday.\nThursday’s sales total pushes NodeMonkes’ all-time sales volume to US$215.16 million. It’s ranked as the top NFT collection in the Bitcoin network and is less than US$1 million away from overtaking CyberKongz for the 26th spot in the market, CryptoSlam data shows.\nCryptoPunks, an Ethereum collection, led the market for two straight days this week but fell out of the top 10 on Thursday with sales totaling US$113,210. The collection had just under US$3 million in sales in the two days before it dropped off the list.\nThe second-highest performing collection of the day, DMarket, witnessed a substantial daily turnover with sales reaching US$781,961.\nThis collection saw high engagement totals with 4,312 unique buyers and 3,715 sellers, resulting in 34,674 transactions.\nDMarket is a collection that represents in-game items for Mythos Chain.\nTwo Bitcoin collections closed the day in the top three, with the $PMPS BRC-20 NFTs trailing DMarket. PMPS had a daily sales volume of US$735,936.\nOther collections also made the top 10 list with their daily performances. Solana’s Mad Lads came in fourth with a daily sales figure of US$689,509 between 53 unique buyers and 50 sellers.\nAzuki followed with US$631,040 from 34 unique buyers and 32 sellers.\nThe Bored Ape Yacht Club, a collection that is often on the daily top three list, recorded a sales volume of US$232,374 on Thursday. This is the 10th consecutive day BAYC has stayed under US$1 million in daily sales.\n","create_date":"2024-05-10T11:42:34+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/hong-kong-to-debut-bitcoin-and-ethereum-etfs-on-april-30/","web_url":"https://forkast.news/","type":"article","description":"City's first spot cryptocurrency ETFs to offer regulated investment options.","title":"Hong Kong to debut Bitcoin and Ethereum ETFs on April 30","content":" Hong Kong is set to launch its inaugural spot Bitcoin and Ethereum exchange-traded funds (ETFs) on April 30, following approval by the Securities and Futures Commission (SFC), Bloomberg reported.\nThese ETFs, managed by Bosera-HashKey Capital and China Asset Management (ChinaAMC), will provide a regulated investment channel for cryptocurrencies, aiming to attract both retail and institutional investors.\nThe ETFs will utilize an in-kind creation model, allowing for the direct exchange of cryptocurrencies for ETF shares, a method not currently used in the United States.\nThe introduction of these ETFs is a strategic move by Hong Kong to cement its status as a digital asset hub and capitalize on the increasing global interest in cryptocurrency investments.\nIt follows the approval and launch of spot Bitcoin ETFs in the world’s largest economy, the U.S., which led to a record-breaking surge in cryptocurrency prices.\nBitcoin has reached a new all-time price record of US$73,737 since the ETFs launched in the U.S. in January.\nIt traded at US$65,044 at 1:30 p.m. ET, down 2.5% on the day. Ethereum is down 1.4% at US$3,182, according to CoinGecko data.\n","create_date":"2024-04-25T01:43:16+00:00","tag":"Hong Kong","author":"CryptoSlam"},
{"url":"https://forkast.news/weekly-market-wrap-bitcoin-dips-us26166-memecoins-flood-blockchain/","web_url":"https://forkast.news/","type":"article","description":"Bitcoin briefly fell to US$26,166 this week, as BRC-20 memecoins flooded the blockchain, raising network congestion issues. Market analysts told Forkast that a weekly close under US$26,111 signals more bearish momentum","title":"Weekly Market Wrap: Bitcoin dips to US$26,166 as memecoins flood the blockchain","content":" Bitcoin fell 9.42% from May 5 to May 12 to trade at US$26,365 as of 7:30 p.m. on Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since April 19. Ether fell 7.3% over the week to US$1,765, losing the key US$1,800 support level.\nThe U.S. Consumer Price Index (CPI) released this week showed slower headline inflation in April, boosting hopes for the Federal Reserve to pause rate hikes next month. U.S. annual inflation slowed to 4.9% last month, from 5% in March, but gained 0.4% on the month.\nBitcoin briefly topped US$28,300 following the release of U.S. inflation data, but has since been trading lower.\n“Bitcoin dropped to US$26,900 after rejecting from the ~US$28,200 area. The reaction from the ~US$26,900 area was quite strong,” tweeted pseudonymous crypto analyst Rekt Capital. “The US$28,200 resistance is the resistance to beat if the price is to enjoy bullish momentum,” he added.\nThe global crypto market capitalization stood at US$1.1 trillion on Friday at 07:30 p.m. in Hong Kong, down 8.33% from US$1.2 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$510 billion market cap accounted for 46.3% of the market, while Ether’s US$214 billion accounted for 19.4%.\nBitcoin stuck in traffic\nIn another milestone for the world’s first blockchain, the number of non-zero balance Bitcoin addresses reached an all-time high of 46.6 million on Thursday, boosted by the surging interest in Ordinals, a protocol that allows data to be inscribed in the smallest monetary unit of Bitcoin, according to on-chain data analytics firm Glassnode.\nAs a result, Bitcoin congestion issues worsened. The network faced a growing backlog of transactions exacerbated by the network surpassing 5 million Ordinals inscriptions, fueled by the arrival of memecoins in the form of BRC-20 tokens, a fungible token standard built on Ordinals protocol. BRC-20 tokens surpassed US$1 billion in market capitalization on Tuesday.\nAdding to the negative market sentiment, Binance temporarily halted Bitcoin withdrawals twice in 12 hours on Monday, due to a “large volume of pending transactions.” The world’s largest crypto exchange resumed Bitcoin withdrawals on the same day, while Bitcoin fell as low as US$27,419 on Monday.\n“[The correction] was highly due to that since Binance witnessed historically-high BTC outflows,” said Leena ElDeeb, a research associate at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products.\nBitcoin supply on exchanges fell to a five-year low of 5.84% on Tuesday, according to crypto analytics firm Santiment, indicating that long-term holders are increasingly opting for self-custody solutions.\n“The downtrend was also influenced by misinformation on Twitter, calling the congestion a denial of service attack when, in fact, it was increased demand that led to that congestion and skyrocketing transactions only meant that people were willing to pay more money for faster settlements,” ElDeeb added.\nNilesh Verma, crypto market analyst and founder of Crypto Granth consultancy in India, pointed to a separate thread of inaccurate information dissemination surrounding the U.S. government and its Bitcoin holdings as a significant factor in the declining value of Bitcoin this week.\nMisinformation emerged on Wednesday, stating that the U.S. government started selling its Bitcoin holdings. According to a March 31 court filing, the U.S. government seized 51,351.89 Bitcoin (worth US$1.4 billion) from Ross Ulbricht, the creator of the darknet marketplace Silk Road. The government sold 9,861 Bitcoin (US$279 million) on March 14 and is planning to sell the remaining 41,490 Bitcoin (US$1.1 billion) in four batches this year.\n“Someone shared fake news that the U.S. government will sell Bitcoin by showing the wrong labeling on the Arkham Platform… same we saw on April 27, when Bitcoin dropped from US$29,000 to US$27,000 on a glitch in the Arkhram platform,” Verma said.\nCrypto Granth’s Verma said that Bitcoin has strong support around US$26,111. “Bitcoin has to hold this support for continued bullish momentum. As of now, we can see a retest of this area. We believe that we will see strong buying near US$25,000-26,000. Weekly closing below US$26,000 will make Bitcoin bearish,” wrote Verma.\nBut Dr. Jeff Ross, founder and chief executive officer of investment firm Vailshire Capital Management, said Bitcoin needs to dip lower before starting a new rally.\n“Short-term momentum indicators need one more flush lower, ideally to US$24,000, to complete the healthy reset and begin the next leg higher, starting in mid-to-late May,” wrote Ross on his verified Twitter account.\nKava, the governance token of a layer-1 blockchain of the same name, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. Kava rose 17% to US$0.9204, after the protocol announced that its mainnet launch is one week away.\nBitcoin SV (BSV) – a fork of Bitcoin Cash focused on scalability – was this week’s second biggest gainer, rising 8.47% to US$35.88. The token saw a surge of interest after congestion on the Bitcoin network caused transaction fees to rise .\nSee related article: Central Banks’ actions move Crypto; Standard Chartered eyes $100K Bitcoin\nNegotiations over raising the U.S. debt ceiling of US$31.4 trillion to keep the government solvent continued on Wednesday, with congressional Republicans demanding more budget cuts. President Biden’s meeting with top Congress leaders planned for Friday was postponed to next week, three sources familiar with the matter told NBC News.\nInvestors are also anticipating Europe’s Harmonised Indices of Consumer Prices report, scheduled for next Wednesday. Euro area annual inflation for April is expected to come in at 7% for April, up from 6.9% in March, according to flash estimates from Eurostat, the European Union’s statistical office.\nIn the crypto space, liquid Ether staking protocol Lido Finance is preparing for its V2 upgrade, enabling Ether and staked Ether (stETH) withdrawals directly on the protocol. The Lido DAO is set to vote for the V2 upgrade starting today, from 10 p.m. Hong Kong time. With the community’s approval, the upgrade is expected to go live next Monday.\nWeb 3.0 gaming protocol Gala Games is also preparing for a contract upgrade on Monday. The protocol will issue its new Gala V2 token in a 1:1 ratio for all Gala token holders, while support and utility for the initial token will cease simultaneously. While most major exchanges signaled their support for the new token, Coinbase stated that it will not be supporting Gala V2.\nSee related article: Crypto and NFT Market Update – May 11th\n","create_date":"2023-05-12T21:10:39+00:00","tag":"BTC - Bitcoin","author":"Zoltan Vardai"},
{"url":"https://forkast.news/blackrock-files-for-spot-bitcoin-etf-taps-coinbase-as-custodian/","web_url":"https://forkast.news/","type":"article","description":"The ETF, if approved, would be the first publicly traded crypto product of its kind in the U.S., but the SEC just sued crypto exchanges for alleged securities violations and has rejected similar ETF applications in the past.","title":"BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian","content":" BlackRock, which manages about US$10 trillion as the world’s biggest asset manager, has filed to launch the first publicly traded spot Bitcoin exchange-traded fund (ETF) in the U.S., even as regulators in the country file lawsuits against cryptocurrency platforms for alleged violations of securities laws.\nBlackRock said in a Thursday filing to the Securities and Exchange Commission (SEC) it intends to launch the “iShares Bitcoin Trust” with Coinbase Custody Trust Co. as the custodian for the Bitcoin. The ETF, if approved, will be listed on Nasdaq.\nThe application comes after the SEC last week sued Coinbase and Binance.US., two of the industry’s biggest crypto exchanges, for allegedly breaching securities rules. That adds to uncertainties the SEC will approve the ETF, given that a Coinbase unit would act as custodian for the product.\nEric Balchunas, a senior ETF analyst at Bloomberg, tweeted Thursday that the BlackRock filing is a “shocker.”\n“There’s been no signs at all SEC willing to approve, but BlackRock is very connected so maybe they know something?” Balchunas said.\nApproval of a spot-traded Bitcoin ETF in the world’s biggest economy and largest financial market is seen by many investors as a stamp of approval for the digital currency and would likely unlock significant amounts of institutional investment in Bitcoin.\nHowever, some in the crypto industry reacted negatively to the BlackRock development, raising “Operation Chokepoint” theories that suggest governments and traditional finance aim to derail the industry because it poses a threat to their interests.\n“If BlackRock’s spot ETF application gets approved, it is undeniable that Operation Chokepoint 2.0 was orchestrated to drive out crypto native companies and bring in large traditional firms that are buddy-buddy with the U.S. [government] to try and control Bitcoin [and] crypto,” Will Clemente, co-founder of digital asset research firm Reflexivity Research, said Thursday on Twitter to his 683,700 followers.\nIn the SEC filing, BlackRock said: “The Shares are intended to constitute a simple means of making an investment similar to an investment in bitcoin rather than by acquiring, holding and trading bitcoin directly on a peer-to-peer or other basis or via a digital asset exchange,”\nThe SEC has previously rejected similar applications for spot Bitcoin ETFs filed by Grayscale, WisdomTree and VanEck. In June 2022, Grayscale sued the SEC for rejecting its application, saying the regulator failed to apply consistent treatment to similar investment vehicles.\nThe securities regulator, however, has approved a number of Bitcoin futures-based ETFs.\nTraditional retail exchanges and brokers, such as Robinhood and eToro, are “navigating complex terrain when venturing into crypto,” Jeff Feng, co-founder of Sei Labs, the company behind the Sei trading blockchain, told Forkast via email.\n“The absence of explicit regulatory guidelines has caused setbacks, leading to some tokens being delisted resulting in crypto market volatility,” said Feng, a former Goldman Sachs analyst. “Nonetheless, these teething issues are part of the broader industry’s evolutionary process.”\nBalchunas at Bloomberg added that the BlackRock filing lists the factors that could adversely affect the price of Bitcoin, and “they list the exchanges, which ‘are largely unregulated and may be subject to manipulation’ which is the SEC’s issue with approving ETF.”\nBitcoin gained 1.89% over the past 24 hours to trade at US$25,541 at 11:50 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization has risen 54.5% so far this year, but is still far below its peak at around US$64,000 recorded in November 2021.\n","create_date":"2023-06-16T13:24:09+00:00","tag":"ETF","author":"Timmy Shen"},
{"url":"https://forkast.news/sec-peirce-dissents-us100m-blockfi-settlement/","web_url":"https://forkast.news/","type":"article","description":"SEC Commissioner Hester Peirce dissented in Monday's US$100M BlockFi settlement, saying the punishment does not fit the crime.","title":"Peirce dissents from SEC's US$100M BlockFi settlement","content":" U.S. Securities and Exchange Commissioner Heather Peirce released a statement dissenting from a settlement announced Monday that deemed BlockFi Lending LLC an unregistered investment company and resulted in two penalties of US$50 million each to the SEC and 32 states to settle the charges.\nPeirce, dubbed Crypto Mom for her friendly stance on crypto, pointed out that borrowers were not hurt by the lender’s actions and therefore the penalty is disproportionate. “Is the approach we are taking with crypto lending the best way to protect crypto lending customers?” she wrote in her statement. “I do not think it is, so I respectfully dissent.”\nThe BlockFi settlement is the first for crypto lending as the industry has come under increasing scrutiny by the SEC. Last month, three companies, Celsius Network, Galaxy Trust and Voyager Digital, confirmed to Bloomberg they were cooperating with an SEC enforcement review centered on whether their interest-bearing crypto products are unregistered securities.\n“Today’s settlement makes clear that crypto markets must comply with time-tested securities laws, such as the Securities Act of 1933 and the Investment Company Act of 1940,” stated SEC Chairman Gary Gensler in an announcement. The commission urged lending platforms to come into compliance with federal securities laws.\nPeirce pointed out that the current laws do not adequately account for crypto businesses, however. She wrote that BlockFi cannot register as an investment company because it issues debt securities so to become compliant it will actually be seeking an exemption or exclusion. She then states that due to “the Commission’s lack of experience with the … exclusion” the company would be hard-pressed to receive one within the timeframe established in the settlement.\nShe concludes, “We often tell companies wanting to offer products that could implicate the securities laws to ‘come in and talk to us.’ To make that invitation meaningful, however, we need to commit to working with these companies to craft sensible, timely, and achievable regulatory paths.”\n","create_date":"2022-02-15T03:58:23+00:00","tag":"SEC - Securities and Exchange Commission","author":"Jeanhee Kim"},
{"url":"https://forkast.news/binance-us-ceo-calls-it-quits-amid-major-layoffs/","web_url":"https://forkast.news/","type":"article","description":"Top blockchain and crypto news: Binance.US undergoes staffing shakeup. Ethereum NFTs at risk. India to take a stand on crypto.","title":"Binance.US CEO calls it quits amid major layoffs","content":" From the Editor’s Desk\nDear Reader,\nWe here at Forkast are big fans of creative destruction, the theory advanced by economist Joseph Schumpeter in which new innovations disrupt and replace established practices. In other words, out with the old, in with the new.\nEvents in the cryptocurrency space in recent days may be pointing that way, as the world’s biggest crypto exchange hemorrhages executive leadership and the fuzzy outlines of international norms for the industry begin to sharpen following the G20’s support for recommendations on regulation.\nIn and of themselves, these two developments aren’t a sufficient basis to conclude that the industry has reached a transformative, Schumpeterian moment, trading its often turbulent times on the fringes of finance for a more secure spot.\nHowever, given the direction of travel more broadly – reflected in increasingly sure-footed digital asset regulation in such key jurisdictions as Singapore and Hong Kong, a much more solid industry consensus around what’s deserving of investment, and not least in the promise of a well-defined framework of crypto rules tailored for India as it concludes its G20 presidency – change seems to be in the air.\nIn this industry, we like to think that change comes quickly – and indeed it often does, although frequently not by design. But almost a year since the implosion of FTX – an event that arguably changed the crypto landscape more than any other in recent times – the industry is still dusting itself off, demonstrating that more fundamental shifts take time. As, indeed, they do in any sector.\nOne thing that hasn’t changed is the upstart nature of crypto, and it isn’t likely to anytime soon, no matter how much it becomes an unremarkable part of the financial ecosystem.\nYet signs that the digital asset revolution is entering a new phase of its development are abundant. If the industry can avoid blowing itself up à la the likes of FTX and Terra LUNA, and continue to develop the creative component of Schumpeter’s thesis, its growing maturity – regulation and all – is to be welcomed.\nUntil the next time,\nAngie Lau, Founder and Editor-in-Chief Forkast.News\nBrian Shroder, the chief executive officer of Binance U.S., has departed the company as the U.S. affiliate of the world’s largest cryptocurrency exchange laid off one-third of its staff, or more than 100 employees.\nForkast.Insights | What does it mean?\nThe cryptocurrency market, notoriously volatile and seen by some as a harbinger of wider economic trends, offers a tantalizing snapshot of current financial winds. Binance.US’ decision to downsize, stemming not just from the ebbs of a crypto bear market but also its intertwined legal complexities, serves as a poignant indicator of shifting sands in the financial world. With the company boasting of a “seven year financial runway,” it would seem that even the giants of the crypto realm are donning a cloak of caution.\nYet, while digital currency platforms take precautionary steps, the broader U.S. economic narrative is engrossed with the menace of inflation. The very mention of the term ‘inflation’ sends tremors through the spine of any economy, and the U.S. is no exception. A 3.7% rise in consumer prices over the past year, exacerbated by surging gasoline prices, has understandably sounded alarm bells.\nThe Federal Reserve has made bold strides to counteract this specter. By hiking interest rates from near-zero in 2022 to a staggering 5.25%-5.5%, levels unseen since the dawn of the 21st century, the Fed’s intent is clear: to temper inflation and ensure a safe landing.\nBut this safeguard comes at a cost. With the consequential surge in mortgage and credit card interest rates, borrowing has transformed from a benign affair into a more daunting endeavor. This shift has understandably ruffled the feathers of investors and business magnates, who worry that such steep hikes could push the economy into the chasm of recession.\nDespite these dramatic monetary maneuvers, the U.S. job market has remained resilient. Wages continue to surge upward, hinting at an economy that isn’t ready to bow down just yet. This juxtaposition brings financial behemoths like BlackRock and Amundi hinting at cracks appearing in the U.S. economy, according to the Financial Times. Vincent Mortier, chief investment officer of Amundi, claims that the possibility of a recession in the U.S. is “very high.” Conversely, the undeniable vitality of the job market suggests a U.S. economy that’s still basking in the glow of its heyday.\nThe declines in Ethereum’s NFT ecosystem have outpaced those in Polygon, Solana, and Cardano, with the impact of OpenSea’s creator fees policy, SEC charges against NFT projects, and controversy in major projects driving down the broader NFT market.\nForkast.Insights | What does it mean?\nThe bigger they are, the harder they fall, and there’s no denying that Ethereum is the big kahuna when it comes to NFTs. From its astronomical peak of value in 2022 to the post-bubble market we now find ourselves in, Ethereum’s fall from the top has hit harder and has done more damage to collectors than anything we’ve seen on other blockchains. From some perspective, Ethereum NFTs have traded for over US $44 billion, while their closest competitors saw only 10% of those sales (Ronin US$4.2 billion, Solana US$4.1 billion, Flow US$3.5 billion, Polygon US$1.2 billion, and Cardano US$606 million)\nBlow by blow, hit by hit, much of what was built with NFT sales is being knocked down by new negative events that just keep coming in. Each story and event ripples across the rest of the market, driving sentiment down and priming each collection for their own collapse once they hit any bumps in the road. Ethereum is the biggest target of all and has already shown us exactly how the market collapse will play out.\nIn the past few weeks we have had two prime examples that showcase exactly how a project tumbles down the mountaintop. The Nouns, one of Ethereum’s top collections from 2021, hit a patch of turbulence this month that has altered the course of their future. With their DAO’s members voting to fork, existing NFT holders have been given an opportunity to exit the project, minus their NFT, but with their share of the treasury. Since the NFT market has declined, and the supply of Nouns NFT increases by the day (a built-in mechanic where 1 Noun is minted every day, forever), the value of Nouns on secondary markets has fallen drastically.\nMembers have an easy decision, take 30+ ETH now from the DAO, 20-25 ETH on secondary markets, or hold for years and hope the value exceeds what they can get today. Seems to be an easy decision, and 40% of Nouns are now leaving the DAO. The Nouns’ treasury has now lost over 35% of its holdings (down to 17,000 ETH from 28,000), signaling a loss in confidence in both the project and the broader market.\nMilady Maker, one of the few PFP collections on Ethereum to actually gain value over the bear market, finally faced reality when one of their own developers stole US$1 million from the project’s treasury. While legal options may ultimately be able to recover the funds, this type of news causes a rush for the exit, because nobody wants to be the last man holding the NFT in this illiquid market. Miladys had reached as high as 4.5 ETH this summer, and this week were selling for just 2.1 ETH.\nIt feels like we’re still at the true start of the market collapse. There’s just not enough projects that have fallen to zero yet. But as predicted weeks ago, more charges are coming from the SEC and its target has become clearer. With their most recent charges against the Stoner Cats the SEC has declared that selling NFTs to raise funds and promoting a secondary market means you’re likely in the crosshairs. Like a Jenga puzzle balancing on one peg, I think we’re just one big story away from the big collapse.\nIndia will decide its position on crypto assets in the coming months, and take reference from the international consensus formed at the recent G20 summit, said the South Asian nation’s Secretary of the Department of Economic Affairs, Ajay Seth.\nForkast.Insights | What does it mean?\nIndia’s official stance on cryptocurrencies has been the subject of intense attention in the crypto industry for a number of years now. The country has also been a source of serial disappointments as its government has imposed hefty taxes on crypto transactions, its central bank has attempted to throttle the industry, enforcement action has been taken against exchanges, and lawmakers have toyed with the idea of banning crypto altogether.\nSo, when India assumed the presidency of the G20, with an apparent determination to allow the industry to thrive under a consensus set of rules that could be adopted internationally, industry observers might have been forgiven a flush of optimism.\nHowever, now that New Delhi has chalked up nine months at the G20’s helm, with little to show for it in terms of its own position on crypto other than a wordy pronouncement by its economic affairs secretary that the government will draw up a regulatory framework “in the coming months,” we’re left wondering just what’s coming down the pipe.\nOn balance, it seems unlikely that the government will reverse course, given the levels of hostility toward crypto expressed by its central bank and various authority figures. But New Delhi appears – unlike Beijing – to understand that crypto can’t simply be wished away, and from that the industry might take some comfort.\nIndeed, the joint policy paper commissioned by the G20 and published by the International Monetary Fund and the Financial Stability Board explicitly warns countries against imposing bans on crypto. Both bodies, however, are noted crypto skeptics, meaning that no matter how commonsense any Indian framework is that emerges from the consultative exercise, it’ll be likely to cleave toward a more restrictive line than many in the industry would doubtless prefer.\nWhatever comes of India’s apparent final push to get the industry into compliance with its forthcoming rules, at least in a democracy – even one as flawed as India’s – bad regulations can be changed in response to public pressure. Try that in a place like China.\n","create_date":"2023-09-14T19:30:00+00:00","tag":"Binance","author":"Forkast.News"},
{"url":"https://forkast.news/solanas-froganas-howdy-hats-lead-nft-sales/","web_url":"https://forkast.news/","type":"article","description":"Two of Solana's up and coming collections lead the NFT market's daily performance.","title":"Solana's Froganas, Howdy Hats, lead NFT sales","content":" Solana-based Froganas non-fungible tokens collection experienced a 111.88% increase in sales to US$1.16 million, coupled with a doubling of transactions to lead all NFT collections on Monday.\nHowdy Hats also saw a substantial rise of 19.12% in sales and an 184.55% increase in transactions, as the two Solana-based collections topped the day’s sales charts, according to CryptoSlam.\nDespite the market-leading performances from Solana’s NFTs, the blockchain itself trailed Ethereum and Bitcoin in blockchain NFT sales.\nOn the Ethereum platform, Yuga Labs’ Bored Ape Yacht Club (BAYC) recorded a 24.48% increase in sales, reaching US$1.02 million, with a slight 5.56% uptick in transactions.\nBAYC maintains its position as the second-highest in all-time sales with US$3.1 billion.\nBAYC and the two Solana projects were the only three projects to have at least US$1 million in sales on Monday.\nDMarket on Mythos Chain recorded just under US$1 million in sales after an 11% decline as the day’s fourth-best performing collection.\nSimilarly, Bitcoin’s NodeMonkes and JIGO BRC-20 NFTs experienced downturns in both sales and transactions.\nOn the Bitcoin network, uncategorized BRC-20 and Ordinals assets posted US$1.9 million and US$2.6 million respectively.\nEach asset class recorded sales exceeding the entire Polygon network’s US$1.01 million, ranking it fourth in the day’s blockchain rankings.\n","create_date":"2024-03-26T03:48:10+00:00","tag":"NFT - Non-Fungible Token","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-ico-raised-less-us5-mln-forbes/","web_url":"https://forkast.news/","type":"article","description":"Binance’s 2017 initial coin offering (ICO) of its Binance Coin (BNB) reportedly raised less than US$5 million, contrary to the US$15 million claimed by the","title":"Binance ICO raised less than US$5 mln: Forbes","content":" Binance’s 2017 initial coin offering (ICO) of its Binance Coin (BNB) reportedly raised less than US$5 million, contrary to the US$15 million claimed by the company and its Chief Executive Officer Changpeng Zhao.\nSee related article: U.S. SEC denied immediate access to Binance.US software\nSee related article: Binance Japan partners with mega bank MUFJ on stablecoin project\n","create_date":"2023-10-06T17:08:36+00:00","tag":"Binance","author":"Zoltan Vardai"},
{"url":"https://forkast.news/headlines/hong-kong-financial-retail-crypto-traders/","web_url":"https://forkast.news/","type":"article","description":"Hong Kong’s financial services providers are preparing for new licensing requirements which will allow them to provide services to retail traders.","title":"HK financial service providers gear up for retail traders","content":" Hong Kong’s financial services providers, including local brokers and fund managers, are seeking advice to prepare for new licensing requirements which will allow them to provide services to retail traders, according to a media report.\nSee related article: Hong Kong Stock Exchange debuts ‘Asia’s first’ crypto futures ETFs\n","create_date":"2023-01-02T19:59:54+00:00","tag":"Hong Kong","author":"Pradipta Mukherjee"},
{"url":"https://forkast.news/pantera-capital-targets-us250-mln-solana-purchase-from-ftx-assets/","web_url":"https://forkast.news/","type":"article","description":"Crypto firm Pantera Capital aims to acquire $250 million in Solana tokens from bankrupt FTX's holdings at a significant discount.","title":"Pantera Capital targets US$250 mln Solana purchase from FTX assets","content":" Pantera Capital, a cryptocurrency investment firm managing over US$5 billion in assets, is actively raising funds to purchase Solana (SOL) tokens valued at US$250 million from the assets of the bankrupt exchange FTX.\nThe firm is seeking to capitalize on the opportunity to buy these tokens for US$59.95 each, which is 39% below Solana’s 30-day average price.\nThis potential acquisition is part of a strategic investment through the Pantera Solana Fund, which targets large investors and requires a minimum investment of US$25 million.\nInvestors participating in this deal are expected to commit to a vesting period of up to four years, indicating Pantera’s long-term confidence in the potential of Solana.\nThe move comes after FTX’s collapse in November 2022, which led to a liquidity crisis and subsequent Chapter 11 bankruptcy protection filing.\nFTX’s estate was granted permission by a bankruptcy court in September to sell US$3.4 billion worth of Bitcoin, Ethereum, and Solana, with a weekly cap of US$100 million in sales.\nSOL rose 13.7% in the past 24 hours to US$147 at noon, ET, according to CoinGecko data.\nSOL has the fifth-largest market capitalization in the world among cryptocurrencies with over US$65 billion.\nIt is also the second-most popular blockchain for NFTs, with over US$5.1 billion in sales, according to CryptoSlam data.\n","create_date":"2024-03-08T01:16:40+00:00","tag":"Cryptocurrencies","author":"CryptoSlam"},
{"url":"https://forkast.news/headlines/binance-chief-says-unclear-crypto-regulation-the-worst/","web_url":"https://forkast.news/","type":"article","description":"Binance CEO Changpeng Zhao said regulators need to come up with clear crypto regulations and should understand that the crypto industry is different from the traditional financial industry.","title":"Binance chief says unclear crypto regulation ‘the worst’","content":" Changpeng Zhao, founder and chief executive officer of Binance, the world’s largest cryptocurrency exchange, said that regulators need to come up with clear crypto regulations and should understand that the crypto industry is different from the traditional financial industry.\nSee related article: Binance rejects U.S. charges of violating trading rules, manipulating markets\nSee related article: ASIC cancels Binance Australia’s derivatives license\n","create_date":"2023-04-13T16:08:53+00:00","tag":"Binance","author":"Timmy Shen"},
{"url":"https://forkast.news/bybit-hong-kong-license-crypto-expansion/","web_url":"https://forkast.news/","type":"article","description":"Crypto derivatives exchange Bybit seeks to enter Hong Kong's market with a new license application.","title":"Bybit eyes Hong Kong license: crypto expansion plans","content":" Bybit, a global cryptocurrency exchange, has officially applied for a license to operate in Hong Kong.\nThe application was submitted amid Hong Kong’s evolving regulatory landscape for digital assets.\nThe exchange, known for offering crypto derivatives trading, is looking to tap into the Hong Kong market, which has shown a growing interest in cryptocurrencies.\nThe city is seen to be establishing a clear regulatory framework for crypto businesses and its government has taken a welcoming stance towards digital asset exchanges that are willing to operate under its regulatory guidelines.\nHong Kong last year reversed its stance on retail cryptocurrency trading, which was previously only permitted to professional investors.\nHong Kong has previously voiced intentions to become a regional hub for digital assets, but it has been cautious in its license approval.\nSince opening to the retail sector last August, only two exchanges, OSL and HashKey, have been given approvals by the city’s securities regulator to provide crypto trading services to retail investors.\n","create_date":"2024-02-02T02:18:34+00:00","tag":"Hong Kong","author":"CryptoSlam"},
{"url":"https://forkast.news/brazilian-congressional-committee-calls-binance-ceo-zhaos-indictment/","web_url":"https://forkast.news/","type":"article","description":"The congressional committee accused Changpeng Zhao and three other executives, along with 45 individuals, of running a financial pyramid scheme in the country.","title":"Brazilian congressional committee calls for Binance CEO Zhao’s indictment ","content":" A congressional committee in Brazil recommended the indictment of Changpeng Zhao, chief executive officer of Binance, following a probe into the world’s largest cryptocurrency exchange.\nSee related article: Binance users in Hong Kong hooked by US$450,000 phishing attacks\nSee related article: Binance ICO raised less than US$5 mln: Forbes\n","create_date":"2023-10-11T17:13:53+00:00","tag":"Binance","author":"Zoltan Vardai"},
{"url":"https://forkast.news/bitcoin-runes-etching-revenue-plummets-for-miners/","web_url":"https://forkast.news/","type":"article","description":"Runes etching on Bitcoin network drops drastically, affecting miners' income.","title":"Bitcoin Runes etching revenue plummets for miners","content":" The Bitcoin network experienced a dramatic 99% decrease in daily Rune etchings, with only 157 Runes recorded on Monday, down from a peak of 14,700 in late April, according to Dune Analytics data.\nThis decline in Rune etchings, a fungible token protocol, has significantly reduced transaction fee income for Bitcoin miners.\nOn April 26, a record 23,061 Runes were etched, but the recent drop has seen transaction fees from etchings fall to just US$3,835 on Monday.\nFollowing its introduction on April 20, the Runes protocol initially boosted miners’ earnings by generating substantial transaction fees, compensating for income losses after the fourth Bitcoin halving event.\nThe halving, which coincided with the Runes launch, reduced the block subsidy to 3.125 BTC, but increased transaction volume from Runes helped maintain miner revenue.\nTo date, over 91,200 Runes have been etched on the Bitcoin blockchain.\nDespite the recent downturn, Runes transactions have dominated Bitcoin network activity.\nThe protocol, introduced by Ordinals creator Casey Rodarmor, aims to create fungible tokens by utilizing block space more efficiently than BRC-20s and aligns with Bitcoin’s unspent transaction output (UTXO) model.\nSome Bitcoin core developers have criticized the Runes protocol, suggesting it takes advantage of Bitcoin network vulnerabilities.\n","create_date":"2024-05-14T14:12:06+00:00","tag":"BTC - Bitcoin","author":"CryptoSlam"},
{"url":"https://forkast.news/solana-foundation-partners-dmcc-crypto-centre-dubai/","web_url":"https://forkast.news/","type":"article","description":"The SOL token rose over 5% in the 24-hour after the partnership was announced.","title":"Solana Foundation partners with DMCC Dubai","content":" The Solana Foundation, the non-profit organization behind the development of the Solana blockchain, has become the ecosystem partner for the Dubai Multi Commodities Centre (DMCC), one of the free economic zones of the United Arab Emirates.\nSee related article: Weekly Market Wrap: Bitcoin falls below US$27,000 following CPI and Israeli conflict\nSee related article: Digital frontiers: Alex Tapscott on Web3, AI, and banking’s new dance\n","create_date":"2023-10-16T21:02:52+00:00","tag":"SOL - Solana","author":"Zoltan Vardai"},
{"url":"https://forkast.news/ethereum-tops-nft-market-ends-20-day-sales-slump-under-us10-mln/","web_url":"https://forkast.news/","type":"article","description":"Ethereum tops daily NFT market with significant sales, outperforming Bitcoin and Solana.","title":"Ethereum tops NFT market, ends 20-day sales slump under US$10 mln","content":" Ethereum topped Thursday’s non-fungible token (NFT) market with over US$23 million in sales, CryptoSlam data shows.\nOver half of those sales came from CryptoPunks 635, which was sold for US$12.4 million at Larva Labs marketplace.\nEthereum saw a total of 16,363 transactions conducted by 1,770 unique buyers and 1,354 unique sellers.\nEthereum ended a 20-day streak of daily sales below US$10 million.\nThis daily performance contributes to Ethereum’s all-time sales volume, which now stands at approximately US$43.64 billion from nearly 47.56 million transactions.\nBitcoin and Solana followed, with daily sales reaching US$6.67 million and US$3.72 million, respectively.\nThis marks the fourth consecutive day Bitcoin collections failed to crack US$10 million.\nBut Bitcoin is creeping closer to the US$3.5 billion milestone for all-time sales. Following Thursday’s sales, the network has a cumulative sales record of US$3.43 billion.\nIt became the fourth blockchain to reach US$3 billion late last month and is now about US$800 million from Ronin, which holds the third spot in all-time sales volume.\nSolana, with its higher number of unique buyers at 10,862 and sellers at 10,221, led to a market-leading larger number of transactions totaling 65,373 for the day.\nSolana is also closing in on a milestone of its own as its all-time figure stands at US$5.45 billion.\nPolygon and Mythos Chain also reported notable daily sales, with Polygon reaching US$2.32 million from 65,536 transactions and Mythos Chain recording sales of US$937,934.75 across 37,828 transactions.\nPolygon ranks fifth in all-time sales with over US$1.5 billion.\n","create_date":"2024-04-26T16:36:42+00:00","tag":"Ethereum","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-converts-us1-bln-fund-eyes-india-comeback-after-obtaining-dubai-license/","web_url":"https://forkast.news/","type":"article","description":"Cryptocurrency giant Binance converts $1B safety fund to USDC, signaling a strategic move to enhance transparency and re-enter the Indian market.","title":"Binance converts US$1 bln fund; eyes India comeback after obtaining Dubai license","content":" Binance, the world’s largest cryptocurrency exchange, announced Thursday the conversion of its US$1 billion Secure Asset Fund for Users (SAFU) to USDC stablecoin in a bid to bolster user confidence and meet regulatory standards.\nThe conversion of the SAFU represents around 3% of USDC’s total circulating supply.\n“Today, we are transferring 100% of SAFU’s assets to USDC. Making use of a trusted, audited, and transparent stablecoin for SAFU further enhances its reliability and ensures it remains stable at $1B,” said Binance.\nMeanwhile, The Economic Times reported Thursday on Binance’s ongoing negotiations for its Indian market comeback, which includes restructuring its operations to fully comply with the country’s regulations.\nBinance’s planned return to India follows a period of negotiations to resolve a US$2 million penalty and align with the country’s Financial Intelligence Unit (FIU) regulations, including the Prevention of Money Laundering Act (PMLA) and the crypto taxation framework.\nBefore its temporary ban in India for non-compliance, Binance played a significant role in the country’s cryptocurrency landscape, with Indian investors holding an estimated US$3.6 billion in crypto assets through the platform, according to the Economic Times.\nIn Dubai, Binance has made considerable progress by obtaining a full Virtual Asset Service Provider (VASP) license, which permits the company to offer its services to a broader clientele, including retail investors.\nChangpeng Zhao, Binance’s co-founder, has made notable governance concessions, such as relinquishing control in the Dubai-based entity, Binance FZE, to meet the regulatory requirements.\n","create_date":"2024-04-18T22:10:07+00:00","tag":"Regulatory","author":"CryptoSlam"},
{"url":"https://forkast.news/binance-japan-launches-34-tokens-bnb-debuts-country/","web_url":"https://forkast.news/","type":"article","description":"Binance announced the launch of Binance Japan on Tuesday, offering 34 cryptocurrencies.","title":"Binance Japan launches with 34 tokens, BNB debuts in the country","content":" Binance, the world’s largest cryptocurrency exchange, announced the launch of Binance Japan K.K. on Tuesday, offering 34 coins, making it the country’s largest exchange by token offerings.\nSee related article: Crypto’s latest inflection point an opportunity for Asia to lead, says Circle’s Yam Ki Chan\nSee related article: Binance executives Hillman, Christie say they are leaving, cite personal reasons\n","create_date":"2023-08-01T22:02:10+00:00","tag":"Binance","author":"Zoltan Vardai"},
{"url":"https://forkast.news/btc-price-surges-futures-etf-nears-approval/","web_url":"https://forkast.news/","type":"article","description":"The U.S. could see a long-awaited Bitcoin futures ETF trading on the New York Stock Exchange and the Nasdaq in the next few days. Forkast.News spoke with market watchers to find out what it means for the industry.","title":"BTC price surges as futures ETF nears approval","content":" Bitcoin’s price edged ever closer to its all-time high over the weekend, boosted by the news that the U.S. Securities and Exchange Commission is slated to approve two Bitcoin futures exchange-traded funds in the coming days. The world’s biggest cryptocurrency jumped around 9.5% in the 24 hours into Saturday Asia time, reaching US$62,688, according to data from CoinGecko, just shy of its all-time high of US$64,804.72 reached in April at the height of the market-wide bull run.\nAfter months of speculation as to when the SEC would approve an ETF for Bitcoin, two separate listings appeared in quick succession on Friday; one for ProShares, which will trade on the New York Stock Exchange, and another for Valkyrie, to trade on the Nasdaq. Barring any last-minute disapprovals from the SEC, the ProShares ETF would begin trading on Monday North America time, marking the culmination of a decade-long campaign for a Bitcoin ETF which began with the Winklevoss twins first submitting a request for one in 2013.\nDespite the growing level of institutional adoption in the crypto industry — particularly in Bitcoin — the approval of a Bitcoin ETF in the U.S. was seen to be a watershed moment for the industry when it entered the realm of other established assets. Businesses and institutions that may have restrictions on what they are able to invest in are now able to gain exposure to the US$1.175 trillion asset class, clearing the road for more entities to participate in the industry.\n“It just puts more assurance to the industry that this asset class is going to stay,” Jeff Yew, CEO of Monochrome, Australia’s first fund to offer institutional-grade exposure to Bitcoin, told Forkast.News. “The institutional appetite for Bitcoin is going only one way — which is increasing, which is good to see. [The approval of these ETFs] legitimizes this asset class and demystifies a lot of what people are afraid of, what people do understand about Bitcoin. When such a big move gets into play, it means that more institutional investors and also regular investors can now access the market in a regulated manner.”\nNotably, both the ProShares and Valkyrie funds are futures trading funds, not a physical Bitcoin ETF. This means they track the futures contracts traded on futures exchanges like the Chicago Mercantile Exchange rather than trading on the value of Bitcoin stored by the fund. Both types have their advantages and disadvantages; a futures fund has lower custody risk compared to a physically-backed fund, though could be more susceptible to price shocks due to how the instruments get connected to the underlying asset.\nIt is not surprising that the first ETF approved in the country would be a futures ETF, due to the higher degree of regulation that applies to it. Trading on regulated stock exchanges, the ETFs track regulated futures contracts on the CME, which itself is regulated. A far cry from tracking Bitcoin spot purchases that would be available through other types of ETFs.\n“It seems like the SEC is comfortable with this from what we’ve seen publicly from them,” said Jonathon Miller, Australian managing director of crypto exchange Kraken, though he admits nothing is certain until the funds are live. “The futures ETFs allows businesses, institutions and managed funds who have restrictions around the venues and the instruments that they can trade to get access because it will tick the boxes as an ETF.”\nThe U.S. is not the first country in the world to approve either type of these ETFs; neighboring Canada has both futures and physically-backed Bitcoin ETFs — as well as ETFs for Ethereum. Yew says that while both types of ETFs are able to track the price of Bitcoin reasonably well, physically-backed ETFs tend to perform better overall, though this could be a first-mover advantage. He also added he believes physically-backed ETFs are now likely to be approved in the U.S. “sooner than we think.”\n“A physically-backed Bitcoin ETF will make more sense for investors that want a hedge against a black swan event,” Yew said. “Hence, why direct exposure would make more sense as they have more control over the asset class ultimately. But a futures-based Bitcoin ETF does have its benefits as well.”\nNot everyone is pleased with the decision to allow a futures ETF before a physically-backed one. Raoul Pal, founder and CEO of Global Macro Investor, posted on Twitter: “Issuing the BTC futures ETF is a good step but it’s basically handing hedge funds a massive arbitrage opportunity as the futures will trade at a large premium in bull phases and they get to capture those returns. This is the old financial market trick — you now have to add multiple new intermediaries who all make profits — the ETF provider, clearinghouse, futures broker, administrator, auditor, law firm, CME and hedge fund arbs. Wall Street gets richer. Retail investors lose. Again.”\nFor all the excitement surrounding the approval, Miller suggested it was worth remembering the premise that Bitcoin was founded on — permissionless, peer-to-peer trading — and that it was envisioned as a means to democratize money and increase access to the financial system. Besides the slight irony of the developments moving away from these principals, Miller added there may just be a competitive disadvantage to using ETFs as opposed to direct trading.\n“The fees involved for any of these choices vary,” Miller said, “and you’d have to think that an ETF which is a product issued by a third party on an exchange that takes fees that uses futures contracts that have spread from the Bitcoin price that in itself have fees because they’re dealing with the Chicago Mercantile Exchange; you’d have to think that product is also going to be potentially less competitive [than] going direct.”\nAfter reaching its six-month high on Saturday, Bitcoin’s price started trending down slightly over the course of the weekend, though it started picking up again as Monday progressed, and was trading at US$62,616 at press time. This sudden price surge has given credence to some Bitcoin bulls predicting it could top the US$100K mark by the end of the year. While Yew acknowledged that historically Bitcoin’s price tends to begin performing well in the lead-up to Christmas, the market is ever-changing, and past performance does not guarantee future returns.\nIn the past, Bitcoin’s price has been largely a retail-driven phenomenon, but increasingly, and especially after the news of the ProShares and Valkyrie ETFs, there is more institutional exposure and players in the space. “It’s interesting because it’s an unknown to have that institutional support and demand underwriting the Bitcoin story from now onwards. I would think that’s an exciting moment to be in,” he said.\n","create_date":"2021-10-18T16:36:00+00:00","tag":"SEC - Securities and Exchange Commission","author":"Lachlan Keller"}
]